{
    "id": "vmvq46m5ikl46xke3gaqrrfb2znb3rle",
    "title": "Semidefinite Optimization and Convex Algebraic Geometry",
    "info": {
        "author": [
            "Pablo A. Parrilo, Department of Electrical Engineering and Computer Science, Massachusetts Institute of Technology, MIT"
        ],
        "published": "Jan. 16, 2013",
        "recorded": "December 2012",
        "category": [
            "Top->Computer Science->Optimization Methods->Convex Optimization"
        ]
    },
    "url": "http://videolectures.net/nipsworkshops2012_parrilo_geometry/",
    "segmentation": [
        [
            "So let me tell you what this talk is about, the kind of things that they are trying to do, and it's really to give a little an overview of essentially how convexity and the algebraic structure of convex sets interact, and in particular, why do we care about when we actually want to solve some of these problems and and what are the implications of these kind of things?",
            "And it will be they will be technical, but I think the main part should be fairly accessible.",
            "There's lots of pictures and ideas really, just with an intuition of what's actually happening in these situations and go out.",
            "You can look at the details in dynaman of all the."
        ],
        [
            "Personal stuff.",
            "So as I said, this is pretty much the outline of the talk is about trying to understand what happens with or what kind of things we can do when we have convex sets with algebraic descriptions, and I'll try to explain why do we care about this algebraic descriptions.",
            "Typically it's a way that most convex sets are presented.",
            "An elaborated on this discussion later, and somehow something that will play fundamental role and try to explain exactly why is semi definite programming mean.",
            "So my definite problem is kind of uniquely suited to deal with deal with convexity with convex problems.",
            "Or there's some kind of algebraic structure in there under very nice unifying idea that that tries to capture what's difficult on what's nice about all these problems.",
            "Which is this idea of the convex Hull of an answer like variety and and.",
            "I'll explain exactly what this is, so this is the main point, is really going to be to show up examples and applications.",
            "I'm going to discuss results, but in particular also I want to hint at what are open questions in here, and also something I'll try to do at the end is to try to make clear how this connects with lots of other other artists.",
            "Of mathematics.",
            "So many of you."
        ],
        [
            "Know quite a bit about the geometric theory of convex sets, right?",
            "So the classical theory of convex sets that you that you study when you do with your convex analysis or convex optimization is a geometric theory.",
            "I mean somehow we have a set and its ascribed geometrically we know exactly what points are in the set with points or not, but typically we don't.",
            "Those sets don't come with the presentation, it's not that they're presented in any particular way.",
            "For instance, as it happens in the case of polytopes, right?",
            "When you think about the polytope it comes in with.",
            "Explicit description typically of the facets or the extreme points.",
            "But somehow whenever we study convex optimization, then typically we only care about the fact that there's a gradient order subgradient and somehow we only care about the geometry of this.",
            "But typically again, what really drives complexity are the algebraic or and geometric questions, or the computational aspects.",
            "If you want off this convex sets, let me give an example.",
            "You know something that I guess for you if you've taken convex optimization, one or one, you may not realize if you take convex optimization 102.",
            "You know this fairly well, which is that line or one of the things that we say always at the beginning.",
            "Said convex optimization is easy right?",
            "Solving convex optimization problem is, but if you actually look at the statement we actually claim when you make this kind of.",
            "Statement he said this is easy if you have some kind of Oracle access to your to your convex set or you have some kind of other description of what your convex set is and you can actually.",
            "They know work with it in some particular way.",
            "Many of the convex sets that we would actually be interested in in optimizing over.",
            "Let me get an example that's close, many of which is, for instance, marginal polytope.",
            "When you look at the marginal polytope of an exponential family, then those are certainly convex sets, but in that typically we cannot optimize efficiently over those words, but also just not presented.",
            "We don't have Oracle access to those, we don't have separation oracles for those.",
            "We don't have kind of any accessible presentation to those convex sets.",
            "In a way that we can that we can actually do things efficiently.",
            "So in a certain sense, this is of course a theorem.",
            "Convex optimization is easy, provided you have a membership for a separation Oracle, but in the absence of further structure then we may have problems.",
            "2 problems in the various in the same dimension and one may be very easy to solve on the other one, maybe in Bihar.",
            "And I'll give you perhaps a few concrete examples of this, and somehow again, typical.",
            "Yeah.",
            "Combat the kind of things that we learn in convex optimization don't quite distinguish between these cases, right, but we only have again, kind of."
        ],
        [
            "Direct access to what these functions.",
            "So before starting comics, it's kind of.",
            "It's very natural to try to study first what happens over here?",
            "I mean everything that you try to say or do for general convex sets should be true for both here and in the case of polyhedra is very well understood, right?",
            "We understand this perfectly well, so let me just mention some of the things that are kind of useful about polyhedra when you think about optimization, one which is fairly important and you'll see why.",
            "So they behave quite nicely under projections, right?",
            "If you have a polytope and you project.",
            "Hope to a lower dimensional space, but it behaved well.",
            "I mean that the projection is also a polytope, right?",
            "Take a polytope your projected down.",
            "You also get a polytope in the projection.",
            "Also, we know fairly well how to understand emptiness questions about it.",
            "Or duality questions if you want available here.",
            "If I give you a call here and and it so happens that it's empty, I give you description if you want in terms of inequality's and this inequality are actually infeasible, then I both know how to detect this invisibility and to actually give you certificates.",
            "But essentially we can solve this LP if this help is not feasible.",
            "The dual is going to be feasible and any solution of the dual problem is going to give us an invisibility certificate about my polynomials and also closely associated to that.",
            "Of course that we have.",
            "Very good computational techniques for dealing with Paul here, right?",
            "We can solve LP solve."
        ],
        [
            "Lots.",
            "So that's great, but somehow in their sets have to be described by Inequality's and the question is what happens when you start moving away from linearity?",
            "Right now you may have set subscribe by other kinds of equations or inequalities.",
            "Again, think about your favorite convex set from water problem and somehow it doesn't really typical.",
            "It will not be able here and then we want to try to understand how to deal with it, or even if it's a polyhedron.",
            "I mean, as we're going to see, we may be interested in approximation questions and the claim is that they or one of the points I want to make sense.",
            "Different problem is fairly senchal.",
            "For these problems many of you have seen."
        ],
        [
            "No fairly well, semi definite programming.",
            "Let me just grab it from a slightly different viewpoint.",
            "Perhaps they want that you've seen just because it kind of connection with nicer with some things are going to say later.",
            "Which is, I mean, the way I like to think about semi definite program.",
            "Many people like to think about some definite problem is kind of this generalization of linear programming, where if linear programming is really about intersecting an affine subspace with the cone with the orthant right, because you write a X = B and X non negative, and that describes intersection of the orphan X non negative.",
            "With the subspace AX equal to be, then somehow semi definite problem is exactly the same story where instead of having the order and now you have the positive semi definite cone, the cone of possible matrices so so my definite problem is really about intersecting on Afrin subspace and the cone of possible side effect matrices and perhaps optimizing a linear function over that intersection.",
            "But the point is somehow from the conic POV LP semi definite programming there kind of the same thing.",
            "I mean you change account.",
            "Bud Light now kind of.",
            "Things are pretty much the same, and by this we mean for instance, that the duality theory of semi definite programming is fairly similar to the Duality Theorem LP.",
            "I mean there's a couple of differences and also whether we can solve semidefinite problems in polynomial time.",
            "Say a few more things about that later, so let me."
        ],
        [
            "Give an example in case you've never seen this in my definite problem and let me actually show you, for instance, why somehow we can do some nice algebraic things.",
            "So let's look for instance of this matrix, right?",
            "This is 3 by three matrix.",
            "It's parameterized by variables XX&Y.",
            "So the feasible set of this semi definite problem is a set of X&Y's that make this matrix positive semi definite.",
            "That's what this inequality mean, right?",
            "It's a symmetric matrix positive definite or like in values have enough negative.",
            "If you draw what they said is what are the values of X&Y that actually make this matrix positive semi definite?",
            "What you'll get is this convex set in here right?",
            "This nice over like figure that you have over there.",
            "Right and what happens in here?",
            "It's actually shifted.",
            "I think the axis are kind of.",
            "Shifting here, so what's kind of interesting and let me perhaps mention this is that I want to think about this or it will be important for a number of reasons to really not think just about the convex set, but actually think about somehow all the other components that define the boundary of this set.",
            "So what happens in here is that when you look at the boundary of this set, the boundary of the set is cubic polynomials.",
            "Just determinant of this matrix, and when you plot the zero set of that.",
            "Polynomial you not only get this part in here, but you get this other component.",
            "This an elliptic curve soloing organ of the Oval part, and there's kind of this other component and somehow in here in the plane in this real plane they look like the separate components, but they're actually just one object.",
            "I cannot talk about this part without talking about this part somehow.",
            "If I were to look in the complex plane below.",
            "These two things are just form right now and this is important for other reasons that we're going to see later somehow complexity things.",
            "Complexity questions about this set?",
            "They don't depend only on the set, but they actually depend on this part are somehow if this part is nasty then this is going to affect whether I can do optimization over this set or not, even though I do not see it on the boundary of this.",
            "Again, this is just an example."
        ],
        [
            "I've never seen this many different problem, so let me ask you a very natural question.",
            "First right or line organ of one of the kind of things that we typically asking here is like I told you, case of semi definite problem.",
            "Many of you have seen a number of applications or semi definite product but very natural question is what can you do with semi definite programming right?",
            "What sets can you represent in terms of semidefinite programming?",
            "So let me give perhaps contrast that to the case of LP.",
            "For which we understand very well this question, right?",
            "If I ask you easy set and can I describe this set as an LP and I give you a sphere.",
            "Right, you will tell me no, you cannot.",
            "While you can, then you have this sort of thinking about why that's actually the case in the case of LP.",
            "It's kind of easy.",
            "We can understand the structure of convex sets.",
            "They have to have find linear train points, so Linux fear doesn't happen in experiences.",
            "Fear I cannot do it in MP."
        ],
        [
            "But what happens if we try to think about the same questions about semidefinite programming?",
            "Right?",
            "What kind of sets I can represent in terms of semidefinite programming?",
            "And this is not just a theoretical?"
        ],
        [
            "When you think about laying on me."
        ],
        [
            "Of the developments in right now, kind of in optimization, in particular in the last line of 1520 years, and a lot of that came from realizing that some sets deadline or they have fairly complicated and different descriptions done both semi definite programming is they can actually be described in terms of semidefinite programming.",
            "If you ever looked at line unnecessary.",
            "Blaine organ, of any recent booking convex optimization.",
            "There's a lot of this extremely clever reformulations of sets in terms of semi definite problem and example.",
            "I'll talk a little bit about later.",
            "For instance, nuclear norm, right?",
            "When you look at the unit ball of the nuclear norm?",
            "Somehow, it's not obvious why that can be reformulated in terms of semantic priming, but nevertheless it can, and there's a lot of work somehow constructive work that actually tries to show that some."
        ],
        [
            "Here.",
            "Sets can or cannot be done, and I'll try to explain a little bit more, at least the kind of more than anything."
        ],
        [
            "I will not tell you that much about the results.",
            "So clearly necessary conditions for is set to be represented in terms of semantic priming here, so we come back some algebraic.",
            "So convex is clear the feasible set of every semi definite problem is convex.",
            "Some algebraic in here essentially means that it can be described in terms of polynomials, right?",
            "Then why polynomials?",
            "If you look at the semi definite problem, remember this is a matrix whose entries depend linearly on my decision variables.",
            "Somehow the boundary of myself is want to be described by determinants and minors, and those are all polynomials of my decision environments.",
            "So for instance, if I were to ask you, can we describe the exponential function in terms of semidefinite programming?",
            "Answer Should be, of course, but you cannot.",
            "And what's interesting is that there's kind of several versions of this question.",
            "One, let me not talk too much about this, which is whether it's actually very important.",
            "I just don't want to talk about it now, which is about the exact versus approximate question.",
            "Right, so perhaps like the exponential case, I cannot represent exactly the exponential function, But perhaps I can do a pretty good approximation using semi definite programming?",
            "Or we actually can?",
            "We actually can quantify exactly how well you can do, and this is very important from the practical point of view.",
            "There's lots of problems out there that even if you cannot represent them exactly, you can give approximate representations of very high quality.",
            "There's a lot that we could talk about that, but for now I'm interested in the exact question, so I have a set and I want to try to understand.",
            "Can I represent that set or not in terms of semi definite forming?",
            "Well, I want you to know this is that there's.",
            "Two slightly different versions of the problem, right?",
            "One is kind of the direct question.",
            "So imagine how we set up on our end and I want to actually represent this set in terms of a semi definite problem that only has the variables X one to XN.",
            "Right, as opposed to, so this is essentially what I'm driving here.",
            "I want to write.",
            "S is my set.",
            "It lives in our end, so I want to describe myself as X in S if and only if some semi definite program in there is visible.",
            "As opposed to what we call a lifted representation, which you can use extra variables, I can use voice wise and such a way that access in S if there are some values of wise for which inequality holds.",
            "So what's the difference?",
            "What's the geometric difference between these two kinds of objects, right?",
            "One is you're actually trying to represent yourself directly in this space that you want.",
            "In this case, what you're actually trying to do is to produce a set in a higher dimensional space whose projection is exactly the set that you want.",
            "And what's very interesting is that for semi definite problem, there's a difference between these two things.",
            "In LP this doesn't happen, right?",
            "As I told you earlier, if you take an LP.",
            "A polytope, and you project it down.",
            "The projection is a polytope, but it is not true that if you take a set which is described by semi definite programming in like know what 100 variables, then the projection to the plane will actually be describable using only two variables.",
            "There's no way that I can do like you know, like.",
            "A foodie Ahmad skin analogue, for instance, when you take apart here and I know you project it down, you may have a lot more inequality's, but those inequality only involve the variables in the projection.",
            "So these are really two different mathematically are two different questions.",
            "Can I represent the set directly in its natural space or is it the projection of something else and this is really what gives semi definite problem its power?",
            "But somehow when we think about the.",
            "Representing sets, these other variables can actually increase a lot the expressive power of my class of sets, and I'll give you examples in 2nd, and if you know, yeah.",
            "That's mine."
        ],
        [
            "Slide, so actually something like this happen happens even in LP.",
            "But over different nature.",
            "So in LP's I will see in a second the differences, complexity right it turns out that we may be able to represent more efficiently certain sets in terms of projection and I'll describe the example in a second but inside my different problem the difference is just existential.",
            "I may just not be able to do it.",
            "Has nothing to do with complexity questions.",
            "So one situation in LP.",
            "Again many of you are familiar that sometimes we have convex sets in some in my Lane RN there are a lot easier or much more competitive.",
            "Much more compact descriptions in terms of projections of other objects.",
            "In the classical example is the L1 ball, right?",
            "The ball over one.",
            "So if I want to describe cross polytope the L1 bowl in the.",
            "Just using the natural facets that describe my policy of the 19 exponentially, many right there.",
            "Essentially the sum of the absolute values of X&Y lesson.",
            "Regarding one, if you expand it out that it says all the inequality of this type under all facets.",
            "So I cannot get rid of any of those ones.",
            "I actually need all to the facet to describe myself.",
            "But because my cross polytope in this particular case has only two N extreme points, then it will be just a projection of a simplex from 2 N dimensional space.",
            "I can take a simplex into an dimensional space, linearly map it so each corner will go to extreme point of my polytope under for that will give me a representation of my center.",
            "If you want an explicit description, this is kind of what we have in here.",
            "This is what you learn in linear programming 101, right?",
            "We write this.",
            "We introduce new variables.",
            "Why so why to kind of represent the absolute value?",
            "Then we expand those inequality.",
            "In this form.",
            "We write this and the projection of this set into the space of the exercise.",
            "That gives me exactly the L1.",
            "So this is a case where we don't want to write this in its natural space.",
            "We actually want to write as a projection of something else.",
            "And this is a."
        ],
        [
            "Extremely important question in combinatorial optimization and many of the combinatorial polytopes that we care about.",
            "In certain cases, or under certain situations, something like this is going to happen that we may be able to describe the convex Hull of some combinatorial object in terms of the projection of something else.",
            "Then example, perhaps just less obvious on this, or you may be a little surprise, which is, for instance, when you look at the convex Hull of trees, the spanning trees of the graph, right?",
            "So I give you a graph.",
            "Let's imagine the complete graph and you look at all the spanning trees.",
            "Right, so I can think of each point in our in square.",
            "If you wanted oranges too and then I can think about taking the convex Hull of all this very nasty polytope and the sensor.",
            "It has exponentially many points, exponentially extreme expansion, extreme points exponentially many facets, but nevertheless it has a non trivial representation as a projection of something else, right?",
            "And sometimes coming up with these representations is absolutely non trivial.",
            "But on those many examples.",
            "Let me know the library too much in the case of Paula."
        ],
        [
            "But let me give just again.",
            "This is mostly a picture, anything.",
            "So what happened of the same situation happening even in semi definite programming right?",
            "So this is a very nice class of convex sets, something called the K...",
            "I mean they appear in some particular problems, so it's kind of a nice generalization of an ellipse.",
            "Or instead of having you know, we can describe classical ellipse learning a set of points in the plane.",
            "So if you have two to four site then I look at the set of points whose sum of distances to my two given points is a constant.",
            "Right, so this K... kind of generalization of that when you don't have two points, but you have three right or K points, right?",
            "And it turns out that line and it said that it describes something like this so convex set.",
            "I mean, so essentially I wanted to think of this convex set in here, right?",
            "These are my three foresight and in this case this is my convex set in there.",
            "So just like I told you before.",
            "Here.",
            "Somehow I don't need to worry only about the boundary of this set by somehow all this stuff over here.",
            "It also plays a role, particularly if you want to do things in terms of justice.",
            "Direct representations of myself.",
            "So this is an example.",
            "For instance, were if you try to represent this set directly in its natural space, you need some indefinite representations of again exponential size, because all this stuff in here is killing you.",
            "This is all this stuff that's increasing the cardinality of your representation.",
            "But it's very natural already easy to give representations of this set again as projections of nicer convex sets, and they way that you construct it's very much a way that you could do it for anyone."
        ],
        [
            "Just an example, I just wanted some pictures.",
            "This is like for instance, a situation for the case of five points.",
            "Somehow in here the convex set the convex part that one cares about.",
            "This is tiny thing in here.",
            "But there's all these other stuff outside your set that actually has an effect on how hard or how easy is to represent, or to optimize over that set.",
            "And this is one of the things that, again, it's kind of these again cartoon.",
            "If you want.",
            "I mean, it's actually represented an actual set, but the point I want to combine here said somehow, when you haven't a polynomial, an algebraic description of a set is extremely rigid and you cannot change it locally because it affects lots of other things and somehow Lane organ of that's really."
        ],
        [
            "Yeah, what makes life easy or."
        ],
        [
            "Or or difficult in some cases again.",
            "I will not describe in detail the kind of results are known, but let me just perhaps a couple of things.",
            "One is that there's some very nice result that started appearing for both cases once or I think beginning to understand quite a bit data direct representation question.",
            "There's a very nice condition, something called rigid convexity, which I will not discuss, which is essentially algebraic analogue of convexity.",
            "There's kind of a nice condition that any set described by semi definite problem needs to satisfy and that involves.",
            "Not just a set, but involves all this other stuff that that's outside that I was telling you about and somehow in the plane that exactly characterizes when you can or you cannot represent sets in semi definite programming and that's related to a whole bunch of other stuff.",
            "But somehow we don't quite have yet afull hire a full version of the story for higher dimensions.",
            "Because the one that's closest or or more relevant to applications, although again in here we're talking about the exact case, is a lifted case, right?",
            "And we want to represent the set as a projection of something else.",
            "It's kind of very interesting because we don't know any nontrivial obstruction for is set to be.",
            "Semi definite represent the world in the set that for instance, I can rule out the exponential function, But if I give you a set which is described by polynomial equations, basics in algebraic set, then you know we don't know any kind of reason why it may not be the case that an arbitrary convex basic semantic set could always be the projection of a set described by semi definite Department.",
            "So in since we don't quite understand yet well semi definite problem, universal in the sense that every time that you have a self described by polynomial inequality.",
            "Convex then somehow you lay projection or something else.",
            "It could be the case.",
            "It has been proven in under some kind of nondegeneracy conditions that this is actually true, but somehow in some sense all the action or the interesting things may happen around similarities and we don't quite understand that picture.",
            "I cannot represent exponential function as a projection of.",
            "Well, these are a gala theoretic arguments.",
            "So essentially.",
            "If you want to optimize a linear function over the epigraph of the exponential, then you may get points which are transcendental, and if you want to optimize a linear function over line or something defined by by kind of semi definite describable set, you will always have algebraic numbers.",
            "So it's really a difference between something algebraic and something transcendent.",
            "Well that's it.",
            "That's trivial in the sense that you know.",
            "We just know that is true.",
            "It's actually trivial, I mean or or it's direct if you want.",
            "Yeah, I shouldn't say trivia.",
            "OK, so this is really, you know, kind of so the point if you want if this is somehow for polytopes we understand very well.",
            "Nobody said polytope.",
            "What are the limits of LP if you want but for semi definite forming without?",
            "And a very interesting question, which again, I'm not saying anything about.",
            "That is what happens in terms of approximation.",
            "Right, that's really also were somehow that brings a lot closer to both approximation algorithms and applications, right?",
            "For many problems I don't care about the order.",
            "You know, I can afford not to exactly describe a set and then an approximation would be fine."
        ],
        [
            "Other questions, how do?",
            "OK, so let me kind of perhaps switch gears a little bit or or introduce something that I'm going to use later.",
            "At least I need to justify a little bit.",
            "While we can do certain things and this is a way of doing it, which is this notion of sum of squares someone scores of polynomials, and I'm guessing some of you have seen this is the basic idea, is very sick and explain it again in a couple of slides.",
            "And really.",
            "They're very simple or very simple observation that if you have a polynomial which is the sum of squares and by someone scores, I mean that I can write as a sum of scores of other polynomials, then that's a sufficient condition for nonnegativity of my polynomial, right?",
            "If pieces sum of squares if something like this, then clearly piece not negative.",
            "So the reason why this is interesting?",
            "Each kind of well known?",
            "I mean, he would actually prove that this is not true in general.",
            "I mean, if we have several variables and high degree or not that high degree, then there are polynomials which are not negative but not summer squares.",
            "But what's interesting about this, at least from our perspective, is a.",
            "It's known that in certain cases issue things coincide.",
            "Let me not talk too much about this, but this is a convex condition.",
            "It turns out that I can efficiently decide whether a polynomial is a sum of scores or not, and I'll tell you exactly how to do this in the second right, and the reason why this is interesting is because deciding negativity with polynomial isn't hard.",
            "I cannot if I give you a polynomial variables, I cannot actually check whether this is non negative for all possible evaluations, but it's very easy to check whether my polynomial is almost scores or not or not.",
            "Very soon I have to solve a semi definite."
        ],
        [
            "So it's idea.",
            "So it's actually very simple.",
            "So what we try to do is essentially to write a polynomial as a quadratic form on some set of monomials, and the reason why this is nontrivial is because these representations are not unique, mean as opposed to when you think about the quadratic form, that if I give you a quadratic form, it's obvious which matrix you should write.",
            "Whenever I give you a polynomial here, because typically monomials in their their algebraically independent, then there's many matrices alike.",
            "All in there and somehow and this equality will be true.",
            "Now I want to see we can use semi definite programming to actually find a good matrix Q where good means that Q is possibly my definite base.",
            "If I have a possible significant matrix in there and I factor it, that will give me a sum of squares representation."
        ],
        [
            "So looking at the example, I think it's actually this."
        ],
        [
            "The general case I don't need to describe it, let me just describe an example.",
            "I think it's a lot easier to understand the ideas if you look at an example.",
            "So let's say that I give you this polynomial, right?",
            "This is a quadratic polynomial in two variables and I want to try to understand all of these polynomials, sum of squares or not.",
            "Right, So what am I going to do is?",
            "What I told you, I will try to write this polynomial as a quadratic form in a set of monomials.",
            "I don't know what by matrixes or I just write Q in there.",
            "I don't know what these queues are and in here I write all monomials in my variables in X&Y of degree two wide agree to because these polynomials every four right and I'm doing the homogeneous case so it's easy.",
            "So now I write this.",
            "And now I just expand this expression.",
            "And now what is my task right?",
            "I have to find a positive semidefinite matrix in here.",
            "So I need to find values of that user Y in such a way that this is possible semi definite and in such a way that this polynomial is the same as this polynomial.",
            "Right?",
            "So when you think about this, this polynomial being the same as this polynomial means that the coefficients are the same.",
            "So I can write a whole bunch of linear equations between this and this.",
            "So for instance, in this case OK, this is easy.",
            "I will write Q one 1 = 2.",
            "But in here I have for instance is nontrivial equation.",
            "I have that the sum of these two coefficients has to be equal to minus one.",
            "And you can imagine if I have a polynomial in a large number of variables, will have is many linear equations that relate these things, right?",
            "So what do I have to do now?",
            "I have to find a positive semi definite matrix.",
            "That satisfies a whole bunch of linear equations.",
            "So geometrically well my doing.",
            "I'm finding an element in a subspace, a whole bunch of linear equations and it's possible semi definite.",
            "That means that lives in the cone of positive definite matrices.",
            "So this is exactly if semidefinite programming feasibility problem finding a cue that simultaneously positive semi definite and satisfies linear equations is a semi definite problem.",
            "You can just solve it for instance in this case this is a solution.",
            "And then if I factor this matrix and I can do this versus positive definite, then I will get a sum of scores representation of my polynomial.",
            "Right, and this goes on if and only if.",
            "I mean I'm showing this in here an example, but it's easy to convince yourself that this is if and only if so somehow.",
            "Every time that we talk about some of squares or this or that, you can always think that in the background or something.",
            "My definite problem that you can solve.",
            "Right, and the point is, we can leverage this just from this simple problem or not so simple.",
            "Perhaps of giving a polynomial deciding where someone scores to essentially deal with arbitrary semi algebraic problems and then try to at least hint at why we can do something like this."
        ],
        [
            "So let me give what at least one point why this directly gives him very good ways of producing lower bounds for optimization is imagine they actually want to optimize the polynomial, right?",
            "I want to optimize.",
            "Let me do unconstrained minimization shots.",
            "It's easier, right?",
            "I want to do unconstrained minimization of my polynomial, and I can actually following.",
            "I can put a number gamma in there, and I can ask a question whether F of X minus gamma is a sum of squares.",
            "Right, if it works, is actually someone scores.",
            "That means average, is greater, equal and zero for every X.",
            "And this actually means of F of X is lower or equal is greater, equal and gamma four legs.",
            "So that means that gamma is actually lower bound on my polynomial global lower bound on my polynomial.",
            "I mean, turns out that I can."
        ],
        [
            "Actually find the best possible such gamma, essentially finding largest gamma for which is true.",
            "The biggest lower bound that I can prove using these techniques by solving SMI definite problem.",
            "This is essentially the same semi definite problem diabase cry before.",
            "And what happens is that these are extremely high quality bonds.",
            "Really, this tends to produce very much based on if we can solve these problems, and that's kind of an issue, but of course as you get large number of responses bigger, these are pretty much the best bounds that you can compute for this kind of problem.",
            "There's good reasons for that.",
            "I mean, they're not always exact, because it's exactly the point that I told you before, right?",
            "It's not always the case.",
            "Then negative polynomial is summer squares, but they tend to be extremely good, and there's ways of recovering.",
            "Solution if something like this holds and there's natural extensions of the constraint case, which I will not tell you about somehow the whole story that I'm telling here about doing unconstrained ministration, it extends in very natural ways of the constraint case.",
            "If I want to do minimize Poly."
        ],
        [
            "Comments about sex.",
            "Yeah, so let me go back or let me tell."
        ],
        [
            "So how we use all this summer school stuff?"
        ],
        [
            "Actually, uh, there is a kind of questions that I was selling all of them yet, so you have a question."
        ],
        [
            "No, it's not.",
            "It's so the number of monomials in the in.",
            "So when you look at the number of animals or polyamine variables and the greedy, you get 10 plus teachers D that's actually polynomial in D. It's polynomial in or the when you fix any of the other ones.",
            "And it's actually in the sense it's polynomial services polynomial size in the input.",
            "It's.",
            "So if you measure your inputs actually polynomial in the.",
            "It's polynomial in each.",
            "It's because it's also N plus V choose N. So if you fix any of the oceans, it's actually polynomial.",
            "If you grow both, of course it's jointly, but when you fix any of those.",
            "I mean somehow at some point the distinction is more in the sense of line or kind of.",
            "You know, when that value is, if that value is right now 3 million, I don't care about, you know kind of, but if you care about polynomial it or whatever then determine tournament."
        ],
        [
            "So let me tell you, for instance, of a special class of problems at that, and I'll tell you why.",
            "Kind of I think many of you should care about these kind of things, which is let me talk about this specific class of convex sets.",
            "We just want to be presented in the following way.",
            "There really somehow I have a set of objects that I care about or set set South that I care about.",
            "South may not be convex, but I'm actually interested in this convex colorways.",
            "Why don't all of you know what the convex Hull is?",
            "Its smallest convex set that contains myself, and we're particularly interested in this address is an algebraic variety, and again, if you don't like algebraic varieties, just think of polynomial equations or even finitely many set of points, right?",
            "Finally, many points it's always an algebraic variety, so some of the object that I'm trying to concern here is I have a set that I normally this somehow, or I can describe and what I'm really interested is in the convex Hull of this set that gives me a convex set that I can.",
            "Talk about them.",
            "Give you examples."
        ],
        [
            "So why do we care about this miss?",
            "Essentially many interesting problems boil down exactly to either understanding or describing this convex hulls, and the two examples I'll tell you about is just optimization mean somehow when you do optimization, this is implicitly what you're doing, and the other case I want to talk about this a little bit of all this kind of story about convex relaxations for rank and a whole bunch of other parts.",
            "I would not tell."
        ],
        [
            "Much about games.",
            "In here, so why do we care about this from the optimization point of view?",
            "Right, let's think about the problem again.",
            "I'm doing the multivariate case now, which is.",
            "Let's imagine that I'm trying to optimize a polynomial in there.",
            "In several variables, right?",
            "So this is a polynomial in several variables and somehow it's in.",
            "There are the monomials appear in this case, so I want to do is I want to phrase this problem which is just minimization or polynomial in the geometric language that I was telling you before to justify why we care about things."
        ],
        [
            "Well, they want to do in that case is I want you to consider the following object.",
            "I'll give you a picture in a second, but hold me for a second, which is.",
            "Let's imagine that I take RN.",
            "I mean all of our end and IMAP around under this monomial map.",
            "Right, So what this means is I'm going to.",
            "I'm going to vectoring here.",
            "This is cardinality of S and what I'm looking is what happens when I take all the points.",
            "Any point in our end I map it under this polynomial map and then I just look at the resulting image.",
            "So if you know this is essentially what's called awareness embedding of RN."
        ],
        [
            "Let me give you a picture and you know just so.",
            "It's kind of very clear which is a 1 dimensional picture.",
            "What this is called a moment curve.",
            "So what am I doing here?",
            "Imagine I'm trying to minimize the polynomial single variable.",
            "So what am I plugging in here?",
            "I take D that goes in this case from minus one to one, but it could go from minus Infinity to Infinity and then I look at this the set of points of the form one TT to the.",
            "In this case 4.",
            "VI think equal to two or three.",
            "Right and what happens is somehow as T goes from minus one to one or from minus Infinity Infinity.",
            "It describes a curb in this space.",
            "Would you say curving black in here?",
            "Right and what I want to do.",
            "The object that I want to consider for reasons that you will see in the second is a convex Hull of this car.",
            "So I have again, I think of our end us or or in this case it's just going in there from minus one to one on this space on this.",
            "After this model map I get this curve in there and now I want to think about this convex Hull of this object.",
            "While it's an extremely interesting convex set, a lot of it is known in the 1 dimensional case, some things are."
        ],
        [
            "In general, but the point I want to make is that optimization optimizing this complicated nontrivial linear polynomial in here non convex polynomial is just doing linear optimization over this set.",
            "And this is true.",
            "I mean, there's nothing deep in here that minimizing P of X.",
            "Is essentially the same thing as minimizing a linear function, linear functional defined by the coefficients of P. Over this over this convex Hull.",
            "So somehow if I could describe this convex Hull if I can approximate the convex Hull of this object demencial approximating my convex optimization problem.",
            "Sorry, my non convex optimization problem over there.",
            "Of."
        ],
        [
            "Also, should expect exactly because of what I said, but it should be NP hard to even check membership in this set.",
            "So this is an example of the kind of things I was selling at the beginning where we have a set which is very easy to describe.",
            "The convex Hull of this surface, let's say in the general case, but I cannot actually even check membership to this.",
            "If I give you a point, I don't have a polynomial time way of deciding whether I'm inside that said or am outside itself.",
            "So somehow we have to be careful when we think about optimizing over a convex set.",
            "It's easy, I mean if it was easy I could solve that and it's really easy.",
            "If this is presented the right way.",
            "So I'm going to tell you about this.",
            "Hint at why we can use all the sum of squares off to actually give approximations of this kind of type of convex."
        ],
        [
            "And let me let me just kind of.",
            "Just take a couple of minutes about something that again the first time that you think about it.",
            "I know it sounds weird, which is that you actually somehow I'm solving what looks like a nonconvex problem right?",
            "In here.",
            "I'm minimizing this non convex polynomial over Iran and in here I'm telling you that I'm solving kind of this linear optimization problem over convex.",
            "And the point is, I mean, this is something that."
        ],
        [
            "Fairly well understood, but I guess it's not.",
            "Appreciate it enough that somehow convexity is relative.",
            "I mean, there's nothing that's absolute about something being convex or not being convex, and it's very much relative to what your particular description, and this is very well known.",
            "In many cases.",
            "I mean when you think about the way that in games you go from from strategies to make strategies, when you think about the focal Planck equations will replace somehow when you essentially property distributions, right?",
            "Then somehow everything becomes convex in infinite dimensional space, but what's interesting the reason why?",
            "All this stuff actually works if you are some things you don't actually need infinite dimensions that somehow finite dimensions or even very small dimensions are actually enough."
        ],
        [
            "So let me give you just a visual example.",
            "I like this will.",
            "Somehow I think it clarifies quite a bit what goes on.",
            "So let's imagine for instance I have a set like this right?",
            "And annulus in here.",
            "Which is clearly not the most non convex set that you can think about whatever that means.",
            "It's not true, but anyway.",
            "So the question is, can I actually use convex optimization somehow to optimize over this set?",
            "Right, and again, it doesn't look like in the Sensodyne organifi."
        ],
        [
            "Hold in there in the middle.",
            "But the point is whether I have a whole or not, it kind of really depends on my perspective.",
            "So imagine that I take the plane.",
            "In this case, I take R2 and I wrap it around like, you know, kind of this parable, Lloyd in here and now when I look at this at my set, I look at the image and my set, which now is this trip around my problem and I just look at the convex Hull of this.",
            "Right, so now all points, all extreme points.",
            "Actually, all points in my set.",
            "They're actually exposed, I can touch them with linear functions.",
            "Right, the problem here the problem in this picture."
        ],
        [
            "He said I cannot touch this set with a linear function.",
            "I cannot touch this point with a linear functional.",
            "I can only touch it once on the boundary, so that's why convex Hull."
        ],
        [
            "To read and write, but in here once, I think about my set not in this description, but actually on this subscription.",
            "Then every point is accessible with a linear function.",
            "So I can just do convex optimization up here.",
            "Right, and that's exactly what was going on in the stuff that I described.",
            "That's exactly where the sum of squared stuff actually tries to."
        ],
        [
            "It's a simple picture, but I think it helps a lot.",
            "Yeah, so we can in a fairly systematic way.",
            "Use all the stuff I told I told you about to actually construct this approximate representations of convex sets in terms of semidefinite programming.",
            "Let me not bore you with equations, and we tell you the high level picture and the high level picture is very simple somehow.",
            "If I want to describe a convex set, let's say that this is a convex set.",
            "I want to describe, then we know that convex sets have a dual description, right?",
            "It's exactly the same to describe convex set in terms of all the linear functionals that are non negative on myself.",
            "Right, so somehow optimizing or the set of all linear functionals really bold sound to minimizing a linear function over my set in there.",
            "So it really boils down to either solving or approximating the optimization problem of minimizing the linear function subject to X being innocent.",
            "And well, I told you before we said we can approximate all kinds of problems of this type.",
            "Every time that we have some kind of optimization problem in there involving polynomials, we can approximate this with someone scores.",
            "So the point is, again, I'm skipping the details of what things actually look like on whatever.",
            "I just want to give you a possibility argument that if I have a way of approximating polynomials, sorry approximating optimization problems, then that implicitly gives me some other approximation of sets.",
            "And that's exactly what happens in here.",
            "Somehow there's a way of making all these construction very precise, and what we have is a nice way of producing nice approximations to convex hulls."
        ],
        [
            "Of arbitrary sets.",
            "So."
        ],
        [
            "Please give this example, so let me tell you.",
            "For instance, you know how how this story applies or simplifies.",
            "If you want in the particular case of this kind of.",
            "Minimum rank type problems.",
            "I think many of you are familiar with, right?",
            "So let's imagine that during some kind of ranking nization problem.",
            "What do you want to minimize?",
            "The rank of a matrix X subject with some kind of linear equations?",
            "We kind of know that this is hard in general, and whatever, so let's say."
        ],
        [
            "Yeah, the sort of unit proposed by Marion Marion Fasel.",
            "So I decided to use a convex envelope instead of the rank function instead of rank, which is this nuclear non self right.",
            "The nuclear norm is just a sum of singular values.",
            "Now let me describe why we do this from the perspective that I was telling you before, how nuclear norm."
        ],
        [
            "He appears in there and how we can go on generalizing, but what they find the nuclear norm on?",
            "Why way to think about it so that actually is is exactly the convex Hull of the variety of rank one matrices.",
            "So if I think about taking all the rank one matrices of norm one.",
            "So they know that's some algebraic variety, and you think about taking the convex Hull of that variety.",
            "It turns out that that's exactly the unit ball of the nuclear norm.",
            "And it turns out again in this case.",
            "I told you earlier that it happens if it's exactly semi definite representable.",
            "So somehow this gives us at least in motivation to think about instead of minimizing this non convex function, let me do the convex aggregate which is in this case just a convex Hull and somehow."
        ],
        [
            "Of all kind of wonderful things perhaps will happen, and in this case they do in the sense that line again, if we know that if somehow my equations are random, then with certain probability things at the same time they didn't have that many of you know this kind of things, right?",
            "So the point if there is one can motivate.",
            "Although it's perhaps not typically not done this way, why we use nuclear norms and stuff like that exactly from this convex geometry perspective?",
            "And the point is, this works not only for this.",
            "But somehow we cannot."
        ],
        [
            "We generalize and lots of divisions have paper somehow to arbitrary situations, or somehow what you're interested in.",
            "Instructions which are essentially lower small number of combinations of elements of some atoms head.",
            "So for instance, if instead of thinking about low rank matrices you think about low rank tensors or matrices which are some of small number of permutation matrices or cut majors or whatever, you can think about doing exactly the same construction that was selling before you think about what are your atoms.",
            "One of the things that you actually care about.",
            "Then you think about taking the convex Hull of that, at least in your mind, because sometimes computing this convex Hull is impossible, and I'll tell you what happens in this case and those under mild conditions that defines the norm, and those nodes are kind of the right regularizers to use if you want to induce certain kinds of structure.",
            "So just in the same way that we talk about L1 or the nuclear norm, we can think about some kind of nuclear norm from tensors, some kind of nuclear norm for plantation matrices in or similar known for cut matrices.",
            "That's what's called.",
            "Two norm and essentially for any situation where you want to induce some kind of structure, then one can think about doing this kind of convex Hull construction.",
            "Now this is kind of where all the stuff I told you before comes into place, right?",
            "It's easy to say this, you just take the convex Hull offline organ of the set of all cut matrices.",
            "But the point is we cannot do this in the sense that it's NP hard to actually do this to check membership to this convex Hull.",
            "So what we can do with all this stuff I told you about gives you are ways of constructing outer approximations to these norms.",
            "In some cases exact.",
            "So for L1, for nuclear norm we exactly know how to describe this convex hulls.",
            "We have small semi definite.",
            "I'm so excited Scribus, but in general this is not true.",
            "And it's very interesting that these kind of approximations are supposed to purely metric approximations where you just want to approximate the set.",
            "They actually preserve facial structure.",
            "They perceive their faces somehow, they low dimensional faces to some extent of my convex body, and let me hint at least why I will not.",
            "I don't have time to talk about this in detail, but let me tell you why this is very important, But in this kind of problems when we think about the statistics of it or the probabilistic aspect of it, which is, for instance, how many samples do I need?",
            "How many equations do I need?",
            "If I want to recover my problem, it turns out that what plays a role I'm not telling you why, but plays a role both in L1 nuclear norm, all this stuff or kind of big width of this tangent cones.",
            "So somehow when I have my convex body in here, think about the blue object, ignore the stuff outside somehow.",
            "What matters is how pointy this object is?",
            "This is really what determines the number of samples that you need for recovery.",
            "I mean, there's a nice way of understanding this, right?",
            "But the point is following.",
            "Somehow when I approximate my set, when I produce an approximation of my set.",
            "The approximations produced by these kind of methods essentially will give you round versions of these convex body that typically have comes in there that necessary are slightly bigger than what they should be.",
            "And what that tells me essentially said we can control, or that there's this tradeoff between how many samples I need to recover, which is related to how big this console versus how expensive is too computationally describe these objects.",
            "So the point is, again, we don't quite serious for L1 and four nuclear norm because we can exactly describe these sets.",
            "Nothing like this happens, but as you start going to more complicated problems, even though the recent natural regularizer that you may want to use, and you may prove all kind of wonderful properties about that, then you cannot compute it.",
            "And there's ways of computing approximations, and there's way of understanding the tradeoff, or how, and this is.",
            "Again, this is a case where any approximations of this set will not work.",
            "If you take an arbitrary metric approximation in there, that won't necessarily preserve the facial structure, so.",
            "If you want to read more."
        ],
        [
            "That's a nice paper to do, some stuff, some pretty much wrapping up, so let me tell you a.",
            "If you think, I mean there's a lot of connections between all these kind of things and very different areas of mathematics, let me just perhaps hints.",
            "Here, which I mean, it's fairly clear because I talked a lot about line or convex hulls.",
            "Somehow the probabilistic interpretation of convex hulls are of course probability distributions, right?",
            "Somehow I can think about an object right now.",
            "Think about mix strategies in games, right?",
            "I can think about this either geometrically convex Hull or I can think about it as a probabilistic object.",
            "So there's kind of very natural ways of describing this.",
            "There's some very nice connections with noncommutative versions of probably there's kind of a quantum version of all this stuff when you think about polynomials not in variables.",
            "In real variables, but you think about polynomials in noncommutative indeterminates, under kind of notions of positive iti, their notions is almost worse.",
            "There's notions of geometric sets on this noncommutative sets, and it's actually quite quite interesting."
        ],
        [
            "Right now.",
            "I even say much in this talk about the how do we actually solve the things?",
            "I mean somehow in this talk I'm just saying, OK, you have a semi definite problem and I ignore everything about how you actually solve this amendment.",
            "We understand fairly well or or it's a huge part.",
            "If you want of actually getting all these ideas work to actually understood, understand how much we can exploit structure.",
            "I mean somehow in here they obvious versions I described before.",
            "I mean they kind of work well for small problems if you try to do bigger things.",
            "You have to be more sophisticated about it and we have a pretty good understanding at least of how to exploit certain kind of structure for these methods.",
            "And that works both of the algebraic level.",
            "Somehow we want to understand structure with polynomial and what does it mean algebraically?",
            "There's very sophisticated ways of understanding when the polynomial is sparse.",
            "I mean not sparse in the naive sense of.",
            "Entries have seed or not, but sparse in terms of laying.",
            "What's convenient.",
            "Total configuration of the coefficient real zero or not."
        ],
        [
            "That actually helps a lot, but also from the numerical viewpoint.",
            "I mean, somehow they semi definite problems arise from these kind of problems.",
            "They're not arbitrary, they have a very nice structure.",
            "If you change, coordinates are right way, then all matrices are appear in your semi definite program that rank one and you can actually use that for efficient computation.",
            "And again I don't have time to talk."
        ],
        [
            "Too much about this, so this is pretty much my summary.",
            "The point is, there's a very rich class of optimization problems that come up when you consider the algebraic structure of convex sets.",
            "These methods are not just theoretical mean, they have enabled or motivated.",
            "I think a whole bunch of applications.",
            "Of course, if you want to scale them to very large dimensions then you have to really start perhaps being a little pragmatic and giving up about using for instance, interior point methods to solve some idea.",
            "Perhaps we want to 1st order methods, but think it's enormously important to actually think about what's the right problem to solve, and somehow I think in this case it's very useful to think, OK, this is this semi definite problem is in the background.",
            "This is really what defines the kind of things that I would ideally like to solve, and then you can kind of compromise or be more pragmatic about how would you actually solve that problem.",
            "So perhaps I don't want to use and the nuclear norm is actually good example, right?",
            "So you can think in terms of the semi definite programming formulation.",
            "If you really want to solve large scale problems, then perhaps you will give up on the convex formulation.",
            "Will give you some factorization or an explicit factorization of matrix line organized.",
            "Then you know some kind of nonlinear method in this, but you're still somehow trying to approximate this underlying convex problem in that."
        ],
        [
            "I want to know more.",
            "There's papers and stuff in my website and we just finished actually this book with a whole bunch of collaborators, so it should appear prism."
        ],
        [
            "What time?",
            "Thanks."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let me tell you what this talk is about, the kind of things that they are trying to do, and it's really to give a little an overview of essentially how convexity and the algebraic structure of convex sets interact, and in particular, why do we care about when we actually want to solve some of these problems and and what are the implications of these kind of things?",
                    "label": 0
                },
                {
                    "sent": "And it will be they will be technical, but I think the main part should be fairly accessible.",
                    "label": 0
                },
                {
                    "sent": "There's lots of pictures and ideas really, just with an intuition of what's actually happening in these situations and go out.",
                    "label": 0
                },
                {
                    "sent": "You can look at the details in dynaman of all the.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Personal stuff.",
                    "label": 0
                },
                {
                    "sent": "So as I said, this is pretty much the outline of the talk is about trying to understand what happens with or what kind of things we can do when we have convex sets with algebraic descriptions, and I'll try to explain why do we care about this algebraic descriptions.",
                    "label": 1
                },
                {
                    "sent": "Typically it's a way that most convex sets are presented.",
                    "label": 0
                },
                {
                    "sent": "An elaborated on this discussion later, and somehow something that will play fundamental role and try to explain exactly why is semi definite programming mean.",
                    "label": 0
                },
                {
                    "sent": "So my definite problem is kind of uniquely suited to deal with deal with convexity with convex problems.",
                    "label": 0
                },
                {
                    "sent": "Or there's some kind of algebraic structure in there under very nice unifying idea that that tries to capture what's difficult on what's nice about all these problems.",
                    "label": 1
                },
                {
                    "sent": "Which is this idea of the convex Hull of an answer like variety and and.",
                    "label": 0
                },
                {
                    "sent": "I'll explain exactly what this is, so this is the main point, is really going to be to show up examples and applications.",
                    "label": 0
                },
                {
                    "sent": "I'm going to discuss results, but in particular also I want to hint at what are open questions in here, and also something I'll try to do at the end is to try to make clear how this connects with lots of other other artists.",
                    "label": 0
                },
                {
                    "sent": "Of mathematics.",
                    "label": 0
                },
                {
                    "sent": "So many of you.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Know quite a bit about the geometric theory of convex sets, right?",
                    "label": 1
                },
                {
                    "sent": "So the classical theory of convex sets that you that you study when you do with your convex analysis or convex optimization is a geometric theory.",
                    "label": 1
                },
                {
                    "sent": "I mean somehow we have a set and its ascribed geometrically we know exactly what points are in the set with points or not, but typically we don't.",
                    "label": 1
                },
                {
                    "sent": "Those sets don't come with the presentation, it's not that they're presented in any particular way.",
                    "label": 0
                },
                {
                    "sent": "For instance, as it happens in the case of polytopes, right?",
                    "label": 0
                },
                {
                    "sent": "When you think about the polytope it comes in with.",
                    "label": 0
                },
                {
                    "sent": "Explicit description typically of the facets or the extreme points.",
                    "label": 1
                },
                {
                    "sent": "But somehow whenever we study convex optimization, then typically we only care about the fact that there's a gradient order subgradient and somehow we only care about the geometry of this.",
                    "label": 0
                },
                {
                    "sent": "But typically again, what really drives complexity are the algebraic or and geometric questions, or the computational aspects.",
                    "label": 0
                },
                {
                    "sent": "If you want off this convex sets, let me give an example.",
                    "label": 0
                },
                {
                    "sent": "You know something that I guess for you if you've taken convex optimization, one or one, you may not realize if you take convex optimization 102.",
                    "label": 0
                },
                {
                    "sent": "You know this fairly well, which is that line or one of the things that we say always at the beginning.",
                    "label": 0
                },
                {
                    "sent": "Said convex optimization is easy right?",
                    "label": 0
                },
                {
                    "sent": "Solving convex optimization problem is, but if you actually look at the statement we actually claim when you make this kind of.",
                    "label": 0
                },
                {
                    "sent": "Statement he said this is easy if you have some kind of Oracle access to your to your convex set or you have some kind of other description of what your convex set is and you can actually.",
                    "label": 0
                },
                {
                    "sent": "They know work with it in some particular way.",
                    "label": 0
                },
                {
                    "sent": "Many of the convex sets that we would actually be interested in in optimizing over.",
                    "label": 0
                },
                {
                    "sent": "Let me get an example that's close, many of which is, for instance, marginal polytope.",
                    "label": 0
                },
                {
                    "sent": "When you look at the marginal polytope of an exponential family, then those are certainly convex sets, but in that typically we cannot optimize efficiently over those words, but also just not presented.",
                    "label": 0
                },
                {
                    "sent": "We don't have Oracle access to those, we don't have separation oracles for those.",
                    "label": 0
                },
                {
                    "sent": "We don't have kind of any accessible presentation to those convex sets.",
                    "label": 0
                },
                {
                    "sent": "In a way that we can that we can actually do things efficiently.",
                    "label": 0
                },
                {
                    "sent": "So in a certain sense, this is of course a theorem.",
                    "label": 0
                },
                {
                    "sent": "Convex optimization is easy, provided you have a membership for a separation Oracle, but in the absence of further structure then we may have problems.",
                    "label": 0
                },
                {
                    "sent": "2 problems in the various in the same dimension and one may be very easy to solve on the other one, maybe in Bihar.",
                    "label": 0
                },
                {
                    "sent": "And I'll give you perhaps a few concrete examples of this, and somehow again, typical.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Combat the kind of things that we learn in convex optimization don't quite distinguish between these cases, right, but we only have again, kind of.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Direct access to what these functions.",
                    "label": 0
                },
                {
                    "sent": "So before starting comics, it's kind of.",
                    "label": 0
                },
                {
                    "sent": "It's very natural to try to study first what happens over here?",
                    "label": 0
                },
                {
                    "sent": "I mean everything that you try to say or do for general convex sets should be true for both here and in the case of polyhedra is very well understood, right?",
                    "label": 1
                },
                {
                    "sent": "We understand this perfectly well, so let me just mention some of the things that are kind of useful about polyhedra when you think about optimization, one which is fairly important and you'll see why.",
                    "label": 1
                },
                {
                    "sent": "So they behave quite nicely under projections, right?",
                    "label": 0
                },
                {
                    "sent": "If you have a polytope and you project.",
                    "label": 0
                },
                {
                    "sent": "Hope to a lower dimensional space, but it behaved well.",
                    "label": 0
                },
                {
                    "sent": "I mean that the projection is also a polytope, right?",
                    "label": 0
                },
                {
                    "sent": "Take a polytope your projected down.",
                    "label": 0
                },
                {
                    "sent": "You also get a polytope in the projection.",
                    "label": 1
                },
                {
                    "sent": "Also, we know fairly well how to understand emptiness questions about it.",
                    "label": 0
                },
                {
                    "sent": "Or duality questions if you want available here.",
                    "label": 0
                },
                {
                    "sent": "If I give you a call here and and it so happens that it's empty, I give you description if you want in terms of inequality's and this inequality are actually infeasible, then I both know how to detect this invisibility and to actually give you certificates.",
                    "label": 0
                },
                {
                    "sent": "But essentially we can solve this LP if this help is not feasible.",
                    "label": 0
                },
                {
                    "sent": "The dual is going to be feasible and any solution of the dual problem is going to give us an invisibility certificate about my polynomials and also closely associated to that.",
                    "label": 0
                },
                {
                    "sent": "Of course that we have.",
                    "label": 0
                },
                {
                    "sent": "Very good computational techniques for dealing with Paul here, right?",
                    "label": 0
                },
                {
                    "sent": "We can solve LP solve.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Lots.",
                    "label": 0
                },
                {
                    "sent": "So that's great, but somehow in their sets have to be described by Inequality's and the question is what happens when you start moving away from linearity?",
                    "label": 1
                },
                {
                    "sent": "Right now you may have set subscribe by other kinds of equations or inequalities.",
                    "label": 0
                },
                {
                    "sent": "Again, think about your favorite convex set from water problem and somehow it doesn't really typical.",
                    "label": 1
                },
                {
                    "sent": "It will not be able here and then we want to try to understand how to deal with it, or even if it's a polyhedron.",
                    "label": 0
                },
                {
                    "sent": "I mean, as we're going to see, we may be interested in approximation questions and the claim is that they or one of the points I want to make sense.",
                    "label": 0
                },
                {
                    "sent": "Different problem is fairly senchal.",
                    "label": 0
                },
                {
                    "sent": "For these problems many of you have seen.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "No fairly well, semi definite programming.",
                    "label": 0
                },
                {
                    "sent": "Let me just grab it from a slightly different viewpoint.",
                    "label": 0
                },
                {
                    "sent": "Perhaps they want that you've seen just because it kind of connection with nicer with some things are going to say later.",
                    "label": 0
                },
                {
                    "sent": "Which is, I mean, the way I like to think about semi definite program.",
                    "label": 0
                },
                {
                    "sent": "Many people like to think about some definite problem is kind of this generalization of linear programming, where if linear programming is really about intersecting an affine subspace with the cone with the orthant right, because you write a X = B and X non negative, and that describes intersection of the orphan X non negative.",
                    "label": 1
                },
                {
                    "sent": "With the subspace AX equal to be, then somehow semi definite problem is exactly the same story where instead of having the order and now you have the positive semi definite cone, the cone of possible matrices so so my definite problem is really about intersecting on Afrin subspace and the cone of possible side effect matrices and perhaps optimizing a linear function over that intersection.",
                    "label": 0
                },
                {
                    "sent": "But the point is somehow from the conic POV LP semi definite programming there kind of the same thing.",
                    "label": 0
                },
                {
                    "sent": "I mean you change account.",
                    "label": 0
                },
                {
                    "sent": "Bud Light now kind of.",
                    "label": 0
                },
                {
                    "sent": "Things are pretty much the same, and by this we mean for instance, that the duality theory of semi definite programming is fairly similar to the Duality Theorem LP.",
                    "label": 1
                },
                {
                    "sent": "I mean there's a couple of differences and also whether we can solve semidefinite problems in polynomial time.",
                    "label": 0
                },
                {
                    "sent": "Say a few more things about that later, so let me.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Give an example in case you've never seen this in my definite problem and let me actually show you, for instance, why somehow we can do some nice algebraic things.",
                    "label": 0
                },
                {
                    "sent": "So let's look for instance of this matrix, right?",
                    "label": 0
                },
                {
                    "sent": "This is 3 by three matrix.",
                    "label": 0
                },
                {
                    "sent": "It's parameterized by variables XX&Y.",
                    "label": 0
                },
                {
                    "sent": "So the feasible set of this semi definite problem is a set of X&Y's that make this matrix positive semi definite.",
                    "label": 1
                },
                {
                    "sent": "That's what this inequality mean, right?",
                    "label": 0
                },
                {
                    "sent": "It's a symmetric matrix positive definite or like in values have enough negative.",
                    "label": 0
                },
                {
                    "sent": "If you draw what they said is what are the values of X&Y that actually make this matrix positive semi definite?",
                    "label": 0
                },
                {
                    "sent": "What you'll get is this convex set in here right?",
                    "label": 0
                },
                {
                    "sent": "This nice over like figure that you have over there.",
                    "label": 0
                },
                {
                    "sent": "Right and what happens in here?",
                    "label": 0
                },
                {
                    "sent": "It's actually shifted.",
                    "label": 0
                },
                {
                    "sent": "I think the axis are kind of.",
                    "label": 0
                },
                {
                    "sent": "Shifting here, so what's kind of interesting and let me perhaps mention this is that I want to think about this or it will be important for a number of reasons to really not think just about the convex set, but actually think about somehow all the other components that define the boundary of this set.",
                    "label": 0
                },
                {
                    "sent": "So what happens in here is that when you look at the boundary of this set, the boundary of the set is cubic polynomials.",
                    "label": 0
                },
                {
                    "sent": "Just determinant of this matrix, and when you plot the zero set of that.",
                    "label": 0
                },
                {
                    "sent": "Polynomial you not only get this part in here, but you get this other component.",
                    "label": 1
                },
                {
                    "sent": "This an elliptic curve soloing organ of the Oval part, and there's kind of this other component and somehow in here in the plane in this real plane they look like the separate components, but they're actually just one object.",
                    "label": 0
                },
                {
                    "sent": "I cannot talk about this part without talking about this part somehow.",
                    "label": 0
                },
                {
                    "sent": "If I were to look in the complex plane below.",
                    "label": 0
                },
                {
                    "sent": "These two things are just form right now and this is important for other reasons that we're going to see later somehow complexity things.",
                    "label": 0
                },
                {
                    "sent": "Complexity questions about this set?",
                    "label": 0
                },
                {
                    "sent": "They don't depend only on the set, but they actually depend on this part are somehow if this part is nasty then this is going to affect whether I can do optimization over this set or not, even though I do not see it on the boundary of this.",
                    "label": 0
                },
                {
                    "sent": "Again, this is just an example.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I've never seen this many different problem, so let me ask you a very natural question.",
                    "label": 0
                },
                {
                    "sent": "First right or line organ of one of the kind of things that we typically asking here is like I told you, case of semi definite problem.",
                    "label": 0
                },
                {
                    "sent": "Many of you have seen a number of applications or semi definite product but very natural question is what can you do with semi definite programming right?",
                    "label": 0
                },
                {
                    "sent": "What sets can you represent in terms of semidefinite programming?",
                    "label": 1
                },
                {
                    "sent": "So let me give perhaps contrast that to the case of LP.",
                    "label": 0
                },
                {
                    "sent": "For which we understand very well this question, right?",
                    "label": 0
                },
                {
                    "sent": "If I ask you easy set and can I describe this set as an LP and I give you a sphere.",
                    "label": 0
                },
                {
                    "sent": "Right, you will tell me no, you cannot.",
                    "label": 0
                },
                {
                    "sent": "While you can, then you have this sort of thinking about why that's actually the case in the case of LP.",
                    "label": 0
                },
                {
                    "sent": "It's kind of easy.",
                    "label": 0
                },
                {
                    "sent": "We can understand the structure of convex sets.",
                    "label": 0
                },
                {
                    "sent": "They have to have find linear train points, so Linux fear doesn't happen in experiences.",
                    "label": 0
                },
                {
                    "sent": "Fear I cannot do it in MP.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But what happens if we try to think about the same questions about semidefinite programming?",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "What kind of sets I can represent in terms of semidefinite programming?",
                    "label": 0
                },
                {
                    "sent": "And this is not just a theoretical?",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When you think about laying on me.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of the developments in right now, kind of in optimization, in particular in the last line of 1520 years, and a lot of that came from realizing that some sets deadline or they have fairly complicated and different descriptions done both semi definite programming is they can actually be described in terms of semidefinite programming.",
                    "label": 0
                },
                {
                    "sent": "If you ever looked at line unnecessary.",
                    "label": 0
                },
                {
                    "sent": "Blaine organ, of any recent booking convex optimization.",
                    "label": 0
                },
                {
                    "sent": "There's a lot of this extremely clever reformulations of sets in terms of semi definite problem and example.",
                    "label": 0
                },
                {
                    "sent": "I'll talk a little bit about later.",
                    "label": 0
                },
                {
                    "sent": "For instance, nuclear norm, right?",
                    "label": 0
                },
                {
                    "sent": "When you look at the unit ball of the nuclear norm?",
                    "label": 0
                },
                {
                    "sent": "Somehow, it's not obvious why that can be reformulated in terms of semantic priming, but nevertheless it can, and there's a lot of work somehow constructive work that actually tries to show that some.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "Sets can or cannot be done, and I'll try to explain a little bit more, at least the kind of more than anything.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I will not tell you that much about the results.",
                    "label": 0
                },
                {
                    "sent": "So clearly necessary conditions for is set to be represented in terms of semantic priming here, so we come back some algebraic.",
                    "label": 0
                },
                {
                    "sent": "So convex is clear the feasible set of every semi definite problem is convex.",
                    "label": 0
                },
                {
                    "sent": "Some algebraic in here essentially means that it can be described in terms of polynomials, right?",
                    "label": 0
                },
                {
                    "sent": "Then why polynomials?",
                    "label": 0
                },
                {
                    "sent": "If you look at the semi definite problem, remember this is a matrix whose entries depend linearly on my decision variables.",
                    "label": 0
                },
                {
                    "sent": "Somehow the boundary of myself is want to be described by determinants and minors, and those are all polynomials of my decision environments.",
                    "label": 0
                },
                {
                    "sent": "So for instance, if I were to ask you, can we describe the exponential function in terms of semidefinite programming?",
                    "label": 0
                },
                {
                    "sent": "Answer Should be, of course, but you cannot.",
                    "label": 0
                },
                {
                    "sent": "And what's interesting is that there's kind of several versions of this question.",
                    "label": 1
                },
                {
                    "sent": "One, let me not talk too much about this, which is whether it's actually very important.",
                    "label": 0
                },
                {
                    "sent": "I just don't want to talk about it now, which is about the exact versus approximate question.",
                    "label": 0
                },
                {
                    "sent": "Right, so perhaps like the exponential case, I cannot represent exactly the exponential function, But perhaps I can do a pretty good approximation using semi definite programming?",
                    "label": 0
                },
                {
                    "sent": "Or we actually can?",
                    "label": 0
                },
                {
                    "sent": "We actually can quantify exactly how well you can do, and this is very important from the practical point of view.",
                    "label": 0
                },
                {
                    "sent": "There's lots of problems out there that even if you cannot represent them exactly, you can give approximate representations of very high quality.",
                    "label": 0
                },
                {
                    "sent": "There's a lot that we could talk about that, but for now I'm interested in the exact question, so I have a set and I want to try to understand.",
                    "label": 0
                },
                {
                    "sent": "Can I represent that set or not in terms of semi definite forming?",
                    "label": 0
                },
                {
                    "sent": "Well, I want you to know this is that there's.",
                    "label": 0
                },
                {
                    "sent": "Two slightly different versions of the problem, right?",
                    "label": 1
                },
                {
                    "sent": "One is kind of the direct question.",
                    "label": 0
                },
                {
                    "sent": "So imagine how we set up on our end and I want to actually represent this set in terms of a semi definite problem that only has the variables X one to XN.",
                    "label": 0
                },
                {
                    "sent": "Right, as opposed to, so this is essentially what I'm driving here.",
                    "label": 0
                },
                {
                    "sent": "I want to write.",
                    "label": 0
                },
                {
                    "sent": "S is my set.",
                    "label": 0
                },
                {
                    "sent": "It lives in our end, so I want to describe myself as X in S if and only if some semi definite program in there is visible.",
                    "label": 1
                },
                {
                    "sent": "As opposed to what we call a lifted representation, which you can use extra variables, I can use voice wise and such a way that access in S if there are some values of wise for which inequality holds.",
                    "label": 0
                },
                {
                    "sent": "So what's the difference?",
                    "label": 0
                },
                {
                    "sent": "What's the geometric difference between these two kinds of objects, right?",
                    "label": 0
                },
                {
                    "sent": "One is you're actually trying to represent yourself directly in this space that you want.",
                    "label": 0
                },
                {
                    "sent": "In this case, what you're actually trying to do is to produce a set in a higher dimensional space whose projection is exactly the set that you want.",
                    "label": 0
                },
                {
                    "sent": "And what's very interesting is that for semi definite problem, there's a difference between these two things.",
                    "label": 0
                },
                {
                    "sent": "In LP this doesn't happen, right?",
                    "label": 0
                },
                {
                    "sent": "As I told you earlier, if you take an LP.",
                    "label": 0
                },
                {
                    "sent": "A polytope, and you project it down.",
                    "label": 0
                },
                {
                    "sent": "The projection is a polytope, but it is not true that if you take a set which is described by semi definite programming in like know what 100 variables, then the projection to the plane will actually be describable using only two variables.",
                    "label": 0
                },
                {
                    "sent": "There's no way that I can do like you know, like.",
                    "label": 0
                },
                {
                    "sent": "A foodie Ahmad skin analogue, for instance, when you take apart here and I know you project it down, you may have a lot more inequality's, but those inequality only involve the variables in the projection.",
                    "label": 0
                },
                {
                    "sent": "So these are really two different mathematically are two different questions.",
                    "label": 0
                },
                {
                    "sent": "Can I represent the set directly in its natural space or is it the projection of something else and this is really what gives semi definite problem its power?",
                    "label": 0
                },
                {
                    "sent": "But somehow when we think about the.",
                    "label": 0
                },
                {
                    "sent": "Representing sets, these other variables can actually increase a lot the expressive power of my class of sets, and I'll give you examples in 2nd, and if you know, yeah.",
                    "label": 0
                },
                {
                    "sent": "That's mine.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Slide, so actually something like this happen happens even in LP.",
                    "label": 0
                },
                {
                    "sent": "But over different nature.",
                    "label": 0
                },
                {
                    "sent": "So in LP's I will see in a second the differences, complexity right it turns out that we may be able to represent more efficiently certain sets in terms of projection and I'll describe the example in a second but inside my different problem the difference is just existential.",
                    "label": 0
                },
                {
                    "sent": "I may just not be able to do it.",
                    "label": 0
                },
                {
                    "sent": "Has nothing to do with complexity questions.",
                    "label": 0
                },
                {
                    "sent": "So one situation in LP.",
                    "label": 0
                },
                {
                    "sent": "Again many of you are familiar that sometimes we have convex sets in some in my Lane RN there are a lot easier or much more competitive.",
                    "label": 1
                },
                {
                    "sent": "Much more compact descriptions in terms of projections of other objects.",
                    "label": 0
                },
                {
                    "sent": "In the classical example is the L1 ball, right?",
                    "label": 0
                },
                {
                    "sent": "The ball over one.",
                    "label": 0
                },
                {
                    "sent": "So if I want to describe cross polytope the L1 bowl in the.",
                    "label": 0
                },
                {
                    "sent": "Just using the natural facets that describe my policy of the 19 exponentially, many right there.",
                    "label": 0
                },
                {
                    "sent": "Essentially the sum of the absolute values of X&Y lesson.",
                    "label": 1
                },
                {
                    "sent": "Regarding one, if you expand it out that it says all the inequality of this type under all facets.",
                    "label": 0
                },
                {
                    "sent": "So I cannot get rid of any of those ones.",
                    "label": 0
                },
                {
                    "sent": "I actually need all to the facet to describe myself.",
                    "label": 0
                },
                {
                    "sent": "But because my cross polytope in this particular case has only two N extreme points, then it will be just a projection of a simplex from 2 N dimensional space.",
                    "label": 0
                },
                {
                    "sent": "I can take a simplex into an dimensional space, linearly map it so each corner will go to extreme point of my polytope under for that will give me a representation of my center.",
                    "label": 0
                },
                {
                    "sent": "If you want an explicit description, this is kind of what we have in here.",
                    "label": 0
                },
                {
                    "sent": "This is what you learn in linear programming 101, right?",
                    "label": 0
                },
                {
                    "sent": "We write this.",
                    "label": 0
                },
                {
                    "sent": "We introduce new variables.",
                    "label": 0
                },
                {
                    "sent": "Why so why to kind of represent the absolute value?",
                    "label": 0
                },
                {
                    "sent": "Then we expand those inequality.",
                    "label": 0
                },
                {
                    "sent": "In this form.",
                    "label": 0
                },
                {
                    "sent": "We write this and the projection of this set into the space of the exercise.",
                    "label": 0
                },
                {
                    "sent": "That gives me exactly the L1.",
                    "label": 0
                },
                {
                    "sent": "So this is a case where we don't want to write this in its natural space.",
                    "label": 0
                },
                {
                    "sent": "We actually want to write as a projection of something else.",
                    "label": 1
                },
                {
                    "sent": "And this is a.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Extremely important question in combinatorial optimization and many of the combinatorial polytopes that we care about.",
                    "label": 0
                },
                {
                    "sent": "In certain cases, or under certain situations, something like this is going to happen that we may be able to describe the convex Hull of some combinatorial object in terms of the projection of something else.",
                    "label": 0
                },
                {
                    "sent": "Then example, perhaps just less obvious on this, or you may be a little surprise, which is, for instance, when you look at the convex Hull of trees, the spanning trees of the graph, right?",
                    "label": 0
                },
                {
                    "sent": "So I give you a graph.",
                    "label": 0
                },
                {
                    "sent": "Let's imagine the complete graph and you look at all the spanning trees.",
                    "label": 0
                },
                {
                    "sent": "Right, so I can think of each point in our in square.",
                    "label": 0
                },
                {
                    "sent": "If you wanted oranges too and then I can think about taking the convex Hull of all this very nasty polytope and the sensor.",
                    "label": 0
                },
                {
                    "sent": "It has exponentially many points, exponentially extreme expansion, extreme points exponentially many facets, but nevertheless it has a non trivial representation as a projection of something else, right?",
                    "label": 0
                },
                {
                    "sent": "And sometimes coming up with these representations is absolutely non trivial.",
                    "label": 0
                },
                {
                    "sent": "But on those many examples.",
                    "label": 0
                },
                {
                    "sent": "Let me know the library too much in the case of Paula.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But let me give just again.",
                    "label": 0
                },
                {
                    "sent": "This is mostly a picture, anything.",
                    "label": 0
                },
                {
                    "sent": "So what happened of the same situation happening even in semi definite programming right?",
                    "label": 0
                },
                {
                    "sent": "So this is a very nice class of convex sets, something called the K...",
                    "label": 0
                },
                {
                    "sent": "I mean they appear in some particular problems, so it's kind of a nice generalization of an ellipse.",
                    "label": 0
                },
                {
                    "sent": "Or instead of having you know, we can describe classical ellipse learning a set of points in the plane.",
                    "label": 0
                },
                {
                    "sent": "So if you have two to four site then I look at the set of points whose sum of distances to my two given points is a constant.",
                    "label": 0
                },
                {
                    "sent": "Right, so this K... kind of generalization of that when you don't have two points, but you have three right or K points, right?",
                    "label": 0
                },
                {
                    "sent": "And it turns out that line and it said that it describes something like this so convex set.",
                    "label": 0
                },
                {
                    "sent": "I mean, so essentially I wanted to think of this convex set in here, right?",
                    "label": 0
                },
                {
                    "sent": "These are my three foresight and in this case this is my convex set in there.",
                    "label": 0
                },
                {
                    "sent": "So just like I told you before.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "Somehow I don't need to worry only about the boundary of this set by somehow all this stuff over here.",
                    "label": 0
                },
                {
                    "sent": "It also plays a role, particularly if you want to do things in terms of justice.",
                    "label": 0
                },
                {
                    "sent": "Direct representations of myself.",
                    "label": 0
                },
                {
                    "sent": "So this is an example.",
                    "label": 0
                },
                {
                    "sent": "For instance, were if you try to represent this set directly in its natural space, you need some indefinite representations of again exponential size, because all this stuff in here is killing you.",
                    "label": 0
                },
                {
                    "sent": "This is all this stuff that's increasing the cardinality of your representation.",
                    "label": 0
                },
                {
                    "sent": "But it's very natural already easy to give representations of this set again as projections of nicer convex sets, and they way that you construct it's very much a way that you could do it for anyone.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just an example, I just wanted some pictures.",
                    "label": 0
                },
                {
                    "sent": "This is like for instance, a situation for the case of five points.",
                    "label": 0
                },
                {
                    "sent": "Somehow in here the convex set the convex part that one cares about.",
                    "label": 0
                },
                {
                    "sent": "This is tiny thing in here.",
                    "label": 0
                },
                {
                    "sent": "But there's all these other stuff outside your set that actually has an effect on how hard or how easy is to represent, or to optimize over that set.",
                    "label": 0
                },
                {
                    "sent": "And this is one of the things that, again, it's kind of these again cartoon.",
                    "label": 0
                },
                {
                    "sent": "If you want.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's actually represented an actual set, but the point I want to combine here said somehow, when you haven't a polynomial, an algebraic description of a set is extremely rigid and you cannot change it locally because it affects lots of other things and somehow Lane organ of that's really.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, what makes life easy or.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Or or difficult in some cases again.",
                    "label": 0
                },
                {
                    "sent": "I will not describe in detail the kind of results are known, but let me just perhaps a couple of things.",
                    "label": 0
                },
                {
                    "sent": "One is that there's some very nice result that started appearing for both cases once or I think beginning to understand quite a bit data direct representation question.",
                    "label": 0
                },
                {
                    "sent": "There's a very nice condition, something called rigid convexity, which I will not discuss, which is essentially algebraic analogue of convexity.",
                    "label": 1
                },
                {
                    "sent": "There's kind of a nice condition that any set described by semi definite problem needs to satisfy and that involves.",
                    "label": 0
                },
                {
                    "sent": "Not just a set, but involves all this other stuff that that's outside that I was telling you about and somehow in the plane that exactly characterizes when you can or you cannot represent sets in semi definite programming and that's related to a whole bunch of other stuff.",
                    "label": 1
                },
                {
                    "sent": "But somehow we don't quite have yet afull hire a full version of the story for higher dimensions.",
                    "label": 1
                },
                {
                    "sent": "Because the one that's closest or or more relevant to applications, although again in here we're talking about the exact case, is a lifted case, right?",
                    "label": 0
                },
                {
                    "sent": "And we want to represent the set as a projection of something else.",
                    "label": 1
                },
                {
                    "sent": "It's kind of very interesting because we don't know any nontrivial obstruction for is set to be.",
                    "label": 0
                },
                {
                    "sent": "Semi definite represent the world in the set that for instance, I can rule out the exponential function, But if I give you a set which is described by polynomial equations, basics in algebraic set, then you know we don't know any kind of reason why it may not be the case that an arbitrary convex basic semantic set could always be the projection of a set described by semi definite Department.",
                    "label": 0
                },
                {
                    "sent": "So in since we don't quite understand yet well semi definite problem, universal in the sense that every time that you have a self described by polynomial inequality.",
                    "label": 0
                },
                {
                    "sent": "Convex then somehow you lay projection or something else.",
                    "label": 0
                },
                {
                    "sent": "It could be the case.",
                    "label": 0
                },
                {
                    "sent": "It has been proven in under some kind of nondegeneracy conditions that this is actually true, but somehow in some sense all the action or the interesting things may happen around similarities and we don't quite understand that picture.",
                    "label": 0
                },
                {
                    "sent": "I cannot represent exponential function as a projection of.",
                    "label": 0
                },
                {
                    "sent": "Well, these are a gala theoretic arguments.",
                    "label": 0
                },
                {
                    "sent": "So essentially.",
                    "label": 0
                },
                {
                    "sent": "If you want to optimize a linear function over the epigraph of the exponential, then you may get points which are transcendental, and if you want to optimize a linear function over line or something defined by by kind of semi definite describable set, you will always have algebraic numbers.",
                    "label": 0
                },
                {
                    "sent": "So it's really a difference between something algebraic and something transcendent.",
                    "label": 0
                },
                {
                    "sent": "Well that's it.",
                    "label": 0
                },
                {
                    "sent": "That's trivial in the sense that you know.",
                    "label": 1
                },
                {
                    "sent": "We just know that is true.",
                    "label": 1
                },
                {
                    "sent": "It's actually trivial, I mean or or it's direct if you want.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I shouldn't say trivia.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is really, you know, kind of so the point if you want if this is somehow for polytopes we understand very well.",
                    "label": 0
                },
                {
                    "sent": "Nobody said polytope.",
                    "label": 0
                },
                {
                    "sent": "What are the limits of LP if you want but for semi definite forming without?",
                    "label": 0
                },
                {
                    "sent": "And a very interesting question, which again, I'm not saying anything about.",
                    "label": 0
                },
                {
                    "sent": "That is what happens in terms of approximation.",
                    "label": 0
                },
                {
                    "sent": "Right, that's really also were somehow that brings a lot closer to both approximation algorithms and applications, right?",
                    "label": 0
                },
                {
                    "sent": "For many problems I don't care about the order.",
                    "label": 0
                },
                {
                    "sent": "You know, I can afford not to exactly describe a set and then an approximation would be fine.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Other questions, how do?",
                    "label": 0
                },
                {
                    "sent": "OK, so let me kind of perhaps switch gears a little bit or or introduce something that I'm going to use later.",
                    "label": 0
                },
                {
                    "sent": "At least I need to justify a little bit.",
                    "label": 0
                },
                {
                    "sent": "While we can do certain things and this is a way of doing it, which is this notion of sum of squares someone scores of polynomials, and I'm guessing some of you have seen this is the basic idea, is very sick and explain it again in a couple of slides.",
                    "label": 0
                },
                {
                    "sent": "And really.",
                    "label": 0
                },
                {
                    "sent": "They're very simple or very simple observation that if you have a polynomial which is the sum of squares and by someone scores, I mean that I can write as a sum of scores of other polynomials, then that's a sufficient condition for nonnegativity of my polynomial, right?",
                    "label": 0
                },
                {
                    "sent": "If pieces sum of squares if something like this, then clearly piece not negative.",
                    "label": 1
                },
                {
                    "sent": "So the reason why this is interesting?",
                    "label": 0
                },
                {
                    "sent": "Each kind of well known?",
                    "label": 0
                },
                {
                    "sent": "I mean, he would actually prove that this is not true in general.",
                    "label": 1
                },
                {
                    "sent": "I mean, if we have several variables and high degree or not that high degree, then there are polynomials which are not negative but not summer squares.",
                    "label": 0
                },
                {
                    "sent": "But what's interesting about this, at least from our perspective, is a.",
                    "label": 1
                },
                {
                    "sent": "It's known that in certain cases issue things coincide.",
                    "label": 0
                },
                {
                    "sent": "Let me not talk too much about this, but this is a convex condition.",
                    "label": 0
                },
                {
                    "sent": "It turns out that I can efficiently decide whether a polynomial is a sum of scores or not, and I'll tell you exactly how to do this in the second right, and the reason why this is interesting is because deciding negativity with polynomial isn't hard.",
                    "label": 0
                },
                {
                    "sent": "I cannot if I give you a polynomial variables, I cannot actually check whether this is non negative for all possible evaluations, but it's very easy to check whether my polynomial is almost scores or not or not.",
                    "label": 0
                },
                {
                    "sent": "Very soon I have to solve a semi definite.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So it's idea.",
                    "label": 0
                },
                {
                    "sent": "So it's actually very simple.",
                    "label": 0
                },
                {
                    "sent": "So what we try to do is essentially to write a polynomial as a quadratic form on some set of monomials, and the reason why this is nontrivial is because these representations are not unique, mean as opposed to when you think about the quadratic form, that if I give you a quadratic form, it's obvious which matrix you should write.",
                    "label": 1
                },
                {
                    "sent": "Whenever I give you a polynomial here, because typically monomials in their their algebraically independent, then there's many matrices alike.",
                    "label": 0
                },
                {
                    "sent": "All in there and somehow and this equality will be true.",
                    "label": 0
                },
                {
                    "sent": "Now I want to see we can use semi definite programming to actually find a good matrix Q where good means that Q is possibly my definite base.",
                    "label": 0
                },
                {
                    "sent": "If I have a possible significant matrix in there and I factor it, that will give me a sum of squares representation.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So looking at the example, I think it's actually this.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The general case I don't need to describe it, let me just describe an example.",
                    "label": 0
                },
                {
                    "sent": "I think it's a lot easier to understand the ideas if you look at an example.",
                    "label": 0
                },
                {
                    "sent": "So let's say that I give you this polynomial, right?",
                    "label": 0
                },
                {
                    "sent": "This is a quadratic polynomial in two variables and I want to try to understand all of these polynomials, sum of squares or not.",
                    "label": 0
                },
                {
                    "sent": "Right, So what am I going to do is?",
                    "label": 0
                },
                {
                    "sent": "What I told you, I will try to write this polynomial as a quadratic form in a set of monomials.",
                    "label": 0
                },
                {
                    "sent": "I don't know what by matrixes or I just write Q in there.",
                    "label": 0
                },
                {
                    "sent": "I don't know what these queues are and in here I write all monomials in my variables in X&Y of degree two wide agree to because these polynomials every four right and I'm doing the homogeneous case so it's easy.",
                    "label": 0
                },
                {
                    "sent": "So now I write this.",
                    "label": 0
                },
                {
                    "sent": "And now I just expand this expression.",
                    "label": 0
                },
                {
                    "sent": "And now what is my task right?",
                    "label": 0
                },
                {
                    "sent": "I have to find a positive semidefinite matrix in here.",
                    "label": 0
                },
                {
                    "sent": "So I need to find values of that user Y in such a way that this is possible semi definite and in such a way that this polynomial is the same as this polynomial.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "So when you think about this, this polynomial being the same as this polynomial means that the coefficients are the same.",
                    "label": 0
                },
                {
                    "sent": "So I can write a whole bunch of linear equations between this and this.",
                    "label": 0
                },
                {
                    "sent": "So for instance, in this case OK, this is easy.",
                    "label": 0
                },
                {
                    "sent": "I will write Q one 1 = 2.",
                    "label": 0
                },
                {
                    "sent": "But in here I have for instance is nontrivial equation.",
                    "label": 0
                },
                {
                    "sent": "I have that the sum of these two coefficients has to be equal to minus one.",
                    "label": 0
                },
                {
                    "sent": "And you can imagine if I have a polynomial in a large number of variables, will have is many linear equations that relate these things, right?",
                    "label": 0
                },
                {
                    "sent": "So what do I have to do now?",
                    "label": 0
                },
                {
                    "sent": "I have to find a positive semi definite matrix.",
                    "label": 0
                },
                {
                    "sent": "That satisfies a whole bunch of linear equations.",
                    "label": 0
                },
                {
                    "sent": "So geometrically well my doing.",
                    "label": 0
                },
                {
                    "sent": "I'm finding an element in a subspace, a whole bunch of linear equations and it's possible semi definite.",
                    "label": 0
                },
                {
                    "sent": "That means that lives in the cone of positive definite matrices.",
                    "label": 0
                },
                {
                    "sent": "So this is exactly if semidefinite programming feasibility problem finding a cue that simultaneously positive semi definite and satisfies linear equations is a semi definite problem.",
                    "label": 0
                },
                {
                    "sent": "You can just solve it for instance in this case this is a solution.",
                    "label": 0
                },
                {
                    "sent": "And then if I factor this matrix and I can do this versus positive definite, then I will get a sum of scores representation of my polynomial.",
                    "label": 0
                },
                {
                    "sent": "Right, and this goes on if and only if.",
                    "label": 0
                },
                {
                    "sent": "I mean I'm showing this in here an example, but it's easy to convince yourself that this is if and only if so somehow.",
                    "label": 0
                },
                {
                    "sent": "Every time that we talk about some of squares or this or that, you can always think that in the background or something.",
                    "label": 0
                },
                {
                    "sent": "My definite problem that you can solve.",
                    "label": 0
                },
                {
                    "sent": "Right, and the point is, we can leverage this just from this simple problem or not so simple.",
                    "label": 0
                },
                {
                    "sent": "Perhaps of giving a polynomial deciding where someone scores to essentially deal with arbitrary semi algebraic problems and then try to at least hint at why we can do something like this.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let me give what at least one point why this directly gives him very good ways of producing lower bounds for optimization is imagine they actually want to optimize the polynomial, right?",
                    "label": 1
                },
                {
                    "sent": "I want to optimize.",
                    "label": 0
                },
                {
                    "sent": "Let me do unconstrained minimization shots.",
                    "label": 0
                },
                {
                    "sent": "It's easier, right?",
                    "label": 0
                },
                {
                    "sent": "I want to do unconstrained minimization of my polynomial, and I can actually following.",
                    "label": 0
                },
                {
                    "sent": "I can put a number gamma in there, and I can ask a question whether F of X minus gamma is a sum of squares.",
                    "label": 0
                },
                {
                    "sent": "Right, if it works, is actually someone scores.",
                    "label": 0
                },
                {
                    "sent": "That means average, is greater, equal and zero for every X.",
                    "label": 0
                },
                {
                    "sent": "And this actually means of F of X is lower or equal is greater, equal and gamma four legs.",
                    "label": 0
                },
                {
                    "sent": "So that means that gamma is actually lower bound on my polynomial global lower bound on my polynomial.",
                    "label": 0
                },
                {
                    "sent": "I mean, turns out that I can.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Actually find the best possible such gamma, essentially finding largest gamma for which is true.",
                    "label": 0
                },
                {
                    "sent": "The biggest lower bound that I can prove using these techniques by solving SMI definite problem.",
                    "label": 0
                },
                {
                    "sent": "This is essentially the same semi definite problem diabase cry before.",
                    "label": 0
                },
                {
                    "sent": "And what happens is that these are extremely high quality bonds.",
                    "label": 0
                },
                {
                    "sent": "Really, this tends to produce very much based on if we can solve these problems, and that's kind of an issue, but of course as you get large number of responses bigger, these are pretty much the best bounds that you can compute for this kind of problem.",
                    "label": 0
                },
                {
                    "sent": "There's good reasons for that.",
                    "label": 0
                },
                {
                    "sent": "I mean, they're not always exact, because it's exactly the point that I told you before, right?",
                    "label": 0
                },
                {
                    "sent": "It's not always the case.",
                    "label": 0
                },
                {
                    "sent": "Then negative polynomial is summer squares, but they tend to be extremely good, and there's ways of recovering.",
                    "label": 0
                },
                {
                    "sent": "Solution if something like this holds and there's natural extensions of the constraint case, which I will not tell you about somehow the whole story that I'm telling here about doing unconstrained ministration, it extends in very natural ways of the constraint case.",
                    "label": 0
                },
                {
                    "sent": "If I want to do minimize Poly.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Comments about sex.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so let me go back or let me tell.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So how we use all this summer school stuff?",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Actually, uh, there is a kind of questions that I was selling all of them yet, so you have a question.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No, it's not.",
                    "label": 0
                },
                {
                    "sent": "It's so the number of monomials in the in.",
                    "label": 0
                },
                {
                    "sent": "So when you look at the number of animals or polyamine variables and the greedy, you get 10 plus teachers D that's actually polynomial in D. It's polynomial in or the when you fix any of the other ones.",
                    "label": 0
                },
                {
                    "sent": "And it's actually in the sense it's polynomial services polynomial size in the input.",
                    "label": 0
                },
                {
                    "sent": "It's.",
                    "label": 0
                },
                {
                    "sent": "So if you measure your inputs actually polynomial in the.",
                    "label": 0
                },
                {
                    "sent": "It's polynomial in each.",
                    "label": 0
                },
                {
                    "sent": "It's because it's also N plus V choose N. So if you fix any of the oceans, it's actually polynomial.",
                    "label": 0
                },
                {
                    "sent": "If you grow both, of course it's jointly, but when you fix any of those.",
                    "label": 0
                },
                {
                    "sent": "I mean somehow at some point the distinction is more in the sense of line or kind of.",
                    "label": 0
                },
                {
                    "sent": "You know, when that value is, if that value is right now 3 million, I don't care about, you know kind of, but if you care about polynomial it or whatever then determine tournament.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let me tell you, for instance, of a special class of problems at that, and I'll tell you why.",
                    "label": 0
                },
                {
                    "sent": "Kind of I think many of you should care about these kind of things, which is let me talk about this specific class of convex sets.",
                    "label": 0
                },
                {
                    "sent": "We just want to be presented in the following way.",
                    "label": 0
                },
                {
                    "sent": "There really somehow I have a set of objects that I care about or set set South that I care about.",
                    "label": 0
                },
                {
                    "sent": "South may not be convex, but I'm actually interested in this convex colorways.",
                    "label": 0
                },
                {
                    "sent": "Why don't all of you know what the convex Hull is?",
                    "label": 0
                },
                {
                    "sent": "Its smallest convex set that contains myself, and we're particularly interested in this address is an algebraic variety, and again, if you don't like algebraic varieties, just think of polynomial equations or even finitely many set of points, right?",
                    "label": 0
                },
                {
                    "sent": "Finally, many points it's always an algebraic variety, so some of the object that I'm trying to concern here is I have a set that I normally this somehow, or I can describe and what I'm really interested is in the convex Hull of this set that gives me a convex set that I can.",
                    "label": 1
                },
                {
                    "sent": "Talk about them.",
                    "label": 0
                },
                {
                    "sent": "Give you examples.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So why do we care about this miss?",
                    "label": 0
                },
                {
                    "sent": "Essentially many interesting problems boil down exactly to either understanding or describing this convex hulls, and the two examples I'll tell you about is just optimization mean somehow when you do optimization, this is implicitly what you're doing, and the other case I want to talk about this a little bit of all this kind of story about convex relaxations for rank and a whole bunch of other parts.",
                    "label": 1
                },
                {
                    "sent": "I would not tell.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Much about games.",
                    "label": 0
                },
                {
                    "sent": "In here, so why do we care about this from the optimization point of view?",
                    "label": 0
                },
                {
                    "sent": "Right, let's think about the problem again.",
                    "label": 0
                },
                {
                    "sent": "I'm doing the multivariate case now, which is.",
                    "label": 0
                },
                {
                    "sent": "Let's imagine that I'm trying to optimize a polynomial in there.",
                    "label": 0
                },
                {
                    "sent": "In several variables, right?",
                    "label": 0
                },
                {
                    "sent": "So this is a polynomial in several variables and somehow it's in.",
                    "label": 0
                },
                {
                    "sent": "There are the monomials appear in this case, so I want to do is I want to phrase this problem which is just minimization or polynomial in the geometric language that I was telling you before to justify why we care about things.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, they want to do in that case is I want you to consider the following object.",
                    "label": 0
                },
                {
                    "sent": "I'll give you a picture in a second, but hold me for a second, which is.",
                    "label": 0
                },
                {
                    "sent": "Let's imagine that I take RN.",
                    "label": 0
                },
                {
                    "sent": "I mean all of our end and IMAP around under this monomial map.",
                    "label": 0
                },
                {
                    "sent": "Right, So what this means is I'm going to.",
                    "label": 0
                },
                {
                    "sent": "I'm going to vectoring here.",
                    "label": 0
                },
                {
                    "sent": "This is cardinality of S and what I'm looking is what happens when I take all the points.",
                    "label": 0
                },
                {
                    "sent": "Any point in our end I map it under this polynomial map and then I just look at the resulting image.",
                    "label": 0
                },
                {
                    "sent": "So if you know this is essentially what's called awareness embedding of RN.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let me give you a picture and you know just so.",
                    "label": 0
                },
                {
                    "sent": "It's kind of very clear which is a 1 dimensional picture.",
                    "label": 0
                },
                {
                    "sent": "What this is called a moment curve.",
                    "label": 0
                },
                {
                    "sent": "So what am I doing here?",
                    "label": 0
                },
                {
                    "sent": "Imagine I'm trying to minimize the polynomial single variable.",
                    "label": 0
                },
                {
                    "sent": "So what am I plugging in here?",
                    "label": 0
                },
                {
                    "sent": "I take D that goes in this case from minus one to one, but it could go from minus Infinity to Infinity and then I look at this the set of points of the form one TT to the.",
                    "label": 0
                },
                {
                    "sent": "In this case 4.",
                    "label": 0
                },
                {
                    "sent": "VI think equal to two or three.",
                    "label": 0
                },
                {
                    "sent": "Right and what happens is somehow as T goes from minus one to one or from minus Infinity Infinity.",
                    "label": 0
                },
                {
                    "sent": "It describes a curb in this space.",
                    "label": 0
                },
                {
                    "sent": "Would you say curving black in here?",
                    "label": 0
                },
                {
                    "sent": "Right and what I want to do.",
                    "label": 0
                },
                {
                    "sent": "The object that I want to consider for reasons that you will see in the second is a convex Hull of this car.",
                    "label": 1
                },
                {
                    "sent": "So I have again, I think of our end us or or in this case it's just going in there from minus one to one on this space on this.",
                    "label": 0
                },
                {
                    "sent": "After this model map I get this curve in there and now I want to think about this convex Hull of this object.",
                    "label": 0
                },
                {
                    "sent": "While it's an extremely interesting convex set, a lot of it is known in the 1 dimensional case, some things are.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In general, but the point I want to make is that optimization optimizing this complicated nontrivial linear polynomial in here non convex polynomial is just doing linear optimization over this set.",
                    "label": 1
                },
                {
                    "sent": "And this is true.",
                    "label": 0
                },
                {
                    "sent": "I mean, there's nothing deep in here that minimizing P of X.",
                    "label": 0
                },
                {
                    "sent": "Is essentially the same thing as minimizing a linear function, linear functional defined by the coefficients of P. Over this over this convex Hull.",
                    "label": 0
                },
                {
                    "sent": "So somehow if I could describe this convex Hull if I can approximate the convex Hull of this object demencial approximating my convex optimization problem.",
                    "label": 0
                },
                {
                    "sent": "Sorry, my non convex optimization problem over there.",
                    "label": 0
                },
                {
                    "sent": "Of.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Also, should expect exactly because of what I said, but it should be NP hard to even check membership in this set.",
                    "label": 0
                },
                {
                    "sent": "So this is an example of the kind of things I was selling at the beginning where we have a set which is very easy to describe.",
                    "label": 0
                },
                {
                    "sent": "The convex Hull of this surface, let's say in the general case, but I cannot actually even check membership to this.",
                    "label": 1
                },
                {
                    "sent": "If I give you a point, I don't have a polynomial time way of deciding whether I'm inside that said or am outside itself.",
                    "label": 0
                },
                {
                    "sent": "So somehow we have to be careful when we think about optimizing over a convex set.",
                    "label": 1
                },
                {
                    "sent": "It's easy, I mean if it was easy I could solve that and it's really easy.",
                    "label": 0
                },
                {
                    "sent": "If this is presented the right way.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to tell you about this.",
                    "label": 0
                },
                {
                    "sent": "Hint at why we can use all the sum of squares off to actually give approximations of this kind of type of convex.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And let me let me just kind of.",
                    "label": 0
                },
                {
                    "sent": "Just take a couple of minutes about something that again the first time that you think about it.",
                    "label": 0
                },
                {
                    "sent": "I know it sounds weird, which is that you actually somehow I'm solving what looks like a nonconvex problem right?",
                    "label": 0
                },
                {
                    "sent": "In here.",
                    "label": 0
                },
                {
                    "sent": "I'm minimizing this non convex polynomial over Iran and in here I'm telling you that I'm solving kind of this linear optimization problem over convex.",
                    "label": 0
                },
                {
                    "sent": "And the point is, I mean, this is something that.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Fairly well understood, but I guess it's not.",
                    "label": 0
                },
                {
                    "sent": "Appreciate it enough that somehow convexity is relative.",
                    "label": 1
                },
                {
                    "sent": "I mean, there's nothing that's absolute about something being convex or not being convex, and it's very much relative to what your particular description, and this is very well known.",
                    "label": 0
                },
                {
                    "sent": "In many cases.",
                    "label": 0
                },
                {
                    "sent": "I mean when you think about the way that in games you go from from strategies to make strategies, when you think about the focal Planck equations will replace somehow when you essentially property distributions, right?",
                    "label": 1
                },
                {
                    "sent": "Then somehow everything becomes convex in infinite dimensional space, but what's interesting the reason why?",
                    "label": 0
                },
                {
                    "sent": "All this stuff actually works if you are some things you don't actually need infinite dimensions that somehow finite dimensions or even very small dimensions are actually enough.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let me give you just a visual example.",
                    "label": 0
                },
                {
                    "sent": "I like this will.",
                    "label": 0
                },
                {
                    "sent": "Somehow I think it clarifies quite a bit what goes on.",
                    "label": 0
                },
                {
                    "sent": "So let's imagine for instance I have a set like this right?",
                    "label": 0
                },
                {
                    "sent": "And annulus in here.",
                    "label": 0
                },
                {
                    "sent": "Which is clearly not the most non convex set that you can think about whatever that means.",
                    "label": 0
                },
                {
                    "sent": "It's not true, but anyway.",
                    "label": 0
                },
                {
                    "sent": "So the question is, can I actually use convex optimization somehow to optimize over this set?",
                    "label": 0
                },
                {
                    "sent": "Right, and again, it doesn't look like in the Sensodyne organifi.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hold in there in the middle.",
                    "label": 0
                },
                {
                    "sent": "But the point is whether I have a whole or not, it kind of really depends on my perspective.",
                    "label": 0
                },
                {
                    "sent": "So imagine that I take the plane.",
                    "label": 0
                },
                {
                    "sent": "In this case, I take R2 and I wrap it around like, you know, kind of this parable, Lloyd in here and now when I look at this at my set, I look at the image and my set, which now is this trip around my problem and I just look at the convex Hull of this.",
                    "label": 0
                },
                {
                    "sent": "Right, so now all points, all extreme points.",
                    "label": 0
                },
                {
                    "sent": "Actually, all points in my set.",
                    "label": 0
                },
                {
                    "sent": "They're actually exposed, I can touch them with linear functions.",
                    "label": 0
                },
                {
                    "sent": "Right, the problem here the problem in this picture.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "He said I cannot touch this set with a linear function.",
                    "label": 0
                },
                {
                    "sent": "I cannot touch this point with a linear functional.",
                    "label": 0
                },
                {
                    "sent": "I can only touch it once on the boundary, so that's why convex Hull.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To read and write, but in here once, I think about my set not in this description, but actually on this subscription.",
                    "label": 0
                },
                {
                    "sent": "Then every point is accessible with a linear function.",
                    "label": 0
                },
                {
                    "sent": "So I can just do convex optimization up here.",
                    "label": 0
                },
                {
                    "sent": "Right, and that's exactly what was going on in the stuff that I described.",
                    "label": 0
                },
                {
                    "sent": "That's exactly where the sum of squared stuff actually tries to.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's a simple picture, but I think it helps a lot.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so we can in a fairly systematic way.",
                    "label": 1
                },
                {
                    "sent": "Use all the stuff I told I told you about to actually construct this approximate representations of convex sets in terms of semidefinite programming.",
                    "label": 0
                },
                {
                    "sent": "Let me not bore you with equations, and we tell you the high level picture and the high level picture is very simple somehow.",
                    "label": 1
                },
                {
                    "sent": "If I want to describe a convex set, let's say that this is a convex set.",
                    "label": 0
                },
                {
                    "sent": "I want to describe, then we know that convex sets have a dual description, right?",
                    "label": 0
                },
                {
                    "sent": "It's exactly the same to describe convex set in terms of all the linear functionals that are non negative on myself.",
                    "label": 0
                },
                {
                    "sent": "Right, so somehow optimizing or the set of all linear functionals really bold sound to minimizing a linear function over my set in there.",
                    "label": 1
                },
                {
                    "sent": "So it really boils down to either solving or approximating the optimization problem of minimizing the linear function subject to X being innocent.",
                    "label": 0
                },
                {
                    "sent": "And well, I told you before we said we can approximate all kinds of problems of this type.",
                    "label": 0
                },
                {
                    "sent": "Every time that we have some kind of optimization problem in there involving polynomials, we can approximate this with someone scores.",
                    "label": 0
                },
                {
                    "sent": "So the point is, again, I'm skipping the details of what things actually look like on whatever.",
                    "label": 0
                },
                {
                    "sent": "I just want to give you a possibility argument that if I have a way of approximating polynomials, sorry approximating optimization problems, then that implicitly gives me some other approximation of sets.",
                    "label": 0
                },
                {
                    "sent": "And that's exactly what happens in here.",
                    "label": 0
                },
                {
                    "sent": "Somehow there's a way of making all these construction very precise, and what we have is a nice way of producing nice approximations to convex hulls.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of arbitrary sets.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Please give this example, so let me tell you.",
                    "label": 0
                },
                {
                    "sent": "For instance, you know how how this story applies or simplifies.",
                    "label": 0
                },
                {
                    "sent": "If you want in the particular case of this kind of.",
                    "label": 0
                },
                {
                    "sent": "Minimum rank type problems.",
                    "label": 0
                },
                {
                    "sent": "I think many of you are familiar with, right?",
                    "label": 0
                },
                {
                    "sent": "So let's imagine that during some kind of ranking nization problem.",
                    "label": 0
                },
                {
                    "sent": "What do you want to minimize?",
                    "label": 0
                },
                {
                    "sent": "The rank of a matrix X subject with some kind of linear equations?",
                    "label": 1
                },
                {
                    "sent": "We kind of know that this is hard in general, and whatever, so let's say.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, the sort of unit proposed by Marion Marion Fasel.",
                    "label": 0
                },
                {
                    "sent": "So I decided to use a convex envelope instead of the rank function instead of rank, which is this nuclear non self right.",
                    "label": 0
                },
                {
                    "sent": "The nuclear norm is just a sum of singular values.",
                    "label": 1
                },
                {
                    "sent": "Now let me describe why we do this from the perspective that I was telling you before, how nuclear norm.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "He appears in there and how we can go on generalizing, but what they find the nuclear norm on?",
                    "label": 0
                },
                {
                    "sent": "Why way to think about it so that actually is is exactly the convex Hull of the variety of rank one matrices.",
                    "label": 1
                },
                {
                    "sent": "So if I think about taking all the rank one matrices of norm one.",
                    "label": 0
                },
                {
                    "sent": "So they know that's some algebraic variety, and you think about taking the convex Hull of that variety.",
                    "label": 0
                },
                {
                    "sent": "It turns out that that's exactly the unit ball of the nuclear norm.",
                    "label": 0
                },
                {
                    "sent": "And it turns out again in this case.",
                    "label": 0
                },
                {
                    "sent": "I told you earlier that it happens if it's exactly semi definite representable.",
                    "label": 0
                },
                {
                    "sent": "So somehow this gives us at least in motivation to think about instead of minimizing this non convex function, let me do the convex aggregate which is in this case just a convex Hull and somehow.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of all kind of wonderful things perhaps will happen, and in this case they do in the sense that line again, if we know that if somehow my equations are random, then with certain probability things at the same time they didn't have that many of you know this kind of things, right?",
                    "label": 0
                },
                {
                    "sent": "So the point if there is one can motivate.",
                    "label": 0
                },
                {
                    "sent": "Although it's perhaps not typically not done this way, why we use nuclear norms and stuff like that exactly from this convex geometry perspective?",
                    "label": 0
                },
                {
                    "sent": "And the point is, this works not only for this.",
                    "label": 0
                },
                {
                    "sent": "But somehow we cannot.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We generalize and lots of divisions have paper somehow to arbitrary situations, or somehow what you're interested in.",
                    "label": 0
                },
                {
                    "sent": "Instructions which are essentially lower small number of combinations of elements of some atoms head.",
                    "label": 0
                },
                {
                    "sent": "So for instance, if instead of thinking about low rank matrices you think about low rank tensors or matrices which are some of small number of permutation matrices or cut majors or whatever, you can think about doing exactly the same construction that was selling before you think about what are your atoms.",
                    "label": 1
                },
                {
                    "sent": "One of the things that you actually care about.",
                    "label": 0
                },
                {
                    "sent": "Then you think about taking the convex Hull of that, at least in your mind, because sometimes computing this convex Hull is impossible, and I'll tell you what happens in this case and those under mild conditions that defines the norm, and those nodes are kind of the right regularizers to use if you want to induce certain kinds of structure.",
                    "label": 0
                },
                {
                    "sent": "So just in the same way that we talk about L1 or the nuclear norm, we can think about some kind of nuclear norm from tensors, some kind of nuclear norm for plantation matrices in or similar known for cut matrices.",
                    "label": 0
                },
                {
                    "sent": "That's what's called.",
                    "label": 0
                },
                {
                    "sent": "Two norm and essentially for any situation where you want to induce some kind of structure, then one can think about doing this kind of convex Hull construction.",
                    "label": 0
                },
                {
                    "sent": "Now this is kind of where all the stuff I told you before comes into place, right?",
                    "label": 0
                },
                {
                    "sent": "It's easy to say this, you just take the convex Hull offline organ of the set of all cut matrices.",
                    "label": 1
                },
                {
                    "sent": "But the point is we cannot do this in the sense that it's NP hard to actually do this to check membership to this convex Hull.",
                    "label": 0
                },
                {
                    "sent": "So what we can do with all this stuff I told you about gives you are ways of constructing outer approximations to these norms.",
                    "label": 0
                },
                {
                    "sent": "In some cases exact.",
                    "label": 0
                },
                {
                    "sent": "So for L1, for nuclear norm we exactly know how to describe this convex hulls.",
                    "label": 0
                },
                {
                    "sent": "We have small semi definite.",
                    "label": 0
                },
                {
                    "sent": "I'm so excited Scribus, but in general this is not true.",
                    "label": 0
                },
                {
                    "sent": "And it's very interesting that these kind of approximations are supposed to purely metric approximations where you just want to approximate the set.",
                    "label": 0
                },
                {
                    "sent": "They actually preserve facial structure.",
                    "label": 0
                },
                {
                    "sent": "They perceive their faces somehow, they low dimensional faces to some extent of my convex body, and let me hint at least why I will not.",
                    "label": 0
                },
                {
                    "sent": "I don't have time to talk about this in detail, but let me tell you why this is very important, But in this kind of problems when we think about the statistics of it or the probabilistic aspect of it, which is, for instance, how many samples do I need?",
                    "label": 1
                },
                {
                    "sent": "How many equations do I need?",
                    "label": 0
                },
                {
                    "sent": "If I want to recover my problem, it turns out that what plays a role I'm not telling you why, but plays a role both in L1 nuclear norm, all this stuff or kind of big width of this tangent cones.",
                    "label": 1
                },
                {
                    "sent": "So somehow when I have my convex body in here, think about the blue object, ignore the stuff outside somehow.",
                    "label": 0
                },
                {
                    "sent": "What matters is how pointy this object is?",
                    "label": 0
                },
                {
                    "sent": "This is really what determines the number of samples that you need for recovery.",
                    "label": 0
                },
                {
                    "sent": "I mean, there's a nice way of understanding this, right?",
                    "label": 0
                },
                {
                    "sent": "But the point is following.",
                    "label": 0
                },
                {
                    "sent": "Somehow when I approximate my set, when I produce an approximation of my set.",
                    "label": 0
                },
                {
                    "sent": "The approximations produced by these kind of methods essentially will give you round versions of these convex body that typically have comes in there that necessary are slightly bigger than what they should be.",
                    "label": 0
                },
                {
                    "sent": "And what that tells me essentially said we can control, or that there's this tradeoff between how many samples I need to recover, which is related to how big this console versus how expensive is too computationally describe these objects.",
                    "label": 0
                },
                {
                    "sent": "So the point is, again, we don't quite serious for L1 and four nuclear norm because we can exactly describe these sets.",
                    "label": 0
                },
                {
                    "sent": "Nothing like this happens, but as you start going to more complicated problems, even though the recent natural regularizer that you may want to use, and you may prove all kind of wonderful properties about that, then you cannot compute it.",
                    "label": 0
                },
                {
                    "sent": "And there's ways of computing approximations, and there's way of understanding the tradeoff, or how, and this is.",
                    "label": 0
                },
                {
                    "sent": "Again, this is a case where any approximations of this set will not work.",
                    "label": 0
                },
                {
                    "sent": "If you take an arbitrary metric approximation in there, that won't necessarily preserve the facial structure, so.",
                    "label": 0
                },
                {
                    "sent": "If you want to read more.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That's a nice paper to do, some stuff, some pretty much wrapping up, so let me tell you a.",
                    "label": 0
                },
                {
                    "sent": "If you think, I mean there's a lot of connections between all these kind of things and very different areas of mathematics, let me just perhaps hints.",
                    "label": 1
                },
                {
                    "sent": "Here, which I mean, it's fairly clear because I talked a lot about line or convex hulls.",
                    "label": 0
                },
                {
                    "sent": "Somehow the probabilistic interpretation of convex hulls are of course probability distributions, right?",
                    "label": 0
                },
                {
                    "sent": "Somehow I can think about an object right now.",
                    "label": 0
                },
                {
                    "sent": "Think about mix strategies in games, right?",
                    "label": 0
                },
                {
                    "sent": "I can think about this either geometrically convex Hull or I can think about it as a probabilistic object.",
                    "label": 0
                },
                {
                    "sent": "So there's kind of very natural ways of describing this.",
                    "label": 0
                },
                {
                    "sent": "There's some very nice connections with noncommutative versions of probably there's kind of a quantum version of all this stuff when you think about polynomials not in variables.",
                    "label": 0
                },
                {
                    "sent": "In real variables, but you think about polynomials in noncommutative indeterminates, under kind of notions of positive iti, their notions is almost worse.",
                    "label": 0
                },
                {
                    "sent": "There's notions of geometric sets on this noncommutative sets, and it's actually quite quite interesting.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Right now.",
                    "label": 0
                },
                {
                    "sent": "I even say much in this talk about the how do we actually solve the things?",
                    "label": 0
                },
                {
                    "sent": "I mean somehow in this talk I'm just saying, OK, you have a semi definite problem and I ignore everything about how you actually solve this amendment.",
                    "label": 0
                },
                {
                    "sent": "We understand fairly well or or it's a huge part.",
                    "label": 0
                },
                {
                    "sent": "If you want of actually getting all these ideas work to actually understood, understand how much we can exploit structure.",
                    "label": 0
                },
                {
                    "sent": "I mean somehow in here they obvious versions I described before.",
                    "label": 0
                },
                {
                    "sent": "I mean they kind of work well for small problems if you try to do bigger things.",
                    "label": 0
                },
                {
                    "sent": "You have to be more sophisticated about it and we have a pretty good understanding at least of how to exploit certain kind of structure for these methods.",
                    "label": 0
                },
                {
                    "sent": "And that works both of the algebraic level.",
                    "label": 0
                },
                {
                    "sent": "Somehow we want to understand structure with polynomial and what does it mean algebraically?",
                    "label": 0
                },
                {
                    "sent": "There's very sophisticated ways of understanding when the polynomial is sparse.",
                    "label": 0
                },
                {
                    "sent": "I mean not sparse in the naive sense of.",
                    "label": 0
                },
                {
                    "sent": "Entries have seed or not, but sparse in terms of laying.",
                    "label": 0
                },
                {
                    "sent": "What's convenient.",
                    "label": 0
                },
                {
                    "sent": "Total configuration of the coefficient real zero or not.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That actually helps a lot, but also from the numerical viewpoint.",
                    "label": 0
                },
                {
                    "sent": "I mean, somehow they semi definite problems arise from these kind of problems.",
                    "label": 0
                },
                {
                    "sent": "They're not arbitrary, they have a very nice structure.",
                    "label": 0
                },
                {
                    "sent": "If you change, coordinates are right way, then all matrices are appear in your semi definite program that rank one and you can actually use that for efficient computation.",
                    "label": 1
                },
                {
                    "sent": "And again I don't have time to talk.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Too much about this, so this is pretty much my summary.",
                    "label": 0
                },
                {
                    "sent": "The point is, there's a very rich class of optimization problems that come up when you consider the algebraic structure of convex sets.",
                    "label": 0
                },
                {
                    "sent": "These methods are not just theoretical mean, they have enabled or motivated.",
                    "label": 0
                },
                {
                    "sent": "I think a whole bunch of applications.",
                    "label": 0
                },
                {
                    "sent": "Of course, if you want to scale them to very large dimensions then you have to really start perhaps being a little pragmatic and giving up about using for instance, interior point methods to solve some idea.",
                    "label": 0
                },
                {
                    "sent": "Perhaps we want to 1st order methods, but think it's enormously important to actually think about what's the right problem to solve, and somehow I think in this case it's very useful to think, OK, this is this semi definite problem is in the background.",
                    "label": 0
                },
                {
                    "sent": "This is really what defines the kind of things that I would ideally like to solve, and then you can kind of compromise or be more pragmatic about how would you actually solve that problem.",
                    "label": 0
                },
                {
                    "sent": "So perhaps I don't want to use and the nuclear norm is actually good example, right?",
                    "label": 0
                },
                {
                    "sent": "So you can think in terms of the semi definite programming formulation.",
                    "label": 0
                },
                {
                    "sent": "If you really want to solve large scale problems, then perhaps you will give up on the convex formulation.",
                    "label": 0
                },
                {
                    "sent": "Will give you some factorization or an explicit factorization of matrix line organized.",
                    "label": 0
                },
                {
                    "sent": "Then you know some kind of nonlinear method in this, but you're still somehow trying to approximate this underlying convex problem in that.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I want to know more.",
                    "label": 0
                },
                {
                    "sent": "There's papers and stuff in my website and we just finished actually this book with a whole bunch of collaborators, so it should appear prism.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What time?",
                    "label": 0
                },
                {
                    "sent": "Thanks.",
                    "label": 0
                }
            ]
        }
    }
}