{
    "id": "vudxdawld36q6bxy3okrf6inylnh7qns",
    "title": "Royal Institute of Technology, Stockholm",
    "info": {
        "author": [
            "Jonas Eliasson, School of Electrical Engineering, KTH - Royal Institute of Technology"
        ],
        "published": "May 22, 2008",
        "recorded": "April 2008",
        "category": [
            "Top->Business->Transportation and Logistics->Infrastructure"
        ]
    },
    "url": "http://videolectures.net/tra08_eliasson_rit/",
    "segmentation": [
        [
            "Thank you, yes, I'm going to speak a little bit of the of the stock congestion charges and I'm I was asked to focus on the equity affect the congestion charges and actually the remarks I'm going to make our applicable also outside the stock.",
            "In context.",
            "I think that most of the conclusions that can be drawn from the fairly extensive equity analysis carried out in stock and can be applied to any sort of western type of city where you have a decent public transportation system needs not be so extensive, at least decent where you have.",
            "Not so extreme income differences."
        ],
        [
            "That runs along.",
            "Obviously I can tell you a lot about the stocking congestion charging, but I'll try to sort of focus on the equity aspects right now, but I couldn't sort of resist saying something about the current development anyway.",
            "Whether that is well for those of you living under a rock for this and for the last two or three years, this would look like we had a trial period lasting for the spring 2006, followed by referendum where a closed yes in the city of Stockholm meant that the system was reintroduced in August in 2007.",
            "So we have almost a year now of continuous experience, but with the charges right now there is a very, very large positive majority, somewhere around 70% of the inhabitants of this of the city to Stockholm.",
            "Are in favor of charges, and this picture stockroom is not.",
            "It's not only the part and circled by the cord and this does not come goes out like this and there's also a significant part of the people living living down here.",
            "The people most, although the Azure, the star bulbs mostly opposed to this congestion charges or living or other persons living here and here and also here and but there is a correlation between the general political agenda.",
            "Of these newspapers as well.",
            "Interesting question.",
            "I won't go in much into much more into the acceptance questions.",
            "You pay between 10% and 10 and 20 Swedish crowns per quarter crossing in both directions depending on time of days.",
            "It's it's free weekends and evenings and so on.",
            "Alternative fuel cars are exempt during the trial.",
            "The alternative fuel cars made up 2% or even below 2% of the charge of the cordon crossings.",
            "But nowadays the alternative fuel cars are up to 9 or even 10% of the quarter crossing, so we're rapidly approaching the point where congestion caused by alternative fuel cards aren't worth anymore.",
            "The source teams is stimulus to to buying an alternative fuel cars anymore when we have the exact point when reached at that point in time, we don't really know, but at some point we're reaching it."
        ],
        [
            "OK, we have had a fairly stable traffic decrease of around 20% through 20% across the cord and this is during the trial and then we had 2006 and 2007 without the charges and then was reintroduced in 2007.",
            "And you see that the decrease in percentage points is some some.",
            "A bit low, I mean a bit about 20% compared to 2005 levels and then in 2007 we have a little bit below the 20%, mainly due to inflation increasing population, an increase in car ownership, I should have updated my data series here for 2008.",
            "I actually forgot that I should have done this last evening actually, but I live for some reason about it.",
            "That one interesting thing is the picture."
        ],
        [
            "Looking like this stuff that is, the dashed line shows the development in 2006 and 2007, sort of between the charging periods.",
            "The 2005 lines is before the charging whatsoever.",
            "That line had been really stable for, well, ten years or so, but for some reason all of all of the disappearing drivers didn't come back with the charges were abolished, and I think that my interpretation of that phenomenon is that some of the car drivers disappearing due to the charges found alternatives that they.",
            "They liked, they switched to public transit.",
            "Perhaps they switched to other departure times, or other travel patterns in general destinations perhaps, and some of them found out that took him.",
            "Maybe it wasn't so bad after all.",
            "Going by public transit, for example, and I think that this says something about the potential impact of sort of softer measures.",
            "Things like information campaigns or or or trying to convince car drivers to try something else.",
            "And I have been traditionally a bit skeptic on on those.",
            "Information there measures as well.",
            "I mean that there's certainly worth it, but I I think that this says something about the that that perhaps at least I had underestimated the sort of prolonged impact of actually sort of forcing car drivers to try something else."
        ],
        [
            "So this yeah.",
            "Obviously then we had a very large decrease in congestion.",
            "The green bars here showing congestion index in 2005 and the the blue ones here in spring 2006.",
            "The bars here show the variability in in in in travel times.",
            "You see that variability in travel time decreased even more than."
        ],
        [
            "The average congestion time.",
            "So where did they go?",
            "Well, roughly speaking, half of the disappearing trips went to translate.",
            "That was, that was the trips connected to work on school trips, while the other half of the disappearing trips went to other things.",
            "Other things like fewer trips, trip chaining, other destinations and so on, and then just a tiny portion of it went to other routes.",
            "You get a Swedish lesson here as well, or just one means route choice.",
            "I forgot to trans."
        ],
        [
            "Right that's approved apparently.",
            "Now the main topic equity in place I'm trying to."
        ],
        [
            "This below 50 minutes there are three problems with actually trying to in the traditional way calculate equity, equity index and the first thing because that is the differences in values of time not only between travelers.",
            "I mean, if you're familiar with the standard way that we do cost benefit analysis, we use more or less one joint value of time for at least all private trips, or at least well, at least we don't differentiate values of time as much as we would need to when it comes to.",
            "Congestion charge because the sort of the Taurus congestion charging is to sort travelers or sort trips not trash, but sort trips into one portion with which who plays high value on the trip and also high value of time while the remaining part of the trips who haven't as high as the value of time or sort of sorted out.",
            "And this means that we have a self selection phenomenon where the trips with the highest values of time stay on the road and you have to understand that this is not the sort of dividing line between.",
            "A little time is not.",
            "Primarily, I would say between high income people knowing people it's mainly between the same individual making different kinds of trips, because sometimes sometimes you're in a hurry.",
            "You really need your car in need to be there on time, but sometimes not since in such a hurry you sort of willing to change your departure time or go somewhere else and so on and so on.",
            "Is that portion of trips that are leaving with the road.",
            "It's a.",
            "It's a matter of fact is them.",
            "So from the the main reason for for the traffic decrease or not.",
            "People who used to go by car all the time and are now switching to public transit all the time.",
            "It's more the case that people who use their cars say for two trips a week or something, or now changing their the numbers of cooperatives to 1.8 trips a week or something, and many of those people aren't even aware of that action.",
            "Decreasing the number of car trips.",
            "From a competitive point of view, this means that this self selection phenomenon means the travel time benefits are underestimated both on the group level but also now."
        ],
        [
            "Aggregate number the second thing here is that we don't know much about the variation within the group, and this is sort of the other side of the coin, since the divisive line between how you affect I mean how you how you adapt to the charges aren't really between groups but within, but for the same individual.",
            "Between different trips, this means that the difference between groups are typically smaller than the difference within the group, and since we typically only have travel server data for one day, for example, we don't know much about whether it is the same people paying charged each day which, which would mean that they sort of that.",
            "This delivery small group and would pay huge amounts of charges.",
            "Or if it's sort of spread more evenly across the group.",
            "For example, we don't know much about that, but."
        ],
        [
            "Know something?",
            "And I'll show you a picture that the second thing is that the use of revenues is really decisive if you do.",
            "If you just focus on sort of direct impacts of the charges, you missed that the thing that really has has an equity impact is how you use the charges afterwards."
        ],
        [
            "Would slide with that as well.",
            "So, so how many are affected?",
            "Well, this slide shows the percentage of private car owners paying the charge or paying different charge levels, so these are charge levels during two week.",
            "This is the percentage of car private car owners in in the County of Taco.",
            "And you see that during two week.",
            "Because we were not were not allowed to save data for, for, for, for integrity reasons, long for longer than two weeks, unfortunately.",
            "During two week periods, almost half of the private cars in the County pay congestion tax at least once, which means that for, I mean if you extend this period to a couple weeks, almost all of the private car owners in the in the counter stock on our affected sound words anyway, but it's really a small amount of cars to pay the charge really, really often.",
            "If you look at the people paying 200 crowns or more, which means that you need to pay well 20 crowns a day, which means that you have to pass the cordon at least once.",
            "Or perhaps once once every two days, perhaps.",
            "Then that makes up only only 5% of the cost.",
            "On the other hand, those make up 1/3 of the revenues, so it's really a small group to pay substantial amount of the charge.",
            "But then on the other hand, 2/3 of the charges are borne by by really large part of the."
        ],
        [
            "Population.",
            "And who paid the most?",
            "Well, the groups were really mostly affected by this, or are the ones that you would expect its inner city residents.",
            "It's rich households.",
            "It's employed people as opposed to students and unemployed people, it's men, it's households with children or houses with two adults.",
            "That means that if you compare this."
        ],
        [
            "So when you consider for example high income segments pay quite a lot more.",
            "These five income segments are divided into 5 equally spaced income segments.",
            "So the the the top 20% income households paid 29% of the charges on the top and the next 20% of the House was paid paid 29."
        ],
        [
            "The charges.",
            "But it's the middle income segment.",
            "Change them or the low income segments don't change more about the mid lower in the middle."
        ],
        [
            "Wants change more.",
            "And on average, when you sort of some of these facts up, it's it turns out that the rich households lose, totally speaking, more than the poor before the revenue, recycling and this like hoops and this slide shows, this slide shows the impact of different refund schemes.",
            "Though different recycling schemes.",
            "The lump sum refund.",
            "This is what happens if you use the revenues for lowering income taxes and this is what happens on the total impact on different income groups.",
            "If you use the revenues for a lower transit, for example, and this is sort of the the message of these slides, or is it from a political perspective?",
            "It's much more important discussing what to do with the revenues than actually discussing this sort of direct."
        ],
        [
            "Equity based on the charges.",
            "Now this last products paradox.",
            "The group that loses them or when you some more.",
            "The effects travel time benefits and the charges that make it turns out that the people who lose them was supposed to lose the most are the inner city residents there supposedly the biggest losers, but they are also the most positive.",
            "There are by far the most positive news and and that's not explained by the fact that they are thinking that they also get the large.",
            "Time benefit because since the inner city residents actually don't get so much.",
            "The blue one here it is OK in switch means travel time the blow.",
            "Everything here shows the travel time benefits.",
            "And The thing is that since the people things that people living in the inner city mostly do, the car trips starting in the inner city in the morning, going out and then going back again in the evening.",
            "So there's sort of going across.",
            "I mean in the opposite direction of the main flow.",
            "They don't get as much travel time benefits as well as the paper traveling in the other direction now.",
            "So why are they then more positively to the charges compared to the rest of the of the geographical groups?",
            "I think this depends on two things.",
            "The first one is that neglect this self selected self self selection effect because it is the case that when the when the inner inner city residents use their car, it's for those particular trips that they when they actually place a high value on their time.",
            "A.",
            "A typical argument that you have that you hear from inner city residents is that, well, well, I don't use my car much, but when I do with them, actually willing to pay something for getting there on time and this is sort of a colloquial way to phrase in this self selection effect on the value of time when they use my car.",
            "I have a high value of time and that's when I will when we're gonna wait awhile and actually willing to pay the charge and the other one is that this traditional sort of economic cost benefit analysis neglects the effects on the perceived urban environments.",
            "Ease of walking these cycling the perceived air quality and so on.",
            "And it turns out this is actually one of the main effects.",
            "I mean one of the main reasons for being positive."
        ],
        [
            "Georges final slide conclusions.",
            "I would say that equity is not such a really big issue in reality.",
            "Only political exposes either politically well anyway, at least in relative left front counters with decent transit rest.",
            "If you want to know who pays the most, it's rich men.",
            "Mainly Richmond from two other from 2 adult households with children, which is basically no problem from a political perspective because these are not the groups who are sort of badly affected in in acquisitions.",
            "And it's also the case that the total charge payments are relatively small compared to the sort of total income of typically income groups, which is because most people pay fairly seldom.",
            "Traditional liquid analysis neglects the effects which are really decisive and the decisive phase are the variation within groups.",
            "The share of frequent payers, versus the freak the share of occasional papers, how revenue is used.",
            "This self selection effects that I tried to explain and also the effects of the urban environment and I bit skeptic whether my equity analysis which I could spend quite some time actually conducting, is actually so meaningful.",
            "Because if you compare to the outcome of the equity analysis.",
            "With the with the with the opinion polls, for example, it turns out that the traditional equity analysis don't say much about whether people actually are posted to the charges or not, and if you don't have any sort of correlation between the equity sort of former equity analysis and what people actually perceive about the charges, maybe then the traditional equity analysis isn't so important after all."
        ],
        [
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you, yes, I'm going to speak a little bit of the of the stock congestion charges and I'm I was asked to focus on the equity affect the congestion charges and actually the remarks I'm going to make our applicable also outside the stock.",
                    "label": 0
                },
                {
                    "sent": "In context.",
                    "label": 0
                },
                {
                    "sent": "I think that most of the conclusions that can be drawn from the fairly extensive equity analysis carried out in stock and can be applied to any sort of western type of city where you have a decent public transportation system needs not be so extensive, at least decent where you have.",
                    "label": 0
                },
                {
                    "sent": "Not so extreme income differences.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That runs along.",
                    "label": 0
                },
                {
                    "sent": "Obviously I can tell you a lot about the stocking congestion charging, but I'll try to sort of focus on the equity aspects right now, but I couldn't sort of resist saying something about the current development anyway.",
                    "label": 0
                },
                {
                    "sent": "Whether that is well for those of you living under a rock for this and for the last two or three years, this would look like we had a trial period lasting for the spring 2006, followed by referendum where a closed yes in the city of Stockholm meant that the system was reintroduced in August in 2007.",
                    "label": 0
                },
                {
                    "sent": "So we have almost a year now of continuous experience, but with the charges right now there is a very, very large positive majority, somewhere around 70% of the inhabitants of this of the city to Stockholm.",
                    "label": 1
                },
                {
                    "sent": "Are in favor of charges, and this picture stockroom is not.",
                    "label": 0
                },
                {
                    "sent": "It's not only the part and circled by the cord and this does not come goes out like this and there's also a significant part of the people living living down here.",
                    "label": 0
                },
                {
                    "sent": "The people most, although the Azure, the star bulbs mostly opposed to this congestion charges or living or other persons living here and here and also here and but there is a correlation between the general political agenda.",
                    "label": 0
                },
                {
                    "sent": "Of these newspapers as well.",
                    "label": 0
                },
                {
                    "sent": "Interesting question.",
                    "label": 0
                },
                {
                    "sent": "I won't go in much into much more into the acceptance questions.",
                    "label": 0
                },
                {
                    "sent": "You pay between 10% and 10 and 20 Swedish crowns per quarter crossing in both directions depending on time of days.",
                    "label": 1
                },
                {
                    "sent": "It's it's free weekends and evenings and so on.",
                    "label": 1
                },
                {
                    "sent": "Alternative fuel cars are exempt during the trial.",
                    "label": 0
                },
                {
                    "sent": "The alternative fuel cars made up 2% or even below 2% of the charge of the cordon crossings.",
                    "label": 0
                },
                {
                    "sent": "But nowadays the alternative fuel cars are up to 9 or even 10% of the quarter crossing, so we're rapidly approaching the point where congestion caused by alternative fuel cards aren't worth anymore.",
                    "label": 0
                },
                {
                    "sent": "The source teams is stimulus to to buying an alternative fuel cars anymore when we have the exact point when reached at that point in time, we don't really know, but at some point we're reaching it.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, we have had a fairly stable traffic decrease of around 20% through 20% across the cord and this is during the trial and then we had 2006 and 2007 without the charges and then was reintroduced in 2007.",
                    "label": 1
                },
                {
                    "sent": "And you see that the decrease in percentage points is some some.",
                    "label": 0
                },
                {
                    "sent": "A bit low, I mean a bit about 20% compared to 2005 levels and then in 2007 we have a little bit below the 20%, mainly due to inflation increasing population, an increase in car ownership, I should have updated my data series here for 2008.",
                    "label": 0
                },
                {
                    "sent": "I actually forgot that I should have done this last evening actually, but I live for some reason about it.",
                    "label": 0
                },
                {
                    "sent": "That one interesting thing is the picture.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Looking like this stuff that is, the dashed line shows the development in 2006 and 2007, sort of between the charging periods.",
                    "label": 0
                },
                {
                    "sent": "The 2005 lines is before the charging whatsoever.",
                    "label": 0
                },
                {
                    "sent": "That line had been really stable for, well, ten years or so, but for some reason all of all of the disappearing drivers didn't come back with the charges were abolished, and I think that my interpretation of that phenomenon is that some of the car drivers disappearing due to the charges found alternatives that they.",
                    "label": 0
                },
                {
                    "sent": "They liked, they switched to public transit.",
                    "label": 0
                },
                {
                    "sent": "Perhaps they switched to other departure times, or other travel patterns in general destinations perhaps, and some of them found out that took him.",
                    "label": 0
                },
                {
                    "sent": "Maybe it wasn't so bad after all.",
                    "label": 0
                },
                {
                    "sent": "Going by public transit, for example, and I think that this says something about the potential impact of sort of softer measures.",
                    "label": 0
                },
                {
                    "sent": "Things like information campaigns or or or trying to convince car drivers to try something else.",
                    "label": 0
                },
                {
                    "sent": "And I have been traditionally a bit skeptic on on those.",
                    "label": 0
                },
                {
                    "sent": "Information there measures as well.",
                    "label": 0
                },
                {
                    "sent": "I mean that there's certainly worth it, but I I think that this says something about the that that perhaps at least I had underestimated the sort of prolonged impact of actually sort of forcing car drivers to try something else.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this yeah.",
                    "label": 0
                },
                {
                    "sent": "Obviously then we had a very large decrease in congestion.",
                    "label": 0
                },
                {
                    "sent": "The green bars here showing congestion index in 2005 and the the blue ones here in spring 2006.",
                    "label": 0
                },
                {
                    "sent": "The bars here show the variability in in in in travel times.",
                    "label": 0
                },
                {
                    "sent": "You see that variability in travel time decreased even more than.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The average congestion time.",
                    "label": 0
                },
                {
                    "sent": "So where did they go?",
                    "label": 0
                },
                {
                    "sent": "Well, roughly speaking, half of the disappearing trips went to translate.",
                    "label": 0
                },
                {
                    "sent": "That was, that was the trips connected to work on school trips, while the other half of the disappearing trips went to other things.",
                    "label": 0
                },
                {
                    "sent": "Other things like fewer trips, trip chaining, other destinations and so on, and then just a tiny portion of it went to other routes.",
                    "label": 1
                },
                {
                    "sent": "You get a Swedish lesson here as well, or just one means route choice.",
                    "label": 1
                },
                {
                    "sent": "I forgot to trans.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Right that's approved apparently.",
                    "label": 0
                },
                {
                    "sent": "Now the main topic equity in place I'm trying to.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This below 50 minutes there are three problems with actually trying to in the traditional way calculate equity, equity index and the first thing because that is the differences in values of time not only between travelers.",
                    "label": 0
                },
                {
                    "sent": "I mean, if you're familiar with the standard way that we do cost benefit analysis, we use more or less one joint value of time for at least all private trips, or at least well, at least we don't differentiate values of time as much as we would need to when it comes to.",
                    "label": 0
                },
                {
                    "sent": "Congestion charge because the sort of the Taurus congestion charging is to sort travelers or sort trips not trash, but sort trips into one portion with which who plays high value on the trip and also high value of time while the remaining part of the trips who haven't as high as the value of time or sort of sorted out.",
                    "label": 0
                },
                {
                    "sent": "And this means that we have a self selection phenomenon where the trips with the highest values of time stay on the road and you have to understand that this is not the sort of dividing line between.",
                    "label": 1
                },
                {
                    "sent": "A little time is not.",
                    "label": 0
                },
                {
                    "sent": "Primarily, I would say between high income people knowing people it's mainly between the same individual making different kinds of trips, because sometimes sometimes you're in a hurry.",
                    "label": 0
                },
                {
                    "sent": "You really need your car in need to be there on time, but sometimes not since in such a hurry you sort of willing to change your departure time or go somewhere else and so on and so on.",
                    "label": 0
                },
                {
                    "sent": "Is that portion of trips that are leaving with the road.",
                    "label": 0
                },
                {
                    "sent": "It's a.",
                    "label": 0
                },
                {
                    "sent": "It's a matter of fact is them.",
                    "label": 0
                },
                {
                    "sent": "So from the the main reason for for the traffic decrease or not.",
                    "label": 0
                },
                {
                    "sent": "People who used to go by car all the time and are now switching to public transit all the time.",
                    "label": 0
                },
                {
                    "sent": "It's more the case that people who use their cars say for two trips a week or something, or now changing their the numbers of cooperatives to 1.8 trips a week or something, and many of those people aren't even aware of that action.",
                    "label": 0
                },
                {
                    "sent": "Decreasing the number of car trips.",
                    "label": 1
                },
                {
                    "sent": "From a competitive point of view, this means that this self selection phenomenon means the travel time benefits are underestimated both on the group level but also now.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Aggregate number the second thing here is that we don't know much about the variation within the group, and this is sort of the other side of the coin, since the divisive line between how you affect I mean how you how you adapt to the charges aren't really between groups but within, but for the same individual.",
                    "label": 0
                },
                {
                    "sent": "Between different trips, this means that the difference between groups are typically smaller than the difference within the group, and since we typically only have travel server data for one day, for example, we don't know much about whether it is the same people paying charged each day which, which would mean that they sort of that.",
                    "label": 1
                },
                {
                    "sent": "This delivery small group and would pay huge amounts of charges.",
                    "label": 0
                },
                {
                    "sent": "Or if it's sort of spread more evenly across the group.",
                    "label": 0
                },
                {
                    "sent": "For example, we don't know much about that, but.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Know something?",
                    "label": 0
                },
                {
                    "sent": "And I'll show you a picture that the second thing is that the use of revenues is really decisive if you do.",
                    "label": 1
                },
                {
                    "sent": "If you just focus on sort of direct impacts of the charges, you missed that the thing that really has has an equity impact is how you use the charges afterwards.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Would slide with that as well.",
                    "label": 0
                },
                {
                    "sent": "So, so how many are affected?",
                    "label": 1
                },
                {
                    "sent": "Well, this slide shows the percentage of private car owners paying the charge or paying different charge levels, so these are charge levels during two week.",
                    "label": 1
                },
                {
                    "sent": "This is the percentage of car private car owners in in the County of Taco.",
                    "label": 0
                },
                {
                    "sent": "And you see that during two week.",
                    "label": 0
                },
                {
                    "sent": "Because we were not were not allowed to save data for, for, for, for integrity reasons, long for longer than two weeks, unfortunately.",
                    "label": 0
                },
                {
                    "sent": "During two week periods, almost half of the private cars in the County pay congestion tax at least once, which means that for, I mean if you extend this period to a couple weeks, almost all of the private car owners in the in the counter stock on our affected sound words anyway, but it's really a small amount of cars to pay the charge really, really often.",
                    "label": 1
                },
                {
                    "sent": "If you look at the people paying 200 crowns or more, which means that you need to pay well 20 crowns a day, which means that you have to pass the cordon at least once.",
                    "label": 1
                },
                {
                    "sent": "Or perhaps once once every two days, perhaps.",
                    "label": 0
                },
                {
                    "sent": "Then that makes up only only 5% of the cost.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, those make up 1/3 of the revenues, so it's really a small group to pay substantial amount of the charge.",
                    "label": 1
                },
                {
                    "sent": "But then on the other hand, 2/3 of the charges are borne by by really large part of the.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Population.",
                    "label": 0
                },
                {
                    "sent": "And who paid the most?",
                    "label": 1
                },
                {
                    "sent": "Well, the groups were really mostly affected by this, or are the ones that you would expect its inner city residents.",
                    "label": 0
                },
                {
                    "sent": "It's rich households.",
                    "label": 0
                },
                {
                    "sent": "It's employed people as opposed to students and unemployed people, it's men, it's households with children or houses with two adults.",
                    "label": 1
                },
                {
                    "sent": "That means that if you compare this.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So when you consider for example high income segments pay quite a lot more.",
                    "label": 1
                },
                {
                    "sent": "These five income segments are divided into 5 equally spaced income segments.",
                    "label": 0
                },
                {
                    "sent": "So the the the top 20% income households paid 29% of the charges on the top and the next 20% of the House was paid paid 29.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The charges.",
                    "label": 0
                },
                {
                    "sent": "But it's the middle income segment.",
                    "label": 1
                },
                {
                    "sent": "Change them or the low income segments don't change more about the mid lower in the middle.",
                    "label": 1
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Wants change more.",
                    "label": 0
                },
                {
                    "sent": "And on average, when you sort of some of these facts up, it's it turns out that the rich households lose, totally speaking, more than the poor before the revenue, recycling and this like hoops and this slide shows, this slide shows the impact of different refund schemes.",
                    "label": 0
                },
                {
                    "sent": "Though different recycling schemes.",
                    "label": 0
                },
                {
                    "sent": "The lump sum refund.",
                    "label": 0
                },
                {
                    "sent": "This is what happens if you use the revenues for lowering income taxes and this is what happens on the total impact on different income groups.",
                    "label": 0
                },
                {
                    "sent": "If you use the revenues for a lower transit, for example, and this is sort of the the message of these slides, or is it from a political perspective?",
                    "label": 0
                },
                {
                    "sent": "It's much more important discussing what to do with the revenues than actually discussing this sort of direct.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Equity based on the charges.",
                    "label": 0
                },
                {
                    "sent": "Now this last products paradox.",
                    "label": 0
                },
                {
                    "sent": "The group that loses them or when you some more.",
                    "label": 0
                },
                {
                    "sent": "The effects travel time benefits and the charges that make it turns out that the people who lose them was supposed to lose the most are the inner city residents there supposedly the biggest losers, but they are also the most positive.",
                    "label": 1
                },
                {
                    "sent": "There are by far the most positive news and and that's not explained by the fact that they are thinking that they also get the large.",
                    "label": 1
                },
                {
                    "sent": "Time benefit because since the inner city residents actually don't get so much.",
                    "label": 0
                },
                {
                    "sent": "The blue one here it is OK in switch means travel time the blow.",
                    "label": 0
                },
                {
                    "sent": "Everything here shows the travel time benefits.",
                    "label": 0
                },
                {
                    "sent": "And The thing is that since the people things that people living in the inner city mostly do, the car trips starting in the inner city in the morning, going out and then going back again in the evening.",
                    "label": 0
                },
                {
                    "sent": "So there's sort of going across.",
                    "label": 1
                },
                {
                    "sent": "I mean in the opposite direction of the main flow.",
                    "label": 0
                },
                {
                    "sent": "They don't get as much travel time benefits as well as the paper traveling in the other direction now.",
                    "label": 1
                },
                {
                    "sent": "So why are they then more positively to the charges compared to the rest of the of the geographical groups?",
                    "label": 0
                },
                {
                    "sent": "I think this depends on two things.",
                    "label": 0
                },
                {
                    "sent": "The first one is that neglect this self selected self self selection effect because it is the case that when the when the inner inner city residents use their car, it's for those particular trips that they when they actually place a high value on their time.",
                    "label": 0
                },
                {
                    "sent": "A.",
                    "label": 0
                },
                {
                    "sent": "A typical argument that you have that you hear from inner city residents is that, well, well, I don't use my car much, but when I do with them, actually willing to pay something for getting there on time and this is sort of a colloquial way to phrase in this self selection effect on the value of time when they use my car.",
                    "label": 0
                },
                {
                    "sent": "I have a high value of time and that's when I will when we're gonna wait awhile and actually willing to pay the charge and the other one is that this traditional sort of economic cost benefit analysis neglects the effects on the perceived urban environments.",
                    "label": 0
                },
                {
                    "sent": "Ease of walking these cycling the perceived air quality and so on.",
                    "label": 0
                },
                {
                    "sent": "And it turns out this is actually one of the main effects.",
                    "label": 0
                },
                {
                    "sent": "I mean one of the main reasons for being positive.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Georges final slide conclusions.",
                    "label": 0
                },
                {
                    "sent": "I would say that equity is not such a really big issue in reality.",
                    "label": 1
                },
                {
                    "sent": "Only political exposes either politically well anyway, at least in relative left front counters with decent transit rest.",
                    "label": 1
                },
                {
                    "sent": "If you want to know who pays the most, it's rich men.",
                    "label": 1
                },
                {
                    "sent": "Mainly Richmond from two other from 2 adult households with children, which is basically no problem from a political perspective because these are not the groups who are sort of badly affected in in acquisitions.",
                    "label": 0
                },
                {
                    "sent": "And it's also the case that the total charge payments are relatively small compared to the sort of total income of typically income groups, which is because most people pay fairly seldom.",
                    "label": 0
                },
                {
                    "sent": "Traditional liquid analysis neglects the effects which are really decisive and the decisive phase are the variation within groups.",
                    "label": 1
                },
                {
                    "sent": "The share of frequent payers, versus the freak the share of occasional papers, how revenue is used.",
                    "label": 0
                },
                {
                    "sent": "This self selection effects that I tried to explain and also the effects of the urban environment and I bit skeptic whether my equity analysis which I could spend quite some time actually conducting, is actually so meaningful.",
                    "label": 0
                },
                {
                    "sent": "Because if you compare to the outcome of the equity analysis.",
                    "label": 0
                },
                {
                    "sent": "With the with the with the opinion polls, for example, it turns out that the traditional equity analysis don't say much about whether people actually are posted to the charges or not, and if you don't have any sort of correlation between the equity sort of former equity analysis and what people actually perceive about the charges, maybe then the traditional equity analysis isn't so important after all.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}