{
    "id": "vuwas3tu7egt4jh3shgj2napjhzkp37p",
    "title": "KM at the Customer Front-Line: The BT Case Study in ACTIVE",
    "info": {
        "author": [
            "Paul Warren, Knowledge Media Institute (KMI), Open University (OU)"
        ],
        "published": "Oct. 20, 2009",
        "recorded": "September 2009",
        "category": [
            "Top->Business->Management->Knowledge Management"
        ]
    },
    "url": "http://videolectures.net/active09_warren_kmcfl/",
    "segmentation": [
        [
            "OK then let's make a start for last the last hour.",
            "You also have a metal ready for still being here, I think, but so when I when I began the workshop at the summer school on Friday, seems like a very long time ago now.",
            "Actually an I said that there were three case studies in the project an you've heard about one already from Accenture from RAID.",
            "And so I'm going to finish off the summer school by talking about the case study in BT.",
            "So there in some ways quite similar, but in some ways also quite different.",
            "So as we go through our try and bring out some of the.",
            "Differences in particular.",
            "I'm.",
            "So at the first thing to do is to make a meter comment really about case studies why?",
            "And I'd be interested if if Aaron agrees with these views while."
        ],
        [
            "Why do we have case studies in these kind of projects?",
            "Well, I think to me there are three reasons and the most important one I guess, and they're all important, but probably the most important one is to validate the technologies and and as I said, right at the beginning, that means really development.",
            "In technical terms, they actually work at the most basic technical level.",
            "Detector technologies all work when they played together.",
            "I'm are they usable?",
            "Is the user interface right for the users?",
            "And finally, do they make sense for the organization so validation of the of the technologies and feedback from that validation process into the further technology development is very important?",
            "Another very important reason is to actually exploit the technologies and all three case studies in active are actually intended to produce systems which will be used within the within the three organisations.",
            "And you've got that flavor.",
            "You've heard that already from from ride.",
            "I'm and finally I think to provide to provide examples, reference cases to use as part of our public relations as part of dissemination.",
            "To illustrate to the wider community that the technologies work, they can be made to work and to encourage the uptake of the technologies outside of the active project.",
            "So those are the three reasons to my mind that we actually do case studies in these kind of projects.",
            "And I certainly would would echo Ariens, comment.",
            "I hadn't heard that quote about gutter before, but the quote I like actually is from another famous German from Karl Marx, so I think it's on his tombstone in Highgate is something he says something like philosophers.",
            "Try to understand the world.",
            "The point is not just to understand it but to change it.",
            "So certainly projects like active exists not just to do cool research, but to actually produce systems which work and which created economic benefit.",
            "OK, so that was that was that was a meta meta comment if you like.",
            "So look at what I'm going to talk about over the next hour.",
            "I'm going to talk a little bit about."
        ],
        [
            "Out the trialist the people were working with him BT about their needs and I would say call this.",
            "I've subtitle is a Greenfield site.",
            "Now this is a distinction really between the BT case study and the extension one, you might have notice on one of rides slides.",
            "I don't think he drew particular attention to it, but on one of his side slides he had the word Sable, an Accenture already have an ride, maintains and expands and knowledge management system called Sable.",
            "In Accenture, so in so in the active project what he's doing is building on that stable system.",
            "Mary Beatty, although our trial is have many systems, they have CRM systems.",
            "They have all sorts of systems have pricing systems.",
            "They have an intranet of course, and they have all the things you normally expect on an intranet within an organization.",
            "They don't really have in any sense an integrated knowledge management system, so our what we're doing is really creative while working in a Greenfield site.",
            "That means that we've spent.",
            "We've had to spend rather more time than raids had to spend rather more time investigating the needs of our users an so I'll talk a little bit about that about how we've investigated their needs.",
            "Then I'll talk about our solution, how we brought the technologies together.",
            "Validation I mentioned important it is.",
            "I'll talk about that.",
            "And then just a few words by waves of summing up and I in a few minutes at the end for questions for questions generally about about the whole active project.",
            "OK, so the people we're working with people who are going to be using our technology are in a part of BT which is called BT Business, BT and.",
            "That's in it, isn't it?",
            "Is in BT retail, which means to say that it's concerned with cash."
        ],
        [
            "Tumors in the UK second concern with small and medium sized enterprises in the UK now actually some of the medium size enterprises are quite large, so the customers that we that our people are dealing with.",
            "They range from maybe a lawyer in a small town with just one office or maybe a lawyer with with a couple of offices right up to some retailers who are actually High Street names.",
            "What these people want these customers are not, though, are multinationals because we have a separate part of BT which which deals with global enterprises with multinationals.",
            "So the people we're working with our dealing date on a day-to-day basis.",
            "They're providing services, providing telecom and ICT services for small and medium sized enterprises in the UK and the people were working with.",
            "They have a variety of names they call themselves sales specialists, technical consultant, sales managers, solutions consultants.",
            "But the characteristic of all of them is that they work directly and they interact directly with customers.",
            "I'm and the within people within BT business there are potentially hundreds of trialists an I'll talk a little bit later about about our plan for trials and how we're going to expand from a very small number of trials up to one or 200 trials.",
            "By the end of the project.",
            "So, um, the the people with that we deal with and they actually spend a lot of time on the road because they because their customer facing.",
            "They spend a lot of time meeting customers."
        ],
        [
            "So when we started to talk then we talk to them about their working week and I users are potential users and they spend about 3 days actually on the road meeting customers and then they spend 2 days and often much of their evenings as well in their offices.",
            "Really interact with customer phone of course and using a range of BT systems in order to provide services to customers in order to propose to prepare proposals for customers in order to prevent.",
            "Provide our prepare designs network designs for customers.",
            "I'm actually most of them work from home, and that's actually quite significant.",
            "Becausw it means that they don't actually get together with their colleagues very much, particularly as we're very keen on.",
            "There's a lot of cost consciousness in BT there's in current economic climate, alot of pressure to save costs.",
            "So these people that they're not able to travel very much, they can travel the customers.",
            "That's fine, because obviously they have customers, but.",
            "We don't have the kind of.",
            "Team meetings they don't have the kind of opportunities where people can come together and talk and interact very much, particularly as the people we're dealing with there that they are located right across the UK.",
            "So we've got people doing a similar function in the Southwest of England right up to, you know, to Scotland, and so This is why geographical distances.",
            "So the point I'm making is actually they can be quite isolated, and so they need knowledge management systems.",
            "They need information systems.",
            "Not just for information, but also to kind of help them interact with each other and help them exchange information with each other.",
            "I'm and they use multiple systems.",
            "When we started talking and observing what they did, horrendous number of systems actually, I mean at least two customer relationship management systems.",
            "Just for starters.",
            "All sorts of pricing design tools.",
            "Obviously Ms Office or kinds of spreadsheet pricing tools, lots and lots of different systems and their forever cutting and pasting and moving information, but he just different systems and it's all very important to use these systems because.",
            "Not only does is the information which is which is put into these systems used to monitor customers to monitor interaction with customers, but they're actually bonus and they are compensated according to their degree of interaction they have with customers according to the leads they get from customers and all this kind of information has been recorded on the system so incredibly motivated to use these systems because they don't get their money if they don't get it, they don't get their bonus if they don't, if they don't put all the information on the systems, but nonetheless.",
            "A sort of horrendous mishmash of different systems.",
            "They have to use.",
            "I'm an typically they would deal with in 10s and hundreds of customers and forever therefore contact switching context switching between customers.",
            "So we started off.",
            "We started talking to these people.",
            "We had some one to one interviews.",
            "We had some focus groups.",
            "We talked to the guys themselves."
        ],
        [
            "Yeah, the guys in the ladies who actually directly doing the job.",
            "We talked to their first line sales managers and we talked to senior managers as well so we have kind of trying to get their requirements trying to understand what they needed and trying to understand.",
            "See how the picture varied between between the different levels of the organization and what different stories they had.",
            "And we also did some remote job shadowing.",
            "We realized we needed to observe what people are.",
            "Actually it's very interesting.",
            "I guess most of us don't get the opportunity to do this to actually observe people as they sit for an hour or two using IT systems and how they actually interact with the IT systems.",
            "And that's quite an interesting experience an because, as I say, these people were so geographically disperse, we didn't want to keep traveling.",
            "We just spent days just traveling.",
            "So we what we did.",
            "We did remote job shadowing.",
            "We use Microsoft Communicator as a voice channel so it didn't didn't voice.",
            "Channel of Microsoft Communicator, so we didn't tie up their phones an we use Microsoft Live meeting so we can view their screens.",
            "So it's very interesting.",
            "Use it at a room in one part of England and you can really watch and see what somebody is doing.",
            "In their home, in a different part of England you can see exactly what they're doing on the screen.",
            "You can hear the conversations they have when they have phone conversations and you try to be not to be too obtrusive, but you can ask questions from time to time, and so we originally conceived there.",
            "My colleague in Thurlow developed this idea of using remote job shadowing because we realized it was going to be so expensive and so time consuming to actually go and visit these people, but we realized we also had another benefit.",
            "Benefit as well, because it's really much less obtrusive.",
            "I would say that the people forgot we were listening.",
            "I hope you didn't forget, because obviously they're kind of we wouldn't want to feel that there any any confidentiality issues, but nonetheless, because we weren't in the room with him, I think there are much less that they were.",
            "They were much less inhibited by our presence, and we could really see how they were using systems.",
            "So we did the remote job shadowing and then we developed some ideas which we put into a concept demonstrator, just not a working prototype, but just something using PowerPoint basically and we fed that back in focus groups and we got we got feedback from that and some of the feedback was positive and some of the ideas we produce we got.",
            "We got some negative feedback.",
            "We had one idea about developing a new piece of software which would help them to store or to keep a track like kind of notepad that will keep track of information.",
            "Context in a context sensitive way, and we've got quite a, we got a negative reaction to that because frankly, they have so many systems they just didn't want anymore system.",
            "They kind of the idea of having one more piece of software on their desktop or something that they didn't want, but we got some positive feedback as well and I'll talk about that as we go through the presentation.",
            "I'm.",
            "So I said when I when I started at the beginning of the summer school, that and there are three major research planks."
        ],
        [
            "Underlying the project and you feel a lot about them over the last three days.",
            "Knowledge sharing process is and context, so we we had the intuition at the beginning of the project that these were important problems an that we had an intuition about how we would approach these problems.",
            "So what we're doing in this work with the customers with the users.",
            "Rather it was to develop her ideas and to refine our ideas.",
            "So when we talked about knowledge sharing, we found there's one particular problem.",
            "Which they they all almost all had, and which was a problem which the the the people at the ground level who are doing doing the job had, but also a problem which is of great concern to the managers into the senior managers as well.",
            "And then when we talked to we talk to right and people in extension we found they had exactly the same problem.",
            "An effect right is already mentioned this a lot of time with our people out of time of rides people is spent developing proposals.",
            "So in rides case, it's proposal for a apiece of consultancy work.",
            "In our case, it's a proposal for a piece of network design, maybe something which involves putting in a virtual private circuit, a virtual private network, something which involves some circuit design, maybe some software as well.",
            "And that's doing doing that well.",
            "Getting proposals to the customer quickly and getting proposals of good quality.",
            "This is a real problem in a real concern.",
            "And that means two things.",
            "It means finding.",
            "And again, this is very much echoes work right right?",
            "Which was saying it means finding the right piece of information to put into the proposal.",
            "And.",
            "Right appropriate means.",
            "Most up-to-date, So what typically what they they do they have to?",
            "They have to do a proposal, and the customer wants some some provision of something like a BlackBerry, say, so they go on the BT Internet.",
            "They do a search and they find some text about BlackBerry and lo and behold, what they find may well not be the most up-to-date piece of information.",
            "It may have the wrong pricing information, so there's a big issue about finding most appropriate kind of kind of kind of information.",
            "And there's also an issue about finding.",
            "The right expertise.",
            "So typically they would have have a proposal and there are a number of questions that have to be addressed and most of the questions they can address easily, but then they left with about 6 issues, which as the individual trying to put the proposal six issues which they find difficult.",
            "They can't find the right people.",
            "We can't find the right information and that's that's a really big practical problem.",
            "Um yeah, I'm and yeah we wanted them that the other.",
            "The other requirement was to be more proactive with customers.",
            "So the idea here is that somebody in the Northeast of England say that we sell to a customer in the Northeast of England.",
            "We sell a solution of a particular kind, and that solution might be relevant to a customer in the Southwest.",
            "Now we want to alert the salesperson, the technical consultant in the Southwest.",
            "Hey, there's something here which might be right for your customer.",
            "How do you do that?",
            "The problem is the all the kind of obvious segmentations.",
            "That people would invent the kind of taxonomies you might do it by.",
            "You might do it but but but by industry sector you might say OK, here's a solution which is good for a particular industry sector.",
            "Here's a solution which is good for particular size customer, those kind of segmentations might not actually be right.",
            "They might not actually be meaningful to the people who are doing the job.",
            "There might be other subtle subtle things which distinguish customers, which mean that a solution for this customer in one part of England is right for the customer.",
            "Another part of it, then nothing to do with him being in the same sector.",
            "Nothing to do with them be having the same kind of being the same kind of size organisations, but some other subtlety of of the particular customers.",
            "So what we wanted to do therefore was to give people the ability to tag their to tag information in the way that was meaningful to them, and let these these people develop their own kind of their own taxonomies, their own ontologies, and not for something on them.",
            "Right?",
            "And what I should say about that?",
            "Another kind of social coming?",
            "Really, the age profile of these people was fairly skewed towards the middle years.",
            "If you like in general, they weren't, then they're not because of the way the companies involved because of the way people's career profiles of developed and so on.",
            "They weren't young people in general, so most of them were not used to the kind of Web 2.0 world.",
            "They weren't the kind of people who are on Facebook all the time.",
            "They weren't used to tagging with with Flickr, so that's another kind of challenge really that you have you have to design something you have to give them something which is which is easy to use and you have to accept that they're not.",
            "There's a sort of learning curve that perhaps when they start to do tagging, for instance, there's a learning curve, isn't there.",
            "If it was, if it was, maybe young people trailer.",
            "I had a college.",
            "So that was knowledge sharing.",
            "So then we we talked about context switching.",
            "We saw we maybe have more difficulty getting the ideas across here, but we certainly saw people doing a lot."
        ],
        [
            "Context switching, so typically we saw people there thinking about 1 customer customer a.",
            "They're busy doing things customer 8 and then what happens?",
            "They get a phone call maybe from customer B.",
            "Maybe from a colleague who wants to do.",
            "Or maybe their boss who wants to do some work on customer be.",
            "Or maybe they get in.",
            "I am something like customer.",
            "We have to swap.",
            "They have to switch context immediately, start forgetting Motors, stop think about customer a switch to customer base.",
            "So we saw that happening all the time.",
            "Yet when we ask them if they had a problem with context switching.",
            "I'm the reaction was more mixed they.",
            "I think they they they felt they were doing it well.",
            "I'm sure that the that the technology could help them to improve, but it was a more mixed reaction.",
            "But what did come out very strongly is that they needed the context switching to be more automatic.",
            "So you saw Igor's presentation yesterday and you saw what we've done so far in providing the taskbar show the taskbar in a moment of game and the idea that you can switch context and you can associate.",
            "You can associate information objects with context.",
            "Now some kinds of users will do that, but most people want something more automatically want to be told what context they want the system to know, what context they're in, and they want the system to do things more automatically.",
            "And then process again.",
            "This was interesting when we talked to the people actually doing the work.",
            "They kind of took the attitude.",
            "Well, we know our process is and in fact they did pretty much.",
            "They knew what they had to do.",
            "The problem though as they go through the process is is that they each stage in the process.",
            "They need information and it's actually finding the information that was difficult.",
            "Rather than knowing the next step in the process.",
            "Yeah, but when we talked to senior managers so so that was kind of the reaction we're getting from from people about process in a way was kind of depressing because that was kind of suggesting that there wasn't a lot of gain in to behave in learning process is, but we then talked to senior managers and suddenly they got very excited.",
            "We started somewhere process is because their take was completely different.",
            "What they had a lot of theoretical process is.",
            "Things have been designed that people are supposed to follow what they wanted to know.",
            "It was are the people actually following.",
            "Those process is to what extent do they deviate from those process is an can we optimize?",
            "Can we understand what people are actually doing rather than what they should be doing?",
            "And can we optimize what they're doing?",
            "I'm so a lot of interest from the senior guys in process learning and process optimization, so so that was interesting and that was something we fed back to my cell and you heard myself talk yesterday?",
            "Or was it yesterday wasn't about process optimization optimization, so that's something we were looking to use in the final stages of the project.",
            "Um, yeah, so we're at the stage now.",
            "We've actually just passed that.",
            "It's a three year project."
        ],
        [
            "We just passed the half year mark, about half the halfway mark, so we're at the stage where we develop the basic infrastructure that Igor talked about.",
            "We've done some of the basic research and we've got a first prototype, which we're putting into the film, which we're going to be trialing in BT in the last few months of the second year of the project.",
            "So we're beginning to roll something out now to trial.",
            "And what we're actually starting with, starting with two things, were signing with the Semantic Mediawiki because we saw that as an opportunity to improve the process.",
            "The ways in which people in which people develop proposals in particular, and the ways that they sharing knowledge in general an.",
            "We're also rolling out the KWS with manual context, switching to a small number of people.",
            "As I say, I think the real hit here.",
            "The real advantage comes when we can.",
            "We have a degree of automation where market gives us the.",
            "Learning stuff and actually in the third or the project, but as an initial trial to a selected number of people were rolling out the manual context switching.",
            "I'm.",
            "So then are in in, in in the last few months of the last six months of the projects we're starting in the second half of 20th.",
            "Next year will be rolling out the OKW, the automatic, the context and process learning in the process optimization.",
            "OK semantic media wiki.",
            "So just kind of brief reminder really, and a recap of some of the things."
        ],
        [
            "Denny said if I've stolen some stuff from one of these papers in the moment so.",
            "Thanks for that, Danny.",
            "So I'm really there are two things that underlie what makes the semantic Mediawiki semantic as I see it, and any correct me if I've put a slightly different slant on this and you would have.",
            "First of all the idea that in a wiki in order Wiki we have links in Semantic Mediawiki you could have type links, i.e.",
            "You associate some semantics with the link, so that's one kind of information.",
            "Then the second kind of information.",
            "So that's the information between.",
            "Classically, the typical example page on London, the page on UK London is the capital of UK.",
            "And the other kind of information is not about a relationship between two entities not represented by pages, but a relationship.",
            "But information is simply about one entity which is called which wich in the Semantic Mediawiki parents it's called an attribute.",
            "So that would be London has a population of.",
            "A certain number.",
            "OK, so those are kind of two basic building blocks and I'll show you that show you some the simple syntax of the way that's done in a minute and the other key thing is that the semantics are informal, that people can make up their own semantics.",
            "They're not working from a predefined ontology.",
            "So it's easy to use.",
            "So, and this is something from a classic conventional wiki."
        ],
        [
            "Mediawiki and we're all familiar with this, and below is the.",
            "It is a source if you like for the 1st first paragraph and we're all familiar with the way this Magic Mediawiki.",
            "You create a link by the double brackets.",
            "K so this is the source from Semantic Mediawiki and you have."
        ],
        [
            "Type links so all that the Semantic Mediawiki does, it slightly extends the syntax so somebody can say capital of not just a link to England but capital of is associated with that link.",
            "And I don't know I took this from a paper of Denny's and I don't know if this was a typo actually or if it was meant to illustrate a point, but in one case it says capital of it.",
            "In the other case it says is capital of, but it illustrates the point that people can use slightly different term.",
            "Obviously it's best if people use if people reuse relationships where relationship the correct relationship exists, but if people do use slightly different terminology then it's possible to equate terms.",
            "Come along later and say those two terms are equivalent.",
            "I'm and then this is an attribute.",
            "This is a different different kind of information, so you can say that.",
            "The population of.",
            "Of London is so much yeah, total resin problem of London was right.",
            "Yeah in the area so that's a fairly simple, fairly simple idea.",
            "But that is how how people can actually develop a knowledge base very easily and can create knowledge without needing to know very much about formal semantics without needing to know anything about owl and etc.",
            "Sorry, is this population of attribute to create a link as well?",
            "No, no, it's it's that sorry.",
            "That was the point I was trying to make it to the.",
            "Let's go back the.",
            "Yeah, the type links are relationships between entities represented."
        ],
        [
            "As pages, the attributes are just information about an entity represented as a page, so it's a bit like.",
            "I suppose it's a bit like in RDF you can have entity, predicate, entity or entity predicate.",
            "Literal.",
            "Is that fair?",
            "Location yeah yes it should use braces actually.",
            "Closer to.",
            "2.",
            "Micro that is a link.",
            "Yeah, I mean what it actually needs to be honest and what it needs for the for the kind of people that we're dealing with, it needs a completely different approach because for the for the person there isn't a tall computer literate or doesn't want to be bothered with being with the detail.",
            "What you actually need is a WYSIWYG interface.",
            "You don't want to flip mean.",
            "None of us really want to flip, but in when we're writing things into a wiki, we don't really want to flip between what it actually looks like and the source.",
            "Which is which is what you have to do at the moment.",
            "So what you really need is a WYSIWYG interface, and you need some simple way of inserting the semantics of the links and inserting the attribute without actually writing double brackets.",
            "But, but I guess that that that will come.",
            "OK, skip again.",
            "So so anyway, so the net result is that the Spanish media where he displays the information about London, Anne Anne is able to display the relationships to other other pages and the attributes.",
            "So the way we're using that, Oh yeah, sorry.",
            "So given that, and again, I think Daddy.",
            "Maybe we went over this very quickly on on Friday because because of time."
        ],
        [
            "The once you've got the information, there's no point putting information into something unless you can get out.",
            "Again, that's the object, so there are various ways of doing that, and if you're computer illiterate, you can write a query syntax which is very similar to the basic syntax of the wiki itself.",
            "Or you can use the you can use a kind of query syntax to create a results page, so you can.",
            "You can create a page which lists all the populations of all the capital cities, say an as you as you add new capital cities or as we update the information and the pages is automatically updated.",
            "Or you can use the asset tag to put a query in a page and that and display the result of the query to the user.",
            "Actually in the page.",
            "I'm Oran, this is current working active.",
            "There's some technology called ask the wiki which provides a more friendly user interface to the end user.",
            "So if an end user wants to do a general query, he doesn't really want to write some complicated syntax or the kind of users we've got down anyway.",
            "So then he and his colleagues that cars were working on something called after the wiki, which is an easier interface really for the end user.",
            "That's sort of that's ongoing work in the active project.",
            "So I'm where we're using this in BT an obviously Wiki is a collaborative forum protects creation, and obviously it's it's.",
            "It's more efficient than emails and justice ride was."
        ],
        [
            "Saying it's just the same with our people.",
            "People are passing emails around and they're using track changes and they're getting confused about about what version of a document they've got.",
            "I'm.",
            "Yeah, So what?",
            "We're encouraging them to do is to use the Semantic Mediawiki, but going back to the point, I was making about the fact that it's not WYSIWYG.",
            "I draw back at the moment is that you can't really use it to produce a whole document because the document was good.",
            "Customers obviously have to be, well format.",
            "They have to look smart, and that's a drawback.",
            "Reader, the Semantic media wiki or wikis in general that it doesn't have formatting.",
            "So what they're doing at the moment is that they're using.",
            "We encourage them to use this technology.",
            "For parts of the documents and one particular part which is contentious and which is a problem and which is not being well done as the executive summary so, so that's that's where we started.",
            "I'm.",
            "So yeah, so.",
            "The what what they're doing in in the Semantic Mediawiki is their modeling relationships, so the kind of relationships that are people are interested in is MPLS.",
            "Is A is a technology and telecoms, so they want to know who they want to be able to model relationships.",
            "They have a page on John Smith who is one of their colleagues and who's next Pret maybe various things.",
            "So page in MPLS.",
            "John Smith is an expert in MPLS.",
            "And then you can then then you can query.",
            "OK.",
            "So um in wiki."
        ],
        [
            "As you know, you talk about categories of pages, which is is in my language I guess.",
            "Is like classes in ontologies.",
            "So what we've created is a very simple ontology.",
            "So when we started this work, Daddy was talking about micro ontologies.",
            "Could could we explain what time Micro Ontology was going to be?",
            "And I got kind of worried about this word micro Ontology.",
            "'cause like I kind of couldn't figure out quite a Micron tells you was, but then I realized that were really from referring to is just a small ontology.",
            "So we've developed a small ontology which at the moment has got four categories or four classes.",
            "Customer proposal customer issue product.",
            "I envisioned that will extend that to technology and I'm sure we'll have various other categories as we work with our with our users and for each M for each category we have a number of properties, so those are the properties we have so far for customer.",
            "So this is.",
            "This is a real system, but it's actually mocked up data B."
        ],
        [
            "'cause you'll see my name there.",
            "Obviously we can't show you the data from the relates to our real customers and our real proposal.",
            "So this data is all is all completely mocked up, but the system itself is real, so this is the way that we've designed the wiki for our users.",
            "So we have like they create a page on a particular proposal.",
            "We've given the forms based interface so they can."
        ],
        [
            "They they input the key.",
            "Various key key facts about the proposal."
        ],
        [
            "And I'm what's important here.",
            "Is that the product in this particular proposal is something called BT Net premium.",
            "So one thing they might somebody who's doing a proposal which includes BT Net premium.",
            "That person might want to say, well, there been other proposals using the same product, so using that little.",
            "Magnifying glass there they can ask the question what other proposals have actually used that?"
        ],
        [
            "Product and they come up with with with with with the proposal itself and with one other proposal.",
            "So that's the kind of querying facilities.",
            "Now that really is, I think is first base.",
            "I think, as I say, we need to use develop the ask the wiki.",
            "We need to have much better querying facilities, but that's a starter.",
            "OK, yeah.",
            "Sir."
        ],
        [
            "So I showed this when I when I did the."
        ],
        [
            "Reduction ego I think showed it in his talk as well.",
            "This is the active taskbar and this is the.",
            "This is what we're going to be using with some initial trial is to get their feedback in the next few months.",
            "Again, I think I mentioned this very brief."
        ],
        [
            "When I when I did the introductory talk, what's the point of actually knowing about context?",
            "The point is to guide to filter information.",
            "Basically for people.",
            "So what happens today if you open a word file, say, then you see a great list of the most recently open files, and if you're in a hurry, you've gotta look through a long list.",
            "But if you open in the implementation of work that we've developed.",
            "For word, here you open from context rather than just opening it generally and you see the files that are relevant to that."
        ],
        [
            "Take the context.",
            "So we've implemented this feature in Word.",
            "We've implemented the feature in PowerPoint.",
            "Where you from writing the same feature in Excel, so the whole approach is that a person is in a particular context and they information that they receive is filtered by that context.",
            "I'm."
        ],
        [
            "Various ways of doing tagging one way and again Igor show this.",
            "I think very briefly, yesterday is when we're in applications such as word and we want to tag.",
            "We've got two options we may consciously want to tag something as big.",
            "We may have a file open and we want to consciously tag that file as being in the current context, or we may just want to do tagging, just general tagging it.",
            "Just just A tag that we made up ourselves that has no relationship to context.",
            "So what we have here if you look top right, you can't see that very well, but expanded.",
            "We have we have we have two things we have contag which means I want to tag this file as being relevant to the context I'm currently in, or we have a simple tag which means I'm going to tag this file and I may use A tag which other people have used before, or I may use A tag which I've made out myself, but it's just a general tag.",
            "OK, so obviously we can have having got having you."
        ],
        [
            "Is that having given provider people without tagging facility?",
            "Then they can use that to share information and as I said earlier, what's important here is that this community of users is going to be tagging in a way which is meaningful to them, which might be quite different from the kind of ways that somebody from the outside might regard as being meaningful.",
            "So that's one way of sharing information.",
            "The other way of sharing information is through the context, so we envisage that context is not just a personal thing somehow."
        ],
        [
            "You might have personal context.",
            "I might have a context on my on on my machine which relates to, you know, to my personal finances or my career, or my or whatever.",
            "But many of my context.",
            "I'll be happy to share with my colleagues because they relate to the active project or they relate to other things in the company.",
            "So many contexts we shared.",
            "So what we've got here is a view of the active portal, which the web portal, which again Igor showed.",
            "I don't envisage actually people going the web portal very often.",
            "It's really an administration tool, but the reason I've shown it here is just to illustrate the point that you can.",
            "You can see their event that somebody has a context they are currently currently in the context active and they can see who is working currently working or sorry they can see who else it has been accessing and using that context and you can actually see what information is in that context.",
            "So if I've got a context.",
            "Relating say I had a context relating to the active summer school and John was preparing his his his presentation as well, and he shared that context.",
            "He could have a look and he could see what information I had, what information I was using in the process of developing my presentation, say.",
            "Sure.",
            "Contacts.",
            "Automatically create themselves with."
        ],
        [
            "They I mean, do you have to create your own context or are they heard?",
            "Yeah, that's the point that I was making reading the moment.",
            "Yes, you have to create your own context and I think that's fine for certain kinds of people.",
            "I could imagine that lawyers, for instance, will be very happy with that, because lawyers are very used to the idea of working on different cases, and they're very used to the idea.",
            "Of being precise and timing themselves as they you know, they switch from case to case, but most people don't want that.",
            "Most people want to automatically what they want a system which automatically knows what context they're in and which automatically guides information to them according to the context there in.",
            "So yeah, at the moment what we've got in the case study is entirely is with regard to context, is entirely manual, but the next stages is to automate, and that's what you're going to do for us in the Marco.",
            "Yeah, good.",
            "Yes, sorry I was doing.",
            "Yeah yeah.",
            "Absolutely yeah yeah yeah yeah yeah.",
            "I'm so the next the the the the next slide is a markup because this is currently working protein in progress we want also to extend this idea to email an one way that we've hypothesized that we can do is one way that we're investigating doing this is again if you can see this very well, but I use the cursor is a pointer.",
            "You can see there's a there.",
            "That there's there's a column label context so that that column label shows the context that each that each email is in.",
            "The emails are classified by context automatically.",
            "This would be an.",
            "You can actually sort on context, just as you sort on time arrival or whatever.",
            "Yeah, this is just a mock up to this at the moment is what we're a is is what we're looking to achieve here.",
            "That that is a mock up that what I said.",
            "Yeah, that's right, yeah.",
            "Yeah man.",
            "And this also is a mock up, but this is."
        ],
        [
            "Straits when users tag.",
            "We want them to be able to tag freely but we also want them the system will will suggest.",
            "What tags that that?",
            "What tags might be suitable so tags can be suggested on the basis of tags that other people have used or it can be suggested on the basis of the contents of the document.",
            "An 70 people can search therefore on tags and content and content.",
            "Yeah."
        ],
        [
            "Yeah, so um.",
            "Yes, I've said context learning is vital and the user interface is still a chance.",
            "A lot of issues in these kind of systems.",
            "A lot of issues around the user interface which are really quite quite important and the success of the technology depends not just on technology.",
            "Working under the hood if you like, but it all depends on the user interface being right.",
            "I'm and certainly in process learning.",
            "I mean there are issues around the user interface.",
            "As I said, our senior managers, they want to be able to compare what people are doing.",
            "With their idealized process is with the process as they think people are following, so there are issues about how we present the information to people.",
            "Yeah, OK, so learning Contacts and process so this is something which, which Markle didn't talk about in his presentation.",
            "But again, I'm seeing I'm stealing some slides here this time of stealing slides from Marco, so I'll let Mark know shipping if I get any of the detail wrong.",
            "So the basis of a learning for context and process is using what marker calls TNT.",
            "He's not a form explosive, but stands for time network text.",
            "Or is it text network time?",
            "I can't hear anyone.",
            "So basically there are three dimensions that feed into the learning, so you heard from Marco about text at Mark's presentation.",
            "Also talked to sorting center time as he was showing you.",
            "Show you some analysis, overtime and trends and you heard from Lisa very much about network about network analysis.",
            "So what we're doing is putting the two together in order to learn, process and to learn context so Marco has developed a database."
        ],
        [
            "Our issue is about how you do this in real time and how you do this with large.",
            "Large amounts of information coming in very quickly because we're having to deal with it with events which were happening in the machine which we have to capture.",
            "A lot of a lot of rich event information.",
            "So the basic idea is that you have an event stream come in.",
            "We have a database which is able to deal in real time to do the complex event processing and from that database you can issue queries and you can do learning.",
            "OK, I think that's what I've said here.",
            "OK so."
        ],
        [
            "Process task context.",
            "Just to illustrate really the difference in process and context."
        ],
        [
            "Ann to introduce the term tasks so typical processing BT is proposal writing.",
            "That's that's that's a key process for us.",
            "So when we when we look at that process, it breaks down into a number of tasks.",
            "So if if I'm if I'm writing a proposal, one thing I have to do is find by the next break.",
            "The tasks themselves, so that's what the individual that's what a human being thinks that he thinks of his profits process, and he thinks of tasks within the process.",
            "What the computer sees.",
            "Actually something lower level.",
            "Still computer sees events, the computer sees somebody opening a file or assembly sending an email.",
            "So the learning challenge then is to go from the events to the tasks, to the process, and where context comes in, context is something which is essentially orthogonal.",
            "To process, so the proposal writing could be the person writing the proposal could be doing this in one of a number of contexts.",
            "They might have 20 different customers they're dealing with, and each customer defines a context.",
            "So they're going through the same process, but they're going through the process in a different context.",
            "So the challenge is to learn not just the process they're in, but to learn something about the context as well.",
            "I'm so I mean the same thing applies in.",
            "If somebody is doing any vendor evaluation then the context might be the vendor or it might be the product or the client they're doing it for whatever, and again they will have a number of tasks.",
            "So what we're actually doing in terms of validation?",
            "Is with the rollout starts next month.",
            "Actually with friendly users."
        ],
        [
            "It's quite a quite a sensitive thing really, because the people we're working with are under.",
            "It's very impressive actually, when you see them working when you talk to them and they have my admiration because they work, they work extremely hard and they work under a lot of pressure.",
            "So we have to be very sensitive in the rollout and we have to be very sensitive that everything we do is in no way detrimental to their to their work.",
            "Otherwise they'll they'll, they'll just switch off and that'll be the end.",
            "So we're starting with the Group of friendly users next month, we've got some FIDE customers and they're basically people that kind of management level.",
            "And then we've got some 5 customer facing people towards the end of this year.",
            "And then we're going to have a trial of about 20 users.",
            "The end of the second year of the project.",
            "So from that will get some feedback and that feedback will inform the the development of technology in the last year of the project and then the last year project is going to be much bigger trial.",
            "Hey.",
            "So validation yeah, I'm I just wanted to say something about the obviously that I've said that."
        ],
        [
            "Salvation is at three levels.",
            "Technical challenge.",
            "There really is is actually integrating the technology, so it all works together and that's something which Igor is leading on an the organizational challenge is really understanding what's important for the organization and actually being able to measure that.",
            "So can we measure how a, whether our technology is actually meaning, means that people can produce proposals more?",
            "Quickly, can we actually measure that the proposals are any higher quality?",
            "Can we measure that is actually an improved knowledge sharing, so there's a number of challenges there.",
            "Really, some of these things are relatively hard, relatively objective things.",
            "You can measure how long it takes people to write a proposal.",
            "Some of those things are more subjective, and we need to develop with developing criteria for what quality means for proposal, so we can look and see whether proposal is of.",
            "Whether the technology helps the quality of the proposals.",
            "And then the final dimension was user assessment and again this is very subjective.",
            "But I mean that the real test of course have usability of any technology is whether people will use it, whether free."
        ],
        [
            "Whether human beings for free well on the ability to not use the technology as these people have, where they will actually use the technology, but in the in the short term we start to measure things, we start to talk we we start to talk to people and get their feedback from the technology will be logging.",
            "What they'll do will be trying to measure errors, mistakes as they use the technology will be giving online questionnaires to get to get people's response at the various stages of the technology rollout.",
            "OK, I saw Arik."
        ],
        [
            "Half of of what I've been saying, really.",
            "OK.",
            "So.",
            "What I want."
        ],
        [
            "To do this this come towards the end of the talk at the point of this slide.",
            "West to mop up a few topics which I didn't think had been covered very, very much in the George during the workshop.",
            "In fact, we had quite a bit.",
            "We've had something from yesterday, I think about security, but one of the issues in knowledge management systems is providing a degree of security without being without being heavyweight.",
            "So it's been a lot of research into security between enterprises and how you provide secure.",
            "How you provide security in business to business chains in, in, in, in, in, in in commercial relationships what we're trying to do is to develop a lightweight security so that so that people working in organisations in certain situations as Rite Aid was saying in certain situations what people are doing has to be invisible to their colleagues.",
            "In some situations that can be shared.",
            "In other situations it can, so there's some issues there.",
            "About how you develop a lightweight security, not so much of an issue in BT actually, as it is for ride, but certainly an issue in in situations where knowledge management is used.",
            "When I was talking to somebody fairly recently who works in the health sector in the UK and talking about, I just explained what I do in about about about active and she was commenting how she works in the health sector and they have to share knowledge between.",
            "Health sector and social services and education sector.",
            "Maybe knowledge about children who are at risk and one of the problems is because of this that there's there are concerns about confidentiality is one of the reasons why the knowledge isn't shared as effectively as it should be shared.",
            "Because because when when there are fears about leaks of information, then people don't share information.",
            "So that's an issue.",
            "In some knowledge management situations.",
            "In order to share information, you have to be able to do that in a way where you're confident there aren't going to be leaked, so that's that's quite an important issue.",
            "Anonymizing data, yeah.",
            "I mean, this really relates to security.",
            "Some of the data is going to be confidential.",
            "How can you anonymize data and yet it that data still be useful for data mining for machine learning purposes?",
            "Somebody was saying that I was at lunch a couple of days ago.",
            "That wasn't possible, but certainly we're having a look at to what extent that can be done.",
            "We've had a.",
            "Some some big cases in the UK recently actually where information has a very sensitive information information about UK servicemen for instance has been has been has been lost or as part of the wrong hands because it's been on the USB sticks or it's been on CD's that have been left that have been left lying around.",
            "The issue happens with government agencies or people who work for government.",
            "Government agencies and you can you can you can query the process is that these people have whereby a USB stick can be left in a public place and obviously it shouldn't happen.",
            "But I think the sort of the Pandora that is out of the box or whatever.",
            "That's wrong it anyway.",
            "The Cats out of the bag.",
            "The advent of the USB stick, the advent of tiny devices means the information is so easy to share is so easy to move around that inevitably information is going to get loss from time to time.",
            "Inevitably, is a risk of information getting into the wrong hands.",
            "Well, OK if we're passing information around, how can we make sure that if it does get into the wrong hands, then at least it's relatively safe.",
            "It isn't going to give away too much.",
            "Is it gonna wait?",
            "Give away too much?",
            "It's harmful.",
            "And the final thing I want to talk about was incentives an an here.",
            "There's a.",
            "There's a real issue with the kind of people that we're working with that really busy there, not Web 2.4 kinds of people.",
            "So how do you incentivize them?",
            "How do you incentivize them to do the kind of tagging that you want them to do so they can share information?",
            "How do we incentivize them to share knowledge and to help each other?",
            "So that's that's that's a part of our project.",
            "For the second half of the project.",
            "It's a key challenge.",
            "There's been some work done, and some of you may be familiar with this.",
            "There's been some work done, for instance by people at the University of Innsbruck.",
            "To encourage people on the web to develop simple ontologies through playing games as there's a thing called on to game which develops an ontology by kind of game playing.",
            "I mean, frankly, I've never played on to game when I heard it described.",
            "It doesn't seem to be exciting game to me, but but our people aren't very likely to play games, so there has to be other ways of getting them to share information.",
            "And I was quite interested in this context by what he, and even if only was saying, talking about getting people motivated.",
            "To make contributions to the the Galaxy Zoo and how people get motivated to do that and and how people are incentivized to to let their computers be used for things like SETI at home.",
            "So there's interesting issues about incentivization and what works for different categories of people.",
            "And sometimes it's financial.",
            "Sometimes it's about status, sometimes it's just about sense of being involved.",
            "OK, yeah, that's that's all I had to say.",
            "So yeah, any questions?",
            "Any questions about?",
            "I hope what I've done in this presentation is not just talked about the BTK study, but I hope."
        ],
        [
            "I've kind of brought together some of the themes that I that I introduced at the beginning of the three of the three days an showed how, and you've seen how the technology is being developed, and then you see in this presentation how the technology is being used in the case study.",
            "Any any final questions on this or on anything that's happened in the worship?",
            "You win the sales.",
            "People use the system.",
            "Context and everything.",
            "Would it make sense to use their mobile phones to track events from them?",
            "As you mentioned that they often communicating with clients via mobile phone and they probably have to report this manually into the.",
            "Yeah yeah.",
            "Motor spares.",
            "So actually automatically log the conversations?",
            "Yeah, yeah, that's.",
            "Yeah yeah, yeah, absolutely yeah, we haven't looked that.",
            "That's certainly possible and we haven't looked into that really through through lack of time.",
            "But yeah, I mean our B team and John Davis I think mentioned ribbon.",
            "You mentioned River didn't Sean which which is a BT now has a. I guess it's not sure.",
            "It's generally just in beta but we we have a product offering that converts voice into text.",
            "So somebody can leave a voicemail and it gets converted into a into an email.",
            "So that basic technology exists, we could use that.",
            "Yeah, yes, good point, yeah.",
            "Anymore questions.",
            "Yeah, how do you prevent abuse of the these systems for.",
            "Monitoring people that don't really want to be monitored and stuff like that because there is great potential for Big Brother here.",
            "Yeah yeah of course.",
            "OK.",
            "So the first point is we're talking about systems that are being used by BT people.",
            "We're not talking about our customers using the systems as such, but yet you're right and we're developing a kind of a code of conduct.",
            "I haven't got a slide to hand, but we've got about 6 points on it, but.",
            "The key thing is that people certainly for the trial people are going to be aware of what information is being recorded of what it's being used for.",
            "Of why it's being recorded and we have rules about sharing of information between partners and information.",
            "For instance about BT BT trialists as their as their past between the consortium for analysis.",
            "Then the information has been destroyed when it only has is only permitted to be used for the purpose that is intended to be used and has to be destroyed when it's being used.",
            "So we have a set of a set of guidelines if you like.",
            "But yeah, there is.",
            "There is a potential for Big Brother and I thought I've commented already that.",
            "The CR senior managers got quite excited at the idea of being able to see how far people were deviating from the theoretical process is.",
            "Yeah, yeah, so.",
            "I think this is an issue.",
            "I mean, our view in the UK is probably a little bit different from the view in Europe.",
            "I think I.",
            "Our view would generally be that people are using BT systems for BT business.",
            "And therefore it's reasonable that they be monitored in the same way as if you phone up a call center, then that conversation is monitored so the Agent Synacor Center, no, essentially, that their conversations interactions are being monitored.",
            "I think it's the same thing, but yeah, this is certainly an issue, and it's one which we've Commission has raised with us and in response to which we've started to develop this.",
            "This code of conduct, yeah?",
            "Because I had an idea how maybe you could.",
            "Anonymized data and still have it.",
            "Yeah, for data mining.",
            "Let's say a user logs on, yeah.",
            "And gets the session ID, which is unique and is not recorded.",
            "For this particular log on and then his activities for the day I recorded.",
            "But when he logs off.",
            "These activities are chained together by this log on ID, but this logon ID has no link to who actually logged on, so you can't really link it to specific, specific specific person, but you can still mine how the activities were performed and stuff like that.",
            "OK.",
            "In English.",
            "They definitely know which user that was, so so much information there.",
            "Could be more dangerous because in that case user may get a false sense of security deposits of privacy and but in reality it was so easy to still figure out who it actually was that this was.",
            "This would just be more dangerous than it's.",
            "Comments.",
            "Anything regarding this will be the key through for Deon Azatian.",
            "So.",
            "Physically, you are proposing, I mean part of solution, but we just need a little bit of frequency or profiling for clustering everything from 1 user with this cluster.",
            "Did you wouldn't be able to figure out why we were receiving 8.3 million euros from the European taxpayer, and that is a responsibility in which responsibility we take very seriously.",
            "I did I actually calculated that that's about 1.6 cents per per per year per person in Europe.",
            "So I hope that those of you who are, I guess you're all from the EU.",
            "I hope you feel you 1.6 sense of being a being well spent.",
            "OK, thanks."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK then let's make a start for last the last hour.",
                    "label": 0
                },
                {
                    "sent": "You also have a metal ready for still being here, I think, but so when I when I began the workshop at the summer school on Friday, seems like a very long time ago now.",
                    "label": 0
                },
                {
                    "sent": "Actually an I said that there were three case studies in the project an you've heard about one already from Accenture from RAID.",
                    "label": 0
                },
                {
                    "sent": "And so I'm going to finish off the summer school by talking about the case study in BT.",
                    "label": 1
                },
                {
                    "sent": "So there in some ways quite similar, but in some ways also quite different.",
                    "label": 0
                },
                {
                    "sent": "So as we go through our try and bring out some of the.",
                    "label": 0
                },
                {
                    "sent": "Differences in particular.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "So at the first thing to do is to make a meter comment really about case studies why?",
                    "label": 0
                },
                {
                    "sent": "And I'd be interested if if Aaron agrees with these views while.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Why do we have case studies in these kind of projects?",
                    "label": 0
                },
                {
                    "sent": "Well, I think to me there are three reasons and the most important one I guess, and they're all important, but probably the most important one is to validate the technologies and and as I said, right at the beginning, that means really development.",
                    "label": 1
                },
                {
                    "sent": "In technical terms, they actually work at the most basic technical level.",
                    "label": 0
                },
                {
                    "sent": "Detector technologies all work when they played together.",
                    "label": 0
                },
                {
                    "sent": "I'm are they usable?",
                    "label": 0
                },
                {
                    "sent": "Is the user interface right for the users?",
                    "label": 0
                },
                {
                    "sent": "And finally, do they make sense for the organization so validation of the of the technologies and feedback from that validation process into the further technology development is very important?",
                    "label": 0
                },
                {
                    "sent": "Another very important reason is to actually exploit the technologies and all three case studies in active are actually intended to produce systems which will be used within the within the three organisations.",
                    "label": 1
                },
                {
                    "sent": "And you've got that flavor.",
                    "label": 0
                },
                {
                    "sent": "You've heard that already from from ride.",
                    "label": 0
                },
                {
                    "sent": "I'm and finally I think to provide to provide examples, reference cases to use as part of our public relations as part of dissemination.",
                    "label": 0
                },
                {
                    "sent": "To illustrate to the wider community that the technologies work, they can be made to work and to encourage the uptake of the technologies outside of the active project.",
                    "label": 0
                },
                {
                    "sent": "So those are the three reasons to my mind that we actually do case studies in these kind of projects.",
                    "label": 0
                },
                {
                    "sent": "And I certainly would would echo Ariens, comment.",
                    "label": 0
                },
                {
                    "sent": "I hadn't heard that quote about gutter before, but the quote I like actually is from another famous German from Karl Marx, so I think it's on his tombstone in Highgate is something he says something like philosophers.",
                    "label": 0
                },
                {
                    "sent": "Try to understand the world.",
                    "label": 0
                },
                {
                    "sent": "The point is not just to understand it but to change it.",
                    "label": 0
                },
                {
                    "sent": "So certainly projects like active exists not just to do cool research, but to actually produce systems which work and which created economic benefit.",
                    "label": 0
                },
                {
                    "sent": "OK, so that was that was that was a meta meta comment if you like.",
                    "label": 0
                },
                {
                    "sent": "So look at what I'm going to talk about over the next hour.",
                    "label": 0
                },
                {
                    "sent": "I'm going to talk a little bit about.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Out the trialist the people were working with him BT about their needs and I would say call this.",
                    "label": 0
                },
                {
                    "sent": "I've subtitle is a Greenfield site.",
                    "label": 1
                },
                {
                    "sent": "Now this is a distinction really between the BT case study and the extension one, you might have notice on one of rides slides.",
                    "label": 0
                },
                {
                    "sent": "I don't think he drew particular attention to it, but on one of his side slides he had the word Sable, an Accenture already have an ride, maintains and expands and knowledge management system called Sable.",
                    "label": 0
                },
                {
                    "sent": "In Accenture, so in so in the active project what he's doing is building on that stable system.",
                    "label": 0
                },
                {
                    "sent": "Mary Beatty, although our trial is have many systems, they have CRM systems.",
                    "label": 0
                },
                {
                    "sent": "They have all sorts of systems have pricing systems.",
                    "label": 0
                },
                {
                    "sent": "They have an intranet of course, and they have all the things you normally expect on an intranet within an organization.",
                    "label": 0
                },
                {
                    "sent": "They don't really have in any sense an integrated knowledge management system, so our what we're doing is really creative while working in a Greenfield site.",
                    "label": 0
                },
                {
                    "sent": "That means that we've spent.",
                    "label": 0
                },
                {
                    "sent": "We've had to spend rather more time than raids had to spend rather more time investigating the needs of our users an so I'll talk a little bit about that about how we've investigated their needs.",
                    "label": 0
                },
                {
                    "sent": "Then I'll talk about our solution, how we brought the technologies together.",
                    "label": 0
                },
                {
                    "sent": "Validation I mentioned important it is.",
                    "label": 0
                },
                {
                    "sent": "I'll talk about that.",
                    "label": 0
                },
                {
                    "sent": "And then just a few words by waves of summing up and I in a few minutes at the end for questions for questions generally about about the whole active project.",
                    "label": 0
                },
                {
                    "sent": "OK, so the people we're working with people who are going to be using our technology are in a part of BT which is called BT Business, BT and.",
                    "label": 0
                },
                {
                    "sent": "That's in it, isn't it?",
                    "label": 0
                },
                {
                    "sent": "Is in BT retail, which means to say that it's concerned with cash.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Tumors in the UK second concern with small and medium sized enterprises in the UK now actually some of the medium size enterprises are quite large, so the customers that we that our people are dealing with.",
                    "label": 0
                },
                {
                    "sent": "They range from maybe a lawyer in a small town with just one office or maybe a lawyer with with a couple of offices right up to some retailers who are actually High Street names.",
                    "label": 0
                },
                {
                    "sent": "What these people want these customers are not, though, are multinationals because we have a separate part of BT which which deals with global enterprises with multinationals.",
                    "label": 0
                },
                {
                    "sent": "So the people we're working with our dealing date on a day-to-day basis.",
                    "label": 0
                },
                {
                    "sent": "They're providing services, providing telecom and ICT services for small and medium sized enterprises in the UK and the people were working with.",
                    "label": 1
                },
                {
                    "sent": "They have a variety of names they call themselves sales specialists, technical consultant, sales managers, solutions consultants.",
                    "label": 0
                },
                {
                    "sent": "But the characteristic of all of them is that they work directly and they interact directly with customers.",
                    "label": 0
                },
                {
                    "sent": "I'm and the within people within BT business there are potentially hundreds of trialists an I'll talk a little bit later about about our plan for trials and how we're going to expand from a very small number of trials up to one or 200 trials.",
                    "label": 0
                },
                {
                    "sent": "By the end of the project.",
                    "label": 0
                },
                {
                    "sent": "So, um, the the people with that we deal with and they actually spend a lot of time on the road because they because their customer facing.",
                    "label": 0
                },
                {
                    "sent": "They spend a lot of time meeting customers.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So when we started to talk then we talk to them about their working week and I users are potential users and they spend about 3 days actually on the road meeting customers and then they spend 2 days and often much of their evenings as well in their offices.",
                    "label": 0
                },
                {
                    "sent": "Really interact with customer phone of course and using a range of BT systems in order to provide services to customers in order to propose to prepare proposals for customers in order to prevent.",
                    "label": 0
                },
                {
                    "sent": "Provide our prepare designs network designs for customers.",
                    "label": 0
                },
                {
                    "sent": "I'm actually most of them work from home, and that's actually quite significant.",
                    "label": 1
                },
                {
                    "sent": "Becausw it means that they don't actually get together with their colleagues very much, particularly as we're very keen on.",
                    "label": 0
                },
                {
                    "sent": "There's a lot of cost consciousness in BT there's in current economic climate, alot of pressure to save costs.",
                    "label": 0
                },
                {
                    "sent": "So these people that they're not able to travel very much, they can travel the customers.",
                    "label": 0
                },
                {
                    "sent": "That's fine, because obviously they have customers, but.",
                    "label": 0
                },
                {
                    "sent": "We don't have the kind of.",
                    "label": 0
                },
                {
                    "sent": "Team meetings they don't have the kind of opportunities where people can come together and talk and interact very much, particularly as the people we're dealing with there that they are located right across the UK.",
                    "label": 0
                },
                {
                    "sent": "So we've got people doing a similar function in the Southwest of England right up to, you know, to Scotland, and so This is why geographical distances.",
                    "label": 0
                },
                {
                    "sent": "So the point I'm making is actually they can be quite isolated, and so they need knowledge management systems.",
                    "label": 0
                },
                {
                    "sent": "They need information systems.",
                    "label": 0
                },
                {
                    "sent": "Not just for information, but also to kind of help them interact with each other and help them exchange information with each other.",
                    "label": 0
                },
                {
                    "sent": "I'm and they use multiple systems.",
                    "label": 1
                },
                {
                    "sent": "When we started talking and observing what they did, horrendous number of systems actually, I mean at least two customer relationship management systems.",
                    "label": 0
                },
                {
                    "sent": "Just for starters.",
                    "label": 0
                },
                {
                    "sent": "All sorts of pricing design tools.",
                    "label": 1
                },
                {
                    "sent": "Obviously Ms Office or kinds of spreadsheet pricing tools, lots and lots of different systems and their forever cutting and pasting and moving information, but he just different systems and it's all very important to use these systems because.",
                    "label": 0
                },
                {
                    "sent": "Not only does is the information which is which is put into these systems used to monitor customers to monitor interaction with customers, but they're actually bonus and they are compensated according to their degree of interaction they have with customers according to the leads they get from customers and all this kind of information has been recorded on the system so incredibly motivated to use these systems because they don't get their money if they don't get it, they don't get their bonus if they don't, if they don't put all the information on the systems, but nonetheless.",
                    "label": 0
                },
                {
                    "sent": "A sort of horrendous mishmash of different systems.",
                    "label": 0
                },
                {
                    "sent": "They have to use.",
                    "label": 0
                },
                {
                    "sent": "I'm an typically they would deal with in 10s and hundreds of customers and forever therefore contact switching context switching between customers.",
                    "label": 1
                },
                {
                    "sent": "So we started off.",
                    "label": 0
                },
                {
                    "sent": "We started talking to these people.",
                    "label": 0
                },
                {
                    "sent": "We had some one to one interviews.",
                    "label": 0
                },
                {
                    "sent": "We had some focus groups.",
                    "label": 0
                },
                {
                    "sent": "We talked to the guys themselves.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, the guys in the ladies who actually directly doing the job.",
                    "label": 0
                },
                {
                    "sent": "We talked to their first line sales managers and we talked to senior managers as well so we have kind of trying to get their requirements trying to understand what they needed and trying to understand.",
                    "label": 0
                },
                {
                    "sent": "See how the picture varied between between the different levels of the organization and what different stories they had.",
                    "label": 0
                },
                {
                    "sent": "And we also did some remote job shadowing.",
                    "label": 0
                },
                {
                    "sent": "We realized we needed to observe what people are.",
                    "label": 0
                },
                {
                    "sent": "Actually it's very interesting.",
                    "label": 0
                },
                {
                    "sent": "I guess most of us don't get the opportunity to do this to actually observe people as they sit for an hour or two using IT systems and how they actually interact with the IT systems.",
                    "label": 0
                },
                {
                    "sent": "And that's quite an interesting experience an because, as I say, these people were so geographically disperse, we didn't want to keep traveling.",
                    "label": 0
                },
                {
                    "sent": "We just spent days just traveling.",
                    "label": 0
                },
                {
                    "sent": "So we what we did.",
                    "label": 0
                },
                {
                    "sent": "We did remote job shadowing.",
                    "label": 0
                },
                {
                    "sent": "We use Microsoft Communicator as a voice channel so it didn't didn't voice.",
                    "label": 0
                },
                {
                    "sent": "Channel of Microsoft Communicator, so we didn't tie up their phones an we use Microsoft Live meeting so we can view their screens.",
                    "label": 0
                },
                {
                    "sent": "So it's very interesting.",
                    "label": 0
                },
                {
                    "sent": "Use it at a room in one part of England and you can really watch and see what somebody is doing.",
                    "label": 0
                },
                {
                    "sent": "In their home, in a different part of England you can see exactly what they're doing on the screen.",
                    "label": 0
                },
                {
                    "sent": "You can hear the conversations they have when they have phone conversations and you try to be not to be too obtrusive, but you can ask questions from time to time, and so we originally conceived there.",
                    "label": 0
                },
                {
                    "sent": "My colleague in Thurlow developed this idea of using remote job shadowing because we realized it was going to be so expensive and so time consuming to actually go and visit these people, but we realized we also had another benefit.",
                    "label": 0
                },
                {
                    "sent": "Benefit as well, because it's really much less obtrusive.",
                    "label": 0
                },
                {
                    "sent": "I would say that the people forgot we were listening.",
                    "label": 0
                },
                {
                    "sent": "I hope you didn't forget, because obviously they're kind of we wouldn't want to feel that there any any confidentiality issues, but nonetheless, because we weren't in the room with him, I think there are much less that they were.",
                    "label": 0
                },
                {
                    "sent": "They were much less inhibited by our presence, and we could really see how they were using systems.",
                    "label": 0
                },
                {
                    "sent": "So we did the remote job shadowing and then we developed some ideas which we put into a concept demonstrator, just not a working prototype, but just something using PowerPoint basically and we fed that back in focus groups and we got we got feedback from that and some of the feedback was positive and some of the ideas we produce we got.",
                    "label": 1
                },
                {
                    "sent": "We got some negative feedback.",
                    "label": 0
                },
                {
                    "sent": "We had one idea about developing a new piece of software which would help them to store or to keep a track like kind of notepad that will keep track of information.",
                    "label": 0
                },
                {
                    "sent": "Context in a context sensitive way, and we've got quite a, we got a negative reaction to that because frankly, they have so many systems they just didn't want anymore system.",
                    "label": 0
                },
                {
                    "sent": "They kind of the idea of having one more piece of software on their desktop or something that they didn't want, but we got some positive feedback as well and I'll talk about that as we go through the presentation.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "So I said when I when I started at the beginning of the summer school, that and there are three major research planks.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Underlying the project and you feel a lot about them over the last three days.",
                    "label": 0
                },
                {
                    "sent": "Knowledge sharing process is and context, so we we had the intuition at the beginning of the project that these were important problems an that we had an intuition about how we would approach these problems.",
                    "label": 0
                },
                {
                    "sent": "So what we're doing in this work with the customers with the users.",
                    "label": 0
                },
                {
                    "sent": "Rather it was to develop her ideas and to refine our ideas.",
                    "label": 0
                },
                {
                    "sent": "So when we talked about knowledge sharing, we found there's one particular problem.",
                    "label": 0
                },
                {
                    "sent": "Which they they all almost all had, and which was a problem which the the the people at the ground level who are doing doing the job had, but also a problem which is of great concern to the managers into the senior managers as well.",
                    "label": 0
                },
                {
                    "sent": "And then when we talked to we talk to right and people in extension we found they had exactly the same problem.",
                    "label": 0
                },
                {
                    "sent": "An effect right is already mentioned this a lot of time with our people out of time of rides people is spent developing proposals.",
                    "label": 1
                },
                {
                    "sent": "So in rides case, it's proposal for a apiece of consultancy work.",
                    "label": 0
                },
                {
                    "sent": "In our case, it's a proposal for a piece of network design, maybe something which involves putting in a virtual private circuit, a virtual private network, something which involves some circuit design, maybe some software as well.",
                    "label": 0
                },
                {
                    "sent": "And that's doing doing that well.",
                    "label": 0
                },
                {
                    "sent": "Getting proposals to the customer quickly and getting proposals of good quality.",
                    "label": 0
                },
                {
                    "sent": "This is a real problem in a real concern.",
                    "label": 0
                },
                {
                    "sent": "And that means two things.",
                    "label": 0
                },
                {
                    "sent": "It means finding.",
                    "label": 0
                },
                {
                    "sent": "And again, this is very much echoes work right right?",
                    "label": 0
                },
                {
                    "sent": "Which was saying it means finding the right piece of information to put into the proposal.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Right appropriate means.",
                    "label": 0
                },
                {
                    "sent": "Most up-to-date, So what typically what they they do they have to?",
                    "label": 0
                },
                {
                    "sent": "They have to do a proposal, and the customer wants some some provision of something like a BlackBerry, say, so they go on the BT Internet.",
                    "label": 0
                },
                {
                    "sent": "They do a search and they find some text about BlackBerry and lo and behold, what they find may well not be the most up-to-date piece of information.",
                    "label": 0
                },
                {
                    "sent": "It may have the wrong pricing information, so there's a big issue about finding most appropriate kind of kind of kind of information.",
                    "label": 0
                },
                {
                    "sent": "And there's also an issue about finding.",
                    "label": 0
                },
                {
                    "sent": "The right expertise.",
                    "label": 0
                },
                {
                    "sent": "So typically they would have have a proposal and there are a number of questions that have to be addressed and most of the questions they can address easily, but then they left with about 6 issues, which as the individual trying to put the proposal six issues which they find difficult.",
                    "label": 0
                },
                {
                    "sent": "They can't find the right people.",
                    "label": 0
                },
                {
                    "sent": "We can't find the right information and that's that's a really big practical problem.",
                    "label": 0
                },
                {
                    "sent": "Um yeah, I'm and yeah we wanted them that the other.",
                    "label": 0
                },
                {
                    "sent": "The other requirement was to be more proactive with customers.",
                    "label": 0
                },
                {
                    "sent": "So the idea here is that somebody in the Northeast of England say that we sell to a customer in the Northeast of England.",
                    "label": 0
                },
                {
                    "sent": "We sell a solution of a particular kind, and that solution might be relevant to a customer in the Southwest.",
                    "label": 0
                },
                {
                    "sent": "Now we want to alert the salesperson, the technical consultant in the Southwest.",
                    "label": 0
                },
                {
                    "sent": "Hey, there's something here which might be right for your customer.",
                    "label": 0
                },
                {
                    "sent": "How do you do that?",
                    "label": 0
                },
                {
                    "sent": "The problem is the all the kind of obvious segmentations.",
                    "label": 0
                },
                {
                    "sent": "That people would invent the kind of taxonomies you might do it by.",
                    "label": 0
                },
                {
                    "sent": "You might do it but but but by industry sector you might say OK, here's a solution which is good for a particular industry sector.",
                    "label": 0
                },
                {
                    "sent": "Here's a solution which is good for particular size customer, those kind of segmentations might not actually be right.",
                    "label": 0
                },
                {
                    "sent": "They might not actually be meaningful to the people who are doing the job.",
                    "label": 0
                },
                {
                    "sent": "There might be other subtle subtle things which distinguish customers, which mean that a solution for this customer in one part of England is right for the customer.",
                    "label": 0
                },
                {
                    "sent": "Another part of it, then nothing to do with him being in the same sector.",
                    "label": 0
                },
                {
                    "sent": "Nothing to do with them be having the same kind of being the same kind of size organisations, but some other subtlety of of the particular customers.",
                    "label": 0
                },
                {
                    "sent": "So what we wanted to do therefore was to give people the ability to tag their to tag information in the way that was meaningful to them, and let these these people develop their own kind of their own taxonomies, their own ontologies, and not for something on them.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "And what I should say about that?",
                    "label": 0
                },
                {
                    "sent": "Another kind of social coming?",
                    "label": 0
                },
                {
                    "sent": "Really, the age profile of these people was fairly skewed towards the middle years.",
                    "label": 0
                },
                {
                    "sent": "If you like in general, they weren't, then they're not because of the way the companies involved because of the way people's career profiles of developed and so on.",
                    "label": 0
                },
                {
                    "sent": "They weren't young people in general, so most of them were not used to the kind of Web 2.0 world.",
                    "label": 0
                },
                {
                    "sent": "They weren't the kind of people who are on Facebook all the time.",
                    "label": 0
                },
                {
                    "sent": "They weren't used to tagging with with Flickr, so that's another kind of challenge really that you have you have to design something you have to give them something which is which is easy to use and you have to accept that they're not.",
                    "label": 0
                },
                {
                    "sent": "There's a sort of learning curve that perhaps when they start to do tagging, for instance, there's a learning curve, isn't there.",
                    "label": 0
                },
                {
                    "sent": "If it was, if it was, maybe young people trailer.",
                    "label": 0
                },
                {
                    "sent": "I had a college.",
                    "label": 0
                },
                {
                    "sent": "So that was knowledge sharing.",
                    "label": 1
                },
                {
                    "sent": "So then we we talked about context switching.",
                    "label": 0
                },
                {
                    "sent": "We saw we maybe have more difficulty getting the ideas across here, but we certainly saw people doing a lot.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Context switching, so typically we saw people there thinking about 1 customer customer a.",
                    "label": 1
                },
                {
                    "sent": "They're busy doing things customer 8 and then what happens?",
                    "label": 0
                },
                {
                    "sent": "They get a phone call maybe from customer B.",
                    "label": 0
                },
                {
                    "sent": "Maybe from a colleague who wants to do.",
                    "label": 0
                },
                {
                    "sent": "Or maybe their boss who wants to do some work on customer be.",
                    "label": 0
                },
                {
                    "sent": "Or maybe they get in.",
                    "label": 0
                },
                {
                    "sent": "I am something like customer.",
                    "label": 0
                },
                {
                    "sent": "We have to swap.",
                    "label": 0
                },
                {
                    "sent": "They have to switch context immediately, start forgetting Motors, stop think about customer a switch to customer base.",
                    "label": 0
                },
                {
                    "sent": "So we saw that happening all the time.",
                    "label": 0
                },
                {
                    "sent": "Yet when we ask them if they had a problem with context switching.",
                    "label": 1
                },
                {
                    "sent": "I'm the reaction was more mixed they.",
                    "label": 0
                },
                {
                    "sent": "I think they they they felt they were doing it well.",
                    "label": 0
                },
                {
                    "sent": "I'm sure that the that the technology could help them to improve, but it was a more mixed reaction.",
                    "label": 0
                },
                {
                    "sent": "But what did come out very strongly is that they needed the context switching to be more automatic.",
                    "label": 0
                },
                {
                    "sent": "So you saw Igor's presentation yesterday and you saw what we've done so far in providing the taskbar show the taskbar in a moment of game and the idea that you can switch context and you can associate.",
                    "label": 0
                },
                {
                    "sent": "You can associate information objects with context.",
                    "label": 0
                },
                {
                    "sent": "Now some kinds of users will do that, but most people want something more automatically want to be told what context they want the system to know, what context they're in, and they want the system to do things more automatically.",
                    "label": 0
                },
                {
                    "sent": "And then process again.",
                    "label": 0
                },
                {
                    "sent": "This was interesting when we talked to the people actually doing the work.",
                    "label": 0
                },
                {
                    "sent": "They kind of took the attitude.",
                    "label": 0
                },
                {
                    "sent": "Well, we know our process is and in fact they did pretty much.",
                    "label": 0
                },
                {
                    "sent": "They knew what they had to do.",
                    "label": 0
                },
                {
                    "sent": "The problem though as they go through the process is is that they each stage in the process.",
                    "label": 0
                },
                {
                    "sent": "They need information and it's actually finding the information that was difficult.",
                    "label": 0
                },
                {
                    "sent": "Rather than knowing the next step in the process.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but when we talked to senior managers so so that was kind of the reaction we're getting from from people about process in a way was kind of depressing because that was kind of suggesting that there wasn't a lot of gain in to behave in learning process is, but we then talked to senior managers and suddenly they got very excited.",
                    "label": 0
                },
                {
                    "sent": "We started somewhere process is because their take was completely different.",
                    "label": 0
                },
                {
                    "sent": "What they had a lot of theoretical process is.",
                    "label": 0
                },
                {
                    "sent": "Things have been designed that people are supposed to follow what they wanted to know.",
                    "label": 0
                },
                {
                    "sent": "It was are the people actually following.",
                    "label": 0
                },
                {
                    "sent": "Those process is to what extent do they deviate from those process is an can we optimize?",
                    "label": 0
                },
                {
                    "sent": "Can we understand what people are actually doing rather than what they should be doing?",
                    "label": 0
                },
                {
                    "sent": "And can we optimize what they're doing?",
                    "label": 0
                },
                {
                    "sent": "I'm so a lot of interest from the senior guys in process learning and process optimization, so so that was interesting and that was something we fed back to my cell and you heard myself talk yesterday?",
                    "label": 0
                },
                {
                    "sent": "Or was it yesterday wasn't about process optimization optimization, so that's something we were looking to use in the final stages of the project.",
                    "label": 0
                },
                {
                    "sent": "Um, yeah, so we're at the stage now.",
                    "label": 0
                },
                {
                    "sent": "We've actually just passed that.",
                    "label": 0
                },
                {
                    "sent": "It's a three year project.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We just passed the half year mark, about half the halfway mark, so we're at the stage where we develop the basic infrastructure that Igor talked about.",
                    "label": 0
                },
                {
                    "sent": "We've done some of the basic research and we've got a first prototype, which we're putting into the film, which we're going to be trialing in BT in the last few months of the second year of the project.",
                    "label": 0
                },
                {
                    "sent": "So we're beginning to roll something out now to trial.",
                    "label": 0
                },
                {
                    "sent": "And what we're actually starting with, starting with two things, were signing with the Semantic Mediawiki because we saw that as an opportunity to improve the process.",
                    "label": 0
                },
                {
                    "sent": "The ways in which people in which people develop proposals in particular, and the ways that they sharing knowledge in general an.",
                    "label": 0
                },
                {
                    "sent": "We're also rolling out the KWS with manual context, switching to a small number of people.",
                    "label": 1
                },
                {
                    "sent": "As I say, I think the real hit here.",
                    "label": 0
                },
                {
                    "sent": "The real advantage comes when we can.",
                    "label": 0
                },
                {
                    "sent": "We have a degree of automation where market gives us the.",
                    "label": 0
                },
                {
                    "sent": "Learning stuff and actually in the third or the project, but as an initial trial to a selected number of people were rolling out the manual context switching.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 1
                },
                {
                    "sent": "So then are in in, in in the last few months of the last six months of the projects we're starting in the second half of 20th.",
                    "label": 0
                },
                {
                    "sent": "Next year will be rolling out the OKW, the automatic, the context and process learning in the process optimization.",
                    "label": 0
                },
                {
                    "sent": "OK semantic media wiki.",
                    "label": 0
                },
                {
                    "sent": "So just kind of brief reminder really, and a recap of some of the things.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Denny said if I've stolen some stuff from one of these papers in the moment so.",
                    "label": 0
                },
                {
                    "sent": "Thanks for that, Danny.",
                    "label": 0
                },
                {
                    "sent": "So I'm really there are two things that underlie what makes the semantic Mediawiki semantic as I see it, and any correct me if I've put a slightly different slant on this and you would have.",
                    "label": 0
                },
                {
                    "sent": "First of all the idea that in a wiki in order Wiki we have links in Semantic Mediawiki you could have type links, i.e.",
                    "label": 0
                },
                {
                    "sent": "You associate some semantics with the link, so that's one kind of information.",
                    "label": 0
                },
                {
                    "sent": "Then the second kind of information.",
                    "label": 0
                },
                {
                    "sent": "So that's the information between.",
                    "label": 0
                },
                {
                    "sent": "Classically, the typical example page on London, the page on UK London is the capital of UK.",
                    "label": 0
                },
                {
                    "sent": "And the other kind of information is not about a relationship between two entities not represented by pages, but a relationship.",
                    "label": 0
                },
                {
                    "sent": "But information is simply about one entity which is called which wich in the Semantic Mediawiki parents it's called an attribute.",
                    "label": 1
                },
                {
                    "sent": "So that would be London has a population of.",
                    "label": 0
                },
                {
                    "sent": "A certain number.",
                    "label": 0
                },
                {
                    "sent": "OK, so those are kind of two basic building blocks and I'll show you that show you some the simple syntax of the way that's done in a minute and the other key thing is that the semantics are informal, that people can make up their own semantics.",
                    "label": 0
                },
                {
                    "sent": "They're not working from a predefined ontology.",
                    "label": 0
                },
                {
                    "sent": "So it's easy to use.",
                    "label": 0
                },
                {
                    "sent": "So, and this is something from a classic conventional wiki.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Mediawiki and we're all familiar with this, and below is the.",
                    "label": 0
                },
                {
                    "sent": "It is a source if you like for the 1st first paragraph and we're all familiar with the way this Magic Mediawiki.",
                    "label": 0
                },
                {
                    "sent": "You create a link by the double brackets.",
                    "label": 0
                },
                {
                    "sent": "K so this is the source from Semantic Mediawiki and you have.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Type links so all that the Semantic Mediawiki does, it slightly extends the syntax so somebody can say capital of not just a link to England but capital of is associated with that link.",
                    "label": 0
                },
                {
                    "sent": "And I don't know I took this from a paper of Denny's and I don't know if this was a typo actually or if it was meant to illustrate a point, but in one case it says capital of it.",
                    "label": 0
                },
                {
                    "sent": "In the other case it says is capital of, but it illustrates the point that people can use slightly different term.",
                    "label": 0
                },
                {
                    "sent": "Obviously it's best if people use if people reuse relationships where relationship the correct relationship exists, but if people do use slightly different terminology then it's possible to equate terms.",
                    "label": 0
                },
                {
                    "sent": "Come along later and say those two terms are equivalent.",
                    "label": 0
                },
                {
                    "sent": "I'm and then this is an attribute.",
                    "label": 0
                },
                {
                    "sent": "This is a different different kind of information, so you can say that.",
                    "label": 0
                },
                {
                    "sent": "The population of.",
                    "label": 0
                },
                {
                    "sent": "Of London is so much yeah, total resin problem of London was right.",
                    "label": 0
                },
                {
                    "sent": "Yeah in the area so that's a fairly simple, fairly simple idea.",
                    "label": 0
                },
                {
                    "sent": "But that is how how people can actually develop a knowledge base very easily and can create knowledge without needing to know very much about formal semantics without needing to know anything about owl and etc.",
                    "label": 0
                },
                {
                    "sent": "Sorry, is this population of attribute to create a link as well?",
                    "label": 0
                },
                {
                    "sent": "No, no, it's it's that sorry.",
                    "label": 0
                },
                {
                    "sent": "That was the point I was trying to make it to the.",
                    "label": 0
                },
                {
                    "sent": "Let's go back the.",
                    "label": 0
                },
                {
                    "sent": "Yeah, the type links are relationships between entities represented.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As pages, the attributes are just information about an entity represented as a page, so it's a bit like.",
                    "label": 0
                },
                {
                    "sent": "I suppose it's a bit like in RDF you can have entity, predicate, entity or entity predicate.",
                    "label": 0
                },
                {
                    "sent": "Literal.",
                    "label": 0
                },
                {
                    "sent": "Is that fair?",
                    "label": 0
                },
                {
                    "sent": "Location yeah yes it should use braces actually.",
                    "label": 0
                },
                {
                    "sent": "Closer to.",
                    "label": 0
                },
                {
                    "sent": "2.",
                    "label": 0
                },
                {
                    "sent": "Micro that is a link.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I mean what it actually needs to be honest and what it needs for the for the kind of people that we're dealing with, it needs a completely different approach because for the for the person there isn't a tall computer literate or doesn't want to be bothered with being with the detail.",
                    "label": 0
                },
                {
                    "sent": "What you actually need is a WYSIWYG interface.",
                    "label": 0
                },
                {
                    "sent": "You don't want to flip mean.",
                    "label": 0
                },
                {
                    "sent": "None of us really want to flip, but in when we're writing things into a wiki, we don't really want to flip between what it actually looks like and the source.",
                    "label": 0
                },
                {
                    "sent": "Which is which is what you have to do at the moment.",
                    "label": 0
                },
                {
                    "sent": "So what you really need is a WYSIWYG interface, and you need some simple way of inserting the semantics of the links and inserting the attribute without actually writing double brackets.",
                    "label": 0
                },
                {
                    "sent": "But, but I guess that that that will come.",
                    "label": 0
                },
                {
                    "sent": "OK, skip again.",
                    "label": 0
                },
                {
                    "sent": "So so anyway, so the net result is that the Spanish media where he displays the information about London, Anne Anne is able to display the relationships to other other pages and the attributes.",
                    "label": 0
                },
                {
                    "sent": "So the way we're using that, Oh yeah, sorry.",
                    "label": 0
                },
                {
                    "sent": "So given that, and again, I think Daddy.",
                    "label": 0
                },
                {
                    "sent": "Maybe we went over this very quickly on on Friday because because of time.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The once you've got the information, there's no point putting information into something unless you can get out.",
                    "label": 0
                },
                {
                    "sent": "Again, that's the object, so there are various ways of doing that, and if you're computer illiterate, you can write a query syntax which is very similar to the basic syntax of the wiki itself.",
                    "label": 0
                },
                {
                    "sent": "Or you can use the you can use a kind of query syntax to create a results page, so you can.",
                    "label": 0
                },
                {
                    "sent": "You can create a page which lists all the populations of all the capital cities, say an as you as you add new capital cities or as we update the information and the pages is automatically updated.",
                    "label": 0
                },
                {
                    "sent": "Or you can use the asset tag to put a query in a page and that and display the result of the query to the user.",
                    "label": 0
                },
                {
                    "sent": "Actually in the page.",
                    "label": 0
                },
                {
                    "sent": "I'm Oran, this is current working active.",
                    "label": 0
                },
                {
                    "sent": "There's some technology called ask the wiki which provides a more friendly user interface to the end user.",
                    "label": 1
                },
                {
                    "sent": "So if an end user wants to do a general query, he doesn't really want to write some complicated syntax or the kind of users we've got down anyway.",
                    "label": 0
                },
                {
                    "sent": "So then he and his colleagues that cars were working on something called after the wiki, which is an easier interface really for the end user.",
                    "label": 0
                },
                {
                    "sent": "That's sort of that's ongoing work in the active project.",
                    "label": 0
                },
                {
                    "sent": "So I'm where we're using this in BT an obviously Wiki is a collaborative forum protects creation, and obviously it's it's.",
                    "label": 0
                },
                {
                    "sent": "It's more efficient than emails and justice ride was.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Saying it's just the same with our people.",
                    "label": 0
                },
                {
                    "sent": "People are passing emails around and they're using track changes and they're getting confused about about what version of a document they've got.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "Yeah, So what?",
                    "label": 0
                },
                {
                    "sent": "We're encouraging them to do is to use the Semantic Mediawiki, but going back to the point, I was making about the fact that it's not WYSIWYG.",
                    "label": 0
                },
                {
                    "sent": "I draw back at the moment is that you can't really use it to produce a whole document because the document was good.",
                    "label": 0
                },
                {
                    "sent": "Customers obviously have to be, well format.",
                    "label": 0
                },
                {
                    "sent": "They have to look smart, and that's a drawback.",
                    "label": 0
                },
                {
                    "sent": "Reader, the Semantic media wiki or wikis in general that it doesn't have formatting.",
                    "label": 0
                },
                {
                    "sent": "So what they're doing at the moment is that they're using.",
                    "label": 0
                },
                {
                    "sent": "We encourage them to use this technology.",
                    "label": 0
                },
                {
                    "sent": "For parts of the documents and one particular part which is contentious and which is a problem and which is not being well done as the executive summary so, so that's that's where we started.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "So yeah, so.",
                    "label": 0
                },
                {
                    "sent": "The what what they're doing in in the Semantic Mediawiki is their modeling relationships, so the kind of relationships that are people are interested in is MPLS.",
                    "label": 0
                },
                {
                    "sent": "Is A is a technology and telecoms, so they want to know who they want to be able to model relationships.",
                    "label": 0
                },
                {
                    "sent": "They have a page on John Smith who is one of their colleagues and who's next Pret maybe various things.",
                    "label": 0
                },
                {
                    "sent": "So page in MPLS.",
                    "label": 0
                },
                {
                    "sent": "John Smith is an expert in MPLS.",
                    "label": 1
                },
                {
                    "sent": "And then you can then then you can query.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So um in wiki.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As you know, you talk about categories of pages, which is is in my language I guess.",
                    "label": 0
                },
                {
                    "sent": "Is like classes in ontologies.",
                    "label": 0
                },
                {
                    "sent": "So what we've created is a very simple ontology.",
                    "label": 0
                },
                {
                    "sent": "So when we started this work, Daddy was talking about micro ontologies.",
                    "label": 0
                },
                {
                    "sent": "Could could we explain what time Micro Ontology was going to be?",
                    "label": 0
                },
                {
                    "sent": "And I got kind of worried about this word micro Ontology.",
                    "label": 0
                },
                {
                    "sent": "'cause like I kind of couldn't figure out quite a Micron tells you was, but then I realized that were really from referring to is just a small ontology.",
                    "label": 0
                },
                {
                    "sent": "So we've developed a small ontology which at the moment has got four categories or four classes.",
                    "label": 0
                },
                {
                    "sent": "Customer proposal customer issue product.",
                    "label": 1
                },
                {
                    "sent": "I envisioned that will extend that to technology and I'm sure we'll have various other categories as we work with our with our users and for each M for each category we have a number of properties, so those are the properties we have so far for customer.",
                    "label": 0
                },
                {
                    "sent": "So this is.",
                    "label": 0
                },
                {
                    "sent": "This is a real system, but it's actually mocked up data B.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "'cause you'll see my name there.",
                    "label": 0
                },
                {
                    "sent": "Obviously we can't show you the data from the relates to our real customers and our real proposal.",
                    "label": 0
                },
                {
                    "sent": "So this data is all is all completely mocked up, but the system itself is real, so this is the way that we've designed the wiki for our users.",
                    "label": 0
                },
                {
                    "sent": "So we have like they create a page on a particular proposal.",
                    "label": 0
                },
                {
                    "sent": "We've given the forms based interface so they can.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "They they input the key.",
                    "label": 0
                },
                {
                    "sent": "Various key key facts about the proposal.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And I'm what's important here.",
                    "label": 0
                },
                {
                    "sent": "Is that the product in this particular proposal is something called BT Net premium.",
                    "label": 1
                },
                {
                    "sent": "So one thing they might somebody who's doing a proposal which includes BT Net premium.",
                    "label": 0
                },
                {
                    "sent": "That person might want to say, well, there been other proposals using the same product, so using that little.",
                    "label": 0
                },
                {
                    "sent": "Magnifying glass there they can ask the question what other proposals have actually used that?",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Product and they come up with with with with with the proposal itself and with one other proposal.",
                    "label": 0
                },
                {
                    "sent": "So that's the kind of querying facilities.",
                    "label": 0
                },
                {
                    "sent": "Now that really is, I think is first base.",
                    "label": 0
                },
                {
                    "sent": "I think, as I say, we need to use develop the ask the wiki.",
                    "label": 0
                },
                {
                    "sent": "We need to have much better querying facilities, but that's a starter.",
                    "label": 0
                },
                {
                    "sent": "OK, yeah.",
                    "label": 0
                },
                {
                    "sent": "Sir.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I showed this when I when I did the.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Reduction ego I think showed it in his talk as well.",
                    "label": 0
                },
                {
                    "sent": "This is the active taskbar and this is the.",
                    "label": 1
                },
                {
                    "sent": "This is what we're going to be using with some initial trial is to get their feedback in the next few months.",
                    "label": 0
                },
                {
                    "sent": "Again, I think I mentioned this very brief.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When I when I did the introductory talk, what's the point of actually knowing about context?",
                    "label": 0
                },
                {
                    "sent": "The point is to guide to filter information.",
                    "label": 0
                },
                {
                    "sent": "Basically for people.",
                    "label": 0
                },
                {
                    "sent": "So what happens today if you open a word file, say, then you see a great list of the most recently open files, and if you're in a hurry, you've gotta look through a long list.",
                    "label": 0
                },
                {
                    "sent": "But if you open in the implementation of work that we've developed.",
                    "label": 0
                },
                {
                    "sent": "For word, here you open from context rather than just opening it generally and you see the files that are relevant to that.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Take the context.",
                    "label": 0
                },
                {
                    "sent": "So we've implemented this feature in Word.",
                    "label": 0
                },
                {
                    "sent": "We've implemented the feature in PowerPoint.",
                    "label": 0
                },
                {
                    "sent": "Where you from writing the same feature in Excel, so the whole approach is that a person is in a particular context and they information that they receive is filtered by that context.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Various ways of doing tagging one way and again Igor show this.",
                    "label": 0
                },
                {
                    "sent": "I think very briefly, yesterday is when we're in applications such as word and we want to tag.",
                    "label": 0
                },
                {
                    "sent": "We've got two options we may consciously want to tag something as big.",
                    "label": 0
                },
                {
                    "sent": "We may have a file open and we want to consciously tag that file as being in the current context, or we may just want to do tagging, just general tagging it.",
                    "label": 0
                },
                {
                    "sent": "Just just A tag that we made up ourselves that has no relationship to context.",
                    "label": 0
                },
                {
                    "sent": "So what we have here if you look top right, you can't see that very well, but expanded.",
                    "label": 0
                },
                {
                    "sent": "We have we have we have two things we have contag which means I want to tag this file as being relevant to the context I'm currently in, or we have a simple tag which means I'm going to tag this file and I may use A tag which other people have used before, or I may use A tag which I've made out myself, but it's just a general tag.",
                    "label": 0
                },
                {
                    "sent": "OK, so obviously we can have having got having you.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is that having given provider people without tagging facility?",
                    "label": 0
                },
                {
                    "sent": "Then they can use that to share information and as I said earlier, what's important here is that this community of users is going to be tagging in a way which is meaningful to them, which might be quite different from the kind of ways that somebody from the outside might regard as being meaningful.",
                    "label": 0
                },
                {
                    "sent": "So that's one way of sharing information.",
                    "label": 0
                },
                {
                    "sent": "The other way of sharing information is through the context, so we envisage that context is not just a personal thing somehow.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You might have personal context.",
                    "label": 0
                },
                {
                    "sent": "I might have a context on my on on my machine which relates to, you know, to my personal finances or my career, or my or whatever.",
                    "label": 0
                },
                {
                    "sent": "But many of my context.",
                    "label": 0
                },
                {
                    "sent": "I'll be happy to share with my colleagues because they relate to the active project or they relate to other things in the company.",
                    "label": 0
                },
                {
                    "sent": "So many contexts we shared.",
                    "label": 0
                },
                {
                    "sent": "So what we've got here is a view of the active portal, which the web portal, which again Igor showed.",
                    "label": 0
                },
                {
                    "sent": "I don't envisage actually people going the web portal very often.",
                    "label": 0
                },
                {
                    "sent": "It's really an administration tool, but the reason I've shown it here is just to illustrate the point that you can.",
                    "label": 0
                },
                {
                    "sent": "You can see their event that somebody has a context they are currently currently in the context active and they can see who is working currently working or sorry they can see who else it has been accessing and using that context and you can actually see what information is in that context.",
                    "label": 0
                },
                {
                    "sent": "So if I've got a context.",
                    "label": 0
                },
                {
                    "sent": "Relating say I had a context relating to the active summer school and John was preparing his his his presentation as well, and he shared that context.",
                    "label": 0
                },
                {
                    "sent": "He could have a look and he could see what information I had, what information I was using in the process of developing my presentation, say.",
                    "label": 0
                },
                {
                    "sent": "Sure.",
                    "label": 0
                },
                {
                    "sent": "Contacts.",
                    "label": 0
                },
                {
                    "sent": "Automatically create themselves with.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "They I mean, do you have to create your own context or are they heard?",
                    "label": 0
                },
                {
                    "sent": "Yeah, that's the point that I was making reading the moment.",
                    "label": 0
                },
                {
                    "sent": "Yes, you have to create your own context and I think that's fine for certain kinds of people.",
                    "label": 0
                },
                {
                    "sent": "I could imagine that lawyers, for instance, will be very happy with that, because lawyers are very used to the idea of working on different cases, and they're very used to the idea.",
                    "label": 0
                },
                {
                    "sent": "Of being precise and timing themselves as they you know, they switch from case to case, but most people don't want that.",
                    "label": 0
                },
                {
                    "sent": "Most people want to automatically what they want a system which automatically knows what context they're in and which automatically guides information to them according to the context there in.",
                    "label": 0
                },
                {
                    "sent": "So yeah, at the moment what we've got in the case study is entirely is with regard to context, is entirely manual, but the next stages is to automate, and that's what you're going to do for us in the Marco.",
                    "label": 0
                },
                {
                    "sent": "Yeah, good.",
                    "label": 0
                },
                {
                    "sent": "Yes, sorry I was doing.",
                    "label": 0
                },
                {
                    "sent": "Yeah yeah.",
                    "label": 0
                },
                {
                    "sent": "Absolutely yeah yeah yeah yeah yeah.",
                    "label": 0
                },
                {
                    "sent": "I'm so the next the the the the next slide is a markup because this is currently working protein in progress we want also to extend this idea to email an one way that we've hypothesized that we can do is one way that we're investigating doing this is again if you can see this very well, but I use the cursor is a pointer.",
                    "label": 0
                },
                {
                    "sent": "You can see there's a there.",
                    "label": 0
                },
                {
                    "sent": "That there's there's a column label context so that that column label shows the context that each that each email is in.",
                    "label": 0
                },
                {
                    "sent": "The emails are classified by context automatically.",
                    "label": 1
                },
                {
                    "sent": "This would be an.",
                    "label": 0
                },
                {
                    "sent": "You can actually sort on context, just as you sort on time arrival or whatever.",
                    "label": 0
                },
                {
                    "sent": "Yeah, this is just a mock up to this at the moment is what we're a is is what we're looking to achieve here.",
                    "label": 0
                },
                {
                    "sent": "That that is a mock up that what I said.",
                    "label": 0
                },
                {
                    "sent": "Yeah, that's right, yeah.",
                    "label": 0
                },
                {
                    "sent": "Yeah man.",
                    "label": 0
                },
                {
                    "sent": "And this also is a mock up, but this is.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Straits when users tag.",
                    "label": 0
                },
                {
                    "sent": "We want them to be able to tag freely but we also want them the system will will suggest.",
                    "label": 0
                },
                {
                    "sent": "What tags that that?",
                    "label": 0
                },
                {
                    "sent": "What tags might be suitable so tags can be suggested on the basis of tags that other people have used or it can be suggested on the basis of the contents of the document.",
                    "label": 0
                },
                {
                    "sent": "An 70 people can search therefore on tags and content and content.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, so um.",
                    "label": 0
                },
                {
                    "sent": "Yes, I've said context learning is vital and the user interface is still a chance.",
                    "label": 1
                },
                {
                    "sent": "A lot of issues in these kind of systems.",
                    "label": 0
                },
                {
                    "sent": "A lot of issues around the user interface which are really quite quite important and the success of the technology depends not just on technology.",
                    "label": 0
                },
                {
                    "sent": "Working under the hood if you like, but it all depends on the user interface being right.",
                    "label": 1
                },
                {
                    "sent": "I'm and certainly in process learning.",
                    "label": 0
                },
                {
                    "sent": "I mean there are issues around the user interface.",
                    "label": 0
                },
                {
                    "sent": "As I said, our senior managers, they want to be able to compare what people are doing.",
                    "label": 0
                },
                {
                    "sent": "With their idealized process is with the process as they think people are following, so there are issues about how we present the information to people.",
                    "label": 0
                },
                {
                    "sent": "Yeah, OK, so learning Contacts and process so this is something which, which Markle didn't talk about in his presentation.",
                    "label": 0
                },
                {
                    "sent": "But again, I'm seeing I'm stealing some slides here this time of stealing slides from Marco, so I'll let Mark know shipping if I get any of the detail wrong.",
                    "label": 1
                },
                {
                    "sent": "So the basis of a learning for context and process is using what marker calls TNT.",
                    "label": 0
                },
                {
                    "sent": "He's not a form explosive, but stands for time network text.",
                    "label": 0
                },
                {
                    "sent": "Or is it text network time?",
                    "label": 0
                },
                {
                    "sent": "I can't hear anyone.",
                    "label": 0
                },
                {
                    "sent": "So basically there are three dimensions that feed into the learning, so you heard from Marco about text at Mark's presentation.",
                    "label": 0
                },
                {
                    "sent": "Also talked to sorting center time as he was showing you.",
                    "label": 0
                },
                {
                    "sent": "Show you some analysis, overtime and trends and you heard from Lisa very much about network about network analysis.",
                    "label": 0
                },
                {
                    "sent": "So what we're doing is putting the two together in order to learn, process and to learn context so Marco has developed a database.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our issue is about how you do this in real time and how you do this with large.",
                    "label": 0
                },
                {
                    "sent": "Large amounts of information coming in very quickly because we're having to deal with it with events which were happening in the machine which we have to capture.",
                    "label": 0
                },
                {
                    "sent": "A lot of a lot of rich event information.",
                    "label": 0
                },
                {
                    "sent": "So the basic idea is that you have an event stream come in.",
                    "label": 0
                },
                {
                    "sent": "We have a database which is able to deal in real time to do the complex event processing and from that database you can issue queries and you can do learning.",
                    "label": 0
                },
                {
                    "sent": "OK, I think that's what I've said here.",
                    "label": 0
                },
                {
                    "sent": "OK so.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Process task context.",
                    "label": 0
                },
                {
                    "sent": "Just to illustrate really the difference in process and context.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ann to introduce the term tasks so typical processing BT is proposal writing.",
                    "label": 0
                },
                {
                    "sent": "That's that's that's a key process for us.",
                    "label": 0
                },
                {
                    "sent": "So when we when we look at that process, it breaks down into a number of tasks.",
                    "label": 0
                },
                {
                    "sent": "So if if I'm if I'm writing a proposal, one thing I have to do is find by the next break.",
                    "label": 0
                },
                {
                    "sent": "The tasks themselves, so that's what the individual that's what a human being thinks that he thinks of his profits process, and he thinks of tasks within the process.",
                    "label": 0
                },
                {
                    "sent": "What the computer sees.",
                    "label": 0
                },
                {
                    "sent": "Actually something lower level.",
                    "label": 0
                },
                {
                    "sent": "Still computer sees events, the computer sees somebody opening a file or assembly sending an email.",
                    "label": 0
                },
                {
                    "sent": "So the learning challenge then is to go from the events to the tasks, to the process, and where context comes in, context is something which is essentially orthogonal.",
                    "label": 0
                },
                {
                    "sent": "To process, so the proposal writing could be the person writing the proposal could be doing this in one of a number of contexts.",
                    "label": 0
                },
                {
                    "sent": "They might have 20 different customers they're dealing with, and each customer defines a context.",
                    "label": 0
                },
                {
                    "sent": "So they're going through the same process, but they're going through the process in a different context.",
                    "label": 0
                },
                {
                    "sent": "So the challenge is to learn not just the process they're in, but to learn something about the context as well.",
                    "label": 0
                },
                {
                    "sent": "I'm so I mean the same thing applies in.",
                    "label": 0
                },
                {
                    "sent": "If somebody is doing any vendor evaluation then the context might be the vendor or it might be the product or the client they're doing it for whatever, and again they will have a number of tasks.",
                    "label": 0
                },
                {
                    "sent": "So what we're actually doing in terms of validation?",
                    "label": 0
                },
                {
                    "sent": "Is with the rollout starts next month.",
                    "label": 0
                },
                {
                    "sent": "Actually with friendly users.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's quite a quite a sensitive thing really, because the people we're working with are under.",
                    "label": 0
                },
                {
                    "sent": "It's very impressive actually, when you see them working when you talk to them and they have my admiration because they work, they work extremely hard and they work under a lot of pressure.",
                    "label": 0
                },
                {
                    "sent": "So we have to be very sensitive in the rollout and we have to be very sensitive that everything we do is in no way detrimental to their to their work.",
                    "label": 0
                },
                {
                    "sent": "Otherwise they'll they'll, they'll just switch off and that'll be the end.",
                    "label": 0
                },
                {
                    "sent": "So we're starting with the Group of friendly users next month, we've got some FIDE customers and they're basically people that kind of management level.",
                    "label": 1
                },
                {
                    "sent": "And then we've got some 5 customer facing people towards the end of this year.",
                    "label": 0
                },
                {
                    "sent": "And then we're going to have a trial of about 20 users.",
                    "label": 0
                },
                {
                    "sent": "The end of the second year of the project.",
                    "label": 0
                },
                {
                    "sent": "So from that will get some feedback and that feedback will inform the the development of technology in the last year of the project and then the last year project is going to be much bigger trial.",
                    "label": 0
                },
                {
                    "sent": "Hey.",
                    "label": 0
                },
                {
                    "sent": "So validation yeah, I'm I just wanted to say something about the obviously that I've said that.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Salvation is at three levels.",
                    "label": 0
                },
                {
                    "sent": "Technical challenge.",
                    "label": 0
                },
                {
                    "sent": "There really is is actually integrating the technology, so it all works together and that's something which Igor is leading on an the organizational challenge is really understanding what's important for the organization and actually being able to measure that.",
                    "label": 0
                },
                {
                    "sent": "So can we measure how a, whether our technology is actually meaning, means that people can produce proposals more?",
                    "label": 0
                },
                {
                    "sent": "Quickly, can we actually measure that the proposals are any higher quality?",
                    "label": 0
                },
                {
                    "sent": "Can we measure that is actually an improved knowledge sharing, so there's a number of challenges there.",
                    "label": 1
                },
                {
                    "sent": "Really, some of these things are relatively hard, relatively objective things.",
                    "label": 0
                },
                {
                    "sent": "You can measure how long it takes people to write a proposal.",
                    "label": 0
                },
                {
                    "sent": "Some of those things are more subjective, and we need to develop with developing criteria for what quality means for proposal, so we can look and see whether proposal is of.",
                    "label": 0
                },
                {
                    "sent": "Whether the technology helps the quality of the proposals.",
                    "label": 1
                },
                {
                    "sent": "And then the final dimension was user assessment and again this is very subjective.",
                    "label": 0
                },
                {
                    "sent": "But I mean that the real test of course have usability of any technology is whether people will use it, whether free.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Whether human beings for free well on the ability to not use the technology as these people have, where they will actually use the technology, but in the in the short term we start to measure things, we start to talk we we start to talk to people and get their feedback from the technology will be logging.",
                    "label": 0
                },
                {
                    "sent": "What they'll do will be trying to measure errors, mistakes as they use the technology will be giving online questionnaires to get to get people's response at the various stages of the technology rollout.",
                    "label": 0
                },
                {
                    "sent": "OK, I saw Arik.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Half of of what I've been saying, really.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "What I want.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To do this this come towards the end of the talk at the point of this slide.",
                    "label": 0
                },
                {
                    "sent": "West to mop up a few topics which I didn't think had been covered very, very much in the George during the workshop.",
                    "label": 1
                },
                {
                    "sent": "In fact, we had quite a bit.",
                    "label": 0
                },
                {
                    "sent": "We've had something from yesterday, I think about security, but one of the issues in knowledge management systems is providing a degree of security without being without being heavyweight.",
                    "label": 0
                },
                {
                    "sent": "So it's been a lot of research into security between enterprises and how you provide secure.",
                    "label": 0
                },
                {
                    "sent": "How you provide security in business to business chains in, in, in, in, in, in in commercial relationships what we're trying to do is to develop a lightweight security so that so that people working in organisations in certain situations as Rite Aid was saying in certain situations what people are doing has to be invisible to their colleagues.",
                    "label": 0
                },
                {
                    "sent": "In some situations that can be shared.",
                    "label": 0
                },
                {
                    "sent": "In other situations it can, so there's some issues there.",
                    "label": 0
                },
                {
                    "sent": "About how you develop a lightweight security, not so much of an issue in BT actually, as it is for ride, but certainly an issue in in situations where knowledge management is used.",
                    "label": 0
                },
                {
                    "sent": "When I was talking to somebody fairly recently who works in the health sector in the UK and talking about, I just explained what I do in about about about active and she was commenting how she works in the health sector and they have to share knowledge between.",
                    "label": 0
                },
                {
                    "sent": "Health sector and social services and education sector.",
                    "label": 0
                },
                {
                    "sent": "Maybe knowledge about children who are at risk and one of the problems is because of this that there's there are concerns about confidentiality is one of the reasons why the knowledge isn't shared as effectively as it should be shared.",
                    "label": 0
                },
                {
                    "sent": "Because because when when there are fears about leaks of information, then people don't share information.",
                    "label": 0
                },
                {
                    "sent": "So that's an issue.",
                    "label": 0
                },
                {
                    "sent": "In some knowledge management situations.",
                    "label": 0
                },
                {
                    "sent": "In order to share information, you have to be able to do that in a way where you're confident there aren't going to be leaked, so that's that's quite an important issue.",
                    "label": 0
                },
                {
                    "sent": "Anonymizing data, yeah.",
                    "label": 0
                },
                {
                    "sent": "I mean, this really relates to security.",
                    "label": 0
                },
                {
                    "sent": "Some of the data is going to be confidential.",
                    "label": 0
                },
                {
                    "sent": "How can you anonymize data and yet it that data still be useful for data mining for machine learning purposes?",
                    "label": 1
                },
                {
                    "sent": "Somebody was saying that I was at lunch a couple of days ago.",
                    "label": 0
                },
                {
                    "sent": "That wasn't possible, but certainly we're having a look at to what extent that can be done.",
                    "label": 0
                },
                {
                    "sent": "We've had a.",
                    "label": 0
                },
                {
                    "sent": "Some some big cases in the UK recently actually where information has a very sensitive information information about UK servicemen for instance has been has been has been lost or as part of the wrong hands because it's been on the USB sticks or it's been on CD's that have been left that have been left lying around.",
                    "label": 0
                },
                {
                    "sent": "The issue happens with government agencies or people who work for government.",
                    "label": 0
                },
                {
                    "sent": "Government agencies and you can you can you can query the process is that these people have whereby a USB stick can be left in a public place and obviously it shouldn't happen.",
                    "label": 0
                },
                {
                    "sent": "But I think the sort of the Pandora that is out of the box or whatever.",
                    "label": 0
                },
                {
                    "sent": "That's wrong it anyway.",
                    "label": 0
                },
                {
                    "sent": "The Cats out of the bag.",
                    "label": 0
                },
                {
                    "sent": "The advent of the USB stick, the advent of tiny devices means the information is so easy to share is so easy to move around that inevitably information is going to get loss from time to time.",
                    "label": 0
                },
                {
                    "sent": "Inevitably, is a risk of information getting into the wrong hands.",
                    "label": 0
                },
                {
                    "sent": "Well, OK if we're passing information around, how can we make sure that if it does get into the wrong hands, then at least it's relatively safe.",
                    "label": 0
                },
                {
                    "sent": "It isn't going to give away too much.",
                    "label": 0
                },
                {
                    "sent": "Is it gonna wait?",
                    "label": 0
                },
                {
                    "sent": "Give away too much?",
                    "label": 0
                },
                {
                    "sent": "It's harmful.",
                    "label": 0
                },
                {
                    "sent": "And the final thing I want to talk about was incentives an an here.",
                    "label": 0
                },
                {
                    "sent": "There's a.",
                    "label": 0
                },
                {
                    "sent": "There's a real issue with the kind of people that we're working with that really busy there, not Web 2.4 kinds of people.",
                    "label": 0
                },
                {
                    "sent": "So how do you incentivize them?",
                    "label": 0
                },
                {
                    "sent": "How do you incentivize them to do the kind of tagging that you want them to do so they can share information?",
                    "label": 0
                },
                {
                    "sent": "How do we incentivize them to share knowledge and to help each other?",
                    "label": 0
                },
                {
                    "sent": "So that's that's that's a part of our project.",
                    "label": 0
                },
                {
                    "sent": "For the second half of the project.",
                    "label": 0
                },
                {
                    "sent": "It's a key challenge.",
                    "label": 0
                },
                {
                    "sent": "There's been some work done, and some of you may be familiar with this.",
                    "label": 0
                },
                {
                    "sent": "There's been some work done, for instance by people at the University of Innsbruck.",
                    "label": 0
                },
                {
                    "sent": "To encourage people on the web to develop simple ontologies through playing games as there's a thing called on to game which develops an ontology by kind of game playing.",
                    "label": 0
                },
                {
                    "sent": "I mean, frankly, I've never played on to game when I heard it described.",
                    "label": 0
                },
                {
                    "sent": "It doesn't seem to be exciting game to me, but but our people aren't very likely to play games, so there has to be other ways of getting them to share information.",
                    "label": 0
                },
                {
                    "sent": "And I was quite interested in this context by what he, and even if only was saying, talking about getting people motivated.",
                    "label": 0
                },
                {
                    "sent": "To make contributions to the the Galaxy Zoo and how people get motivated to do that and and how people are incentivized to to let their computers be used for things like SETI at home.",
                    "label": 0
                },
                {
                    "sent": "So there's interesting issues about incentivization and what works for different categories of people.",
                    "label": 0
                },
                {
                    "sent": "And sometimes it's financial.",
                    "label": 0
                },
                {
                    "sent": "Sometimes it's about status, sometimes it's just about sense of being involved.",
                    "label": 0
                },
                {
                    "sent": "OK, yeah, that's that's all I had to say.",
                    "label": 0
                },
                {
                    "sent": "So yeah, any questions?",
                    "label": 0
                },
                {
                    "sent": "Any questions about?",
                    "label": 0
                },
                {
                    "sent": "I hope what I've done in this presentation is not just talked about the BTK study, but I hope.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I've kind of brought together some of the themes that I that I introduced at the beginning of the three of the three days an showed how, and you've seen how the technology is being developed, and then you see in this presentation how the technology is being used in the case study.",
                    "label": 0
                },
                {
                    "sent": "Any any final questions on this or on anything that's happened in the worship?",
                    "label": 0
                },
                {
                    "sent": "You win the sales.",
                    "label": 0
                },
                {
                    "sent": "People use the system.",
                    "label": 0
                },
                {
                    "sent": "Context and everything.",
                    "label": 0
                },
                {
                    "sent": "Would it make sense to use their mobile phones to track events from them?",
                    "label": 0
                },
                {
                    "sent": "As you mentioned that they often communicating with clients via mobile phone and they probably have to report this manually into the.",
                    "label": 0
                },
                {
                    "sent": "Yeah yeah.",
                    "label": 0
                },
                {
                    "sent": "Motor spares.",
                    "label": 0
                },
                {
                    "sent": "So actually automatically log the conversations?",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah, that's.",
                    "label": 0
                },
                {
                    "sent": "Yeah yeah, yeah, absolutely yeah, we haven't looked that.",
                    "label": 0
                },
                {
                    "sent": "That's certainly possible and we haven't looked into that really through through lack of time.",
                    "label": 0
                },
                {
                    "sent": "But yeah, I mean our B team and John Davis I think mentioned ribbon.",
                    "label": 0
                },
                {
                    "sent": "You mentioned River didn't Sean which which is a BT now has a. I guess it's not sure.",
                    "label": 0
                },
                {
                    "sent": "It's generally just in beta but we we have a product offering that converts voice into text.",
                    "label": 0
                },
                {
                    "sent": "So somebody can leave a voicemail and it gets converted into a into an email.",
                    "label": 0
                },
                {
                    "sent": "So that basic technology exists, we could use that.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yes, good point, yeah.",
                    "label": 0
                },
                {
                    "sent": "Anymore questions.",
                    "label": 0
                },
                {
                    "sent": "Yeah, how do you prevent abuse of the these systems for.",
                    "label": 0
                },
                {
                    "sent": "Monitoring people that don't really want to be monitored and stuff like that because there is great potential for Big Brother here.",
                    "label": 0
                },
                {
                    "sent": "Yeah yeah of course.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So the first point is we're talking about systems that are being used by BT people.",
                    "label": 0
                },
                {
                    "sent": "We're not talking about our customers using the systems as such, but yet you're right and we're developing a kind of a code of conduct.",
                    "label": 0
                },
                {
                    "sent": "I haven't got a slide to hand, but we've got about 6 points on it, but.",
                    "label": 0
                },
                {
                    "sent": "The key thing is that people certainly for the trial people are going to be aware of what information is being recorded of what it's being used for.",
                    "label": 0
                },
                {
                    "sent": "Of why it's being recorded and we have rules about sharing of information between partners and information.",
                    "label": 0
                },
                {
                    "sent": "For instance about BT BT trialists as their as their past between the consortium for analysis.",
                    "label": 0
                },
                {
                    "sent": "Then the information has been destroyed when it only has is only permitted to be used for the purpose that is intended to be used and has to be destroyed when it's being used.",
                    "label": 0
                },
                {
                    "sent": "So we have a set of a set of guidelines if you like.",
                    "label": 0
                },
                {
                    "sent": "But yeah, there is.",
                    "label": 0
                },
                {
                    "sent": "There is a potential for Big Brother and I thought I've commented already that.",
                    "label": 0
                },
                {
                    "sent": "The CR senior managers got quite excited at the idea of being able to see how far people were deviating from the theoretical process is.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah, so.",
                    "label": 0
                },
                {
                    "sent": "I think this is an issue.",
                    "label": 0
                },
                {
                    "sent": "I mean, our view in the UK is probably a little bit different from the view in Europe.",
                    "label": 0
                },
                {
                    "sent": "I think I.",
                    "label": 0
                },
                {
                    "sent": "Our view would generally be that people are using BT systems for BT business.",
                    "label": 0
                },
                {
                    "sent": "And therefore it's reasonable that they be monitored in the same way as if you phone up a call center, then that conversation is monitored so the Agent Synacor Center, no, essentially, that their conversations interactions are being monitored.",
                    "label": 0
                },
                {
                    "sent": "I think it's the same thing, but yeah, this is certainly an issue, and it's one which we've Commission has raised with us and in response to which we've started to develop this.",
                    "label": 0
                },
                {
                    "sent": "This code of conduct, yeah?",
                    "label": 0
                },
                {
                    "sent": "Because I had an idea how maybe you could.",
                    "label": 0
                },
                {
                    "sent": "Anonymized data and still have it.",
                    "label": 0
                },
                {
                    "sent": "Yeah, for data mining.",
                    "label": 0
                },
                {
                    "sent": "Let's say a user logs on, yeah.",
                    "label": 0
                },
                {
                    "sent": "And gets the session ID, which is unique and is not recorded.",
                    "label": 0
                },
                {
                    "sent": "For this particular log on and then his activities for the day I recorded.",
                    "label": 0
                },
                {
                    "sent": "But when he logs off.",
                    "label": 0
                },
                {
                    "sent": "These activities are chained together by this log on ID, but this logon ID has no link to who actually logged on, so you can't really link it to specific, specific specific person, but you can still mine how the activities were performed and stuff like that.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "In English.",
                    "label": 0
                },
                {
                    "sent": "They definitely know which user that was, so so much information there.",
                    "label": 0
                },
                {
                    "sent": "Could be more dangerous because in that case user may get a false sense of security deposits of privacy and but in reality it was so easy to still figure out who it actually was that this was.",
                    "label": 0
                },
                {
                    "sent": "This would just be more dangerous than it's.",
                    "label": 0
                },
                {
                    "sent": "Comments.",
                    "label": 0
                },
                {
                    "sent": "Anything regarding this will be the key through for Deon Azatian.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Physically, you are proposing, I mean part of solution, but we just need a little bit of frequency or profiling for clustering everything from 1 user with this cluster.",
                    "label": 0
                },
                {
                    "sent": "Did you wouldn't be able to figure out why we were receiving 8.3 million euros from the European taxpayer, and that is a responsibility in which responsibility we take very seriously.",
                    "label": 0
                },
                {
                    "sent": "I did I actually calculated that that's about 1.6 cents per per per year per person in Europe.",
                    "label": 0
                },
                {
                    "sent": "So I hope that those of you who are, I guess you're all from the EU.",
                    "label": 0
                },
                {
                    "sent": "I hope you feel you 1.6 sense of being a being well spent.",
                    "label": 0
                },
                {
                    "sent": "OK, thanks.",
                    "label": 0
                }
            ]
        }
    }
}