{
    "id": "vvj5hhtgmnr7ifwyztignz7zfh2hgxn7",
    "title": "Political Polarization on Twitter",
    "info": {
        "author": [
            "Michael Conover, School of Informatics and Computing, Indiana University"
        ],
        "published": "Aug. 18, 2011",
        "recorded": "July 2011",
        "category": [
            "Top->Computer Science->Social Media"
        ]
    },
    "url": "http://videolectures.net/icwsm2011_conover_polarization/",
    "segmentation": [
        [
            "My name is Mike Connor from Indiana University and I'm going to talk about how communication technologies can shape the structure of the public sphere."
        ],
        [
            "So one of the.",
            "Principles of a deliberative democracy where we talk and make decisions about how.",
            "To shape the future of a country is that we need a broadly informed public who has exposure.",
            "To a wide range of experiences so that we can reflect and know our fellow citizens and make informed decisions about policy.",
            "One of the concerns about new technologies, or that they make it very easy to be exposed only to opinions and people and information that reflect views that you already hold.",
            "If you think about Amazon Book recommendation makes it very easy to read books that are similar to the books you've already read.",
            "Google customize search results will tailor things to your interests that you already have.",
            "Friend recommendation in social networks makes it very easy to meet people who already know the people you know.",
            "And so the problem with this is that when you're only exposed to very homogeneous view of the world, your views are likely to become more extreme as a result of not being exposed to credible opposing opinions and their social incentives to stake out a more extreme position and so."
        ],
        [
            "We were working on a project called Truthi which looks."
        ],
        [
            "Diffusion of information in the Twitter space and here we have visualizations.",
            "These diffusion networks that arose as a result of this project and a very characteristic structure ricord when we were looking at these and you see this biclustering, we have retweet edges in blue and mentions in orange and these are each of the hashtags are all the tweets associated with the hashtags you see at the bottom here and we have two communities of users who preferentially rebroadcast content.",
            "Produced by other individuals within that community, but who are connecting across the divide using mentions.",
            "And so we saw this structure at the atomic level and a question that we wanted to know was does this exist in the aggregate?",
            "And so we took.",
            "Olive.",
            "Now let's say 55 political hashtags that we discovered using a simple algorithm relating to political content and aggregating them all together over the six week.",
            "Preceding the 2010 midterm congressional elections, we found a network whose largest connected component had approximately 22,000 individuals sharing about 250,000 tweets, and this structure persists.",
            "We have two communities of users.",
            "Who interact with one another using mentions, but who do not rebroadcast content produced in this other."
        ],
        [
            "Community.",
            "So a natural question to ask is, do these communities correspond to our understanding of the partisan political?"
        ],
        [
            "Spectrum in the US.",
            "R. We don't want to ask that question yet though.",
            "If we tease these two networks apart and treat these as different communication modalities, we see that the effect is even more pronounced for the retweet network.",
            "We can cluster this and find two well defined communities.",
            "But Dimension Network does not exhibit any clustering in this by structured way or very little clustering in this price structured way, it's dominated by a single large community, and so the question we want to ask now is whether these retweet communities have a political interpretation.",
            "And so a question like this help we come up against the limits of quantitative reasoning.",
            "And so you have to turn to methods from the social Sciences and qualitative analysis to give you a lens on the question you really want to answer.",
            "And so we use a technique called."
        ],
        [
            "Qualitative content analysis to examine the body of the tweets produced by users in these communities from those six weeks preceding the election, and we had two authors working independently of one another.",
            "Annotate 1000 people and make the decision.",
            "Does the content of this person's Tweet Express a left, right, or UN decidable political ideology?",
            "We then compared those annotations to a subset annotated by and an author judge.",
            "Somebody not associated with the study, working totally independent of us to help us know that somebody, anybody in this audience could look at the same data we did and then use our rubric to arrive at the same conclusions.",
            "And so we compute, you want to look at precision and recall accuracy or the method measure from the social Sciences.",
            "Cohens Kappa Inter annotator agreement for the left and right classes is very high, nearly perfect for this on decidable class.",
            "It's a little harder, but it's still quite good, and so we see that in fact here we have the annotated users color to.",
            "So according to whether they're left or right, red or blue.",
            "And in the red community you see 93% of those users are expressive right leaning political ideology and in the blue Community, 80% of those individuals express a left leaning ideology.",
            "And so.",
            "We see that the mention network is dominated by a single large, politically heterogeneous cluster of users, and if you drill in deeper and say OK I don't want K = 2 clusters.",
            "I want K = 712.",
            "We don't find a more fine grained political structure which is not to say we couldn't, but we did due diligence and you just get smaller, consistently.",
            "Politically heterogeneous clusters of users.",
            "So what this means, Oh yeah, so you can.",
            "You don't have to rely on this cluster structure to make a statement about the retweet network being different from the mention network.",
            "We can ask this analytically.",
            "We can say, given that there are K edges originate Ng from left leaning users, and our percent of the individuals in the network expressive right leaning political ideology, we would expect our percent of those K edges to terminate with right leaning.",
            "Users were people to associate irrespective of political affiliation.",
            "And so we can compare what we observe in the mention and retweet networks to what we should expect in this random case.",
            "And it turns out that for the retweet network you see about one.",
            "120th of what you should expect by chance alone, and the effect is still there for this mentioned network, but it's much less pronounced.",
            "UC sent out 70% of what you should expect in this random case, and so we can conclude that these mentions."
        ],
        [
            "Serve as a bridge over which information and exposure to people and ideas flow between these two politically segregated communities.",
            "And so this we know that hyperlinks are frequently included in these tweets.",
            "About 20% of these tweets have links to other information resources, and so this is qualitatively different from other results in technological systems that look at polarization.",
            "Here we have a communication modality that connects people who don't agree with each other and begins to address perhaps some of these concerns about the polarized structure of the networked public sphere.",
            "So natural question to ask is why do these two communication mechanisms have such divergent apologies?",
            "And we think that the answer has to do with.",
            "How people conceive of hashtags?",
            "And so if you think about a hashtag.",
            "It often is a topic identifier like oil or taxes.",
            "But sometimes infrequently in the political discourse.",
            "It identifies an information stream in the same way that a radio frequency or a TV channel does, and people sample from this information stream and we think that people make inferences about the partisan composition of the audience based on who they observe contributing to this stream.",
            "And so if we look using."
        ],
        [
            "The retweet clusters.",
            "As high Fidelity proxies for political identity.",
            "We can begin to see what the composition of these streams is.",
            "You'll see that people will frequently annotate a tweet with multiple hashtags, and they'll say I want to contribute to these streams.",
            "I want to contribute to progressives 2.0.",
            "Democrats.",
            "Top Conservatives on Twitter.",
            "And so for very low marginal cost they can inject their partisan content into an information stream whose primary audience would not likely choose to see it ahead of time.",
            "And so this is.",
            "This is an editor list platform which is very different from the mass media model where even on blogs you edit the comments.",
            "Somebody says something you don't like.",
            "It's offensive.",
            "Come out here.",
            "Nobody controls the content of the information stream.",
            "And this has very dramatic effects.",
            "You should expect here in this case that.",
            "Individuals who are exposed to content in this way would receive more communication.",
            "From across that, partisan divide, and so we can begin to look at the behavior of individuals and whether or not they are engaging in this content injection."
        ],
        [
            "To do this, we need to define some measures and so if we look at an information stream and we use these to retweet network communities as high Fidelity proxies for political alignment, we can do this with about 90% accuracy accounting for the undesirables.",
            "You see that P2.",
            "Has almost 30% of its content originating from users in that right leaning community.",
            "And so.",
            "This means that people are being exposed to these ideas and opinions and mass.",
            "This is the most popular hashtag that's dominated by left leaning users, and so you can define the importance of a hashtag with respect to a community as essentially the probability that given we're seeing a hashtag produced by a left leaning user, how likely is it to be this hashtag?"
        ],
        [
            "And so if we compare the relative importances of these hashtags, we derive a measure we called balance that gives you.",
            "Arrange from negative one to one negative one.",
            "If it's only important to left leaning users, positive one if it's only important to right leaning users, and zero if it's equally likely to be produced by a user.",
            "In either of those two communities.",
            "And so here we see the.",
            "Political spectrum emerge in the information Stream selections of the individuals in these communities, and there are some interesting characteristics.",
            "I'm sure you can see here in the nature of these hashtags, and so like I said earlier.",
            "We should expect that people who participate in content injection would receive the most communication.",
            "Provoke responses from across the partisan divide.",
            "We think that when people inject content in this manner.",
            "The people who receive it are not likely to rebroadcast that tweet.",
            "But they will respond to the original author in the form of a mention, and so a person who engages in content injection should receive this kind of communication.",
            "And if we take an average of the valences of all the hashtag streams, a person contributes to, we can define their mean hashtags select."
        ],
        [
            "And we see that people who contribute to a politically balanced stream of hashtags do in fact receive the most communication from across the partisan divide.",
            "But it's less pronounced for sending.",
            "So this is an indication that maybe they're just looking to provoke a response and characterizing the nature of this cross ideological interaction in a sociological sense is something we're interested in.",
            "So if anybody has ideas about how to do this in a rigorous way.",
            "Would love to hear it."
        ],
        [
            "So this is a lesson about how design decisions can affect the structure of political discourse, and that we're not locked in to these interactions that are polarized and myopic.",
            "In this filter bubble we can precipitate cross ideological interaction and this is very important for democracy.",
            "This buys us a couple interesting analysis.",
            "First, we can predict the political alignment of Twitter users.",
            "You know, 10s of thousands of Twitters users with very high accuracy, so if you're looking at targeting political messages or seeing who are influential, or you want to say I mean.",
            "Let's say that you want to see what's important, how people are talking about a specific piece of legislation you don't want to average over both sides of the political spectrum.",
            "You just want to look at left leaning individuals.",
            "You can do this.",
            "We see that hashtags using, let's say we train an SVM here, hashtags outperform unigrams and this is like the results you see in the bio medical literature where abstracts and figure captions perform better at predicting weather and articles about protein protein interaction then the full text.",
            "The hashtags are.",
            "Topics they are semantically loaded terms and if we do topic detection using latent semantic analysis, of course we find that the second most important source of variation in the data is political identity."
        ],
        [
            "You can look at the policy issues and I think that this dovetails well with I think what's going to come next where we look at.",
            "Well, I'm not sure what exactly comes next, but I know that this is complementary to the kinds of results we're seeing in this space.",
            "Here we're looking at Brookings Institution, so nonprofit public policy think tank.",
            "We're looking at the.",
            "300 keywords that they tracked around public policy and we see that left leaning users have different priorities in terms of policy than right leaning users.",
            "We can all."
        ],
        [
            "Look at where these people come from based on the location field, their self reported location string and we see that the basic political geography of the US emerges even in this space where you can connect with individuals irrespective of your metric embedding.",
            "And so this is kind of interesting.",
            "You can also look at how these people behave differently and interact differently and we find if we expand our analysis to the nine weeks on either side of the election.",
            "That individuals in that right leaning community produce 54% more total political content, despite constituting a smaller portion of the total userbase.",
            "They devote 83% more of their time on Twitter.",
            "22% of their tweets contain one of these hashtags.",
            "They're using this as an explicitly political space, and we see this in their biographies there twice as likely, nearly twice as likely to self identify as a constitutional conservative.",
            "They use that valuable biography space to say this is what I'm here to do.",
            "This is a political platform for me.",
            "How we doing on time.",
            "Mom.",
            "They also use more hyperlinks.",
            "They and both of these communities are much more likely to use Twitter as an information sharing resource than the general population.",
            "I think the baseline rate, at least that we observe for the general population is, let's say 12 or 15%.",
            "So to have 50% of your tweets containing hashtags.",
            "Is this is a way to propagate information?",
            "I'm trying to share resources with other individuals in this network and their connectivity structures are different.",
            "We find that among these right leaning users they are more likely to be in high order cake or zenkei clicks, and if we think about complex contagion and how you have to be exposed to an idea multiple times if you're in a tightly connected community, you're more likely to see it again and again.",
            "Likewise, we know people who are in high order K cores are for simple epidemic models of information spreading more likely to precipitate broad and rapid spreading of information, so they have a structural advantage.",
            "And compared to, say, the survey results from twenty 08 from the Pew Internet and American Life study that showed that Obama voters were across all dimensions much more likely to be politically engaged online this.",
            "Portends a structural partisan.",
            "See change in the topology of the political landscape, and so you can imagine techniques like this being used longitudinally to ask questions about incumbency.",
            "Is activity just a factor of not being in power?",
            "If we collect this data over the next several years, we can begin to see how this changes as a function of time and tie this theory and data without theory is mute, and I think that so much of the progress we've made has come as a result of tying our quantitative work to methods from the social Sciences and theory from the social Sciences."
        ],
        [
            "I want to thank my team, amazing collaborators like Phil said, we're hiring.",
            "It's a great group that Ruthie projectruthie.indiana.edu interesting developing shamik in the back.",
            "There has just created a visualization interface for dynamic information diffusion for creating movies.",
            "We're releasing a data set derived from this.",
            "It's not the full body of the tweets, but it's the network structure in the hashtags and the time stamps, and we think there are a lot of interesting questions that remain.",
            "Who are the influential people?",
            "How?",
            "How are the people who are making this cross ideological communication?",
            "How are they engaged with the platform?",
            "We think there's a lot of grist for the mill here, and this is available on our website.",
            "If you have any questions or ideas for collaborations, contact me on Twitter or by email and be happy to chat.",
            "Thanks.",
            "Just a suggestion relevant to what you were getting to at the end there with this difference in behavior between and network characteristics between the left and the right online.",
            "A lot of what?",
            "What I've seen in previous research on blog networks, particularly in the 2008 elections, is that a lot of that conservative activity is the result of actual organized behaviors.",
            "So there are often campaign affiliated groups that are doing this.",
            "Not it's not, as it's not sockpuppets, but it's kind of recruited individuals that are acting in a coordinated way.",
            "So that will help explain some of that.",
            "I think is that it's not sort of individual.",
            "You don't want to the model where it's individual citizens that are kind of doing this only mediated through Twitter.",
            "There very often organized in ways that are external to the network.",
            "It's an interesting question.",
            "I think we would need data too.",
            "I mean that it's very delicate with this work to make sure that you're approaching it objectively and we.",
            "I mean, we a hypothesis like that is dangerous because it presumes that the right is centrally orchestrated.",
            "Which is sort of a loaded hypothesis, but we can answer these questions empirically.",
            "Offline yeah yeah.",
            "OK."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "My name is Mike Connor from Indiana University and I'm going to talk about how communication technologies can shape the structure of the public sphere.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So one of the.",
                    "label": 0
                },
                {
                    "sent": "Principles of a deliberative democracy where we talk and make decisions about how.",
                    "label": 0
                },
                {
                    "sent": "To shape the future of a country is that we need a broadly informed public who has exposure.",
                    "label": 0
                },
                {
                    "sent": "To a wide range of experiences so that we can reflect and know our fellow citizens and make informed decisions about policy.",
                    "label": 0
                },
                {
                    "sent": "One of the concerns about new technologies, or that they make it very easy to be exposed only to opinions and people and information that reflect views that you already hold.",
                    "label": 0
                },
                {
                    "sent": "If you think about Amazon Book recommendation makes it very easy to read books that are similar to the books you've already read.",
                    "label": 0
                },
                {
                    "sent": "Google customize search results will tailor things to your interests that you already have.",
                    "label": 0
                },
                {
                    "sent": "Friend recommendation in social networks makes it very easy to meet people who already know the people you know.",
                    "label": 0
                },
                {
                    "sent": "And so the problem with this is that when you're only exposed to very homogeneous view of the world, your views are likely to become more extreme as a result of not being exposed to credible opposing opinions and their social incentives to stake out a more extreme position and so.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We were working on a project called Truthi which looks.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Diffusion of information in the Twitter space and here we have visualizations.",
                    "label": 0
                },
                {
                    "sent": "These diffusion networks that arose as a result of this project and a very characteristic structure ricord when we were looking at these and you see this biclustering, we have retweet edges in blue and mentions in orange and these are each of the hashtags are all the tweets associated with the hashtags you see at the bottom here and we have two communities of users who preferentially rebroadcast content.",
                    "label": 0
                },
                {
                    "sent": "Produced by other individuals within that community, but who are connecting across the divide using mentions.",
                    "label": 0
                },
                {
                    "sent": "And so we saw this structure at the atomic level and a question that we wanted to know was does this exist in the aggregate?",
                    "label": 0
                },
                {
                    "sent": "And so we took.",
                    "label": 0
                },
                {
                    "sent": "Olive.",
                    "label": 0
                },
                {
                    "sent": "Now let's say 55 political hashtags that we discovered using a simple algorithm relating to political content and aggregating them all together over the six week.",
                    "label": 0
                },
                {
                    "sent": "Preceding the 2010 midterm congressional elections, we found a network whose largest connected component had approximately 22,000 individuals sharing about 250,000 tweets, and this structure persists.",
                    "label": 0
                },
                {
                    "sent": "We have two communities of users.",
                    "label": 0
                },
                {
                    "sent": "Who interact with one another using mentions, but who do not rebroadcast content produced in this other.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Community.",
                    "label": 0
                },
                {
                    "sent": "So a natural question to ask is, do these communities correspond to our understanding of the partisan political?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Spectrum in the US.",
                    "label": 0
                },
                {
                    "sent": "R. We don't want to ask that question yet though.",
                    "label": 0
                },
                {
                    "sent": "If we tease these two networks apart and treat these as different communication modalities, we see that the effect is even more pronounced for the retweet network.",
                    "label": 0
                },
                {
                    "sent": "We can cluster this and find two well defined communities.",
                    "label": 0
                },
                {
                    "sent": "But Dimension Network does not exhibit any clustering in this by structured way or very little clustering in this price structured way, it's dominated by a single large community, and so the question we want to ask now is whether these retweet communities have a political interpretation.",
                    "label": 0
                },
                {
                    "sent": "And so a question like this help we come up against the limits of quantitative reasoning.",
                    "label": 0
                },
                {
                    "sent": "And so you have to turn to methods from the social Sciences and qualitative analysis to give you a lens on the question you really want to answer.",
                    "label": 0
                },
                {
                    "sent": "And so we use a technique called.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Qualitative content analysis to examine the body of the tweets produced by users in these communities from those six weeks preceding the election, and we had two authors working independently of one another.",
                    "label": 0
                },
                {
                    "sent": "Annotate 1000 people and make the decision.",
                    "label": 0
                },
                {
                    "sent": "Does the content of this person's Tweet Express a left, right, or UN decidable political ideology?",
                    "label": 0
                },
                {
                    "sent": "We then compared those annotations to a subset annotated by and an author judge.",
                    "label": 0
                },
                {
                    "sent": "Somebody not associated with the study, working totally independent of us to help us know that somebody, anybody in this audience could look at the same data we did and then use our rubric to arrive at the same conclusions.",
                    "label": 0
                },
                {
                    "sent": "And so we compute, you want to look at precision and recall accuracy or the method measure from the social Sciences.",
                    "label": 0
                },
                {
                    "sent": "Cohens Kappa Inter annotator agreement for the left and right classes is very high, nearly perfect for this on decidable class.",
                    "label": 0
                },
                {
                    "sent": "It's a little harder, but it's still quite good, and so we see that in fact here we have the annotated users color to.",
                    "label": 0
                },
                {
                    "sent": "So according to whether they're left or right, red or blue.",
                    "label": 0
                },
                {
                    "sent": "And in the red community you see 93% of those users are expressive right leaning political ideology and in the blue Community, 80% of those individuals express a left leaning ideology.",
                    "label": 0
                },
                {
                    "sent": "And so.",
                    "label": 0
                },
                {
                    "sent": "We see that the mention network is dominated by a single large, politically heterogeneous cluster of users, and if you drill in deeper and say OK I don't want K = 2 clusters.",
                    "label": 0
                },
                {
                    "sent": "I want K = 712.",
                    "label": 0
                },
                {
                    "sent": "We don't find a more fine grained political structure which is not to say we couldn't, but we did due diligence and you just get smaller, consistently.",
                    "label": 0
                },
                {
                    "sent": "Politically heterogeneous clusters of users.",
                    "label": 0
                },
                {
                    "sent": "So what this means, Oh yeah, so you can.",
                    "label": 0
                },
                {
                    "sent": "You don't have to rely on this cluster structure to make a statement about the retweet network being different from the mention network.",
                    "label": 0
                },
                {
                    "sent": "We can ask this analytically.",
                    "label": 0
                },
                {
                    "sent": "We can say, given that there are K edges originate Ng from left leaning users, and our percent of the individuals in the network expressive right leaning political ideology, we would expect our percent of those K edges to terminate with right leaning.",
                    "label": 0
                },
                {
                    "sent": "Users were people to associate irrespective of political affiliation.",
                    "label": 0
                },
                {
                    "sent": "And so we can compare what we observe in the mention and retweet networks to what we should expect in this random case.",
                    "label": 0
                },
                {
                    "sent": "And it turns out that for the retweet network you see about one.",
                    "label": 0
                },
                {
                    "sent": "120th of what you should expect by chance alone, and the effect is still there for this mentioned network, but it's much less pronounced.",
                    "label": 0
                },
                {
                    "sent": "UC sent out 70% of what you should expect in this random case, and so we can conclude that these mentions.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Serve as a bridge over which information and exposure to people and ideas flow between these two politically segregated communities.",
                    "label": 0
                },
                {
                    "sent": "And so this we know that hyperlinks are frequently included in these tweets.",
                    "label": 0
                },
                {
                    "sent": "About 20% of these tweets have links to other information resources, and so this is qualitatively different from other results in technological systems that look at polarization.",
                    "label": 0
                },
                {
                    "sent": "Here we have a communication modality that connects people who don't agree with each other and begins to address perhaps some of these concerns about the polarized structure of the networked public sphere.",
                    "label": 0
                },
                {
                    "sent": "So natural question to ask is why do these two communication mechanisms have such divergent apologies?",
                    "label": 0
                },
                {
                    "sent": "And we think that the answer has to do with.",
                    "label": 0
                },
                {
                    "sent": "How people conceive of hashtags?",
                    "label": 0
                },
                {
                    "sent": "And so if you think about a hashtag.",
                    "label": 0
                },
                {
                    "sent": "It often is a topic identifier like oil or taxes.",
                    "label": 0
                },
                {
                    "sent": "But sometimes infrequently in the political discourse.",
                    "label": 0
                },
                {
                    "sent": "It identifies an information stream in the same way that a radio frequency or a TV channel does, and people sample from this information stream and we think that people make inferences about the partisan composition of the audience based on who they observe contributing to this stream.",
                    "label": 0
                },
                {
                    "sent": "And so if we look using.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The retweet clusters.",
                    "label": 0
                },
                {
                    "sent": "As high Fidelity proxies for political identity.",
                    "label": 0
                },
                {
                    "sent": "We can begin to see what the composition of these streams is.",
                    "label": 0
                },
                {
                    "sent": "You'll see that people will frequently annotate a tweet with multiple hashtags, and they'll say I want to contribute to these streams.",
                    "label": 0
                },
                {
                    "sent": "I want to contribute to progressives 2.0.",
                    "label": 0
                },
                {
                    "sent": "Democrats.",
                    "label": 0
                },
                {
                    "sent": "Top Conservatives on Twitter.",
                    "label": 0
                },
                {
                    "sent": "And so for very low marginal cost they can inject their partisan content into an information stream whose primary audience would not likely choose to see it ahead of time.",
                    "label": 0
                },
                {
                    "sent": "And so this is.",
                    "label": 0
                },
                {
                    "sent": "This is an editor list platform which is very different from the mass media model where even on blogs you edit the comments.",
                    "label": 0
                },
                {
                    "sent": "Somebody says something you don't like.",
                    "label": 0
                },
                {
                    "sent": "It's offensive.",
                    "label": 0
                },
                {
                    "sent": "Come out here.",
                    "label": 0
                },
                {
                    "sent": "Nobody controls the content of the information stream.",
                    "label": 0
                },
                {
                    "sent": "And this has very dramatic effects.",
                    "label": 0
                },
                {
                    "sent": "You should expect here in this case that.",
                    "label": 0
                },
                {
                    "sent": "Individuals who are exposed to content in this way would receive more communication.",
                    "label": 0
                },
                {
                    "sent": "From across that, partisan divide, and so we can begin to look at the behavior of individuals and whether or not they are engaging in this content injection.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To do this, we need to define some measures and so if we look at an information stream and we use these to retweet network communities as high Fidelity proxies for political alignment, we can do this with about 90% accuracy accounting for the undesirables.",
                    "label": 0
                },
                {
                    "sent": "You see that P2.",
                    "label": 0
                },
                {
                    "sent": "Has almost 30% of its content originating from users in that right leaning community.",
                    "label": 0
                },
                {
                    "sent": "And so.",
                    "label": 0
                },
                {
                    "sent": "This means that people are being exposed to these ideas and opinions and mass.",
                    "label": 0
                },
                {
                    "sent": "This is the most popular hashtag that's dominated by left leaning users, and so you can define the importance of a hashtag with respect to a community as essentially the probability that given we're seeing a hashtag produced by a left leaning user, how likely is it to be this hashtag?",
                    "label": 1
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so if we compare the relative importances of these hashtags, we derive a measure we called balance that gives you.",
                    "label": 0
                },
                {
                    "sent": "Arrange from negative one to one negative one.",
                    "label": 0
                },
                {
                    "sent": "If it's only important to left leaning users, positive one if it's only important to right leaning users, and zero if it's equally likely to be produced by a user.",
                    "label": 0
                },
                {
                    "sent": "In either of those two communities.",
                    "label": 0
                },
                {
                    "sent": "And so here we see the.",
                    "label": 0
                },
                {
                    "sent": "Political spectrum emerge in the information Stream selections of the individuals in these communities, and there are some interesting characteristics.",
                    "label": 0
                },
                {
                    "sent": "I'm sure you can see here in the nature of these hashtags, and so like I said earlier.",
                    "label": 0
                },
                {
                    "sent": "We should expect that people who participate in content injection would receive the most communication.",
                    "label": 0
                },
                {
                    "sent": "Provoke responses from across the partisan divide.",
                    "label": 0
                },
                {
                    "sent": "We think that when people inject content in this manner.",
                    "label": 0
                },
                {
                    "sent": "The people who receive it are not likely to rebroadcast that tweet.",
                    "label": 0
                },
                {
                    "sent": "But they will respond to the original author in the form of a mention, and so a person who engages in content injection should receive this kind of communication.",
                    "label": 0
                },
                {
                    "sent": "And if we take an average of the valences of all the hashtag streams, a person contributes to, we can define their mean hashtags select.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we see that people who contribute to a politically balanced stream of hashtags do in fact receive the most communication from across the partisan divide.",
                    "label": 0
                },
                {
                    "sent": "But it's less pronounced for sending.",
                    "label": 0
                },
                {
                    "sent": "So this is an indication that maybe they're just looking to provoke a response and characterizing the nature of this cross ideological interaction in a sociological sense is something we're interested in.",
                    "label": 0
                },
                {
                    "sent": "So if anybody has ideas about how to do this in a rigorous way.",
                    "label": 0
                },
                {
                    "sent": "Would love to hear it.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is a lesson about how design decisions can affect the structure of political discourse, and that we're not locked in to these interactions that are polarized and myopic.",
                    "label": 0
                },
                {
                    "sent": "In this filter bubble we can precipitate cross ideological interaction and this is very important for democracy.",
                    "label": 0
                },
                {
                    "sent": "This buys us a couple interesting analysis.",
                    "label": 0
                },
                {
                    "sent": "First, we can predict the political alignment of Twitter users.",
                    "label": 0
                },
                {
                    "sent": "You know, 10s of thousands of Twitters users with very high accuracy, so if you're looking at targeting political messages or seeing who are influential, or you want to say I mean.",
                    "label": 0
                },
                {
                    "sent": "Let's say that you want to see what's important, how people are talking about a specific piece of legislation you don't want to average over both sides of the political spectrum.",
                    "label": 0
                },
                {
                    "sent": "You just want to look at left leaning individuals.",
                    "label": 0
                },
                {
                    "sent": "You can do this.",
                    "label": 0
                },
                {
                    "sent": "We see that hashtags using, let's say we train an SVM here, hashtags outperform unigrams and this is like the results you see in the bio medical literature where abstracts and figure captions perform better at predicting weather and articles about protein protein interaction then the full text.",
                    "label": 0
                },
                {
                    "sent": "The hashtags are.",
                    "label": 0
                },
                {
                    "sent": "Topics they are semantically loaded terms and if we do topic detection using latent semantic analysis, of course we find that the second most important source of variation in the data is political identity.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You can look at the policy issues and I think that this dovetails well with I think what's going to come next where we look at.",
                    "label": 0
                },
                {
                    "sent": "Well, I'm not sure what exactly comes next, but I know that this is complementary to the kinds of results we're seeing in this space.",
                    "label": 0
                },
                {
                    "sent": "Here we're looking at Brookings Institution, so nonprofit public policy think tank.",
                    "label": 1
                },
                {
                    "sent": "We're looking at the.",
                    "label": 0
                },
                {
                    "sent": "300 keywords that they tracked around public policy and we see that left leaning users have different priorities in terms of policy than right leaning users.",
                    "label": 0
                },
                {
                    "sent": "We can all.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Look at where these people come from based on the location field, their self reported location string and we see that the basic political geography of the US emerges even in this space where you can connect with individuals irrespective of your metric embedding.",
                    "label": 1
                },
                {
                    "sent": "And so this is kind of interesting.",
                    "label": 0
                },
                {
                    "sent": "You can also look at how these people behave differently and interact differently and we find if we expand our analysis to the nine weeks on either side of the election.",
                    "label": 0
                },
                {
                    "sent": "That individuals in that right leaning community produce 54% more total political content, despite constituting a smaller portion of the total userbase.",
                    "label": 0
                },
                {
                    "sent": "They devote 83% more of their time on Twitter.",
                    "label": 0
                },
                {
                    "sent": "22% of their tweets contain one of these hashtags.",
                    "label": 0
                },
                {
                    "sent": "They're using this as an explicitly political space, and we see this in their biographies there twice as likely, nearly twice as likely to self identify as a constitutional conservative.",
                    "label": 0
                },
                {
                    "sent": "They use that valuable biography space to say this is what I'm here to do.",
                    "label": 0
                },
                {
                    "sent": "This is a political platform for me.",
                    "label": 0
                },
                {
                    "sent": "How we doing on time.",
                    "label": 0
                },
                {
                    "sent": "Mom.",
                    "label": 0
                },
                {
                    "sent": "They also use more hyperlinks.",
                    "label": 0
                },
                {
                    "sent": "They and both of these communities are much more likely to use Twitter as an information sharing resource than the general population.",
                    "label": 0
                },
                {
                    "sent": "I think the baseline rate, at least that we observe for the general population is, let's say 12 or 15%.",
                    "label": 0
                },
                {
                    "sent": "So to have 50% of your tweets containing hashtags.",
                    "label": 0
                },
                {
                    "sent": "Is this is a way to propagate information?",
                    "label": 0
                },
                {
                    "sent": "I'm trying to share resources with other individuals in this network and their connectivity structures are different.",
                    "label": 0
                },
                {
                    "sent": "We find that among these right leaning users they are more likely to be in high order cake or zenkei clicks, and if we think about complex contagion and how you have to be exposed to an idea multiple times if you're in a tightly connected community, you're more likely to see it again and again.",
                    "label": 0
                },
                {
                    "sent": "Likewise, we know people who are in high order K cores are for simple epidemic models of information spreading more likely to precipitate broad and rapid spreading of information, so they have a structural advantage.",
                    "label": 0
                },
                {
                    "sent": "And compared to, say, the survey results from twenty 08 from the Pew Internet and American Life study that showed that Obama voters were across all dimensions much more likely to be politically engaged online this.",
                    "label": 0
                },
                {
                    "sent": "Portends a structural partisan.",
                    "label": 0
                },
                {
                    "sent": "See change in the topology of the political landscape, and so you can imagine techniques like this being used longitudinally to ask questions about incumbency.",
                    "label": 0
                },
                {
                    "sent": "Is activity just a factor of not being in power?",
                    "label": 0
                },
                {
                    "sent": "If we collect this data over the next several years, we can begin to see how this changes as a function of time and tie this theory and data without theory is mute, and I think that so much of the progress we've made has come as a result of tying our quantitative work to methods from the social Sciences and theory from the social Sciences.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I want to thank my team, amazing collaborators like Phil said, we're hiring.",
                    "label": 0
                },
                {
                    "sent": "It's a great group that Ruthie projectruthie.indiana.edu interesting developing shamik in the back.",
                    "label": 0
                },
                {
                    "sent": "There has just created a visualization interface for dynamic information diffusion for creating movies.",
                    "label": 0
                },
                {
                    "sent": "We're releasing a data set derived from this.",
                    "label": 0
                },
                {
                    "sent": "It's not the full body of the tweets, but it's the network structure in the hashtags and the time stamps, and we think there are a lot of interesting questions that remain.",
                    "label": 0
                },
                {
                    "sent": "Who are the influential people?",
                    "label": 0
                },
                {
                    "sent": "How?",
                    "label": 0
                },
                {
                    "sent": "How are the people who are making this cross ideological communication?",
                    "label": 0
                },
                {
                    "sent": "How are they engaged with the platform?",
                    "label": 0
                },
                {
                    "sent": "We think there's a lot of grist for the mill here, and this is available on our website.",
                    "label": 0
                },
                {
                    "sent": "If you have any questions or ideas for collaborations, contact me on Twitter or by email and be happy to chat.",
                    "label": 0
                },
                {
                    "sent": "Thanks.",
                    "label": 0
                },
                {
                    "sent": "Just a suggestion relevant to what you were getting to at the end there with this difference in behavior between and network characteristics between the left and the right online.",
                    "label": 0
                },
                {
                    "sent": "A lot of what?",
                    "label": 0
                },
                {
                    "sent": "What I've seen in previous research on blog networks, particularly in the 2008 elections, is that a lot of that conservative activity is the result of actual organized behaviors.",
                    "label": 0
                },
                {
                    "sent": "So there are often campaign affiliated groups that are doing this.",
                    "label": 0
                },
                {
                    "sent": "Not it's not, as it's not sockpuppets, but it's kind of recruited individuals that are acting in a coordinated way.",
                    "label": 0
                },
                {
                    "sent": "So that will help explain some of that.",
                    "label": 0
                },
                {
                    "sent": "I think is that it's not sort of individual.",
                    "label": 0
                },
                {
                    "sent": "You don't want to the model where it's individual citizens that are kind of doing this only mediated through Twitter.",
                    "label": 0
                },
                {
                    "sent": "There very often organized in ways that are external to the network.",
                    "label": 0
                },
                {
                    "sent": "It's an interesting question.",
                    "label": 0
                },
                {
                    "sent": "I think we would need data too.",
                    "label": 0
                },
                {
                    "sent": "I mean that it's very delicate with this work to make sure that you're approaching it objectively and we.",
                    "label": 0
                },
                {
                    "sent": "I mean, we a hypothesis like that is dangerous because it presumes that the right is centrally orchestrated.",
                    "label": 0
                },
                {
                    "sent": "Which is sort of a loaded hypothesis, but we can answer these questions empirically.",
                    "label": 0
                },
                {
                    "sent": "Offline yeah yeah.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        }
    }
}