{
    "id": "w3jynlhb4zxtj3g7vfawv2gbtlquf6lp",
    "title": "Benchmarking Logistics Chains",
    "info": {
        "author": [
            "Jeroen Bozuwa, ECORYS Holding BV"
        ],
        "published": "June 3, 2011",
        "recorded": "May 2011",
        "category": [
            "Top->Business->Transportation and Logistics"
        ]
    },
    "url": "http://videolectures.net/efreight2011_bozuwa_benchmarking/",
    "segmentation": [
        [
            "Thank you for the invitation first.",
            "To have a presentation only logic project.",
            "Which was finalized my at the end of February this year.",
            "I actually prepared the paper but also the slides with Donald have mobile call.",
            "Who is one of the one of the work package early this on one of the tools I'm going to present.",
            "Actually, I'm going to present two tools that is the main content of the presentation."
        ],
        [
            "First, of course, there's a bit of background.",
            "I very shortly introduce the logic project.",
            "And of course, it's the Fed Conference I try to.",
            "Relates some of our findings and especially the European internal or Route Finder II till I'm going to present I try to relay that to the freight concept."
        ],
        [
            "First, on some facts and figures on the Bill Belichick project, the main objective of the project was to improve the efficiency, but also the quality within and across different modes of transport.",
            "Surreal Co model approach.",
            "In the beginning, the attention the focus was on small and medium sized enterprises.",
            "Becausw, I believe was that especially.",
            "In small and medium enterprises there is still a lot of potential improvement that could be achieved becausw, and this was also set this morning.",
            "These companies don't have the large research budgets.",
            "To do daily improvements to their logistics operations.",
            "So the intention was at the beginning of small and medium size enterprises, but we find out along the project that the tools that we have actually developed are also useful to the larger companies.",
            "The projects on it in the September 2008 and was finalized in February this year.",
            "Anet included nine partition.",
            "You find the logos at the bottom."
        ],
        [
            "The main results of the logic projects are of course these two tools which I will present in more detail in the next slide, but I also would like to draw attention to important report's that were delivered also in the project.",
            "All deliverables are public.",
            "You can find them at the project website.",
            "The last slide contains the web address, so you don't need to write it down.",
            "The first is report on the need for new quality standards.",
            "It was a work package that was left by Newcastle University.",
            "I said the report can be downloaded front from the project website.",
            "The second report went in very in detail analysis on barriers that still exist varies related to policy frameworks.",
            "Conditions in the Member States will show at EU level and we may even a comparison with logistics in the US and also in Japan.",
            "Also separate deliverable which can be downloaded from the website."
        ],
        [
            "If you go to the website.",
            "You will find this this home page and at the top of the photo.",
            "You find the two tools at the left, the European Internal Route Finder an at the right logistics benchmarking tool.",
            "And this is the first."
        ],
        [
            "So I would like to.",
            "To present.",
            "And I will do that along a case that was actually carried out by about more mobicom.",
            "1st, to explain the structure of the tool and objectives of the tool.",
            "Objective force quite quite simple.",
            "It was just to show shippers that there are internal alternatives.",
            "Besides roads only transport.",
            "A second objective for us to support the use is really to support them in searching improvements.",
            "You too tomorrow change.",
            "Again, the focus wasn't small and medium sized enterprises and I said they are.",
            "Well, let's say for more than 90% thinking it only enrolled only option rather than internal alternatives.",
            "The tool itself works along 6 main key performance indicators.",
            "Three of them are quantitative, and three of them are qualitative.",
            "It's really up to the user of the tool.",
            "How many of these key performance indicators he's going to select.",
            "I guess three is a minimum.",
            "To do a good benchmark, but of course you can select all 66 indicators into the benchmark.",
            "He would like to.",
            "To do, and if he has the information available, he can even choose for ship indicators.",
            "So time is not only the transfer time.",
            "But you can break it down, you can disaggregate it also in the waiting time and all the time components.",
            "Same for cost saving for sustainability.",
            "Sustainability is not only CO2 but it also includes other externalities.",
            "The qualitative indicators, reliability, quality, and flexibility are measured on a 5 point scale and it's really up to the user of the tool to make his own assessment.",
            "How he compares the reliability of intermodal transport.",
            "Thrill that includes shipping, how he compares that to route only options.",
            "That"
        ],
        [
            "Make it a bit more clear.",
            "I will present the case that we carried out in the Netherlands.",
            "First base case and this was really an existing case of rail transport which started in the northern part of the Netherlands.",
            "Actually the village of start canal.",
            "It was contained transporter thought of two TU which were transported to Feagans a in Italy.",
            "And this base case.",
            "So the current practice of this particular.",
            "Shipper was to compare it with an internal alternative which had first around like from South Canal to Rotterdam and then a real leg from Rotterdam to free Gaza.",
            "So that was the alternative which was applied for the bench."
        ],
        [
            "Rock.",
            "Well, this this user had actually a lot of information available, at least on his his base case for out.",
            "You calculated the cost for the route only option.",
            "At 2500 euros it took him 36 hours to ship the containers from start Canal, two free guns in Italy.",
            "And he made an assessment as well of the qualitative indicators, and even applied to the ship indicators in this in this case.",
            "It took a bit more time to collect information on the alternative cause.",
            "It wasn't a daily practice.",
            "We should put him into finding these figures and these are presented at the in the right column.",
            "And they see that the real alternative which includes this pre haulage from the start screen to them and then by rail from Rotterdam to to Miller.",
            "It was more costly.",
            "It took much more time to ship the cargo from the start canal to figure.",
            "But it was.",
            "It had less much less environmental impact in terms of two emissions."
        ],
        [
            "Just as an example, but if you try the tool yourself, it's available on the website.",
            "It's free of charge.",
            "You can try it yourself.",
            "You will finally end up in this output screen.",
            "It consists of three tables.",
            "The table at the top indicates the weights that you can allocate yourself to.",
            "The key performance indicators, and in this case I just described.",
            "The user allocated the highest weight to the transport cost 30% but you are flexible in doing that, so you can first allocate these weights to the key performance indicators and you can adapt that later.",
            "The second table really provides the summary of the two cases that are being compared.",
            "In this room you see the base case and the green shells really say that the base case performs better.",
            "On the on the on the respective key performance indicators which are indicated in the columns.",
            "Don't think it's you can see it in the bag, but believe me there are the key performance indicators.",
            "And it's compared with the internal alternative, which is right below the below the base case.",
            "A lot of red cells, which indicates that in this particular case the internal alternative scored worse on most key performance indicators, but I said it performed much better in terms of CO2 emissions.",
            "I forgot to tell that's the CO2 emissions and also the other emissions.",
            "You don't have to calculate it yourself.",
            "The tool is developed in a way that it calculates the missions, the types of emissions fireequaltransit.org, which is also accessible through the Internet.",
            "And then the table at the bottom.",
            "This is really an overall summary which tells that in this case the base case is relative.",
            "Only transport from static notifications are performs, overall around 10% better than the internal alternative.",
            "Of course it's very much depends on the weights that the user has allocated to the key performance indicators, but as you want to understand, applying this tool several times, it also provides you with a kind of sensitivity analysis tool.",
            "You can easily adapt to the weights and of course the outcomes will will change."
        ],
        [
            "Actually, we started with a spreadsheet based tool which was tested in 40K studies.",
            "Then we translated this tool to a web based application.",
            "We collected a lot of feedback from about 80 cases which we performed.",
            "And the main conclusions I've written down in this light ship is also logistic service providers told us.",
            "That the do list is well structured.",
            "It's quite simple to apply.",
            "It only includes six main indicates you can select three at least.",
            "It really helps to communicate.",
            "The pros and cons of possible alternatives internally with your colleagues.",
            "But also with your customers.",
            "If you really think that sustainability is a major issue, it helps you too.",
            "To make it more transparent, transparent to your colleagues will also to your clients.",
            "Shippers especially told us that applying the tool.",
            "Support them in evaluating incoming tenders.",
            "And more towards policy the 4th bullet.",
            "The tool can also be applied as a kind of analysis tool.",
            "For the green freight corridors, because it's quite easy to compare.",
            "Informal alternatives in certain freight corridors with unimodal transport.",
            "Big cause.",
            "Actually, none of these are included, but also yield are important.",
            "Key performance indicators, quality as flexibility and reliability.",
            "These are all included.",
            "So it also provides a analysis tool for policymakers.",
            "And of course, the European Commission."
        ],
        [
            "At first the second tool, the Internal root Finder."
        ],
        [
            "Also to be found on the website.",
            "But actually it's a large database.",
            "I first gives you some some information to have an understanding of what's included in the database.",
            "We started to collect information in March 2010 with nine partners.",
            "We started to collect information on transit times of transport services between different terminals.",
            "We collected information on the frequencies of these services that were offered an we implemented it in a very simple first in a Excel spreadsheet database, but.",
            "It came to launch.",
            "We shifted to an access database.",
            "But at this moment the database alone includes about 650 terminals, internal terminals, real terminals in shipping terminals, shorts you terminals.",
            "It covers 327 plus no I plus Switzerland.",
            "We developed a kind of root finding algorithm service finding algorithm.",
            "Which really helps the user to find internal alternatives from a certain origin to a certain destination.",
            "And if you run that application and will show it in the next slides.",
            "It contains about 4000 Direct Terminal Terminal relations.",
            "And we also included the possibility for the user to select its shipping terminal, so you're also allowed as user.",
            "To select a terminal transhipment Terminal final terminal relation.",
            "And then it's subject to about 70,000 indirect terminal relations that can be found through the European Animal Route Finder.",
            "Just along a few screenshots."
        ],
        [
            "If you go to the website and you click on the European route Finder tip."
        ],
        [
            "You will come into the screen and it's really works.",
            "Very simple.",
            "You select a country of origin, place of origin, where terminals are located.",
            "You do the same at the right side for the destination country of destination.",
            "Place the destination.",
            "By default, the total transfer time is 7 days, but also this is flexible.",
            "You can.",
            "Choose a longer or shorter transfer time.",
            "Once doing that, in this example, the country of origin is Germany, place of origin is Bremerhaven.",
            "The cargo cargo needs to be shipped to Rotterdam so the user selected the Netherlands and Rotterdam and as you then tap on the proceed to final results which is at the bar."
        ],
        [
            "You will come into this screen and here.",
            "The overview contains all the intermodal alternatives that has been found in the database.",
            "It works.",
            "In the sense that the internal alternatives which takes the last the least transport time and number of days, is on top.",
            "So in this particular case, the Euro gates terminal has been found.",
            "An has been put as the best option, possibly because the transport time in days is 2 days.",
            "It's also ordered by frequency.",
            "In this example, the frequency of the surface that has been found is 5 times a week.",
            "In the second column.",
            "You will find a hyperlink to the web address of the terminal.",
            "And in this particular Case No direct relations have been found, so these are all indirect relations an for indirect relations.",
            "The output will also provide you with information on the transshipment terminal.",
            "The first leg of transport, whether it's real, whether it's inland shipping, whether it's so, transport, and it will do the same for the second leg."
        ],
        [
            "Some of the features are built in as well.",
            "One is that you can print a PDF report.",
            "If you tap on that, I'm sorry if you tap on the on the hyper link of the web page of the terminal, you will end up here and you will find background information of the particle."
        ],
        [
            "Terminal.",
            "You can print PDF reports of all the alternatives that have been found in the internal database.",
            "You will also find contact information of the terminal.",
            "Telephone numbers.",
            "Email addresses."
        ],
        [
            "Etc.",
            "Of course.",
            "It's a proof of concept.",
            "If you say it is now, it's just the beginning.",
            "We hope to at least achieve to make the internal transport marker abit more transparent.",
            "And this is also one of the aims which is written down in the White Paper to make the intermodal transport market the market of internal transport service abit more transparent.",
            "The only objective we had when we try to develop this too.",
            "Of course we tested it as well in about 80 cases and we received a lot of feedback.",
            "Which functionalities could be improved?",
            "I've listed them here.",
            "Of course, the search functionality could be much more improved.",
            "Allowing for instance, the user to select only the New York terminal or the whole country of destination and then all the destination terminals.",
            "So you can really extent on the search externalities.",
            "Another remark was made, and that's one of the top priorities to follow.",
            "Up is also to include, of course, contact information of the shuttle operated, 'cause if you find interesting option you want to contact the shuttle operator or the batch operator and not the terminal operator.",
            "The Third Point is to extend it to other countries assets.",
            "At this moment, 29 European countries, but there is also an interest of some operators to extend it to countries.",
            "Russia, Ukraine and Turkey.",
            "At this moment the tool only provide you with the total transport time and number of days, which is not really accurate, so we would like to appreciate it a bit more.",
            "This information to the actual number of weekdays when will its depart and when will it arrive and even the time of departure and arrival.",
            "All the functionalities and mapping tools that you really see.",
            "The intermodal surface is on the map.",
            "And of course we look for possibilities too.",
            "Upload the information directly to have a diploma directly by shuttle operators and batch operators rather than to collect the information ourselves."
        ],
        [
            "Last point of my presentation."
        ],
        [
            "I think I skipped this because it's also presented in this picture.",
            "You already presented the four roles within the E Freight concept.",
            "And I guess that's the linking pin between our European Animal Route Finder and the freight concept is really in the transport service description, which is in the middle.",
            "From the transport service provider through the transport user.",
            "Because actually what we did in the European Animal Route Finder is to develop a very simple basic transport service description.",
            "Which grows from the transporter."
        ],
        [
            "Added to the transport user.",
            "And this basic transport service description we've developed in the AF contains information on the mode that is used.",
            "In the transport service can be in shipping.",
            "It can be real, can be short she.",
            "Information on where their service actually starts and where it arrives.",
            "Also, information on the frequency that is delivered by the servants 345 times a week.",
            "And also the duration and number of days.",
            "I would like to stress that the tool that we have developed is not a search facility which you can launch and it searches along the World Wide Web to enter model alternative.",
            "No, it's really a standalone database at this moment.",
            "You can only run an algorithm, it's accessible via Internet.",
            "You can launch an algorithm and its search internal alternative."
        ],
        [
            "For you.",
            "How might it look like in future?",
            "And I think he we we met the freight.",
            "We can meet the freight concept.",
            "At the top left you see the individual transport service.",
            "Descriptions of individual transport service providers.",
            "Labeled by T as the one up to TSDN, these are being inserted in a transport service description database.",
            "And.",
            "And optimization tool, which can be a more sophisticated algorithm that we have developed in the RF can be applied on that transport service description database to find real internal alternatives.",
            "And then of course transfer plan.",
            "Ishan shippers can retrieve data whenever they like."
        ],
        [
            "So for the for the future, I think the transport service subscription.",
            "Which we have.",
            "Developed in the European Animal route Finder.",
            "It can be much can be improved.",
            "Especially where it concerns information on the departure and information on the arrivals, but also on the actual services that are being provided at the terminals.",
            "For instance, where the terminals can handle dangerous quotes, whether they can handle all times of containers, whether they have repair facilities for for containers.",
            "But this is really something for for the future an.",
            "I'm really eager to hear your opinions about it."
        ],
        [
            "Assets more information can be found on the project website which is at the bottom.",
            "All deliverables are public and both tools that were developed in the logic projects are free of charge and you can just try.",
            "Thank you for attention.",
            "Thank you, win any any questions for your own.",
            "Kim will start again.",
            "Otherwise powerful features that I think if you actually get more stuff back, especially that hard with thousand 4000 kilometres.",
            "It's not.",
            "Look at the origin destination, so use railways Rd.",
            "It's actually using strategically when people even charge the transshipment terminals, cells and the cause.",
            "Another interesting parameter, possibly there is the critical transit time that the customer wants because Frank forwarders who are generally lazy who actually they put on Rd stays alright if they put their rally stays on right, but the possibility with transshipment where you actually get a much better service time by being part road and Park Trail and you also actually get the benefit usually of the rail link being much cheaper than the 50% of Travel Rd leg as well so you get a sustainability, you get a service commitment.",
            "So betterment and and also cheaper out come and get what I call me calling Australia new Corridor, Connect using strategic transshipment terminals is generally not seen because of all sorts of political reasons are unusually as long as the time is actually somewhere between the critical time required by the customer and what Rd can deliver.",
            "In many cases Rd over services, the customer requirements at a much more expensive rate and certainly.",
            "Fonzarelli operator I would trying to be very strategic and actually opening up some of these strategic terminals for the long distance blur to Park Road Park Trail unifies and potentially your tool by the focusing on finding where you need to.",
            "Actually really search the capability of actually finding the transshipment terminals where you can do part Road and Park trailer.",
            "Meet the customer service critical requirement you will come in cheaper than Rd at a time requirement.",
            "Basically it's still within the customer requirements and yet this entire mid corridor connects strategic value based.",
            "Richard is almost on dribble.",
            "Could be coming soon.",
            "I've gotta go back to this light.",
            "At least what you can do now with the tool is to select a maximum number of days.",
            "You think yourself is reasonable for this service.",
            "So if you think on certain freight corridor it should not exceed a total transfer time of two days, you can just select there two days and it will only find animal solutions which are at a maximum of two transport at a maximum of two days transport time.",
            "Journal, but can do it within that time it will find it.",
            "Yeah.",
            "This is a bit small.",
            "This presentation very interesting here is showing the price difference and we look for a car and only the roads for the color takes the least price.",
            "Lowest price group.",
            "Not people in crisis in such a search function.",
            "Is it the I think to take away the damn restraining of Jimmy's country?",
            "August.",
            "If you don't cut the price.",
            "Don't take the price with this Calculator.",
            "Don't fall for disappointing for for not to delivering a result.",
            "I mean they will take the lowest price.",
            "Yes.",
            "It is true that, well, to be honest, we also took a case which.",
            "If we had selected the case with where intermodal transport would be the very best solution.",
            "That might start to raise questions.",
            "That's always intermodal solutions would be the best outcome.",
            "So to be honest, we also selected a real case which showed that in the more tense, but it's not always and not not in all cases the best solution.",
            "But again, when we tested the tool.",
            "There were still quite a number of shippers and logistics service providers which were triggered by the difference in environmental impact.",
            "Although although they said well course there still is still the most important performance indicators, but as long as you don't see the real difference between CO2 emissions or small particles.",
            "It's our belief that you always opt for the cheapest solution, especially as a small and medium enterprise.",
            "One question back in back.",
            "It says one point.",
            "I think it's very interesting affected that you show.",
            "However, you might have a lot of extra benefits if you take into account that in another presentation they really constipated or pointed out that waiting time in supply chain is about 40% for regular purposes.",
            "Reason for that these custom system, let's say life difficult because they won't date at the base, their analysis on manifested that bill of lading.",
            "That's not going to work.",
            "If they would have the data from the source with consignor for instance.",
            "They would do a much more efficient so you would have data at the point into model where you can switch, which is a much higher quality, which means that it could happen enormously impact on intermodal switching, and just as an anecdote that in the networks we did some case with Fulton vegetables, which is 98% of Rd transport coming from autonomic pulling, pushing and the estimate is that if we would have this type of data on silent.",
            "Rather than Mike's data, they could switch into mobile in order down to Barnes, 50% reduced 50% of Rd transport, which is huge.",
            "So it's 12 billion turnover, and so if you take that, if you combine those things where you say OK, not just taking standard data, because that's I think one of the key issues here.",
            "But really going to consignment, which is, it's a revolution because it means that they are protected exchanges, practice of customs.",
            "It integrates customs in the supply chain and basically they reduce business there.",
            "So that's account.",
            "So we have a new project in this home.",
            "Voice, with its related to what you prayed with.",
            "These ICM lies so that would be very interesting to combine data concerning that literally.",
            "Project we really can see Epiglottic stand can be with the Customs Partnership more facilitative new facilitators.",
            "Biking rather then.",
            "Then it's now kind of obstruction.",
            "Wiki issue is the decision to take really sourcing.",
            "Which means again, legal and political power, but there might be some American alchemist steps, so we're well to be honest, already exchanged some ideas with your colleagues over lunch.",
            "Some ideas about it?",
            "These will be taken up for sure.",
            "Thank you very much everyone."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you for the invitation first.",
                    "label": 0
                },
                {
                    "sent": "To have a presentation only logic project.",
                    "label": 0
                },
                {
                    "sent": "Which was finalized my at the end of February this year.",
                    "label": 0
                },
                {
                    "sent": "I actually prepared the paper but also the slides with Donald have mobile call.",
                    "label": 0
                },
                {
                    "sent": "Who is one of the one of the work package early this on one of the tools I'm going to present.",
                    "label": 0
                },
                {
                    "sent": "Actually, I'm going to present two tools that is the main content of the presentation.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First, of course, there's a bit of background.",
                    "label": 0
                },
                {
                    "sent": "I very shortly introduce the logic project.",
                    "label": 0
                },
                {
                    "sent": "And of course, it's the Fed Conference I try to.",
                    "label": 0
                },
                {
                    "sent": "Relates some of our findings and especially the European internal or Route Finder II till I'm going to present I try to relay that to the freight concept.",
                    "label": 1
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First, on some facts and figures on the Bill Belichick project, the main objective of the project was to improve the efficiency, but also the quality within and across different modes of transport.",
                    "label": 1
                },
                {
                    "sent": "Surreal Co model approach.",
                    "label": 0
                },
                {
                    "sent": "In the beginning, the attention the focus was on small and medium sized enterprises.",
                    "label": 0
                },
                {
                    "sent": "Becausw, I believe was that especially.",
                    "label": 0
                },
                {
                    "sent": "In small and medium enterprises there is still a lot of potential improvement that could be achieved becausw, and this was also set this morning.",
                    "label": 0
                },
                {
                    "sent": "These companies don't have the large research budgets.",
                    "label": 0
                },
                {
                    "sent": "To do daily improvements to their logistics operations.",
                    "label": 0
                },
                {
                    "sent": "So the intention was at the beginning of small and medium size enterprises, but we find out along the project that the tools that we have actually developed are also useful to the larger companies.",
                    "label": 0
                },
                {
                    "sent": "The projects on it in the September 2008 and was finalized in February this year.",
                    "label": 0
                },
                {
                    "sent": "Anet included nine partition.",
                    "label": 0
                },
                {
                    "sent": "You find the logos at the bottom.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The main results of the logic projects are of course these two tools which I will present in more detail in the next slide, but I also would like to draw attention to important report's that were delivered also in the project.",
                    "label": 0
                },
                {
                    "sent": "All deliverables are public.",
                    "label": 0
                },
                {
                    "sent": "You can find them at the project website.",
                    "label": 0
                },
                {
                    "sent": "The last slide contains the web address, so you don't need to write it down.",
                    "label": 0
                },
                {
                    "sent": "The first is report on the need for new quality standards.",
                    "label": 1
                },
                {
                    "sent": "It was a work package that was left by Newcastle University.",
                    "label": 0
                },
                {
                    "sent": "I said the report can be downloaded front from the project website.",
                    "label": 0
                },
                {
                    "sent": "The second report went in very in detail analysis on barriers that still exist varies related to policy frameworks.",
                    "label": 0
                },
                {
                    "sent": "Conditions in the Member States will show at EU level and we may even a comparison with logistics in the US and also in Japan.",
                    "label": 1
                },
                {
                    "sent": "Also separate deliverable which can be downloaded from the website.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you go to the website.",
                    "label": 0
                },
                {
                    "sent": "You will find this this home page and at the top of the photo.",
                    "label": 0
                },
                {
                    "sent": "You find the two tools at the left, the European Internal Route Finder an at the right logistics benchmarking tool.",
                    "label": 0
                },
                {
                    "sent": "And this is the first.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I would like to.",
                    "label": 0
                },
                {
                    "sent": "To present.",
                    "label": 0
                },
                {
                    "sent": "And I will do that along a case that was actually carried out by about more mobicom.",
                    "label": 0
                },
                {
                    "sent": "1st, to explain the structure of the tool and objectives of the tool.",
                    "label": 1
                },
                {
                    "sent": "Objective force quite quite simple.",
                    "label": 0
                },
                {
                    "sent": "It was just to show shippers that there are internal alternatives.",
                    "label": 1
                },
                {
                    "sent": "Besides roads only transport.",
                    "label": 0
                },
                {
                    "sent": "A second objective for us to support the use is really to support them in searching improvements.",
                    "label": 0
                },
                {
                    "sent": "You too tomorrow change.",
                    "label": 0
                },
                {
                    "sent": "Again, the focus wasn't small and medium sized enterprises and I said they are.",
                    "label": 0
                },
                {
                    "sent": "Well, let's say for more than 90% thinking it only enrolled only option rather than internal alternatives.",
                    "label": 0
                },
                {
                    "sent": "The tool itself works along 6 main key performance indicators.",
                    "label": 0
                },
                {
                    "sent": "Three of them are quantitative, and three of them are qualitative.",
                    "label": 0
                },
                {
                    "sent": "It's really up to the user of the tool.",
                    "label": 0
                },
                {
                    "sent": "How many of these key performance indicators he's going to select.",
                    "label": 0
                },
                {
                    "sent": "I guess three is a minimum.",
                    "label": 0
                },
                {
                    "sent": "To do a good benchmark, but of course you can select all 66 indicators into the benchmark.",
                    "label": 0
                },
                {
                    "sent": "He would like to.",
                    "label": 0
                },
                {
                    "sent": "To do, and if he has the information available, he can even choose for ship indicators.",
                    "label": 0
                },
                {
                    "sent": "So time is not only the transfer time.",
                    "label": 0
                },
                {
                    "sent": "But you can break it down, you can disaggregate it also in the waiting time and all the time components.",
                    "label": 0
                },
                {
                    "sent": "Same for cost saving for sustainability.",
                    "label": 0
                },
                {
                    "sent": "Sustainability is not only CO2 but it also includes other externalities.",
                    "label": 0
                },
                {
                    "sent": "The qualitative indicators, reliability, quality, and flexibility are measured on a 5 point scale and it's really up to the user of the tool to make his own assessment.",
                    "label": 1
                },
                {
                    "sent": "How he compares the reliability of intermodal transport.",
                    "label": 0
                },
                {
                    "sent": "Thrill that includes shipping, how he compares that to route only options.",
                    "label": 0
                },
                {
                    "sent": "That",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Make it a bit more clear.",
                    "label": 0
                },
                {
                    "sent": "I will present the case that we carried out in the Netherlands.",
                    "label": 0
                },
                {
                    "sent": "First base case and this was really an existing case of rail transport which started in the northern part of the Netherlands.",
                    "label": 0
                },
                {
                    "sent": "Actually the village of start canal.",
                    "label": 0
                },
                {
                    "sent": "It was contained transporter thought of two TU which were transported to Feagans a in Italy.",
                    "label": 0
                },
                {
                    "sent": "And this base case.",
                    "label": 0
                },
                {
                    "sent": "So the current practice of this particular.",
                    "label": 0
                },
                {
                    "sent": "Shipper was to compare it with an internal alternative which had first around like from South Canal to Rotterdam and then a real leg from Rotterdam to free Gaza.",
                    "label": 0
                },
                {
                    "sent": "So that was the alternative which was applied for the bench.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Rock.",
                    "label": 0
                },
                {
                    "sent": "Well, this this user had actually a lot of information available, at least on his his base case for out.",
                    "label": 0
                },
                {
                    "sent": "You calculated the cost for the route only option.",
                    "label": 0
                },
                {
                    "sent": "At 2500 euros it took him 36 hours to ship the containers from start Canal, two free guns in Italy.",
                    "label": 0
                },
                {
                    "sent": "And he made an assessment as well of the qualitative indicators, and even applied to the ship indicators in this in this case.",
                    "label": 0
                },
                {
                    "sent": "It took a bit more time to collect information on the alternative cause.",
                    "label": 0
                },
                {
                    "sent": "It wasn't a daily practice.",
                    "label": 0
                },
                {
                    "sent": "We should put him into finding these figures and these are presented at the in the right column.",
                    "label": 0
                },
                {
                    "sent": "And they see that the real alternative which includes this pre haulage from the start screen to them and then by rail from Rotterdam to to Miller.",
                    "label": 0
                },
                {
                    "sent": "It was more costly.",
                    "label": 0
                },
                {
                    "sent": "It took much more time to ship the cargo from the start canal to figure.",
                    "label": 0
                },
                {
                    "sent": "But it was.",
                    "label": 0
                },
                {
                    "sent": "It had less much less environmental impact in terms of two emissions.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just as an example, but if you try the tool yourself, it's available on the website.",
                    "label": 1
                },
                {
                    "sent": "It's free of charge.",
                    "label": 0
                },
                {
                    "sent": "You can try it yourself.",
                    "label": 0
                },
                {
                    "sent": "You will finally end up in this output screen.",
                    "label": 0
                },
                {
                    "sent": "It consists of three tables.",
                    "label": 0
                },
                {
                    "sent": "The table at the top indicates the weights that you can allocate yourself to.",
                    "label": 0
                },
                {
                    "sent": "The key performance indicators, and in this case I just described.",
                    "label": 0
                },
                {
                    "sent": "The user allocated the highest weight to the transport cost 30% but you are flexible in doing that, so you can first allocate these weights to the key performance indicators and you can adapt that later.",
                    "label": 0
                },
                {
                    "sent": "The second table really provides the summary of the two cases that are being compared.",
                    "label": 1
                },
                {
                    "sent": "In this room you see the base case and the green shells really say that the base case performs better.",
                    "label": 0
                },
                {
                    "sent": "On the on the on the respective key performance indicators which are indicated in the columns.",
                    "label": 0
                },
                {
                    "sent": "Don't think it's you can see it in the bag, but believe me there are the key performance indicators.",
                    "label": 0
                },
                {
                    "sent": "And it's compared with the internal alternative, which is right below the below the base case.",
                    "label": 0
                },
                {
                    "sent": "A lot of red cells, which indicates that in this particular case the internal alternative scored worse on most key performance indicators, but I said it performed much better in terms of CO2 emissions.",
                    "label": 0
                },
                {
                    "sent": "I forgot to tell that's the CO2 emissions and also the other emissions.",
                    "label": 0
                },
                {
                    "sent": "You don't have to calculate it yourself.",
                    "label": 0
                },
                {
                    "sent": "The tool is developed in a way that it calculates the missions, the types of emissions fireequaltransit.org, which is also accessible through the Internet.",
                    "label": 0
                },
                {
                    "sent": "And then the table at the bottom.",
                    "label": 0
                },
                {
                    "sent": "This is really an overall summary which tells that in this case the base case is relative.",
                    "label": 0
                },
                {
                    "sent": "Only transport from static notifications are performs, overall around 10% better than the internal alternative.",
                    "label": 0
                },
                {
                    "sent": "Of course it's very much depends on the weights that the user has allocated to the key performance indicators, but as you want to understand, applying this tool several times, it also provides you with a kind of sensitivity analysis tool.",
                    "label": 0
                },
                {
                    "sent": "You can easily adapt to the weights and of course the outcomes will will change.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Actually, we started with a spreadsheet based tool which was tested in 40K studies.",
                    "label": 0
                },
                {
                    "sent": "Then we translated this tool to a web based application.",
                    "label": 0
                },
                {
                    "sent": "We collected a lot of feedback from about 80 cases which we performed.",
                    "label": 0
                },
                {
                    "sent": "And the main conclusions I've written down in this light ship is also logistic service providers told us.",
                    "label": 0
                },
                {
                    "sent": "That the do list is well structured.",
                    "label": 0
                },
                {
                    "sent": "It's quite simple to apply.",
                    "label": 0
                },
                {
                    "sent": "It only includes six main indicates you can select three at least.",
                    "label": 0
                },
                {
                    "sent": "It really helps to communicate.",
                    "label": 1
                },
                {
                    "sent": "The pros and cons of possible alternatives internally with your colleagues.",
                    "label": 0
                },
                {
                    "sent": "But also with your customers.",
                    "label": 0
                },
                {
                    "sent": "If you really think that sustainability is a major issue, it helps you too.",
                    "label": 1
                },
                {
                    "sent": "To make it more transparent, transparent to your colleagues will also to your clients.",
                    "label": 1
                },
                {
                    "sent": "Shippers especially told us that applying the tool.",
                    "label": 0
                },
                {
                    "sent": "Support them in evaluating incoming tenders.",
                    "label": 1
                },
                {
                    "sent": "And more towards policy the 4th bullet.",
                    "label": 1
                },
                {
                    "sent": "The tool can also be applied as a kind of analysis tool.",
                    "label": 0
                },
                {
                    "sent": "For the green freight corridors, because it's quite easy to compare.",
                    "label": 0
                },
                {
                    "sent": "Informal alternatives in certain freight corridors with unimodal transport.",
                    "label": 0
                },
                {
                    "sent": "Big cause.",
                    "label": 0
                },
                {
                    "sent": "Actually, none of these are included, but also yield are important.",
                    "label": 0
                },
                {
                    "sent": "Key performance indicators, quality as flexibility and reliability.",
                    "label": 0
                },
                {
                    "sent": "These are all included.",
                    "label": 0
                },
                {
                    "sent": "So it also provides a analysis tool for policymakers.",
                    "label": 0
                },
                {
                    "sent": "And of course, the European Commission.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At first the second tool, the Internal root Finder.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Also to be found on the website.",
                    "label": 0
                },
                {
                    "sent": "But actually it's a large database.",
                    "label": 0
                },
                {
                    "sent": "I first gives you some some information to have an understanding of what's included in the database.",
                    "label": 1
                },
                {
                    "sent": "We started to collect information in March 2010 with nine partners.",
                    "label": 0
                },
                {
                    "sent": "We started to collect information on transit times of transport services between different terminals.",
                    "label": 1
                },
                {
                    "sent": "We collected information on the frequencies of these services that were offered an we implemented it in a very simple first in a Excel spreadsheet database, but.",
                    "label": 0
                },
                {
                    "sent": "It came to launch.",
                    "label": 0
                },
                {
                    "sent": "We shifted to an access database.",
                    "label": 0
                },
                {
                    "sent": "But at this moment the database alone includes about 650 terminals, internal terminals, real terminals in shipping terminals, shorts you terminals.",
                    "label": 0
                },
                {
                    "sent": "It covers 327 plus no I plus Switzerland.",
                    "label": 0
                },
                {
                    "sent": "We developed a kind of root finding algorithm service finding algorithm.",
                    "label": 0
                },
                {
                    "sent": "Which really helps the user to find internal alternatives from a certain origin to a certain destination.",
                    "label": 0
                },
                {
                    "sent": "And if you run that application and will show it in the next slides.",
                    "label": 0
                },
                {
                    "sent": "It contains about 4000 Direct Terminal Terminal relations.",
                    "label": 0
                },
                {
                    "sent": "And we also included the possibility for the user to select its shipping terminal, so you're also allowed as user.",
                    "label": 0
                },
                {
                    "sent": "To select a terminal transhipment Terminal final terminal relation.",
                    "label": 1
                },
                {
                    "sent": "And then it's subject to about 70,000 indirect terminal relations that can be found through the European Animal Route Finder.",
                    "label": 1
                },
                {
                    "sent": "Just along a few screenshots.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you go to the website and you click on the European route Finder tip.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You will come into the screen and it's really works.",
                    "label": 0
                },
                {
                    "sent": "Very simple.",
                    "label": 0
                },
                {
                    "sent": "You select a country of origin, place of origin, where terminals are located.",
                    "label": 0
                },
                {
                    "sent": "You do the same at the right side for the destination country of destination.",
                    "label": 0
                },
                {
                    "sent": "Place the destination.",
                    "label": 0
                },
                {
                    "sent": "By default, the total transfer time is 7 days, but also this is flexible.",
                    "label": 0
                },
                {
                    "sent": "You can.",
                    "label": 0
                },
                {
                    "sent": "Choose a longer or shorter transfer time.",
                    "label": 0
                },
                {
                    "sent": "Once doing that, in this example, the country of origin is Germany, place of origin is Bremerhaven.",
                    "label": 0
                },
                {
                    "sent": "The cargo cargo needs to be shipped to Rotterdam so the user selected the Netherlands and Rotterdam and as you then tap on the proceed to final results which is at the bar.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You will come into this screen and here.",
                    "label": 0
                },
                {
                    "sent": "The overview contains all the intermodal alternatives that has been found in the database.",
                    "label": 1
                },
                {
                    "sent": "It works.",
                    "label": 0
                },
                {
                    "sent": "In the sense that the internal alternatives which takes the last the least transport time and number of days, is on top.",
                    "label": 0
                },
                {
                    "sent": "So in this particular case, the Euro gates terminal has been found.",
                    "label": 0
                },
                {
                    "sent": "An has been put as the best option, possibly because the transport time in days is 2 days.",
                    "label": 0
                },
                {
                    "sent": "It's also ordered by frequency.",
                    "label": 0
                },
                {
                    "sent": "In this example, the frequency of the surface that has been found is 5 times a week.",
                    "label": 0
                },
                {
                    "sent": "In the second column.",
                    "label": 0
                },
                {
                    "sent": "You will find a hyperlink to the web address of the terminal.",
                    "label": 0
                },
                {
                    "sent": "And in this particular Case No direct relations have been found, so these are all indirect relations an for indirect relations.",
                    "label": 0
                },
                {
                    "sent": "The output will also provide you with information on the transshipment terminal.",
                    "label": 0
                },
                {
                    "sent": "The first leg of transport, whether it's real, whether it's inland shipping, whether it's so, transport, and it will do the same for the second leg.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some of the features are built in as well.",
                    "label": 0
                },
                {
                    "sent": "One is that you can print a PDF report.",
                    "label": 0
                },
                {
                    "sent": "If you tap on that, I'm sorry if you tap on the on the hyper link of the web page of the terminal, you will end up here and you will find background information of the particle.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Terminal.",
                    "label": 0
                },
                {
                    "sent": "You can print PDF reports of all the alternatives that have been found in the internal database.",
                    "label": 0
                },
                {
                    "sent": "You will also find contact information of the terminal.",
                    "label": 0
                },
                {
                    "sent": "Telephone numbers.",
                    "label": 0
                },
                {
                    "sent": "Email addresses.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Etc.",
                    "label": 0
                },
                {
                    "sent": "Of course.",
                    "label": 0
                },
                {
                    "sent": "It's a proof of concept.",
                    "label": 0
                },
                {
                    "sent": "If you say it is now, it's just the beginning.",
                    "label": 0
                },
                {
                    "sent": "We hope to at least achieve to make the internal transport marker abit more transparent.",
                    "label": 0
                },
                {
                    "sent": "And this is also one of the aims which is written down in the White Paper to make the intermodal transport market the market of internal transport service abit more transparent.",
                    "label": 0
                },
                {
                    "sent": "The only objective we had when we try to develop this too.",
                    "label": 0
                },
                {
                    "sent": "Of course we tested it as well in about 80 cases and we received a lot of feedback.",
                    "label": 0
                },
                {
                    "sent": "Which functionalities could be improved?",
                    "label": 0
                },
                {
                    "sent": "I've listed them here.",
                    "label": 0
                },
                {
                    "sent": "Of course, the search functionality could be much more improved.",
                    "label": 0
                },
                {
                    "sent": "Allowing for instance, the user to select only the New York terminal or the whole country of destination and then all the destination terminals.",
                    "label": 0
                },
                {
                    "sent": "So you can really extent on the search externalities.",
                    "label": 0
                },
                {
                    "sent": "Another remark was made, and that's one of the top priorities to follow.",
                    "label": 0
                },
                {
                    "sent": "Up is also to include, of course, contact information of the shuttle operated, 'cause if you find interesting option you want to contact the shuttle operator or the batch operator and not the terminal operator.",
                    "label": 0
                },
                {
                    "sent": "The Third Point is to extend it to other countries assets.",
                    "label": 0
                },
                {
                    "sent": "At this moment, 29 European countries, but there is also an interest of some operators to extend it to countries.",
                    "label": 0
                },
                {
                    "sent": "Russia, Ukraine and Turkey.",
                    "label": 0
                },
                {
                    "sent": "At this moment the tool only provide you with the total transport time and number of days, which is not really accurate, so we would like to appreciate it a bit more.",
                    "label": 0
                },
                {
                    "sent": "This information to the actual number of weekdays when will its depart and when will it arrive and even the time of departure and arrival.",
                    "label": 0
                },
                {
                    "sent": "All the functionalities and mapping tools that you really see.",
                    "label": 0
                },
                {
                    "sent": "The intermodal surface is on the map.",
                    "label": 0
                },
                {
                    "sent": "And of course we look for possibilities too.",
                    "label": 0
                },
                {
                    "sent": "Upload the information directly to have a diploma directly by shuttle operators and batch operators rather than to collect the information ourselves.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Last point of my presentation.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I think I skipped this because it's also presented in this picture.",
                    "label": 0
                },
                {
                    "sent": "You already presented the four roles within the E Freight concept.",
                    "label": 0
                },
                {
                    "sent": "And I guess that's the linking pin between our European Animal Route Finder and the freight concept is really in the transport service description, which is in the middle.",
                    "label": 1
                },
                {
                    "sent": "From the transport service provider through the transport user.",
                    "label": 1
                },
                {
                    "sent": "Because actually what we did in the European Animal Route Finder is to develop a very simple basic transport service description.",
                    "label": 0
                },
                {
                    "sent": "Which grows from the transporter.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Added to the transport user.",
                    "label": 0
                },
                {
                    "sent": "And this basic transport service description we've developed in the AF contains information on the mode that is used.",
                    "label": 1
                },
                {
                    "sent": "In the transport service can be in shipping.",
                    "label": 1
                },
                {
                    "sent": "It can be real, can be short she.",
                    "label": 0
                },
                {
                    "sent": "Information on where their service actually starts and where it arrives.",
                    "label": 0
                },
                {
                    "sent": "Also, information on the frequency that is delivered by the servants 345 times a week.",
                    "label": 0
                },
                {
                    "sent": "And also the duration and number of days.",
                    "label": 1
                },
                {
                    "sent": "I would like to stress that the tool that we have developed is not a search facility which you can launch and it searches along the World Wide Web to enter model alternative.",
                    "label": 0
                },
                {
                    "sent": "No, it's really a standalone database at this moment.",
                    "label": 0
                },
                {
                    "sent": "You can only run an algorithm, it's accessible via Internet.",
                    "label": 0
                },
                {
                    "sent": "You can launch an algorithm and its search internal alternative.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For you.",
                    "label": 0
                },
                {
                    "sent": "How might it look like in future?",
                    "label": 0
                },
                {
                    "sent": "And I think he we we met the freight.",
                    "label": 0
                },
                {
                    "sent": "We can meet the freight concept.",
                    "label": 1
                },
                {
                    "sent": "At the top left you see the individual transport service.",
                    "label": 0
                },
                {
                    "sent": "Descriptions of individual transport service providers.",
                    "label": 0
                },
                {
                    "sent": "Labeled by T as the one up to TSDN, these are being inserted in a transport service description database.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "And optimization tool, which can be a more sophisticated algorithm that we have developed in the RF can be applied on that transport service description database to find real internal alternatives.",
                    "label": 0
                },
                {
                    "sent": "And then of course transfer plan.",
                    "label": 0
                },
                {
                    "sent": "Ishan shippers can retrieve data whenever they like.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So for the for the future, I think the transport service subscription.",
                    "label": 1
                },
                {
                    "sent": "Which we have.",
                    "label": 1
                },
                {
                    "sent": "Developed in the European Animal route Finder.",
                    "label": 0
                },
                {
                    "sent": "It can be much can be improved.",
                    "label": 0
                },
                {
                    "sent": "Especially where it concerns information on the departure and information on the arrivals, but also on the actual services that are being provided at the terminals.",
                    "label": 0
                },
                {
                    "sent": "For instance, where the terminals can handle dangerous quotes, whether they can handle all times of containers, whether they have repair facilities for for containers.",
                    "label": 0
                },
                {
                    "sent": "But this is really something for for the future an.",
                    "label": 0
                },
                {
                    "sent": "I'm really eager to hear your opinions about it.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Assets more information can be found on the project website which is at the bottom.",
                    "label": 0
                },
                {
                    "sent": "All deliverables are public and both tools that were developed in the logic projects are free of charge and you can just try.",
                    "label": 0
                },
                {
                    "sent": "Thank you for attention.",
                    "label": 0
                },
                {
                    "sent": "Thank you, win any any questions for your own.",
                    "label": 0
                },
                {
                    "sent": "Kim will start again.",
                    "label": 0
                },
                {
                    "sent": "Otherwise powerful features that I think if you actually get more stuff back, especially that hard with thousand 4000 kilometres.",
                    "label": 0
                },
                {
                    "sent": "It's not.",
                    "label": 0
                },
                {
                    "sent": "Look at the origin destination, so use railways Rd.",
                    "label": 0
                },
                {
                    "sent": "It's actually using strategically when people even charge the transshipment terminals, cells and the cause.",
                    "label": 0
                },
                {
                    "sent": "Another interesting parameter, possibly there is the critical transit time that the customer wants because Frank forwarders who are generally lazy who actually they put on Rd stays alright if they put their rally stays on right, but the possibility with transshipment where you actually get a much better service time by being part road and Park Trail and you also actually get the benefit usually of the rail link being much cheaper than the 50% of Travel Rd leg as well so you get a sustainability, you get a service commitment.",
                    "label": 0
                },
                {
                    "sent": "So betterment and and also cheaper out come and get what I call me calling Australia new Corridor, Connect using strategic transshipment terminals is generally not seen because of all sorts of political reasons are unusually as long as the time is actually somewhere between the critical time required by the customer and what Rd can deliver.",
                    "label": 0
                },
                {
                    "sent": "In many cases Rd over services, the customer requirements at a much more expensive rate and certainly.",
                    "label": 0
                },
                {
                    "sent": "Fonzarelli operator I would trying to be very strategic and actually opening up some of these strategic terminals for the long distance blur to Park Road Park Trail unifies and potentially your tool by the focusing on finding where you need to.",
                    "label": 0
                },
                {
                    "sent": "Actually really search the capability of actually finding the transshipment terminals where you can do part Road and Park trailer.",
                    "label": 0
                },
                {
                    "sent": "Meet the customer service critical requirement you will come in cheaper than Rd at a time requirement.",
                    "label": 0
                },
                {
                    "sent": "Basically it's still within the customer requirements and yet this entire mid corridor connects strategic value based.",
                    "label": 0
                },
                {
                    "sent": "Richard is almost on dribble.",
                    "label": 0
                },
                {
                    "sent": "Could be coming soon.",
                    "label": 0
                },
                {
                    "sent": "I've gotta go back to this light.",
                    "label": 0
                },
                {
                    "sent": "At least what you can do now with the tool is to select a maximum number of days.",
                    "label": 0
                },
                {
                    "sent": "You think yourself is reasonable for this service.",
                    "label": 0
                },
                {
                    "sent": "So if you think on certain freight corridor it should not exceed a total transfer time of two days, you can just select there two days and it will only find animal solutions which are at a maximum of two transport at a maximum of two days transport time.",
                    "label": 0
                },
                {
                    "sent": "Journal, but can do it within that time it will find it.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "This is a bit small.",
                    "label": 0
                },
                {
                    "sent": "This presentation very interesting here is showing the price difference and we look for a car and only the roads for the color takes the least price.",
                    "label": 0
                },
                {
                    "sent": "Lowest price group.",
                    "label": 0
                },
                {
                    "sent": "Not people in crisis in such a search function.",
                    "label": 0
                },
                {
                    "sent": "Is it the I think to take away the damn restraining of Jimmy's country?",
                    "label": 0
                },
                {
                    "sent": "August.",
                    "label": 0
                },
                {
                    "sent": "If you don't cut the price.",
                    "label": 0
                },
                {
                    "sent": "Don't take the price with this Calculator.",
                    "label": 0
                },
                {
                    "sent": "Don't fall for disappointing for for not to delivering a result.",
                    "label": 0
                },
                {
                    "sent": "I mean they will take the lowest price.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "It is true that, well, to be honest, we also took a case which.",
                    "label": 0
                },
                {
                    "sent": "If we had selected the case with where intermodal transport would be the very best solution.",
                    "label": 0
                },
                {
                    "sent": "That might start to raise questions.",
                    "label": 0
                },
                {
                    "sent": "That's always intermodal solutions would be the best outcome.",
                    "label": 0
                },
                {
                    "sent": "So to be honest, we also selected a real case which showed that in the more tense, but it's not always and not not in all cases the best solution.",
                    "label": 0
                },
                {
                    "sent": "But again, when we tested the tool.",
                    "label": 0
                },
                {
                    "sent": "There were still quite a number of shippers and logistics service providers which were triggered by the difference in environmental impact.",
                    "label": 0
                },
                {
                    "sent": "Although although they said well course there still is still the most important performance indicators, but as long as you don't see the real difference between CO2 emissions or small particles.",
                    "label": 0
                },
                {
                    "sent": "It's our belief that you always opt for the cheapest solution, especially as a small and medium enterprise.",
                    "label": 0
                },
                {
                    "sent": "One question back in back.",
                    "label": 0
                },
                {
                    "sent": "It says one point.",
                    "label": 0
                },
                {
                    "sent": "I think it's very interesting affected that you show.",
                    "label": 0
                },
                {
                    "sent": "However, you might have a lot of extra benefits if you take into account that in another presentation they really constipated or pointed out that waiting time in supply chain is about 40% for regular purposes.",
                    "label": 0
                },
                {
                    "sent": "Reason for that these custom system, let's say life difficult because they won't date at the base, their analysis on manifested that bill of lading.",
                    "label": 0
                },
                {
                    "sent": "That's not going to work.",
                    "label": 0
                },
                {
                    "sent": "If they would have the data from the source with consignor for instance.",
                    "label": 0
                },
                {
                    "sent": "They would do a much more efficient so you would have data at the point into model where you can switch, which is a much higher quality, which means that it could happen enormously impact on intermodal switching, and just as an anecdote that in the networks we did some case with Fulton vegetables, which is 98% of Rd transport coming from autonomic pulling, pushing and the estimate is that if we would have this type of data on silent.",
                    "label": 0
                },
                {
                    "sent": "Rather than Mike's data, they could switch into mobile in order down to Barnes, 50% reduced 50% of Rd transport, which is huge.",
                    "label": 0
                },
                {
                    "sent": "So it's 12 billion turnover, and so if you take that, if you combine those things where you say OK, not just taking standard data, because that's I think one of the key issues here.",
                    "label": 0
                },
                {
                    "sent": "But really going to consignment, which is, it's a revolution because it means that they are protected exchanges, practice of customs.",
                    "label": 0
                },
                {
                    "sent": "It integrates customs in the supply chain and basically they reduce business there.",
                    "label": 0
                },
                {
                    "sent": "So that's account.",
                    "label": 0
                },
                {
                    "sent": "So we have a new project in this home.",
                    "label": 0
                },
                {
                    "sent": "Voice, with its related to what you prayed with.",
                    "label": 0
                },
                {
                    "sent": "These ICM lies so that would be very interesting to combine data concerning that literally.",
                    "label": 0
                },
                {
                    "sent": "Project we really can see Epiglottic stand can be with the Customs Partnership more facilitative new facilitators.",
                    "label": 0
                },
                {
                    "sent": "Biking rather then.",
                    "label": 0
                },
                {
                    "sent": "Then it's now kind of obstruction.",
                    "label": 0
                },
                {
                    "sent": "Wiki issue is the decision to take really sourcing.",
                    "label": 0
                },
                {
                    "sent": "Which means again, legal and political power, but there might be some American alchemist steps, so we're well to be honest, already exchanged some ideas with your colleagues over lunch.",
                    "label": 0
                },
                {
                    "sent": "Some ideas about it?",
                    "label": 0
                },
                {
                    "sent": "These will be taken up for sure.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much everyone.",
                    "label": 0
                }
            ]
        }
    }
}