{
    "id": "wbhkj6dfouuze4vdq6x5t6xmmymbx7dn",
    "title": "Knowledge Discovery of Artistic Influences: A Metric Learning Approach",
    "info": {
        "author": [
            "Ahmed Elgammal, Department of Computer Science, Rutgers, The State University of New Jersey"
        ],
        "published": "Aug. 8, 2014",
        "recorded": "June 2014",
        "category": [
            "Top->Arts",
            "Top->Philosophy",
            "Top->Social Sciences->Psychology",
            "Top->Computer Science->Artificial Intelligence",
            "Top->Computer Science->Machine Learning"
        ]
    },
    "url": "http://videolectures.net/iccc2014_elgammal_metric_learning/",
    "segmentation": [
        [
            "So the talk is about.",
            "Discovering artistic influence.",
            "Although this is really a big goal, not really what we did.",
            "We just scratching the surface on this problem."
        ],
        [
            "So that's myself, I'ma astrophysical science at Rutgers and these are the students who did most of the work.",
            "Kind of was an undergraduate when she did this work from visual art and computer science.",
            "She basically doing the artistic part of that work while back is a beach day, students doing the Computer Vision Board of the work.",
            "Alright, so this is a creative."
        ],
        [
            "The conference why this is related?",
            "Basically, we all agree that understanding peoples creativity is essential.",
            "Building block in creating creative systems although.",
            "Somebody other than that?",
            "Looking at.",
            "Visual arts in particular is very interesting, 'cause it's very rich.",
            "Information here.",
            "And when artists look at being things you have."
        ],
        [
            "Visual language to describe their work.",
            "So artist talk about element of art.",
            "Things like space, texture, form, color, things like that and also principle of art.",
            "Things like Harmony, variety, movement, contrast.",
            "So these are a specific language artist use when they talk about their work and that's important when you make creative systems to do visual arts.",
            "But also there's other things like brush strokes and.",
            "Subject matters and things like that.",
            "What we are particular."
        ],
        [
            "Justin is influences between artists.",
            "We understand that influence is a very challenging area because what influence an artist can be something like some feeling.",
            "Or or some specific things, or some specific events that's really very hard to measure, but also measure influence.",
            "Artist is other piece of art as well.",
            "So basically being things communicate with each others somehow."
        ],
        [
            "Let me just put my pointer here.",
            "So for example, this is one of the most influential piece of art and we can see that big cause many artists later redraw the same events.",
            "I would say that Delhi would influenced by the painting by the venture, not by the event itself.",
            "The same thing here in Star Wars the same thing appears again and again so."
        ],
        [
            "There are."
        ],
        [
            "Who was the influential board, not the event itself, I would say.",
            "So basically, uh."
        ],
        [
            "Art historian study this problem for long time.",
            "How to find influences.",
            "And they do that by basically look at the language of art and trying to see similarities between paintings and putting that in historical context.",
            "So it's a very elaborate process."
        ],
        [
            "So this is 1 example of well cited influence.",
            "This is Francis Bacon bits of work which recreates an older.",
            "Baiting 45 of these paintings influenced by this by this exactly 1 painting.",
            "And so basically is an example of creativity in the recreation of an old work and this will side by art historian and the way they do that.",
            "Basically look at the composition and the use of color that is sharing all these visual elements that we talked about.",
            "However, all these art historian claims are many subjective and unless the artist themselves declared that had been influenced by others, we cannot really talk about art influence as truth, just.",
            "Always going to remain subject."
        ],
        [
            "So what do computer science know about art anyway?",
            "So making?",
            "Claims about influences.",
            "I know it's very sensitive and subjective, and we will sometimes don't like it, specially art historians.",
            "But I think it's very interesting if I ask this question, can computers really measure influence or help in that?",
            "At least we can start by the question can we translate visual language to computers to start with?",
            "It would be fun, and if you can really unearth some, had some hidden."
        ],
        [
            "In the critique of static judgment, Immanuel Kant argued that artistic taste which applies to our problem here is not cognitive and not logical, but mainly aesthetic and mainly subjective, so our computers capable of making such aesthetics judgments that question had been floating around since yesterday.",
            "But there's another question, which is is art influence itself is.",
            "Influence itself is going to be subjective or can be a benefit from some objective criteria as well.",
            "So."
        ],
        [
            "Our focus basically is.",
            "To address this influence, we need to really find good similarity measure between being things in between artists and with basically the major thing in this talk and have to declare that we are not asserting any truth.",
            "We just making suggestion or recommendation for art historian to look at things that maybe haven't you haven't looked at, especially now that in Digital World where millions of buildings are around and being accessible."
        ],
        [
            "Alright, so just a little prior research and general computer vision.",
            "People have looked on Google image similarity and recognition, but they haven't worked a lot on painting classification.",
            "This is just very few of the things that have been appeared rate to painting classification in general, which mainly address things like classifying a certain painting among us to detect or predict who painted this painting among a set of few.",
            "Artist maybe 8 or 10 or something like that.",
            "We would have look at similarity between paintings.",
            "Or things like predicting the date of painting.",
            "It's evil and archival of paintings that very little work has been done in influence.",
            "Like this work here who look at distinguishing Mango from contemporary.",
            "Again, very limited time.",
            "So very little has been done on that problem and we are working on the direction as well.",
            "So our focus would be finding a good representation."
        ],
        [
            "Pretty and measurements between being thing and then measure switching between artist."
        ],
        [
            "So I'm looking at buying things like that.",
            "What kind of similarity I should look at?",
            "Should we look at color, texture, decomposition or many things we should look at so the only look at low level feature also look at semantic meaning.",
            "Symmetric is very important because artists always use symbols to express meaning.",
            "So semantic is very important."
        ],
        [
            "So this is the first change what feature to use to measure similarity.",
            "And do high level features are powerful and useful in judging influences?",
            "The problem is how can we test these hypothesis?",
            "How to evaluate if you find something, we have some ground truth of influences that you can collect, but it's very few of them.",
            "So instead we use a proxy task which is type classification at least to learn our model.",
            "Strike classification is straightforward problem, which is we have certain styles of art, Renaissance, Baroque, Impressionism.",
            "Whatever.",
            "So there are classes here, so this can be easily mapped into a machine learning problem in a supervised setting, so this can be easily used to learn some model that you build, and then we can use this model to now discover influences later.",
            "So we collect."
        ],
        [
            "This set of 1700 paintings from 66 artists.",
            "This part of the market 100 hundred archive datasets spending time video from 1400 to recent 1996.",
            "Examples of the different styles in the painting has about 13 styles.",
            "Anne."
        ],
        [
            "And the first study that we have done on this will basically try to classify 70 art styles here.",
            "And what we look at."
        ],
        [
            "We look at basically applying different computer vision techniques to this problem, in particular, looking at this Community versus generative models using bag of visual words methodology to compare the performance of both of them in the task of strike classification.",
            "And also we look at discriminative models but then looking at different kind of features, low level feature versus features versus semantically."
        ],
        [
            "Features so I get some details.",
            "If you are not aware of that bag of word visual models.",
            "Very popular in object recognition.",
            "Include vision which basically look at some interest point images and find some resolution of the local neighborhoods and applying key means to find some codebook injecting histogram out of that.",
            "So basically the way to abstract the information in an image away from just the low level information and on top of that you can do discriminative training basic training classifiers to do the classification task.",
            "Or do agitative models things like latent topic models that are popular in text classification.",
            "So we basically evaluated this kind of techniques in this task on."
        ],
        [
            "Feature level we have low level features.",
            "Things like our histogram texture, banks Edge is an intermediate level feature which is basically this bag of words on some interest point detection and local features.",
            "But also we have high level semantic features.",
            "For high level semantic features, we use in particular classmate features which was proposed in front end by any."
        ],
        [
            "Basically interesting kind of features that we find a very fitting here.",
            "Basically what they do is the train a large number, about 25 hundred 600 classifiers for different terms.",
            "They collected terms from the web and between the images from the web has nothing to do with art at all.",
            "In terms it can be anything like airplane or submarine or any terms or even some activities like collaboration in terms.",
            "They collect images from that for these terms and train, we classifier classifier can be very weak in their performance and this classifier based on some basic features things like hog color shift.",
            "All these kind of features combined with multicolor kernel learning and the interesting thing that you use this 2500 classifiers themselves as a visual features to the next level of classifiers which can be used can be based on something like SVM or something like that.",
            "2 three in any new category.",
            "The interesting thing that is this 25 or 2600 classifier give you a representation that somehow semantic because it's it's 11 fires give you something about something in the image.",
            "So we thought this can be a very good representation at the semantic level to encode what's in an image was inhabiting engine.",
            "Although there's nothing here.",
            "We trained on any painting work."
        ],
        [
            "So these are outcome of the first study that we have done and these generative models and these are descriptive models and these are discriminative model with the semantic class feature and it was very interesting to visit this semantic level feature, outperform all other methods significantly.",
            "Looking at the details here, we can find that some art style are being classified better, but other techniques but more or less average.",
            "This is significantly better.",
            "So that's interesting, although that's predictable, because basically the semantic level model will capture the basically the subject matter in the painting.",
            "This is 1 example of a confusion matrix between the seven styles that Barack is the best."
        ],
        [
            "Side art style 87%, while Impressionism and Expressionism are confused all over the place, was only 48% classification.",
            "This is just one example of using the that particular message here.",
            "Alright, so that's interesting."
        ],
        [
            "So the conclusion is that high level semantic feature is a good descriptor, so it can be used for artistic influence.",
            "So let's look at the similarities between being that we find using this feature and see if it makes sense."
        ],
        [
            "Out of the 1700 images that we have of being things we look at, the most similar paintings out of these features and its results are very striking.",
            "The meaningful, so look at these things here.",
            "This is Van Gogh and mirrors, and is clearly a similar scene.",
            "Similar objects."
        ],
        [
            "Similar composition between artists are between paintings.",
            "Some."
        ],
        [
            "Things are obviously similar just because of the shape of the overall shape, although the content is very hard to see a similar not this."
        ],
        [
            "And was very interesting.",
            "This is Basil Studio painting and this is Rockwell Bieber barbershop painting.",
            "We were when we got this bit of similarity that we found it was very interesting to look at them because nobody have art history.",
            "Nobody had declared this to be similar at all, although when you look at the."
        ],
        [
            "It's obviously our base, similar for example.",
            "The perspective is very similar.",
            "You see here a combination of three people, three people here.",
            "There is a stove over here and over here and over here that share here and share here.",
            "Even the composition, the window here, the four quarters of the window has a similar vision here into four quarters, so that basically looking at similarity using computers, and you can discover things that no artist or historian has looked at, so that's that's very.",
            "Encouraging."
        ],
        [
            "Alright, so as I mentioned, the concurrent with high level features are really useful in performing the task classification, but we thought is it really the semantics of this feature that's giving you the power or something else so inside to dig deeper and look at the ingredient of this class features, which is basically basically based features that we also evaluated, and we thought why don't we use this space feature and apply something like metric learning.",
            "Where basically will try to find out, uh, waiting between the features that will somehow be best for the task.",
            "Alright, so I have to hurry here.",
            "So basically we use metric learning."
        ],
        [
            "On the best feature, which is basically something called just an hug.",
            "Basically these are features that look at the frequency domain of the image and this looks at the local oriented histogram.",
            "So we capture texture and color and variety of things and shape."
        ],
        [
            "Metric running if you are a machine learning person, you know that it's a generalization of the Mahalanobis distance where you basically the learning problem is usually you have a loss function and regularizer and the loss function.",
            "Here you use the style labels to minimize the loss function."
        ],
        [
            "And we visited five different techniques of popular metric learning approach for this task classification problem."
        ],
        [
            "And this is a result line that use class me.",
            "And this is the metric learning that use the same features that you used.",
            "But learn the metric and it's surprisingly that actually we can outperform classmate features that are semantics.",
            "So basically it says it's not the semantic that's really useful, it's somehow in the features are the information is there but have to wait them right too.",
            "To get the right answer, some of them are significantly better than the class mean."
        ],
        [
            "Or at least talk about influence.",
            "Now all this has been just about similarity between paintings.",
            "So."
        ],
        [
            "So for every artist have paintings and a time periods."
        ],
        [
            "We measure distance between being things were just mentioned using the metric and for every painting you can find out the best match from another artist, set of paintings and then you can compute an artist to artist set distance.",
            "The question how to define the distance between artists.",
            "You can think of the distance as the minimum.",
            "Link distance was basically that distance between the closest point in between them or a central tendency kind of dense distance like average or median.",
            "What a maximum distance like House of distance.",
            "So each one of them will have some intuition, although it's not clear what is the best.",
            "So what we did is a quantum quantized quantile percentile version of House of Distance where you can vary the Q here and this way we can evaluate different measures."
        ],
        [
            "Based on this and we can build influence graph where.",
            "Uses distance to build a graph.",
            "Weights on the graph given the time constraint between artists, of course an that graph can be used in getting."
        ],
        [
            "So there's some results.",
            "The first experiment here I'll show is learning learning the metric using the style labels.",
            "We now image query.",
            "We have a query image images from different styles, not from the same style.",
            "Because of this slide would be similar."
        ],
        [
            "And for example, here this is the query image on the left, which is claims.",
            "Hope painting and these are the top results from the boost metric.",
            "If you look at them, they can find that each of them Skechers some similarities.",
            "It's not really obvious, for example subject matter, most of them are women.",
            "Some nudity, some similarity in color, some stretchy and veterans.",
            "So as you see, different as are captured in the key similar things."
        ],
        [
            "1 meter metrics will result in different things.",
            "Here's the other metric.",
            "Again, this Mary are reasonable.",
            "Reasonable can see striking similarity between these paintings, although on different dimensions as I mentioned."
        ],
        [
            "The 2nd result I want to show is giving these metrics that we learn find the best, most similar briefing, not from the same styles."
        ],
        [
            "And these are some further so that everybody here is very similar, being things not from the same style.",
            "And it's very intuitive."
        ],
        [
            "Also, the kind of results we get kind of scenes kind of object."
        ],
        [
            "And so on."
        ],
        [
            "So all this."
        ],
        [
            "Different results, so now let's have some evaluation on influence discovery.",
            "So what we did we?"
        ],
        [
            "Collected some ground truth influences from art history books, which about 70 years like that like its shallows influenced by Picasso and things like that he's an infant by Bizarro things and we measure.",
            "Basically we measured the recall of our results based on the top key from the influence graph.",
            "There is no meaning to measure precision because we can declare influences that are not there.",
            "So there's no meaningful precision.",
            "So."
        ],
        [
            "So here are recall curves we can look at the Bieber to find."
        ],
        [
            "Using different percentiles and different."
        ],
        [
            "Techniques metric learning techniques.",
            "Interestingly, here that techniques that give the best performance in style classification gives the Bulls to performance in influence discovery.",
            "So it's quite interesting and unintuitive in the beginning."
        ],
        [
            "This is compared to some baseline that doesn't use metric learning, so it's keys that make learning help.",
            "Also in influence discovery.",
            "Here, at least in the using few key retrieval."
        ],
        [
            "This is actually our top five.",
            "Down here is the top five influence influences that we can declare for each artist here, so for each others we can have five influences.",
            "When I show this to artists, and art historian finds many of them make sense of them.",
            "He's had to say this similarity, but we cannot.",
            "This is the thing I mean, we are at the best.",
            "We can just tell you that these are similar.",
            "We cannot tell you they are really influences.",
            "This is something that they're context.",
            "Another historic things that you have to look at."
        ],
        [
            "But anyway, these are some of our thing."
        ],
        [
            "The last thing is, once we have this graph, we."
        ],
        [
            "Actually now, but the map of artist can now visualize this artist I mentioned like that we give you all the our database, an dimensional representation and you can see things like Picasso and Braque and Clint are very close which is very clear.",
            "Some artists like modern and abstract are very far away.",
            "Renaissance and Impressionism are very close to each other, although if you can."
        ],
        [
            "They mentioned a little bit this community, so this is very interesting to art.",
            "Historians look at this map where you can see all the artists together."
        ],
        [
            "Alright, so I'll see."
        ],
        [
            "Here a conclusion.",
            "We just crashed surface of a problem of artistic influence.",
            "I have alot of things to do in that problem.",
            "It's touching this creativity aspect, although not clear, we have still many things to do here.",
            "Alright, so I have to stop the time and let's move to questions.",
            "I was struck by Lichtenstein floating way up one day, the top left and it occurred to me that the reason he's up there is because he copied from comic book artists who were not in your database and who are not respected.",
            "Feet copied from someone else, he'd be.",
            "He'd be considered a fraud.",
            "It's far away from all the crowd of people who couldn't defend themselves.",
            "Was thinking along that lines if you compared you could use this for humorous purposes by finding similarities between high and low art.",
            "So generate visual jokes by comparing the Last Supper, two dogs playing pool.",
            "Dogs playing cards maybe?",
            "On more practically, you might use it for.",
            "For improving or generating advertisements so that the composition of advertising images have a more classical artistic composition, I just wondered what you thought about that.",
            "Things we can think about using this to do creativity which I haven't thought about about, but I am thinking about them now.",
            "Thank you so I was curious if if you think it might be interesting to give this tool as R2.",
            "Packages thing as a tool to give the art historians to allow them to kind of like an informational visualization tool.",
            "So if the tool can't ultimately kind of tell for sure whether this is influenced, like its similarity is like it's kind of strong suit, then if we give it to the art historians and let them explore like you said a lot of times for so many paintings that they would never be able to tell that these are ever similar.",
            "So then if we kind of give them a list of things that are a way to explore the space, that kind of help some.",
            "Something that I would like to do as I need some resources to that, but it's definitely something like.",
            "Another thing about this kind of tool is that measuring similarity between building is multi dimensional.",
            "You have to like that you can allow the artist to specify what kind of dimension we want to look at is something that's very hard for me to visualize here, but as a tool you can interact with this, and this is something that I would like to do.",
            "This this is really fascinating.",
            "Archaeologists have been working on exactly these issues because they're trying to organize historical artifacts into chronologically accurate lineages, and until well, I my students came along.",
            "They were actually just using completely low level features, nothing semantic at all, and so then I started to try to convince them to use a different modified algorithm that incorporates semantic information.",
            "So then I was happy with your first results that showed that that actually was useful, and then you said that.",
            "There was something that, with the proper weight then the algorithm that was just based on the low level features actually outperformed the semantic one, and I wonder what exactly you mean by proper weight and then the other question was rickerl regarding the recall curve.",
            "What I think there needs to be a little bit more explanation of what that conveyed to Get Me Out of it.",
            "So the first question, if you have different low level feature.",
            "And with them equally or with them by hand as a human.",
            "Differently, you might not have the best results at all.",
            "Machine learning techniques like metric learning try to adjust the waiting for different features in a task specific way.",
            "So here we have the task of classification, so it gives you the best ways to do this task, which really in that case will outperform any other features that are not weighted like even the semantic level features.",
            "So I'm sure in your domain also if using the techniques you going to have very good results.",
            "So, but but it doesn't really cancel my claim that semantic feature is useful.",
            "Obviously if use also metric learning on this semantic level feature, you can even get better, but we haven't done that.",
            "And recall curves is basically a way to compare this kind of result that we get with the ground truth that we have here.",
            "So basically what we do is when we have when we say, for example, that Goya was influenced by Rembrandt.",
            "An IF in the ground truth, Goya was effectively in fact actually influenced by Rembrandt.",
            "Then that's ahead.",
            "So we count how many hits we get out of the total number of influences in our database, which is about 70 and give you other equal number so that curves actually are these numbers here.",
            "So this is, uh, if you just find the top five results so the record is about 30 something obviously if you.",
            "Look at the top 10 or top 15.",
            "Recall we keep increasing to approach 100% because you're getting all the results.",
            "But what's most interesting is the top five, which I would say because most influences are really very small number of artists anyway.",
            "These are typical measure used in data mining and machine learning.",
            "OK, let us thank the speaker again.",
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the talk is about.",
                    "label": 0
                },
                {
                    "sent": "Discovering artistic influence.",
                    "label": 0
                },
                {
                    "sent": "Although this is really a big goal, not really what we did.",
                    "label": 0
                },
                {
                    "sent": "We just scratching the surface on this problem.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So that's myself, I'ma astrophysical science at Rutgers and these are the students who did most of the work.",
                    "label": 0
                },
                {
                    "sent": "Kind of was an undergraduate when she did this work from visual art and computer science.",
                    "label": 1
                },
                {
                    "sent": "She basically doing the artistic part of that work while back is a beach day, students doing the Computer Vision Board of the work.",
                    "label": 0
                },
                {
                    "sent": "Alright, so this is a creative.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The conference why this is related?",
                    "label": 0
                },
                {
                    "sent": "Basically, we all agree that understanding peoples creativity is essential.",
                    "label": 0
                },
                {
                    "sent": "Building block in creating creative systems although.",
                    "label": 0
                },
                {
                    "sent": "Somebody other than that?",
                    "label": 0
                },
                {
                    "sent": "Looking at.",
                    "label": 0
                },
                {
                    "sent": "Visual arts in particular is very interesting, 'cause it's very rich.",
                    "label": 0
                },
                {
                    "sent": "Information here.",
                    "label": 0
                },
                {
                    "sent": "And when artists look at being things you have.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Visual language to describe their work.",
                    "label": 1
                },
                {
                    "sent": "So artist talk about element of art.",
                    "label": 0
                },
                {
                    "sent": "Things like space, texture, form, color, things like that and also principle of art.",
                    "label": 1
                },
                {
                    "sent": "Things like Harmony, variety, movement, contrast.",
                    "label": 0
                },
                {
                    "sent": "So these are a specific language artist use when they talk about their work and that's important when you make creative systems to do visual arts.",
                    "label": 0
                },
                {
                    "sent": "But also there's other things like brush strokes and.",
                    "label": 0
                },
                {
                    "sent": "Subject matters and things like that.",
                    "label": 0
                },
                {
                    "sent": "What we are particular.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Justin is influences between artists.",
                    "label": 0
                },
                {
                    "sent": "We understand that influence is a very challenging area because what influence an artist can be something like some feeling.",
                    "label": 1
                },
                {
                    "sent": "Or or some specific things, or some specific events that's really very hard to measure, but also measure influence.",
                    "label": 0
                },
                {
                    "sent": "Artist is other piece of art as well.",
                    "label": 0
                },
                {
                    "sent": "So basically being things communicate with each others somehow.",
                    "label": 1
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let me just put my pointer here.",
                    "label": 0
                },
                {
                    "sent": "So for example, this is one of the most influential piece of art and we can see that big cause many artists later redraw the same events.",
                    "label": 0
                },
                {
                    "sent": "I would say that Delhi would influenced by the painting by the venture, not by the event itself.",
                    "label": 0
                },
                {
                    "sent": "The same thing here in Star Wars the same thing appears again and again so.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There are.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Who was the influential board, not the event itself, I would say.",
                    "label": 0
                },
                {
                    "sent": "So basically, uh.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Art historian study this problem for long time.",
                    "label": 0
                },
                {
                    "sent": "How to find influences.",
                    "label": 0
                },
                {
                    "sent": "And they do that by basically look at the language of art and trying to see similarities between paintings and putting that in historical context.",
                    "label": 0
                },
                {
                    "sent": "So it's a very elaborate process.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is 1 example of well cited influence.",
                    "label": 0
                },
                {
                    "sent": "This is Francis Bacon bits of work which recreates an older.",
                    "label": 0
                },
                {
                    "sent": "Baiting 45 of these paintings influenced by this by this exactly 1 painting.",
                    "label": 0
                },
                {
                    "sent": "And so basically is an example of creativity in the recreation of an old work and this will side by art historian and the way they do that.",
                    "label": 0
                },
                {
                    "sent": "Basically look at the composition and the use of color that is sharing all these visual elements that we talked about.",
                    "label": 0
                },
                {
                    "sent": "However, all these art historian claims are many subjective and unless the artist themselves declared that had been influenced by others, we cannot really talk about art influence as truth, just.",
                    "label": 0
                },
                {
                    "sent": "Always going to remain subject.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what do computer science know about art anyway?",
                    "label": 1
                },
                {
                    "sent": "So making?",
                    "label": 0
                },
                {
                    "sent": "Claims about influences.",
                    "label": 1
                },
                {
                    "sent": "I know it's very sensitive and subjective, and we will sometimes don't like it, specially art historians.",
                    "label": 0
                },
                {
                    "sent": "But I think it's very interesting if I ask this question, can computers really measure influence or help in that?",
                    "label": 1
                },
                {
                    "sent": "At least we can start by the question can we translate visual language to computers to start with?",
                    "label": 0
                },
                {
                    "sent": "It would be fun, and if you can really unearth some, had some hidden.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In the critique of static judgment, Immanuel Kant argued that artistic taste which applies to our problem here is not cognitive and not logical, but mainly aesthetic and mainly subjective, so our computers capable of making such aesthetics judgments that question had been floating around since yesterday.",
                    "label": 1
                },
                {
                    "sent": "But there's another question, which is is art influence itself is.",
                    "label": 0
                },
                {
                    "sent": "Influence itself is going to be subjective or can be a benefit from some objective criteria as well.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our focus basically is.",
                    "label": 0
                },
                {
                    "sent": "To address this influence, we need to really find good similarity measure between being things in between artists and with basically the major thing in this talk and have to declare that we are not asserting any truth.",
                    "label": 1
                },
                {
                    "sent": "We just making suggestion or recommendation for art historian to look at things that maybe haven't you haven't looked at, especially now that in Digital World where millions of buildings are around and being accessible.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Alright, so just a little prior research and general computer vision.",
                    "label": 1
                },
                {
                    "sent": "People have looked on Google image similarity and recognition, but they haven't worked a lot on painting classification.",
                    "label": 0
                },
                {
                    "sent": "This is just very few of the things that have been appeared rate to painting classification in general, which mainly address things like classifying a certain painting among us to detect or predict who painted this painting among a set of few.",
                    "label": 0
                },
                {
                    "sent": "Artist maybe 8 or 10 or something like that.",
                    "label": 1
                },
                {
                    "sent": "We would have look at similarity between paintings.",
                    "label": 0
                },
                {
                    "sent": "Or things like predicting the date of painting.",
                    "label": 1
                },
                {
                    "sent": "It's evil and archival of paintings that very little work has been done in influence.",
                    "label": 0
                },
                {
                    "sent": "Like this work here who look at distinguishing Mango from contemporary.",
                    "label": 0
                },
                {
                    "sent": "Again, very limited time.",
                    "label": 0
                },
                {
                    "sent": "So very little has been done on that problem and we are working on the direction as well.",
                    "label": 0
                },
                {
                    "sent": "So our focus would be finding a good representation.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Pretty and measurements between being thing and then measure switching between artist.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I'm looking at buying things like that.",
                    "label": 0
                },
                {
                    "sent": "What kind of similarity I should look at?",
                    "label": 0
                },
                {
                    "sent": "Should we look at color, texture, decomposition or many things we should look at so the only look at low level feature also look at semantic meaning.",
                    "label": 0
                },
                {
                    "sent": "Symmetric is very important because artists always use symbols to express meaning.",
                    "label": 1
                },
                {
                    "sent": "So semantic is very important.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is the first change what feature to use to measure similarity.",
                    "label": 1
                },
                {
                    "sent": "And do high level features are powerful and useful in judging influences?",
                    "label": 0
                },
                {
                    "sent": "The problem is how can we test these hypothesis?",
                    "label": 0
                },
                {
                    "sent": "How to evaluate if you find something, we have some ground truth of influences that you can collect, but it's very few of them.",
                    "label": 1
                },
                {
                    "sent": "So instead we use a proxy task which is type classification at least to learn our model.",
                    "label": 0
                },
                {
                    "sent": "Strike classification is straightforward problem, which is we have certain styles of art, Renaissance, Baroque, Impressionism.",
                    "label": 0
                },
                {
                    "sent": "Whatever.",
                    "label": 0
                },
                {
                    "sent": "So there are classes here, so this can be easily mapped into a machine learning problem in a supervised setting, so this can be easily used to learn some model that you build, and then we can use this model to now discover influences later.",
                    "label": 1
                },
                {
                    "sent": "So we collect.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This set of 1700 paintings from 66 artists.",
                    "label": 1
                },
                {
                    "sent": "This part of the market 100 hundred archive datasets spending time video from 1400 to recent 1996.",
                    "label": 0
                },
                {
                    "sent": "Examples of the different styles in the painting has about 13 styles.",
                    "label": 1
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the first study that we have done on this will basically try to classify 70 art styles here.",
                    "label": 0
                },
                {
                    "sent": "And what we look at.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We look at basically applying different computer vision techniques to this problem, in particular, looking at this Community versus generative models using bag of visual words methodology to compare the performance of both of them in the task of strike classification.",
                    "label": 0
                },
                {
                    "sent": "And also we look at discriminative models but then looking at different kind of features, low level feature versus features versus semantically.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Features so I get some details.",
                    "label": 0
                },
                {
                    "sent": "If you are not aware of that bag of word visual models.",
                    "label": 1
                },
                {
                    "sent": "Very popular in object recognition.",
                    "label": 1
                },
                {
                    "sent": "Include vision which basically look at some interest point images and find some resolution of the local neighborhoods and applying key means to find some codebook injecting histogram out of that.",
                    "label": 0
                },
                {
                    "sent": "So basically the way to abstract the information in an image away from just the low level information and on top of that you can do discriminative training basic training classifiers to do the classification task.",
                    "label": 1
                },
                {
                    "sent": "Or do agitative models things like latent topic models that are popular in text classification.",
                    "label": 0
                },
                {
                    "sent": "So we basically evaluated this kind of techniques in this task on.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Feature level we have low level features.",
                    "label": 0
                },
                {
                    "sent": "Things like our histogram texture, banks Edge is an intermediate level feature which is basically this bag of words on some interest point detection and local features.",
                    "label": 1
                },
                {
                    "sent": "But also we have high level semantic features.",
                    "label": 0
                },
                {
                    "sent": "For high level semantic features, we use in particular classmate features which was proposed in front end by any.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Basically interesting kind of features that we find a very fitting here.",
                    "label": 0
                },
                {
                    "sent": "Basically what they do is the train a large number, about 25 hundred 600 classifiers for different terms.",
                    "label": 1
                },
                {
                    "sent": "They collected terms from the web and between the images from the web has nothing to do with art at all.",
                    "label": 0
                },
                {
                    "sent": "In terms it can be anything like airplane or submarine or any terms or even some activities like collaboration in terms.",
                    "label": 0
                },
                {
                    "sent": "They collect images from that for these terms and train, we classifier classifier can be very weak in their performance and this classifier based on some basic features things like hog color shift.",
                    "label": 0
                },
                {
                    "sent": "All these kind of features combined with multicolor kernel learning and the interesting thing that you use this 2500 classifiers themselves as a visual features to the next level of classifiers which can be used can be based on something like SVM or something like that.",
                    "label": 0
                },
                {
                    "sent": "2 three in any new category.",
                    "label": 0
                },
                {
                    "sent": "The interesting thing that is this 25 or 2600 classifier give you a representation that somehow semantic because it's it's 11 fires give you something about something in the image.",
                    "label": 1
                },
                {
                    "sent": "So we thought this can be a very good representation at the semantic level to encode what's in an image was inhabiting engine.",
                    "label": 0
                },
                {
                    "sent": "Although there's nothing here.",
                    "label": 1
                },
                {
                    "sent": "We trained on any painting work.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So these are outcome of the first study that we have done and these generative models and these are descriptive models and these are discriminative model with the semantic class feature and it was very interesting to visit this semantic level feature, outperform all other methods significantly.",
                    "label": 0
                },
                {
                    "sent": "Looking at the details here, we can find that some art style are being classified better, but other techniques but more or less average.",
                    "label": 0
                },
                {
                    "sent": "This is significantly better.",
                    "label": 0
                },
                {
                    "sent": "So that's interesting, although that's predictable, because basically the semantic level model will capture the basically the subject matter in the painting.",
                    "label": 0
                },
                {
                    "sent": "This is 1 example of a confusion matrix between the seven styles that Barack is the best.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Side art style 87%, while Impressionism and Expressionism are confused all over the place, was only 48% classification.",
                    "label": 0
                },
                {
                    "sent": "This is just one example of using the that particular message here.",
                    "label": 0
                },
                {
                    "sent": "Alright, so that's interesting.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the conclusion is that high level semantic feature is a good descriptor, so it can be used for artistic influence.",
                    "label": 0
                },
                {
                    "sent": "So let's look at the similarities between being that we find using this feature and see if it makes sense.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Out of the 1700 images that we have of being things we look at, the most similar paintings out of these features and its results are very striking.",
                    "label": 0
                },
                {
                    "sent": "The meaningful, so look at these things here.",
                    "label": 0
                },
                {
                    "sent": "This is Van Gogh and mirrors, and is clearly a similar scene.",
                    "label": 0
                },
                {
                    "sent": "Similar objects.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Similar composition between artists are between paintings.",
                    "label": 0
                },
                {
                    "sent": "Some.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Things are obviously similar just because of the shape of the overall shape, although the content is very hard to see a similar not this.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And was very interesting.",
                    "label": 0
                },
                {
                    "sent": "This is Basil Studio painting and this is Rockwell Bieber barbershop painting.",
                    "label": 0
                },
                {
                    "sent": "We were when we got this bit of similarity that we found it was very interesting to look at them because nobody have art history.",
                    "label": 0
                },
                {
                    "sent": "Nobody had declared this to be similar at all, although when you look at the.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's obviously our base, similar for example.",
                    "label": 0
                },
                {
                    "sent": "The perspective is very similar.",
                    "label": 0
                },
                {
                    "sent": "You see here a combination of three people, three people here.",
                    "label": 0
                },
                {
                    "sent": "There is a stove over here and over here and over here that share here and share here.",
                    "label": 0
                },
                {
                    "sent": "Even the composition, the window here, the four quarters of the window has a similar vision here into four quarters, so that basically looking at similarity using computers, and you can discover things that no artist or historian has looked at, so that's that's very.",
                    "label": 0
                },
                {
                    "sent": "Encouraging.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Alright, so as I mentioned, the concurrent with high level features are really useful in performing the task classification, but we thought is it really the semantics of this feature that's giving you the power or something else so inside to dig deeper and look at the ingredient of this class features, which is basically basically based features that we also evaluated, and we thought why don't we use this space feature and apply something like metric learning.",
                    "label": 1
                },
                {
                    "sent": "Where basically will try to find out, uh, waiting between the features that will somehow be best for the task.",
                    "label": 0
                },
                {
                    "sent": "Alright, so I have to hurry here.",
                    "label": 0
                },
                {
                    "sent": "So basically we use metric learning.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On the best feature, which is basically something called just an hug.",
                    "label": 0
                },
                {
                    "sent": "Basically these are features that look at the frequency domain of the image and this looks at the local oriented histogram.",
                    "label": 0
                },
                {
                    "sent": "So we capture texture and color and variety of things and shape.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Metric running if you are a machine learning person, you know that it's a generalization of the Mahalanobis distance where you basically the learning problem is usually you have a loss function and regularizer and the loss function.",
                    "label": 0
                },
                {
                    "sent": "Here you use the style labels to minimize the loss function.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we visited five different techniques of popular metric learning approach for this task classification problem.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this is a result line that use class me.",
                    "label": 0
                },
                {
                    "sent": "And this is the metric learning that use the same features that you used.",
                    "label": 1
                },
                {
                    "sent": "But learn the metric and it's surprisingly that actually we can outperform classmate features that are semantics.",
                    "label": 0
                },
                {
                    "sent": "So basically it says it's not the semantic that's really useful, it's somehow in the features are the information is there but have to wait them right too.",
                    "label": 0
                },
                {
                    "sent": "To get the right answer, some of them are significantly better than the class mean.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or at least talk about influence.",
                    "label": 0
                },
                {
                    "sent": "Now all this has been just about similarity between paintings.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So for every artist have paintings and a time periods.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We measure distance between being things were just mentioned using the metric and for every painting you can find out the best match from another artist, set of paintings and then you can compute an artist to artist set distance.",
                    "label": 0
                },
                {
                    "sent": "The question how to define the distance between artists.",
                    "label": 1
                },
                {
                    "sent": "You can think of the distance as the minimum.",
                    "label": 0
                },
                {
                    "sent": "Link distance was basically that distance between the closest point in between them or a central tendency kind of dense distance like average or median.",
                    "label": 1
                },
                {
                    "sent": "What a maximum distance like House of distance.",
                    "label": 0
                },
                {
                    "sent": "So each one of them will have some intuition, although it's not clear what is the best.",
                    "label": 0
                },
                {
                    "sent": "So what we did is a quantum quantized quantile percentile version of House of Distance where you can vary the Q here and this way we can evaluate different measures.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Based on this and we can build influence graph where.",
                    "label": 1
                },
                {
                    "sent": "Uses distance to build a graph.",
                    "label": 1
                },
                {
                    "sent": "Weights on the graph given the time constraint between artists, of course an that graph can be used in getting.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So there's some results.",
                    "label": 0
                },
                {
                    "sent": "The first experiment here I'll show is learning learning the metric using the style labels.",
                    "label": 0
                },
                {
                    "sent": "We now image query.",
                    "label": 0
                },
                {
                    "sent": "We have a query image images from different styles, not from the same style.",
                    "label": 1
                },
                {
                    "sent": "Because of this slide would be similar.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And for example, here this is the query image on the left, which is claims.",
                    "label": 0
                },
                {
                    "sent": "Hope painting and these are the top results from the boost metric.",
                    "label": 0
                },
                {
                    "sent": "If you look at them, they can find that each of them Skechers some similarities.",
                    "label": 0
                },
                {
                    "sent": "It's not really obvious, for example subject matter, most of them are women.",
                    "label": 0
                },
                {
                    "sent": "Some nudity, some similarity in color, some stretchy and veterans.",
                    "label": 0
                },
                {
                    "sent": "So as you see, different as are captured in the key similar things.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "1 meter metrics will result in different things.",
                    "label": 0
                },
                {
                    "sent": "Here's the other metric.",
                    "label": 0
                },
                {
                    "sent": "Again, this Mary are reasonable.",
                    "label": 0
                },
                {
                    "sent": "Reasonable can see striking similarity between these paintings, although on different dimensions as I mentioned.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The 2nd result I want to show is giving these metrics that we learn find the best, most similar briefing, not from the same styles.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And these are some further so that everybody here is very similar, being things not from the same style.",
                    "label": 0
                },
                {
                    "sent": "And it's very intuitive.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also, the kind of results we get kind of scenes kind of object.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so on.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So all this.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Different results, so now let's have some evaluation on influence discovery.",
                    "label": 0
                },
                {
                    "sent": "So what we did we?",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Collected some ground truth influences from art history books, which about 70 years like that like its shallows influenced by Picasso and things like that he's an infant by Bizarro things and we measure.",
                    "label": 0
                },
                {
                    "sent": "Basically we measured the recall of our results based on the top key from the influence graph.",
                    "label": 0
                },
                {
                    "sent": "There is no meaning to measure precision because we can declare influences that are not there.",
                    "label": 0
                },
                {
                    "sent": "So there's no meaningful precision.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here are recall curves we can look at the Bieber to find.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Using different percentiles and different.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Techniques metric learning techniques.",
                    "label": 0
                },
                {
                    "sent": "Interestingly, here that techniques that give the best performance in style classification gives the Bulls to performance in influence discovery.",
                    "label": 0
                },
                {
                    "sent": "So it's quite interesting and unintuitive in the beginning.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is compared to some baseline that doesn't use metric learning, so it's keys that make learning help.",
                    "label": 0
                },
                {
                    "sent": "Also in influence discovery.",
                    "label": 0
                },
                {
                    "sent": "Here, at least in the using few key retrieval.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is actually our top five.",
                    "label": 0
                },
                {
                    "sent": "Down here is the top five influence influences that we can declare for each artist here, so for each others we can have five influences.",
                    "label": 0
                },
                {
                    "sent": "When I show this to artists, and art historian finds many of them make sense of them.",
                    "label": 0
                },
                {
                    "sent": "He's had to say this similarity, but we cannot.",
                    "label": 0
                },
                {
                    "sent": "This is the thing I mean, we are at the best.",
                    "label": 0
                },
                {
                    "sent": "We can just tell you that these are similar.",
                    "label": 0
                },
                {
                    "sent": "We cannot tell you they are really influences.",
                    "label": 0
                },
                {
                    "sent": "This is something that they're context.",
                    "label": 0
                },
                {
                    "sent": "Another historic things that you have to look at.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But anyway, these are some of our thing.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The last thing is, once we have this graph, we.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Actually now, but the map of artist can now visualize this artist I mentioned like that we give you all the our database, an dimensional representation and you can see things like Picasso and Braque and Clint are very close which is very clear.",
                    "label": 0
                },
                {
                    "sent": "Some artists like modern and abstract are very far away.",
                    "label": 0
                },
                {
                    "sent": "Renaissance and Impressionism are very close to each other, although if you can.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "They mentioned a little bit this community, so this is very interesting to art.",
                    "label": 0
                },
                {
                    "sent": "Historians look at this map where you can see all the artists together.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Alright, so I'll see.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here a conclusion.",
                    "label": 0
                },
                {
                    "sent": "We just crashed surface of a problem of artistic influence.",
                    "label": 0
                },
                {
                    "sent": "I have alot of things to do in that problem.",
                    "label": 0
                },
                {
                    "sent": "It's touching this creativity aspect, although not clear, we have still many things to do here.",
                    "label": 0
                },
                {
                    "sent": "Alright, so I have to stop the time and let's move to questions.",
                    "label": 0
                },
                {
                    "sent": "I was struck by Lichtenstein floating way up one day, the top left and it occurred to me that the reason he's up there is because he copied from comic book artists who were not in your database and who are not respected.",
                    "label": 0
                },
                {
                    "sent": "Feet copied from someone else, he'd be.",
                    "label": 0
                },
                {
                    "sent": "He'd be considered a fraud.",
                    "label": 0
                },
                {
                    "sent": "It's far away from all the crowd of people who couldn't defend themselves.",
                    "label": 0
                },
                {
                    "sent": "Was thinking along that lines if you compared you could use this for humorous purposes by finding similarities between high and low art.",
                    "label": 0
                },
                {
                    "sent": "So generate visual jokes by comparing the Last Supper, two dogs playing pool.",
                    "label": 0
                },
                {
                    "sent": "Dogs playing cards maybe?",
                    "label": 0
                },
                {
                    "sent": "On more practically, you might use it for.",
                    "label": 0
                },
                {
                    "sent": "For improving or generating advertisements so that the composition of advertising images have a more classical artistic composition, I just wondered what you thought about that.",
                    "label": 0
                },
                {
                    "sent": "Things we can think about using this to do creativity which I haven't thought about about, but I am thinking about them now.",
                    "label": 0
                },
                {
                    "sent": "Thank you so I was curious if if you think it might be interesting to give this tool as R2.",
                    "label": 0
                },
                {
                    "sent": "Packages thing as a tool to give the art historians to allow them to kind of like an informational visualization tool.",
                    "label": 0
                },
                {
                    "sent": "So if the tool can't ultimately kind of tell for sure whether this is influenced, like its similarity is like it's kind of strong suit, then if we give it to the art historians and let them explore like you said a lot of times for so many paintings that they would never be able to tell that these are ever similar.",
                    "label": 0
                },
                {
                    "sent": "So then if we kind of give them a list of things that are a way to explore the space, that kind of help some.",
                    "label": 0
                },
                {
                    "sent": "Something that I would like to do as I need some resources to that, but it's definitely something like.",
                    "label": 0
                },
                {
                    "sent": "Another thing about this kind of tool is that measuring similarity between building is multi dimensional.",
                    "label": 0
                },
                {
                    "sent": "You have to like that you can allow the artist to specify what kind of dimension we want to look at is something that's very hard for me to visualize here, but as a tool you can interact with this, and this is something that I would like to do.",
                    "label": 0
                },
                {
                    "sent": "This this is really fascinating.",
                    "label": 0
                },
                {
                    "sent": "Archaeologists have been working on exactly these issues because they're trying to organize historical artifacts into chronologically accurate lineages, and until well, I my students came along.",
                    "label": 0
                },
                {
                    "sent": "They were actually just using completely low level features, nothing semantic at all, and so then I started to try to convince them to use a different modified algorithm that incorporates semantic information.",
                    "label": 0
                },
                {
                    "sent": "So then I was happy with your first results that showed that that actually was useful, and then you said that.",
                    "label": 0
                },
                {
                    "sent": "There was something that, with the proper weight then the algorithm that was just based on the low level features actually outperformed the semantic one, and I wonder what exactly you mean by proper weight and then the other question was rickerl regarding the recall curve.",
                    "label": 0
                },
                {
                    "sent": "What I think there needs to be a little bit more explanation of what that conveyed to Get Me Out of it.",
                    "label": 0
                },
                {
                    "sent": "So the first question, if you have different low level feature.",
                    "label": 0
                },
                {
                    "sent": "And with them equally or with them by hand as a human.",
                    "label": 0
                },
                {
                    "sent": "Differently, you might not have the best results at all.",
                    "label": 0
                },
                {
                    "sent": "Machine learning techniques like metric learning try to adjust the waiting for different features in a task specific way.",
                    "label": 0
                },
                {
                    "sent": "So here we have the task of classification, so it gives you the best ways to do this task, which really in that case will outperform any other features that are not weighted like even the semantic level features.",
                    "label": 0
                },
                {
                    "sent": "So I'm sure in your domain also if using the techniques you going to have very good results.",
                    "label": 0
                },
                {
                    "sent": "So, but but it doesn't really cancel my claim that semantic feature is useful.",
                    "label": 0
                },
                {
                    "sent": "Obviously if use also metric learning on this semantic level feature, you can even get better, but we haven't done that.",
                    "label": 0
                },
                {
                    "sent": "And recall curves is basically a way to compare this kind of result that we get with the ground truth that we have here.",
                    "label": 0
                },
                {
                    "sent": "So basically what we do is when we have when we say, for example, that Goya was influenced by Rembrandt.",
                    "label": 0
                },
                {
                    "sent": "An IF in the ground truth, Goya was effectively in fact actually influenced by Rembrandt.",
                    "label": 0
                },
                {
                    "sent": "Then that's ahead.",
                    "label": 0
                },
                {
                    "sent": "So we count how many hits we get out of the total number of influences in our database, which is about 70 and give you other equal number so that curves actually are these numbers here.",
                    "label": 0
                },
                {
                    "sent": "So this is, uh, if you just find the top five results so the record is about 30 something obviously if you.",
                    "label": 0
                },
                {
                    "sent": "Look at the top 10 or top 15.",
                    "label": 0
                },
                {
                    "sent": "Recall we keep increasing to approach 100% because you're getting all the results.",
                    "label": 0
                },
                {
                    "sent": "But what's most interesting is the top five, which I would say because most influences are really very small number of artists anyway.",
                    "label": 0
                },
                {
                    "sent": "These are typical measure used in data mining and machine learning.",
                    "label": 0
                },
                {
                    "sent": "OK, let us thank the speaker again.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}