{
    "id": "wfbnqlrx56u7eonc3bjth4dlb2iv43hh",
    "title": "A review of first preliminary results from Quaero",
    "info": {
        "author": [
            "Pieter van der Linden, Technicolor S.A."
        ],
        "published": "June 19, 2009",
        "recorded": "May 2009",
        "category": [
            "Top->Science->Scientific Projects",
            "Top->Computer Science->Social Media"
        ]
    },
    "url": "http://videolectures.net/chorusfc09_linden_rfp/",
    "segmentation": [
        [
            "You're doing well, meaning it's lunchtime though, so I will.",
            "I will try to be short.",
            "So basically my my my present you know I have presented queer oh right.",
            "10s of times and I wanted to go quick on that and just to show some first reason."
        ],
        [
            "So very rapidly.",
            "What was the status?",
            "So we after some discussion and whatever we got the let's say administrative approvals from the European Commission for the French State and so forth, and then the developments of query did start in May 2008.",
            "It's only one year ago, exactly one year that we are in the air now.",
            "So it's clear roads are research and development program stretching over five years at the budget is about 200 million.",
            "It's assisted by the French stage through the public agency 00, and it involves 24 partners.",
            "The number is 24.",
            "The first year achievement is the first one.",
            "The most important is the project launch.",
            "We we did put the people on work and we have currently about like 300 researchers and engineers working.",
            "We have produced in one year there has been produced like hundreds of scientific publications.",
            "We have a first commercial results with the face detection algorithm.",
            "What is what is in the embedded in the exhibit image search engine?",
            "Second, to be commercial result which the 2424 actew.fr Bene service by Orange An and a whole bunch of technology demonstrators and I will show two of them.",
            "The one when his folks are needed when his face real quick."
        ],
        [
            "Mission.",
            "OK, this those are the partners.",
            "I will not go through the through the list of the partners.",
            "The only thing that is important to say is that there are private enterprises.",
            "There are two large groups Thompson, but is still a large group.",
            "May change, but the situation is still at large group France Telecom.",
            "Then we have a series of of SM ES.",
            "There's exactly Juve, better and so forth.",
            "Then we have public research laboratories, so we have a lot of.",
            "Public research there with INRIA.",
            "Patrick is there nosa?",
            "C&RS and also to universities from Germany.",
            "There's the University of Culture and one of the demos that will lose them from them.",
            "There's the University of.",
            "RW TH and then we also have the involvement of the French stage through a series of public institutions.",
            "There is the National Library.",
            "There's the.",
            "Meaning the military part, there's the E. Now it's the National Archive for Audio Visual and the elini.",
            "What's the equivalent to the?",
            "American next meeting the people in charge of measuring and establishing standards and all this is coordinated by."
        ],
        [
            "Thompson so why queer oh?",
            "Basically again, the squirrel denied it came up to, you know, to help this this poor lady here was kind of overwhelmed by a lot of information.",
            "We have a series of trends and you know nothing very different from what has already been said.",
            "Meaning volume is exploding, there is more and more usage of of content on new type of devices such as the PC to TV, handheld devices and so forth.",
            "Internet is becoming the privileged information space and we believe that search engines and search tools are the are the way to access to the.",
            "Through this this information and one of one other important point is that.",
            "Professor Ramesh Jain mentioned YouTube's YouTube as being one of the three important services and we believe that video search is a reality today, even if it's not the ideal video search video search is there."
        ],
        [
            "Um?",
            "So.",
            "The program what is it about?",
            "Meaning it's it's a collaborative research and development program.",
            "It's it's research is very important.",
            "We will.",
            "And it's focused on the automatic extract extraction, analyzes classification, use of multimedia, and multilingual complaints.",
            "Multilingual is there also.",
            "And basically all this, the goal of all this is to facilitate the content.",
            "The access to this content.",
            "Um?",
            "So I will."
        ],
        [
            "Skip that one.",
            "The way we are organized is that we have we have set up.",
            "You know you have those.",
            "Three very different populations working together.",
            "The research on the one hand, the industry, on the other hand, and then the institutional organizations we have set up a structure based on a series of so-called use cases or application projects.",
            "What range from the left side?",
            "Let's say the most related to the content and to the preparation of the content, and then the production of the content.",
            "What you digitalization content enrichment but is led by by Juve.",
            "So basically this just aims at building tools and software and services for editors, patent offices, libraries, digital libraries and so forth.",
            "Then going to the right, we have the digital media asset management project, but this leads in by two partners by Thompson and Ina, and basically this build software for broadcasters, media companies, audiovisual archives.",
            "The idea is here to enable the those organizations to keep track of their audiovisual content, do the annotations, and so forth.",
            "The third one is personalized video.",
            "This is again led by by Thompson.",
            "The idea here is to you know currently you have this possibility to have the TV and through ADSL lines.",
            "Basically what this does is just doing like TV Broadcasting TV, but it goes over an ADSL line.",
            "The next thing is to try to use the networking structure to actually personalize content and send content to the users that they actually.",
            "Are supposed to be interested in either through profiling, through detection of who's there, and so forth.",
            "Then we have the search engine's by excited and there will be a talk by.",
            "Like regularly have referenced it from my anxiety so I will not say too much on this project, but basically it is about.",
            "Actually it is the running of.",
            "A search engine what is purely text based or used to be purely text based and in the future it will be extended with video and audio and music and so forth.",
            "And the first I will do some show on that and the last one is the portal service project with by France Telecom.",
            "We will build new generations of access services, Georgia visual content and I will do the demo to show it.",
            "But that means and all this, those five projects are served by a shared research structure called the CTC for core technology cluster.",
            "So the same name is mentions my Regina and so this is a coordinated by SNR SNR WTH and you know it's working and trying to improve the state of the art.",
            "The technologies and trying to improve this state in the yard in a direction in the direction what is needed by those application projects.",
            "It's OK. OK, so basically what we would be trying to do, meaning it it it is not simple, it is, you know it's putting a series of guys together so you were in this rules and your academic said you should work together so it it takes sometimes to to to workout how this should work.",
            "And and I think we have done some some significant progress over the last year on that.",
            "First, the interest rules and research organizations cooperate on what?",
            "On building demonstrators with aim at identified businesses at businesses, what are in the scope of what those guys?",
            "War on this slide, sorry.",
            "Are doing.",
            "I shouldn't do."
        ],
        [
            "Because it's OK. One way that we organized it is through something called the corpora.",
            "Basically.",
            "All those technologies we're working on are based on analyzing, you know, images and an expert.",
            "Extrapolating on on an Infinity of images of something what has been learned on a small set of images.",
            "So basically the there's a strong investment into building the corporate building the the ground rules where the research community will be working on.",
            "And one other important point is that in order to measure.",
            "Where the research is going and to measure the fact that there that we are making progress along a path, there is objective measurement of results through a systematic benchmarking every."
        ],
        [
            "Here.",
            "OK, so this is a picture more impressionistic picture.",
            "What kind of says the same thing?",
            "Let let."
        ],
        [
            "Go fast.",
            "Here are the.",
            "Here are the main technologies we are working on.",
            "So.",
            "Windows protection so fingerprinting and so forth.",
            "Searching navigation with written language processing translation is an important aspect.",
            "Image processing, speech transcriptions or speech for speech to text, audio, and music.",
            "Analyzes mood, analyzes similarity and so forth.",
            "Just close to what Mickey's Ayama did.",
            "Did show video processing, an multimedia multimodal structuring."
        ],
        [
            "So this is globally the project.",
            "So what I wanted to show you today is just the first examples of where we were standing in one of 1.",
            "One of the let's say common goals.",
            "What is the video search?",
            "Just a very quick statement on where we're standing in video search.",
            "Video search exists.",
            "It's it's.",
            "It's rather important.",
            "YouTube is rated the second largest search engine in the and the number of requests done.",
            "But the way that this works today is is basically based on tags or on text.",
            "What is surrounding a video?",
            "Some pioneering applications using the transcription search are available from blinks from exhibit now.",
            "From Google and so forth.",
            "And what we believe is that over the next years there will be kind of significant progress in a series of areas such as object recognition, scene segmentation, speech transcription, translation and what combined together will allow to do more automatic feature extraction.",
            "And the goal is to.",
            "Progressively put this together and build it into use."
        ],
        [
            "Able applications, so let me let me just.",
            "Do a quick.",
            "Thing I I will start with the I have I have to take a note.",
            "I will start with the.",
            "A result from research.",
            "It was done by a PhD student from council were called.",
            "Housing has a make an L. He has been.",
            "He's got an award European biometric awards for for a paper, but describes the system.",
            "But I'm going to show you.",
            "So.",
            "Basically.",
            "What this is going to do?",
            "It is going to combine a face to face tracking.",
            "The algorithm with a face recognition algorithm to segment automatically video in a very short time.",
            "The video is, it is a.",
            "It's a friends like series.",
            "What has been released by BBC some years ago.",
            "Whatever it is, that's not important.",
            "The important is so.",
            "Here let's go let.",
            "OK, so the machine has detected two persons and now I want to see go browse through the.",
            "And to browse through those persons in the.",
            "In the in the whole seat and your whole abuse it.",
            "This series so the way to proceed this you just click on the visit on the on the face and all the scenes where there's actor.",
            "Appears automatically jump up.",
            "The yellow for click here.",
            "You can see my mouse.",
            "Yeah, you can see what I'm doing right?",
            "Here, here you always the same guy sitting, so it's a very convenient way.",
            "Just to get back.",
            "Through the beginning.",
            "I want to just very rapidly to show another feature.",
            "Up there we go.",
            "Up so.",
            "Here's this other guy you can click on it also, but there's some uncertainty that there's some.",
            "Uncertainty is not.",
            "The algorithm is not sure about witch witch witch witch guide is is so you can you know select yeah this is this is this is this is.",
            "This is him again.",
            "This is him.",
            "But this is not him and it is not him either.",
            "OK so and again click OK and then he will find all the scenes where this person occurs.",
            "So first example of something.",
            "What will allow you to segment like hundreds of hours of.",
            "A video very convenient in very rapidly.",
            "I'm.",
            "A second example.",
            "I wanted to.",
            "Is the rock solid application waxley this?",
            "This is an application that uses the software for Lindsey and vexes to transcribe the audio tape.",
            "The speech in audio tapes and so you know.",
            "It's only in French for the moment, so I I and the information is not particularly fresh.",
            "It said it's it's not a bad hour and Alpha side or whatever, it's just.",
            "A demo.",
            "So.",
            "They didn't work.",
            "OK, I just took this example.",
            "I did type something called Latvian holes.",
            "Via hose is a very famous title of a song by 80P F and you know.",
            "And then I did type Oscar and if you click on it you.",
            "But you will see that.",
            "Yeah, a year ago called the got the Oscar award for her participation in this in this film about Edit Piaf.",
            "So there she is.",
            "Meaning it's something I think it's interesting because it's something that manual annotation is very unlikely to put there.",
            "To annotate this film saying love jungholz, it's just because there's a full transcription of the audio table, but brings that the last one is.",
            "Actual mental service by by France Telecom.",
            "Basically what it is?",
            "It is a an aggregator of news streams and aggregates them by theme and then you can browse.",
            "Browse through it.",
            "So for instance, if I if I go here on this, this is the front page of the services I click here then I get you know.",
            "So it talks about labels.",
            "There's some issue and milk pricing or whatever and you get basically all the information.",
            "What is there?",
            "Through either by video on video, so by TV or radio or press here.",
            "OK. Click here you get.",
            "Um?",
            "OK, so those those are some 1st results, meaning it it's very it's rather preliminary.",
            "It's only one year that we're there.",
            "I think that in the future I will be capable to do more compelling and more complete demos, but that's what I have today."
        ],
        [
            "You know just to carry on that just a peek on on possibilities, but will be there.",
            "I will by the end of the year.",
            "I believe it will be showing video services TV services.",
            "Personalized TV services based on video recommendation.",
            "Targeted advertising using audience correct characterization.",
            "You know taking a webcam and looking at who's sitting there in order to find out who is what would be the most relevant content are their children or not.",
            "If there are children, then we filter out any.",
            "Violence or sex content or whatever.",
            "And model based classification."
        ],
        [
            "So that's it for today.",
            "Hi.",
            "I'm Andreas Hotel Siemens and I would have a question regarding your work on the corpora you've mentioned.",
            "You put a lot of effort in this.",
            "Is there any intent of making these corpora available?",
            "For example, in international benchmarking initiatives or.",
            "Would there be any possibility to use this outside quiero?",
            "I think that has the meaning yes and no meaning no to begin with.",
            "Meaning that it's filled by the partners as as as a as an investment, meaning industrial partners by the way, paid themselves to have this as an investment, and they want will want to build, you know, like competitiveadvantage it sit around this so it's unlikely that the corporate will be freely available now.",
            "We have currently are working on integrating so-called associated partners who can under certain conditions.",
            "Use the corpora and work on the and you know participate to do research so you don't.",
            "You don't, only.",
            "Use the corpora you participate in the research so you publish publish your results.",
            "You explain what you were doing and you get in exchange the corpora.",
            "That's the status today may change, but that's that's how it is."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You're doing well, meaning it's lunchtime though, so I will.",
                    "label": 0
                },
                {
                    "sent": "I will try to be short.",
                    "label": 0
                },
                {
                    "sent": "So basically my my my present you know I have presented queer oh right.",
                    "label": 0
                },
                {
                    "sent": "10s of times and I wanted to go quick on that and just to show some first reason.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So very rapidly.",
                    "label": 0
                },
                {
                    "sent": "What was the status?",
                    "label": 0
                },
                {
                    "sent": "So we after some discussion and whatever we got the let's say administrative approvals from the European Commission for the French State and so forth, and then the developments of query did start in May 2008.",
                    "label": 0
                },
                {
                    "sent": "It's only one year ago, exactly one year that we are in the air now.",
                    "label": 0
                },
                {
                    "sent": "So it's clear roads are research and development program stretching over five years at the budget is about 200 million.",
                    "label": 1
                },
                {
                    "sent": "It's assisted by the French stage through the public agency 00, and it involves 24 partners.",
                    "label": 0
                },
                {
                    "sent": "The number is 24.",
                    "label": 0
                },
                {
                    "sent": "The first year achievement is the first one.",
                    "label": 0
                },
                {
                    "sent": "The most important is the project launch.",
                    "label": 0
                },
                {
                    "sent": "We we did put the people on work and we have currently about like 300 researchers and engineers working.",
                    "label": 0
                },
                {
                    "sent": "We have produced in one year there has been produced like hundreds of scientific publications.",
                    "label": 0
                },
                {
                    "sent": "We have a first commercial results with the face detection algorithm.",
                    "label": 0
                },
                {
                    "sent": "What is what is in the embedded in the exhibit image search engine?",
                    "label": 0
                },
                {
                    "sent": "Second, to be commercial result which the 2424 actew.fr Bene service by Orange An and a whole bunch of technology demonstrators and I will show two of them.",
                    "label": 0
                },
                {
                    "sent": "The one when his folks are needed when his face real quick.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Mission.",
                    "label": 0
                },
                {
                    "sent": "OK, this those are the partners.",
                    "label": 0
                },
                {
                    "sent": "I will not go through the through the list of the partners.",
                    "label": 0
                },
                {
                    "sent": "The only thing that is important to say is that there are private enterprises.",
                    "label": 0
                },
                {
                    "sent": "There are two large groups Thompson, but is still a large group.",
                    "label": 0
                },
                {
                    "sent": "May change, but the situation is still at large group France Telecom.",
                    "label": 1
                },
                {
                    "sent": "Then we have a series of of SM ES.",
                    "label": 0
                },
                {
                    "sent": "There's exactly Juve, better and so forth.",
                    "label": 0
                },
                {
                    "sent": "Then we have public research laboratories, so we have a lot of.",
                    "label": 1
                },
                {
                    "sent": "Public research there with INRIA.",
                    "label": 0
                },
                {
                    "sent": "Patrick is there nosa?",
                    "label": 0
                },
                {
                    "sent": "C&RS and also to universities from Germany.",
                    "label": 0
                },
                {
                    "sent": "There's the University of Culture and one of the demos that will lose them from them.",
                    "label": 0
                },
                {
                    "sent": "There's the University of.",
                    "label": 0
                },
                {
                    "sent": "RW TH and then we also have the involvement of the French stage through a series of public institutions.",
                    "label": 0
                },
                {
                    "sent": "There is the National Library.",
                    "label": 0
                },
                {
                    "sent": "There's the.",
                    "label": 0
                },
                {
                    "sent": "Meaning the military part, there's the E. Now it's the National Archive for Audio Visual and the elini.",
                    "label": 0
                },
                {
                    "sent": "What's the equivalent to the?",
                    "label": 0
                },
                {
                    "sent": "American next meeting the people in charge of measuring and establishing standards and all this is coordinated by.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thompson so why queer oh?",
                    "label": 0
                },
                {
                    "sent": "Basically again, the squirrel denied it came up to, you know, to help this this poor lady here was kind of overwhelmed by a lot of information.",
                    "label": 0
                },
                {
                    "sent": "We have a series of trends and you know nothing very different from what has already been said.",
                    "label": 0
                },
                {
                    "sent": "Meaning volume is exploding, there is more and more usage of of content on new type of devices such as the PC to TV, handheld devices and so forth.",
                    "label": 0
                },
                {
                    "sent": "Internet is becoming the privileged information space and we believe that search engines and search tools are the are the way to access to the.",
                    "label": 1
                },
                {
                    "sent": "Through this this information and one of one other important point is that.",
                    "label": 1
                },
                {
                    "sent": "Professor Ramesh Jain mentioned YouTube's YouTube as being one of the three important services and we believe that video search is a reality today, even if it's not the ideal video search video search is there.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The program what is it about?",
                    "label": 1
                },
                {
                    "sent": "Meaning it's it's a collaborative research and development program.",
                    "label": 1
                },
                {
                    "sent": "It's it's research is very important.",
                    "label": 0
                },
                {
                    "sent": "We will.",
                    "label": 1
                },
                {
                    "sent": "And it's focused on the automatic extract extraction, analyzes classification, use of multimedia, and multilingual complaints.",
                    "label": 0
                },
                {
                    "sent": "Multilingual is there also.",
                    "label": 1
                },
                {
                    "sent": "And basically all this, the goal of all this is to facilitate the content.",
                    "label": 0
                },
                {
                    "sent": "The access to this content.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So I will.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Skip that one.",
                    "label": 0
                },
                {
                    "sent": "The way we are organized is that we have we have set up.",
                    "label": 0
                },
                {
                    "sent": "You know you have those.",
                    "label": 0
                },
                {
                    "sent": "Three very different populations working together.",
                    "label": 0
                },
                {
                    "sent": "The research on the one hand, the industry, on the other hand, and then the institutional organizations we have set up a structure based on a series of so-called use cases or application projects.",
                    "label": 0
                },
                {
                    "sent": "What range from the left side?",
                    "label": 0
                },
                {
                    "sent": "Let's say the most related to the content and to the preparation of the content, and then the production of the content.",
                    "label": 0
                },
                {
                    "sent": "What you digitalization content enrichment but is led by by Juve.",
                    "label": 1
                },
                {
                    "sent": "So basically this just aims at building tools and software and services for editors, patent offices, libraries, digital libraries and so forth.",
                    "label": 1
                },
                {
                    "sent": "Then going to the right, we have the digital media asset management project, but this leads in by two partners by Thompson and Ina, and basically this build software for broadcasters, media companies, audiovisual archives.",
                    "label": 1
                },
                {
                    "sent": "The idea is here to enable the those organizations to keep track of their audiovisual content, do the annotations, and so forth.",
                    "label": 0
                },
                {
                    "sent": "The third one is personalized video.",
                    "label": 0
                },
                {
                    "sent": "This is again led by by Thompson.",
                    "label": 0
                },
                {
                    "sent": "The idea here is to you know currently you have this possibility to have the TV and through ADSL lines.",
                    "label": 0
                },
                {
                    "sent": "Basically what this does is just doing like TV Broadcasting TV, but it goes over an ADSL line.",
                    "label": 0
                },
                {
                    "sent": "The next thing is to try to use the networking structure to actually personalize content and send content to the users that they actually.",
                    "label": 0
                },
                {
                    "sent": "Are supposed to be interested in either through profiling, through detection of who's there, and so forth.",
                    "label": 0
                },
                {
                    "sent": "Then we have the search engine's by excited and there will be a talk by.",
                    "label": 0
                },
                {
                    "sent": "Like regularly have referenced it from my anxiety so I will not say too much on this project, but basically it is about.",
                    "label": 0
                },
                {
                    "sent": "Actually it is the running of.",
                    "label": 0
                },
                {
                    "sent": "A search engine what is purely text based or used to be purely text based and in the future it will be extended with video and audio and music and so forth.",
                    "label": 1
                },
                {
                    "sent": "And the first I will do some show on that and the last one is the portal service project with by France Telecom.",
                    "label": 1
                },
                {
                    "sent": "We will build new generations of access services, Georgia visual content and I will do the demo to show it.",
                    "label": 0
                },
                {
                    "sent": "But that means and all this, those five projects are served by a shared research structure called the CTC for core technology cluster.",
                    "label": 0
                },
                {
                    "sent": "So the same name is mentions my Regina and so this is a coordinated by SNR SNR WTH and you know it's working and trying to improve the state of the art.",
                    "label": 0
                },
                {
                    "sent": "The technologies and trying to improve this state in the yard in a direction in the direction what is needed by those application projects.",
                    "label": 0
                },
                {
                    "sent": "It's OK. OK, so basically what we would be trying to do, meaning it it it is not simple, it is, you know it's putting a series of guys together so you were in this rules and your academic said you should work together so it it takes sometimes to to to workout how this should work.",
                    "label": 0
                },
                {
                    "sent": "And and I think we have done some some significant progress over the last year on that.",
                    "label": 0
                },
                {
                    "sent": "First, the interest rules and research organizations cooperate on what?",
                    "label": 0
                },
                {
                    "sent": "On building demonstrators with aim at identified businesses at businesses, what are in the scope of what those guys?",
                    "label": 0
                },
                {
                    "sent": "War on this slide, sorry.",
                    "label": 0
                },
                {
                    "sent": "Are doing.",
                    "label": 0
                },
                {
                    "sent": "I shouldn't do.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Because it's OK. One way that we organized it is through something called the corpora.",
                    "label": 0
                },
                {
                    "sent": "Basically.",
                    "label": 0
                },
                {
                    "sent": "All those technologies we're working on are based on analyzing, you know, images and an expert.",
                    "label": 0
                },
                {
                    "sent": "Extrapolating on on an Infinity of images of something what has been learned on a small set of images.",
                    "label": 0
                },
                {
                    "sent": "So basically the there's a strong investment into building the corporate building the the ground rules where the research community will be working on.",
                    "label": 1
                },
                {
                    "sent": "And one other important point is that in order to measure.",
                    "label": 0
                },
                {
                    "sent": "Where the research is going and to measure the fact that there that we are making progress along a path, there is objective measurement of results through a systematic benchmarking every.",
                    "label": 1
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is a picture more impressionistic picture.",
                    "label": 0
                },
                {
                    "sent": "What kind of says the same thing?",
                    "label": 0
                },
                {
                    "sent": "Let let.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Go fast.",
                    "label": 0
                },
                {
                    "sent": "Here are the.",
                    "label": 0
                },
                {
                    "sent": "Here are the main technologies we are working on.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Windows protection so fingerprinting and so forth.",
                    "label": 0
                },
                {
                    "sent": "Searching navigation with written language processing translation is an important aspect.",
                    "label": 1
                },
                {
                    "sent": "Image processing, speech transcriptions or speech for speech to text, audio, and music.",
                    "label": 0
                },
                {
                    "sent": "Analyzes mood, analyzes similarity and so forth.",
                    "label": 0
                },
                {
                    "sent": "Just close to what Mickey's Ayama did.",
                    "label": 1
                },
                {
                    "sent": "Did show video processing, an multimedia multimodal structuring.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is globally the project.",
                    "label": 0
                },
                {
                    "sent": "So what I wanted to show you today is just the first examples of where we were standing in one of 1.",
                    "label": 0
                },
                {
                    "sent": "One of the let's say common goals.",
                    "label": 0
                },
                {
                    "sent": "What is the video search?",
                    "label": 0
                },
                {
                    "sent": "Just a very quick statement on where we're standing in video search.",
                    "label": 0
                },
                {
                    "sent": "Video search exists.",
                    "label": 0
                },
                {
                    "sent": "It's it's.",
                    "label": 0
                },
                {
                    "sent": "It's rather important.",
                    "label": 0
                },
                {
                    "sent": "YouTube is rated the second largest search engine in the and the number of requests done.",
                    "label": 0
                },
                {
                    "sent": "But the way that this works today is is basically based on tags or on text.",
                    "label": 0
                },
                {
                    "sent": "What is surrounding a video?",
                    "label": 0
                },
                {
                    "sent": "Some pioneering applications using the transcription search are available from blinks from exhibit now.",
                    "label": 1
                },
                {
                    "sent": "From Google and so forth.",
                    "label": 0
                },
                {
                    "sent": "And what we believe is that over the next years there will be kind of significant progress in a series of areas such as object recognition, scene segmentation, speech transcription, translation and what combined together will allow to do more automatic feature extraction.",
                    "label": 1
                },
                {
                    "sent": "And the goal is to.",
                    "label": 0
                },
                {
                    "sent": "Progressively put this together and build it into use.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Able applications, so let me let me just.",
                    "label": 0
                },
                {
                    "sent": "Do a quick.",
                    "label": 0
                },
                {
                    "sent": "Thing I I will start with the I have I have to take a note.",
                    "label": 0
                },
                {
                    "sent": "I will start with the.",
                    "label": 0
                },
                {
                    "sent": "A result from research.",
                    "label": 0
                },
                {
                    "sent": "It was done by a PhD student from council were called.",
                    "label": 0
                },
                {
                    "sent": "Housing has a make an L. He has been.",
                    "label": 0
                },
                {
                    "sent": "He's got an award European biometric awards for for a paper, but describes the system.",
                    "label": 0
                },
                {
                    "sent": "But I'm going to show you.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Basically.",
                    "label": 0
                },
                {
                    "sent": "What this is going to do?",
                    "label": 0
                },
                {
                    "sent": "It is going to combine a face to face tracking.",
                    "label": 0
                },
                {
                    "sent": "The algorithm with a face recognition algorithm to segment automatically video in a very short time.",
                    "label": 0
                },
                {
                    "sent": "The video is, it is a.",
                    "label": 0
                },
                {
                    "sent": "It's a friends like series.",
                    "label": 0
                },
                {
                    "sent": "What has been released by BBC some years ago.",
                    "label": 0
                },
                {
                    "sent": "Whatever it is, that's not important.",
                    "label": 0
                },
                {
                    "sent": "The important is so.",
                    "label": 0
                },
                {
                    "sent": "Here let's go let.",
                    "label": 0
                },
                {
                    "sent": "OK, so the machine has detected two persons and now I want to see go browse through the.",
                    "label": 0
                },
                {
                    "sent": "And to browse through those persons in the.",
                    "label": 0
                },
                {
                    "sent": "In the in the whole seat and your whole abuse it.",
                    "label": 0
                },
                {
                    "sent": "This series so the way to proceed this you just click on the visit on the on the face and all the scenes where there's actor.",
                    "label": 0
                },
                {
                    "sent": "Appears automatically jump up.",
                    "label": 0
                },
                {
                    "sent": "The yellow for click here.",
                    "label": 0
                },
                {
                    "sent": "You can see my mouse.",
                    "label": 0
                },
                {
                    "sent": "Yeah, you can see what I'm doing right?",
                    "label": 0
                },
                {
                    "sent": "Here, here you always the same guy sitting, so it's a very convenient way.",
                    "label": 0
                },
                {
                    "sent": "Just to get back.",
                    "label": 0
                },
                {
                    "sent": "Through the beginning.",
                    "label": 0
                },
                {
                    "sent": "I want to just very rapidly to show another feature.",
                    "label": 0
                },
                {
                    "sent": "Up there we go.",
                    "label": 0
                },
                {
                    "sent": "Up so.",
                    "label": 0
                },
                {
                    "sent": "Here's this other guy you can click on it also, but there's some uncertainty that there's some.",
                    "label": 0
                },
                {
                    "sent": "Uncertainty is not.",
                    "label": 0
                },
                {
                    "sent": "The algorithm is not sure about witch witch witch witch guide is is so you can you know select yeah this is this is this is this is.",
                    "label": 0
                },
                {
                    "sent": "This is him again.",
                    "label": 0
                },
                {
                    "sent": "This is him.",
                    "label": 0
                },
                {
                    "sent": "But this is not him and it is not him either.",
                    "label": 0
                },
                {
                    "sent": "OK so and again click OK and then he will find all the scenes where this person occurs.",
                    "label": 0
                },
                {
                    "sent": "So first example of something.",
                    "label": 0
                },
                {
                    "sent": "What will allow you to segment like hundreds of hours of.",
                    "label": 0
                },
                {
                    "sent": "A video very convenient in very rapidly.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "A second example.",
                    "label": 0
                },
                {
                    "sent": "I wanted to.",
                    "label": 0
                },
                {
                    "sent": "Is the rock solid application waxley this?",
                    "label": 0
                },
                {
                    "sent": "This is an application that uses the software for Lindsey and vexes to transcribe the audio tape.",
                    "label": 0
                },
                {
                    "sent": "The speech in audio tapes and so you know.",
                    "label": 0
                },
                {
                    "sent": "It's only in French for the moment, so I I and the information is not particularly fresh.",
                    "label": 0
                },
                {
                    "sent": "It said it's it's not a bad hour and Alpha side or whatever, it's just.",
                    "label": 0
                },
                {
                    "sent": "A demo.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "They didn't work.",
                    "label": 0
                },
                {
                    "sent": "OK, I just took this example.",
                    "label": 0
                },
                {
                    "sent": "I did type something called Latvian holes.",
                    "label": 0
                },
                {
                    "sent": "Via hose is a very famous title of a song by 80P F and you know.",
                    "label": 0
                },
                {
                    "sent": "And then I did type Oscar and if you click on it you.",
                    "label": 0
                },
                {
                    "sent": "But you will see that.",
                    "label": 0
                },
                {
                    "sent": "Yeah, a year ago called the got the Oscar award for her participation in this in this film about Edit Piaf.",
                    "label": 0
                },
                {
                    "sent": "So there she is.",
                    "label": 0
                },
                {
                    "sent": "Meaning it's something I think it's interesting because it's something that manual annotation is very unlikely to put there.",
                    "label": 0
                },
                {
                    "sent": "To annotate this film saying love jungholz, it's just because there's a full transcription of the audio table, but brings that the last one is.",
                    "label": 0
                },
                {
                    "sent": "Actual mental service by by France Telecom.",
                    "label": 0
                },
                {
                    "sent": "Basically what it is?",
                    "label": 0
                },
                {
                    "sent": "It is a an aggregator of news streams and aggregates them by theme and then you can browse.",
                    "label": 0
                },
                {
                    "sent": "Browse through it.",
                    "label": 0
                },
                {
                    "sent": "So for instance, if I if I go here on this, this is the front page of the services I click here then I get you know.",
                    "label": 0
                },
                {
                    "sent": "So it talks about labels.",
                    "label": 0
                },
                {
                    "sent": "There's some issue and milk pricing or whatever and you get basically all the information.",
                    "label": 0
                },
                {
                    "sent": "What is there?",
                    "label": 0
                },
                {
                    "sent": "Through either by video on video, so by TV or radio or press here.",
                    "label": 0
                },
                {
                    "sent": "OK. Click here you get.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "OK, so those those are some 1st results, meaning it it's very it's rather preliminary.",
                    "label": 0
                },
                {
                    "sent": "It's only one year that we're there.",
                    "label": 0
                },
                {
                    "sent": "I think that in the future I will be capable to do more compelling and more complete demos, but that's what I have today.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You know just to carry on that just a peek on on possibilities, but will be there.",
                    "label": 0
                },
                {
                    "sent": "I will by the end of the year.",
                    "label": 0
                },
                {
                    "sent": "I believe it will be showing video services TV services.",
                    "label": 0
                },
                {
                    "sent": "Personalized TV services based on video recommendation.",
                    "label": 0
                },
                {
                    "sent": "Targeted advertising using audience correct characterization.",
                    "label": 0
                },
                {
                    "sent": "You know taking a webcam and looking at who's sitting there in order to find out who is what would be the most relevant content are their children or not.",
                    "label": 0
                },
                {
                    "sent": "If there are children, then we filter out any.",
                    "label": 0
                },
                {
                    "sent": "Violence or sex content or whatever.",
                    "label": 0
                },
                {
                    "sent": "And model based classification.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that's it for today.",
                    "label": 0
                },
                {
                    "sent": "Hi.",
                    "label": 0
                },
                {
                    "sent": "I'm Andreas Hotel Siemens and I would have a question regarding your work on the corpora you've mentioned.",
                    "label": 0
                },
                {
                    "sent": "You put a lot of effort in this.",
                    "label": 0
                },
                {
                    "sent": "Is there any intent of making these corpora available?",
                    "label": 0
                },
                {
                    "sent": "For example, in international benchmarking initiatives or.",
                    "label": 0
                },
                {
                    "sent": "Would there be any possibility to use this outside quiero?",
                    "label": 0
                },
                {
                    "sent": "I think that has the meaning yes and no meaning no to begin with.",
                    "label": 0
                },
                {
                    "sent": "Meaning that it's filled by the partners as as as a as an investment, meaning industrial partners by the way, paid themselves to have this as an investment, and they want will want to build, you know, like competitiveadvantage it sit around this so it's unlikely that the corporate will be freely available now.",
                    "label": 0
                },
                {
                    "sent": "We have currently are working on integrating so-called associated partners who can under certain conditions.",
                    "label": 0
                },
                {
                    "sent": "Use the corpora and work on the and you know participate to do research so you don't.",
                    "label": 0
                },
                {
                    "sent": "You don't, only.",
                    "label": 0
                },
                {
                    "sent": "Use the corpora you participate in the research so you publish publish your results.",
                    "label": 0
                },
                {
                    "sent": "You explain what you were doing and you get in exchange the corpora.",
                    "label": 0
                },
                {
                    "sent": "That's the status today may change, but that's that's how it is.",
                    "label": 0
                }
            ]
        }
    }
}