{
    "id": "wtjpq4fuazzemiqos7lcfsjgyth34p2l",
    "title": "Data Stream Mining for Ubiquitous Environments",
    "info": {
        "author": [
            "João Gama, Laboratory of Artificial Intelligence and Decision Support, University of Porto"
        ],
        "published": "Nov. 16, 2012",
        "recorded": "October 2012",
        "category": [
            "Top->Computer Science->Data Mining"
        ]
    },
    "url": "http://videolectures.net/is2012_gama_ubiquitous_environments/",
    "segmentation": [
        [
            "Thank you for coming.",
            "First of all, I would like to thank such selesky and doing for this kind invitation.",
            "It's my great honor to be here.",
            "I would like to say.",
            "To refer to other people, even Black and Pavel profit that during long time promote the collaboration between Porto and locally, and I prepared the story here but when I was confirming story welcome so stories that the first European Workshop on machine learning what in lab.",
            "And last one.",
            "In 89 I think and last one was in Portal in 90, three since portal it cancer conference.",
            "But the.",
            "In preview.",
            "Ago I was confirming that, and it seems that first European workshop on Machine learning was in 88 in France.",
            "It's true.",
            "8686 and the second one in black, with you want to share?",
            "We have a partly ad and just left definition to type.",
            "A conflict of interest.",
            "Because I'm in at the European Conference on Machine learning, there was an hour for the Institute with more students and we always try to react.",
            "We always tried to.",
            "Got 2 hours but this was left open both variable.",
            "We never succeed OK?",
            "So my talk today is about you week."
        ],
        [
            "Data mining I will present the motivation for this work and illustrative example and.",
            "Two different algorithms for clustering sensor network."
        ],
        [
            "So the motivation is basically.",
            "There are two recent technological developments.",
            "That shot changing how we act with the environment.",
            "On one hand we have cheap computer power.",
            "Computers appears everywhere in smartphones, GPS, washing machines and so on.",
            "The other technological development is networks.",
            "The there are networks everywhere.",
            "The Bluetooth peer to peer and so on, and this allows device to communicate with other devices.",
            "So this is the social credit cards that seems the environment and can communicate with other cars.",
            "Intelligent homes sensor networks for monitoring the environment.",
            "Smart grids and so on.",
            "Email"
        ],
        [
            "So we can formalize the problem as device that are sensing something in the environment and collect data about their local environment and they act as network.",
            "They can communicate with other device.",
            "Nevertheless, each one of these devices, as it local vision of what is going on."
        ],
        [
            "And the quitting model is I want to query over do union of the data, collect 4 from each one of the device and I have two types of queries, 1 short queries.",
            "What is state of network?",
            "But you are more most interested in continuous queries that track and monitor the state of the network of overtime so.",
            "The routing schemes that we."
        ],
        [
            "Can see there is basically broadcast where a node can send messages to all the other nodes or.",
            "Would it cast where node sends a message to a specific?"
        ],
        [
            "So.",
            "In this context.",
            "And requirement for learning and adapting adaptation with smart device.",
            "They must be able to send the environment, communicate with other device and construct global model of the universe.",
            "They need to be able to continuously adapt to changing environmental conditions and evolving.",
            "With user needs.",
            "They need to be able or positive self diagnostics and they must be resource resource aware becausw they have limited computational power, memory, communication, bandwidth and."
        ],
        [
            "So one.",
            "2.",
            "Goostrey this.",
            "This framework I present.",
            "Work on very short term forecasting over power generation from photovoltaic systems that was presented by Georgia Brielle.",
            "PDF at the next generation data mining.",
            "So the idea is we have photovoltaic panels and this photovoltaic panels are able to sense data so the power the electrical power that they produce the sign in via cell conditions and so and they are they have memory they at.",
            "A study of the that data and they they are able to communicate the consent this date."
        ],
        [
            "Two other device.",
            "For."
        ],
        [
            "Short term prediction.",
            "Short term prediction in that case is prediction in.",
            "Three days are yet.",
            "Do you see what the matter?",
            "This youth satellite image and weather weather conditions forecast in weather forecasting, but for very short term the best prediction is.",
            "Near death labeled applause."
        ],
        [
            "So the problem, the algorithm that the shorter bug presented.",
            "So the problem is this guy is sensing the.",
            "The electric the.",
            "Energy provided by the Sun and the they have istorie.",
            "This is the.",
            "You study called data.",
            "Could say that this memorize that this site and we want to predict for next 15 minutes.",
            "Present an argument that is a first step algorithm that the first step is a local step.",
            "So from the recent observations, look for historical data.",
            "Find similar contexts.",
            "The second step is a collaborative step.",
            "This guy communicates with near.",
            "Make would to define what is the global context of the weather conditions.",
            "After that he does another local search to infer the global context and makes predictions.",
            "So the problem is this one.",
            "So each one of these guys is orderly."
        ],
        [
            "Local information assume that this is the current global situation, but this guy looking for historical data.",
            "There are in the past this situation is similar to what is going on now and but also this situation is similar.",
            "So this guy needs to this to communicate with neighbors to infer from these two situations that are locally similar to what we are observing now with which.",
            "One is reflect the global context.",
            "And so we would like to be fair that the.",
            "Grant Global context is similar to this one and not to this one.",
            "So you think after in failing global, the global context, we can predict make predictions using the nearest staples.",
            "So.",
            "The first step consists so."
        ],
        [
            "This is grant state.",
            "I want to predict for the 15 minutes yet.",
            "I consider this.",
            "Reference window of.",
            "And I look for the.",
            "Past the most similar context to in comparison to the."
        ],
        [
            "Connect with so."
        ],
        [
            "Looking for that."
        ],
        [
            "I computer disk."
        ],
        [
            "Move from this this time series to this one and look for similar one."
        ],
        [
            "After this local search are the system communicate with neighbors and is send the timestamps of the most similar contexts and so this is local site we are interested in.",
            "And these are the the information that I received from neighbors is saved from neighbors.",
            "The for this neighbor the most similar.",
            "Contacts were awkward at the time stamps.",
            "And so on.",
            "And from this information the system looks for the most probable."
        ],
        [
            "Global Contacts so and basically find for when there are more matched at that point."
        ],
        [
            "Three match year zero."
        ],
        [
            "At year one match and so on.",
            "So if the influence."
        ],
        [
            "Step is the best match for the global context is this one so use."
        ],
        [
            "That information to predict for the.",
            "Near for next 15 minutes."
        ],
        [
            "So lessons learned.",
            "You think this talking to my paper using local information?",
            "In fair, the global pretext.",
            "And this is done by collaborating with the neighbors.",
            "Another important issue when we have communicate information with other other peers is.",
            "The privacy preserving.",
            "In that case, the only information that is provided to the language is the timestamps, not the data, not the data, so this is.",
            "By 50% pink blush.",
            "So this is to give."
        ],
        [
            "Nutritive example, but clarifies what you are talking about so.",
            "We will have different notes collecting data and.",
            "Notes have local information and you want to be fair.",
            "The global context of the where these Sensors Act.",
            "Now I have.",
            "I will focus on clustering distributed data streams.",
            "Basically we have a set of sensors.",
            "With a shoe graphic distribution itself, or produce it on data for shake off the simplified things, we will assume that these are univariate.",
            "Is 3.",
            "The goal is continuously maintain a clustered structure over the network, this is.",
            "These the cluster structure over the network can be interpreted in two different ways.",
            "The first one is the usual approach."
        ],
        [
            "That where cluster.",
            "Is a set of data points.",
            "And this provides information about discretions in the sensor data space.",
            "So here.",
            "A cluster is formed by the data collected.",
            "This timestamp and data collected that pipe step one cluster another different.",
            "Formulation of."
        ],
        [
            "The problem is this 1A cluster is a set of things which in that case a cluster is this set of sensors.",
            "That means these are sensors.",
            "The data collected by produced by Pitzen Source.",
            "As similarities are more similar than the other group of sensors, so these are two."
        ],
        [
            "Different problems.",
            "And we are presented in our joint work with Petr tricks for the first problem, where the goal is fine demonstrations in the data space, the basic idea, or to have insight to what is going on.",
            "Assume that you have three sensors.",
            "This is the day to produce it by these three sensors and what we like.",
            "Who knows that we extract is something like that.",
            "Low values of censored one are good related with."
        ],
        [
            "I values of sensor 2 and sales or through three I values are sensor.",
            "One is correlated with low values of sensor 2 and low values of 33."
        ],
        [
            "So the.",
            "System that we proposed is 3 step system.",
            "The first is the first step.",
            "It sensor keeps.",
            "Online reputation of his data stream basically imaps the time series to string that reflects the sensor state.",
            "The same source sent to a coordinator.",
            "The current state and only send that information when he changed the state.",
            "The coordinator.",
            "The goal of gluten ator is to construct the cluster over all the network.",
            "The coordinator keeps a small list of the most frequent States and from this small list of frequently States and using algorithms like partitional clustering, compute the final plastic so.",
            "This is step one.",
            "The.",
            "That"
        ],
        [
            "Series is mapped to.",
            "Symbolic temptation and.",
            "That corresponds to the current state of the.",
            "Up the heat sensor."
        ],
        [
            "The script inflation is something like that you can use for example sucks approach that Maps time series to a string and the.",
            "The the censored only when they changed the state sent to.",
            "The coordinator this guarantees constant update time and almost constant."
        ],
        [
            "Space.",
            "Do cordinator receive the?",
            "The state of each sensor in network and the coordinator does the first thing is synchronized the data.",
            "From the information provided by the source.",
            "It synchronizes the data and now the coordinator must maintain at least of the most frequent state.",
            "And the.",
            "Becaused the space of the."
        ],
        [
            "The state is exponential in number of sensors.",
            "The possible state is huge.",
            "We use our algorithm for efficient computation of frequent top K element that is illustrative is illustrative algorithm for stream processing.",
            "For one example, this is the first streaming algorithm was presented in the Donald Note book on.",
            "The art of computer programming and it's similar to this one that was present in 2005, the.",
            "The basic idea dealt with is.",
            "The.",
            "Presented the year, the basic idea instead of monitoring all possible states, we only monitor the small subset of possible state and when a new state a new state in that case is.",
            "Affect of Allstate appear.",
            "He is available the if this state is being monitored, we increment the corresponding counter by 1.",
            "Otherwise we give to this state the possibility to do opportunityto become frequent.",
            "So we go to the list of list of frequent states, identified the state with least it remove it.",
            "And replaced by the the current state.",
            "The trick here is that the counter SCS eated with this with this state is not one, but is the account associated with the least frequent.",
            "Is states under monitoring plus well?",
            "She says.",
            "Fun, interesting properties.",
            "One of them that is interesting for our current problem is that if the list of the most frequent states evolves overtime, this algorithm is able to follow trend becausw for each new state he gives it in do portunity to become frequent.",
            "We have the grantees that the top K frequent states are the dolls that appear in the least of the subset that is being monitored.",
            "So basically when a new state arrives, we go to the list of top K frequent."
        ],
        [
            "Date and update that list."
        ],
        [
            "So."
        ],
        [
            "But final step, use the furthest point clustering.",
            "But the.",
            "Jan is a very efficient way for doing clustering over.",
            "And there's also error valentis.",
            "This is not an exact algorithm.",
            "Is an approximate algorithm, but it guarantees that.",
            "The exact solution is under.",
            "The airport margin of the provided solution.",
            "The idea is very simple.",
            "So we receive we go to the list of top K frequent states, select one randomly as fast cluster centroid and the subsequent came came in as one cluster center.",
            "I've chosen as the point that are more distant from the previous center.",
            "This is the guarantees is that the exact clustering the diameter of the cluster.",
            "Provided by the furthest point is less than twice the diameter of the exact solution.",
            "So this is an illustrative example of the type of solution."
        ],
        [
            "The granularity of degree it depending on the size of the alphabet to represent the time series, and this is an advantage becausw due to we have sensors have limited memory so we can.",
            "Increase or decrease the granularity of degree depending on the."
        ],
        [
            "Have money available."
        ],
        [
            "So.",
            "Do second.",
            "Algorithm is for the second framework where we do goal is to find groups of sensors that are high correlated."
        ],
        [
            "The I will present illustrative example to give the insights of how the algorithm works for, for example, we have a sensor network and would like to find, say, the two means clustering sensors.",
            "So it sensor kit sketch summary of its mode.",
            "Most recent data for to deal with this problem.",
            "What is the most recent data?",
            "There are two generic approach.",
            "One is using a sliding window, the other is using for forgetting factors.",
            "The forgetting factors has the advantage of being memory left for them to compute the mean.",
            "The Alpha mean of variable you need to maintain 2 numbers.",
            "And this is how we compute the Alpha mean fighting mean.",
            "So this is the context."
        ],
        [
            "Ava network it node is generating time series in this example.",
            "Is a. Simulation using visual sense that uses software to simulate sensor network.",
            "Its answer is generating Gaussian around the number represented in the same source the.",
            "The arcs indicate the neighborhoods of some sort.",
            "View other things.",
            "Sort that it censored can communicate.",
            "So for example, in that data in this network, we'd like to.",
            "Identify."
        ],
        [
            "That there are.",
            "It's these two groups.",
            "When one group with a centroid around 7, the other group with a centroid around 98."
        ],
        [
            "The basic idea of the algorithm is that.",
            "It's North Montains sketch.",
            "Alpha fading mean of over the measurement maintains belief about what what should be the.",
            "Centroids of the two.",
            "Clusters and communicate that information to the nearest.",
            "Beard so assume that this this is the current estimate of the mean of the measurement of this sensor, and these are the current beliefs of the nearest sensor."
        ],
        [
            "So.",
            "It's near Sanford sends to decensor their beliefs and their current measurement.",
            "This guy using."
        ],
        [
            "It's on.",
            "Fading mean it aren't believed, and the beliefs of nearest neighbors and using furthest point clustering algorithm that was as it was in the previous examples compute.",
            "Update data on beliefs and these beliefs are propagated, are sent to the nearest sensors.",
            "So this is out the algorithm."
        ],
        [
            "Works.",
            "This is after 522 iterations.",
            "This is the error.",
            "The numbers here are the error that is, the distance from the current beliefs to the true.",
            "2.",
            "Two memes"
        ],
        [
            "Jet 4 it is to present the.",
            "All the system behaves.",
            "This is using real data from the electricity demand sensors in the North of Portugal.",
            "We have used data from around.",
            "Three years, the sensor network is composed about 2000 sensors, and in that case we don't have the ground truth.",
            "So we use internal evaluation validated measurements.",
            "The probability of agreement between the different sensors and the Kappa statistics.",
            "What we observe is that our these both dirty tricks evolve overtime.",
            "This is done in a streaming setting, so each.",
            "Each observation is processed once."
        ],
        [
            "So F conclu."
        ],
        [
            "Oceans.",
            "The most challenging problems that you have machine learning and data mining community.",
            "Our faith today.",
            "We have new data as new.",
            "Two different characteristics.",
            "One is data.",
            "Our time and space characteristics the objects of announces.",
            "He's still time and space, and often they are able to move.",
            "Did the environment that is producing data is dynamic and.",
            "Evolve overtime.",
            "The.",
            "The objects of limited information and memory processing capabilities, communication capacity, and so on.",
            "The object know only their local spatial temporal environment and they need to communicate with neighbors to infer the global context.",
            "The main goal is if you are interested in real time analysis, decision models must evolve in corresponding with.",
            "Evolving game vitamin and this characteristics imply that."
        ],
        [
            "We must switch from one shot learning to continuous learning dynamic models that evolve overtime.",
            "In Ubik to say vironment.",
            "The.",
            "Finite training set static models, nationalities, dilution will need to be completely solved and new.",
            "The algorithms have will have to use limited compassion or resource in terms that is limited rationality in terms of.",
            "Computation capability, space and time communications, and so on that my."
        ],
        [
            "Talk, thank you for.",
            "Staying here till death."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you for coming.",
                    "label": 0
                },
                {
                    "sent": "First of all, I would like to thank such selesky and doing for this kind invitation.",
                    "label": 0
                },
                {
                    "sent": "It's my great honor to be here.",
                    "label": 0
                },
                {
                    "sent": "I would like to say.",
                    "label": 0
                },
                {
                    "sent": "To refer to other people, even Black and Pavel profit that during long time promote the collaboration between Porto and locally, and I prepared the story here but when I was confirming story welcome so stories that the first European Workshop on machine learning what in lab.",
                    "label": 0
                },
                {
                    "sent": "And last one.",
                    "label": 0
                },
                {
                    "sent": "In 89 I think and last one was in Portal in 90, three since portal it cancer conference.",
                    "label": 0
                },
                {
                    "sent": "But the.",
                    "label": 0
                },
                {
                    "sent": "In preview.",
                    "label": 0
                },
                {
                    "sent": "Ago I was confirming that, and it seems that first European workshop on Machine learning was in 88 in France.",
                    "label": 0
                },
                {
                    "sent": "It's true.",
                    "label": 0
                },
                {
                    "sent": "8686 and the second one in black, with you want to share?",
                    "label": 0
                },
                {
                    "sent": "We have a partly ad and just left definition to type.",
                    "label": 0
                },
                {
                    "sent": "A conflict of interest.",
                    "label": 0
                },
                {
                    "sent": "Because I'm in at the European Conference on Machine learning, there was an hour for the Institute with more students and we always try to react.",
                    "label": 0
                },
                {
                    "sent": "We always tried to.",
                    "label": 0
                },
                {
                    "sent": "Got 2 hours but this was left open both variable.",
                    "label": 0
                },
                {
                    "sent": "We never succeed OK?",
                    "label": 0
                },
                {
                    "sent": "So my talk today is about you week.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Data mining I will present the motivation for this work and illustrative example and.",
                    "label": 0
                },
                {
                    "sent": "Two different algorithms for clustering sensor network.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the motivation is basically.",
                    "label": 0
                },
                {
                    "sent": "There are two recent technological developments.",
                    "label": 0
                },
                {
                    "sent": "That shot changing how we act with the environment.",
                    "label": 0
                },
                {
                    "sent": "On one hand we have cheap computer power.",
                    "label": 0
                },
                {
                    "sent": "Computers appears everywhere in smartphones, GPS, washing machines and so on.",
                    "label": 0
                },
                {
                    "sent": "The other technological development is networks.",
                    "label": 0
                },
                {
                    "sent": "The there are networks everywhere.",
                    "label": 0
                },
                {
                    "sent": "The Bluetooth peer to peer and so on, and this allows device to communicate with other devices.",
                    "label": 0
                },
                {
                    "sent": "So this is the social credit cards that seems the environment and can communicate with other cars.",
                    "label": 0
                },
                {
                    "sent": "Intelligent homes sensor networks for monitoring the environment.",
                    "label": 1
                },
                {
                    "sent": "Smart grids and so on.",
                    "label": 0
                },
                {
                    "sent": "Email",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we can formalize the problem as device that are sensing something in the environment and collect data about their local environment and they act as network.",
                    "label": 0
                },
                {
                    "sent": "They can communicate with other device.",
                    "label": 0
                },
                {
                    "sent": "Nevertheless, each one of these devices, as it local vision of what is going on.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the quitting model is I want to query over do union of the data, collect 4 from each one of the device and I have two types of queries, 1 short queries.",
                    "label": 0
                },
                {
                    "sent": "What is state of network?",
                    "label": 1
                },
                {
                    "sent": "But you are more most interested in continuous queries that track and monitor the state of the network of overtime so.",
                    "label": 1
                },
                {
                    "sent": "The routing schemes that we.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Can see there is basically broadcast where a node can send messages to all the other nodes or.",
                    "label": 0
                },
                {
                    "sent": "Would it cast where node sends a message to a specific?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "In this context.",
                    "label": 0
                },
                {
                    "sent": "And requirement for learning and adapting adaptation with smart device.",
                    "label": 1
                },
                {
                    "sent": "They must be able to send the environment, communicate with other device and construct global model of the universe.",
                    "label": 1
                },
                {
                    "sent": "They need to be able to continuously adapt to changing environmental conditions and evolving.",
                    "label": 1
                },
                {
                    "sent": "With user needs.",
                    "label": 0
                },
                {
                    "sent": "They need to be able or positive self diagnostics and they must be resource resource aware becausw they have limited computational power, memory, communication, bandwidth and.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So one.",
                    "label": 0
                },
                {
                    "sent": "2.",
                    "label": 0
                },
                {
                    "sent": "Goostrey this.",
                    "label": 0
                },
                {
                    "sent": "This framework I present.",
                    "label": 0
                },
                {
                    "sent": "Work on very short term forecasting over power generation from photovoltaic systems that was presented by Georgia Brielle.",
                    "label": 1
                },
                {
                    "sent": "PDF at the next generation data mining.",
                    "label": 0
                },
                {
                    "sent": "So the idea is we have photovoltaic panels and this photovoltaic panels are able to sense data so the power the electrical power that they produce the sign in via cell conditions and so and they are they have memory they at.",
                    "label": 0
                },
                {
                    "sent": "A study of the that data and they they are able to communicate the consent this date.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Two other device.",
                    "label": 0
                },
                {
                    "sent": "For.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Short term prediction.",
                    "label": 0
                },
                {
                    "sent": "Short term prediction in that case is prediction in.",
                    "label": 0
                },
                {
                    "sent": "Three days are yet.",
                    "label": 0
                },
                {
                    "sent": "Do you see what the matter?",
                    "label": 0
                },
                {
                    "sent": "This youth satellite image and weather weather conditions forecast in weather forecasting, but for very short term the best prediction is.",
                    "label": 0
                },
                {
                    "sent": "Near death labeled applause.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the problem, the algorithm that the shorter bug presented.",
                    "label": 0
                },
                {
                    "sent": "So the problem is this guy is sensing the.",
                    "label": 0
                },
                {
                    "sent": "The electric the.",
                    "label": 0
                },
                {
                    "sent": "Energy provided by the Sun and the they have istorie.",
                    "label": 0
                },
                {
                    "sent": "This is the.",
                    "label": 0
                },
                {
                    "sent": "You study called data.",
                    "label": 0
                },
                {
                    "sent": "Could say that this memorize that this site and we want to predict for next 15 minutes.",
                    "label": 0
                },
                {
                    "sent": "Present an argument that is a first step algorithm that the first step is a local step.",
                    "label": 0
                },
                {
                    "sent": "So from the recent observations, look for historical data.",
                    "label": 0
                },
                {
                    "sent": "Find similar contexts.",
                    "label": 0
                },
                {
                    "sent": "The second step is a collaborative step.",
                    "label": 0
                },
                {
                    "sent": "This guy communicates with near.",
                    "label": 0
                },
                {
                    "sent": "Make would to define what is the global context of the weather conditions.",
                    "label": 1
                },
                {
                    "sent": "After that he does another local search to infer the global context and makes predictions.",
                    "label": 1
                },
                {
                    "sent": "So the problem is this one.",
                    "label": 0
                },
                {
                    "sent": "So each one of these guys is orderly.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Local information assume that this is the current global situation, but this guy looking for historical data.",
                    "label": 0
                },
                {
                    "sent": "There are in the past this situation is similar to what is going on now and but also this situation is similar.",
                    "label": 0
                },
                {
                    "sent": "So this guy needs to this to communicate with neighbors to infer from these two situations that are locally similar to what we are observing now with which.",
                    "label": 0
                },
                {
                    "sent": "One is reflect the global context.",
                    "label": 0
                },
                {
                    "sent": "And so we would like to be fair that the.",
                    "label": 0
                },
                {
                    "sent": "Grant Global context is similar to this one and not to this one.",
                    "label": 0
                },
                {
                    "sent": "So you think after in failing global, the global context, we can predict make predictions using the nearest staples.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The first step consists so.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is grant state.",
                    "label": 0
                },
                {
                    "sent": "I want to predict for the 15 minutes yet.",
                    "label": 0
                },
                {
                    "sent": "I consider this.",
                    "label": 0
                },
                {
                    "sent": "Reference window of.",
                    "label": 0
                },
                {
                    "sent": "And I look for the.",
                    "label": 0
                },
                {
                    "sent": "Past the most similar context to in comparison to the.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Connect with so.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Looking for that.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I computer disk.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Move from this this time series to this one and look for similar one.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "After this local search are the system communicate with neighbors and is send the timestamps of the most similar contexts and so this is local site we are interested in.",
                    "label": 1
                },
                {
                    "sent": "And these are the the information that I received from neighbors is saved from neighbors.",
                    "label": 0
                },
                {
                    "sent": "The for this neighbor the most similar.",
                    "label": 0
                },
                {
                    "sent": "Contacts were awkward at the time stamps.",
                    "label": 0
                },
                {
                    "sent": "And so on.",
                    "label": 0
                },
                {
                    "sent": "And from this information the system looks for the most probable.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Global Contacts so and basically find for when there are more matched at that point.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Three match year zero.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At year one match and so on.",
                    "label": 0
                },
                {
                    "sent": "So if the influence.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Step is the best match for the global context is this one so use.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That information to predict for the.",
                    "label": 0
                },
                {
                    "sent": "Near for next 15 minutes.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So lessons learned.",
                    "label": 0
                },
                {
                    "sent": "You think this talking to my paper using local information?",
                    "label": 0
                },
                {
                    "sent": "In fair, the global pretext.",
                    "label": 0
                },
                {
                    "sent": "And this is done by collaborating with the neighbors.",
                    "label": 0
                },
                {
                    "sent": "Another important issue when we have communicate information with other other peers is.",
                    "label": 0
                },
                {
                    "sent": "The privacy preserving.",
                    "label": 0
                },
                {
                    "sent": "In that case, the only information that is provided to the language is the timestamps, not the data, not the data, so this is.",
                    "label": 0
                },
                {
                    "sent": "By 50% pink blush.",
                    "label": 0
                },
                {
                    "sent": "So this is to give.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Nutritive example, but clarifies what you are talking about so.",
                    "label": 0
                },
                {
                    "sent": "We will have different notes collecting data and.",
                    "label": 0
                },
                {
                    "sent": "Notes have local information and you want to be fair.",
                    "label": 0
                },
                {
                    "sent": "The global context of the where these Sensors Act.",
                    "label": 0
                },
                {
                    "sent": "Now I have.",
                    "label": 0
                },
                {
                    "sent": "I will focus on clustering distributed data streams.",
                    "label": 1
                },
                {
                    "sent": "Basically we have a set of sensors.",
                    "label": 0
                },
                {
                    "sent": "With a shoe graphic distribution itself, or produce it on data for shake off the simplified things, we will assume that these are univariate.",
                    "label": 0
                },
                {
                    "sent": "Is 3.",
                    "label": 0
                },
                {
                    "sent": "The goal is continuously maintain a clustered structure over the network, this is.",
                    "label": 1
                },
                {
                    "sent": "These the cluster structure over the network can be interpreted in two different ways.",
                    "label": 0
                },
                {
                    "sent": "The first one is the usual approach.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That where cluster.",
                    "label": 0
                },
                {
                    "sent": "Is a set of data points.",
                    "label": 1
                },
                {
                    "sent": "And this provides information about discretions in the sensor data space.",
                    "label": 1
                },
                {
                    "sent": "So here.",
                    "label": 0
                },
                {
                    "sent": "A cluster is formed by the data collected.",
                    "label": 0
                },
                {
                    "sent": "This timestamp and data collected that pipe step one cluster another different.",
                    "label": 0
                },
                {
                    "sent": "Formulation of.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The problem is this 1A cluster is a set of things which in that case a cluster is this set of sensors.",
                    "label": 1
                },
                {
                    "sent": "That means these are sensors.",
                    "label": 0
                },
                {
                    "sent": "The data collected by produced by Pitzen Source.",
                    "label": 0
                },
                {
                    "sent": "As similarities are more similar than the other group of sensors, so these are two.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Different problems.",
                    "label": 0
                },
                {
                    "sent": "And we are presented in our joint work with Petr tricks for the first problem, where the goal is fine demonstrations in the data space, the basic idea, or to have insight to what is going on.",
                    "label": 0
                },
                {
                    "sent": "Assume that you have three sensors.",
                    "label": 0
                },
                {
                    "sent": "This is the day to produce it by these three sensors and what we like.",
                    "label": 0
                },
                {
                    "sent": "Who knows that we extract is something like that.",
                    "label": 0
                },
                {
                    "sent": "Low values of censored one are good related with.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I values of sensor 2 and sales or through three I values are sensor.",
                    "label": 0
                },
                {
                    "sent": "One is correlated with low values of sensor 2 and low values of 33.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the.",
                    "label": 0
                },
                {
                    "sent": "System that we proposed is 3 step system.",
                    "label": 0
                },
                {
                    "sent": "The first is the first step.",
                    "label": 0
                },
                {
                    "sent": "It sensor keeps.",
                    "label": 0
                },
                {
                    "sent": "Online reputation of his data stream basically imaps the time series to string that reflects the sensor state.",
                    "label": 0
                },
                {
                    "sent": "The same source sent to a coordinator.",
                    "label": 0
                },
                {
                    "sent": "The current state and only send that information when he changed the state.",
                    "label": 0
                },
                {
                    "sent": "The coordinator.",
                    "label": 0
                },
                {
                    "sent": "The goal of gluten ator is to construct the cluster over all the network.",
                    "label": 0
                },
                {
                    "sent": "The coordinator keeps a small list of the most frequent States and from this small list of frequently States and using algorithms like partitional clustering, compute the final plastic so.",
                    "label": 1
                },
                {
                    "sent": "This is step one.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "That",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Series is mapped to.",
                    "label": 0
                },
                {
                    "sent": "Symbolic temptation and.",
                    "label": 0
                },
                {
                    "sent": "That corresponds to the current state of the.",
                    "label": 0
                },
                {
                    "sent": "Up the heat sensor.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The script inflation is something like that you can use for example sucks approach that Maps time series to a string and the.",
                    "label": 0
                },
                {
                    "sent": "The the censored only when they changed the state sent to.",
                    "label": 0
                },
                {
                    "sent": "The coordinator this guarantees constant update time and almost constant.",
                    "label": 1
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Space.",
                    "label": 0
                },
                {
                    "sent": "Do cordinator receive the?",
                    "label": 0
                },
                {
                    "sent": "The state of each sensor in network and the coordinator does the first thing is synchronized the data.",
                    "label": 1
                },
                {
                    "sent": "From the information provided by the source.",
                    "label": 0
                },
                {
                    "sent": "It synchronizes the data and now the coordinator must maintain at least of the most frequent state.",
                    "label": 1
                },
                {
                    "sent": "And the.",
                    "label": 0
                },
                {
                    "sent": "Becaused the space of the.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The state is exponential in number of sensors.",
                    "label": 1
                },
                {
                    "sent": "The possible state is huge.",
                    "label": 1
                },
                {
                    "sent": "We use our algorithm for efficient computation of frequent top K element that is illustrative is illustrative algorithm for stream processing.",
                    "label": 0
                },
                {
                    "sent": "For one example, this is the first streaming algorithm was presented in the Donald Note book on.",
                    "label": 0
                },
                {
                    "sent": "The art of computer programming and it's similar to this one that was present in 2005, the.",
                    "label": 0
                },
                {
                    "sent": "The basic idea dealt with is.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "Presented the year, the basic idea instead of monitoring all possible states, we only monitor the small subset of possible state and when a new state a new state in that case is.",
                    "label": 0
                },
                {
                    "sent": "Affect of Allstate appear.",
                    "label": 0
                },
                {
                    "sent": "He is available the if this state is being monitored, we increment the corresponding counter by 1.",
                    "label": 0
                },
                {
                    "sent": "Otherwise we give to this state the possibility to do opportunityto become frequent.",
                    "label": 1
                },
                {
                    "sent": "So we go to the list of list of frequent states, identified the state with least it remove it.",
                    "label": 0
                },
                {
                    "sent": "And replaced by the the current state.",
                    "label": 0
                },
                {
                    "sent": "The trick here is that the counter SCS eated with this with this state is not one, but is the account associated with the least frequent.",
                    "label": 0
                },
                {
                    "sent": "Is states under monitoring plus well?",
                    "label": 0
                },
                {
                    "sent": "She says.",
                    "label": 0
                },
                {
                    "sent": "Fun, interesting properties.",
                    "label": 0
                },
                {
                    "sent": "One of them that is interesting for our current problem is that if the list of the most frequent states evolves overtime, this algorithm is able to follow trend becausw for each new state he gives it in do portunity to become frequent.",
                    "label": 0
                },
                {
                    "sent": "We have the grantees that the top K frequent states are the dolls that appear in the least of the subset that is being monitored.",
                    "label": 1
                },
                {
                    "sent": "So basically when a new state arrives, we go to the list of top K frequent.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Date and update that list.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But final step, use the furthest point clustering.",
                    "label": 1
                },
                {
                    "sent": "But the.",
                    "label": 0
                },
                {
                    "sent": "Jan is a very efficient way for doing clustering over.",
                    "label": 0
                },
                {
                    "sent": "And there's also error valentis.",
                    "label": 0
                },
                {
                    "sent": "This is not an exact algorithm.",
                    "label": 0
                },
                {
                    "sent": "Is an approximate algorithm, but it guarantees that.",
                    "label": 1
                },
                {
                    "sent": "The exact solution is under.",
                    "label": 0
                },
                {
                    "sent": "The airport margin of the provided solution.",
                    "label": 0
                },
                {
                    "sent": "The idea is very simple.",
                    "label": 0
                },
                {
                    "sent": "So we receive we go to the list of top K frequent states, select one randomly as fast cluster centroid and the subsequent came came in as one cluster center.",
                    "label": 0
                },
                {
                    "sent": "I've chosen as the point that are more distant from the previous center.",
                    "label": 1
                },
                {
                    "sent": "This is the guarantees is that the exact clustering the diameter of the cluster.",
                    "label": 0
                },
                {
                    "sent": "Provided by the furthest point is less than twice the diameter of the exact solution.",
                    "label": 0
                },
                {
                    "sent": "So this is an illustrative example of the type of solution.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The granularity of degree it depending on the size of the alphabet to represent the time series, and this is an advantage becausw due to we have sensors have limited memory so we can.",
                    "label": 0
                },
                {
                    "sent": "Increase or decrease the granularity of degree depending on the.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Have money available.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Do second.",
                    "label": 0
                },
                {
                    "sent": "Algorithm is for the second framework where we do goal is to find groups of sensors that are high correlated.",
                    "label": 1
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The I will present illustrative example to give the insights of how the algorithm works for, for example, we have a sensor network and would like to find, say, the two means clustering sensors.",
                    "label": 0
                },
                {
                    "sent": "So it sensor kit sketch summary of its mode.",
                    "label": 0
                },
                {
                    "sent": "Most recent data for to deal with this problem.",
                    "label": 1
                },
                {
                    "sent": "What is the most recent data?",
                    "label": 1
                },
                {
                    "sent": "There are two generic approach.",
                    "label": 0
                },
                {
                    "sent": "One is using a sliding window, the other is using for forgetting factors.",
                    "label": 0
                },
                {
                    "sent": "The forgetting factors has the advantage of being memory left for them to compute the mean.",
                    "label": 0
                },
                {
                    "sent": "The Alpha mean of variable you need to maintain 2 numbers.",
                    "label": 0
                },
                {
                    "sent": "And this is how we compute the Alpha mean fighting mean.",
                    "label": 0
                },
                {
                    "sent": "So this is the context.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ava network it node is generating time series in this example.",
                    "label": 0
                },
                {
                    "sent": "Is a. Simulation using visual sense that uses software to simulate sensor network.",
                    "label": 0
                },
                {
                    "sent": "Its answer is generating Gaussian around the number represented in the same source the.",
                    "label": 0
                },
                {
                    "sent": "The arcs indicate the neighborhoods of some sort.",
                    "label": 0
                },
                {
                    "sent": "View other things.",
                    "label": 0
                },
                {
                    "sent": "Sort that it censored can communicate.",
                    "label": 0
                },
                {
                    "sent": "So for example, in that data in this network, we'd like to.",
                    "label": 0
                },
                {
                    "sent": "Identify.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That there are.",
                    "label": 0
                },
                {
                    "sent": "It's these two groups.",
                    "label": 0
                },
                {
                    "sent": "When one group with a centroid around 7, the other group with a centroid around 98.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The basic idea of the algorithm is that.",
                    "label": 0
                },
                {
                    "sent": "It's North Montains sketch.",
                    "label": 0
                },
                {
                    "sent": "Alpha fading mean of over the measurement maintains belief about what what should be the.",
                    "label": 0
                },
                {
                    "sent": "Centroids of the two.",
                    "label": 0
                },
                {
                    "sent": "Clusters and communicate that information to the nearest.",
                    "label": 0
                },
                {
                    "sent": "Beard so assume that this this is the current estimate of the mean of the measurement of this sensor, and these are the current beliefs of the nearest sensor.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "It's near Sanford sends to decensor their beliefs and their current measurement.",
                    "label": 0
                },
                {
                    "sent": "This guy using.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's on.",
                    "label": 0
                },
                {
                    "sent": "Fading mean it aren't believed, and the beliefs of nearest neighbors and using furthest point clustering algorithm that was as it was in the previous examples compute.",
                    "label": 0
                },
                {
                    "sent": "Update data on beliefs and these beliefs are propagated, are sent to the nearest sensors.",
                    "label": 0
                },
                {
                    "sent": "So this is out the algorithm.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Works.",
                    "label": 0
                },
                {
                    "sent": "This is after 522 iterations.",
                    "label": 0
                },
                {
                    "sent": "This is the error.",
                    "label": 0
                },
                {
                    "sent": "The numbers here are the error that is, the distance from the current beliefs to the true.",
                    "label": 0
                },
                {
                    "sent": "2.",
                    "label": 0
                },
                {
                    "sent": "Two memes",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Jet 4 it is to present the.",
                    "label": 0
                },
                {
                    "sent": "All the system behaves.",
                    "label": 0
                },
                {
                    "sent": "This is using real data from the electricity demand sensors in the North of Portugal.",
                    "label": 1
                },
                {
                    "sent": "We have used data from around.",
                    "label": 0
                },
                {
                    "sent": "Three years, the sensor network is composed about 2000 sensors, and in that case we don't have the ground truth.",
                    "label": 0
                },
                {
                    "sent": "So we use internal evaluation validated measurements.",
                    "label": 0
                },
                {
                    "sent": "The probability of agreement between the different sensors and the Kappa statistics.",
                    "label": 0
                },
                {
                    "sent": "What we observe is that our these both dirty tricks evolve overtime.",
                    "label": 0
                },
                {
                    "sent": "This is done in a streaming setting, so each.",
                    "label": 0
                },
                {
                    "sent": "Each observation is processed once.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So F conclu.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Oceans.",
                    "label": 0
                },
                {
                    "sent": "The most challenging problems that you have machine learning and data mining community.",
                    "label": 0
                },
                {
                    "sent": "Our faith today.",
                    "label": 0
                },
                {
                    "sent": "We have new data as new.",
                    "label": 0
                },
                {
                    "sent": "Two different characteristics.",
                    "label": 0
                },
                {
                    "sent": "One is data.",
                    "label": 0
                },
                {
                    "sent": "Our time and space characteristics the objects of announces.",
                    "label": 1
                },
                {
                    "sent": "He's still time and space, and often they are able to move.",
                    "label": 1
                },
                {
                    "sent": "Did the environment that is producing data is dynamic and.",
                    "label": 0
                },
                {
                    "sent": "Evolve overtime.",
                    "label": 1
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "The objects of limited information and memory processing capabilities, communication capacity, and so on.",
                    "label": 1
                },
                {
                    "sent": "The object know only their local spatial temporal environment and they need to communicate with neighbors to infer the global context.",
                    "label": 0
                },
                {
                    "sent": "The main goal is if you are interested in real time analysis, decision models must evolve in corresponding with.",
                    "label": 0
                },
                {
                    "sent": "Evolving game vitamin and this characteristics imply that.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We must switch from one shot learning to continuous learning dynamic models that evolve overtime.",
                    "label": 1
                },
                {
                    "sent": "In Ubik to say vironment.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 1
                },
                {
                    "sent": "Finite training set static models, nationalities, dilution will need to be completely solved and new.",
                    "label": 0
                },
                {
                    "sent": "The algorithms have will have to use limited compassion or resource in terms that is limited rationality in terms of.",
                    "label": 1
                },
                {
                    "sent": "Computation capability, space and time communications, and so on that my.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Talk, thank you for.",
                    "label": 0
                },
                {
                    "sent": "Staying here till death.",
                    "label": 0
                }
            ]
        }
    }
}