{
    "id": "wzc4v7ygq2y5o3zxothhcozj66d5okx6",
    "title": "Modulation of Cortical Excitability by Detection of Motor Intention and Artificial Afferent Feedback",
    "info": {
        "author": [
            "Dario Farina, Bernstein Center for Computational Neurosciences Göttingen"
        ],
        "published": "Dec. 3, 2012",
        "recorded": "September 2012",
        "category": [
            "Top->Technology->Neurotechnology",
            "Top->Medicine->Neuroscience"
        ]
    },
    "url": "http://videolectures.net/bbci2012_farina_cortical_excitability/",
    "segmentation": [
        [
            "Yeah, good morning to everybody.",
            "And first of all I would like to thank Klaus for the kind invitation.",
            "It is close aide.",
            "I my group work in Gottingen also in the best and focus their technology.",
            "Now our activities are mostly related to the peripheral nervous system actually.",
            "So controlling prosthesis with the nerve and muscle signals.",
            "But then when the signal is invitation, I voted to present some of our work also in brain computer interfaces, especially because the topic I thought to present seemed not covered, at least extensively by the other speakers.",
            "So I will talk about the use of brain, computer interfacing systems and not to replace or restore motor function or similar application.",
            "But to change a narrow pathways with the aim of training or rehabilitate patients.",
            "So with this application would like to change the excitability specific neural pathways so that they re learning of a task that has been lost by patients.",
            "For example you to stroke can be done in a faster way.",
            "And we think that interface in the brain can be a potentially very interesting approach for this problem.",
            "So accordingly I will divide my presentation in the trip part.",
            "The first is very introductory and."
        ],
        [
            "It relates mainly to the type of brain signals we use and to the type of application we focus.",
            "The second part is the core part of the method we use to change excitability of cortical areas in a controlled way, and then the third party will present you very new studies.",
            "Still not published, but in revision on stroke abilitation.",
            "With these methods of the last part is somehow the probably the most interesting part."
        ],
        [
            "So to start with very simple introduction, we have heard from the previous speakers that BC operation is the interaction between two adaptive controllers.",
            "So the user produce signals machine interpret this signals.",
            "A new skill is learned and in this operational behavior there is the fundamental concept of feedback that those are into."
        ],
        [
            "Use just before.",
            "So this kind of system can work for communication for control of environmental control, robotics, neural prosthetics and what I will focus on is neuro modulation.",
            "So as I said before we neuromodulation, I mean the use of the feedback that the BCI naturally provide in order to change neural pathways in the way that we would like to change them.",
            "Pacifically to train patients."
        ],
        [
            "And to finish with this introductory part, the type of signal that we use have also been introduced by Jose, just in the last part of his presentation when he talked about contingent negative variation, and this is the type of signal that we showed in this case.",
            "It's a signal produced by a different movement, but basically when a subject intended to do a movement, what can be observed quite before the execution of that movement that they e.g signal.",
            "Is a negative deflection and then a rebound and this signal is being described in several decades and is particularly interesting because as you can see, this is the point in which the movement started.",
            "Then this see no start to indicate the intention to secure the movement quite before the movement is actually executed, and the same can be said when the movement is only imagined or attempted in case it cannot be executed because the patient cannot execute them.",
            "So these signals that I will refer to as movement related cortical potentials."
        ],
        [
            "Can also be referred to as contingent.",
            "Negative variation are different depending on the way the movement is imagined or executor.",
            "So if we intended to do a fast movement, we will have usually a faster negative slope with respect to slower movements, and they're also modulated by the way in which the movement is a security in terms of the force that is put into the movement.",
            "And this means that they can be used and we have used it in the past for controlling bind."
        ],
        [
            "The BCI system of the classic type by classifying, for example, the imagination of a subject.",
            "Thinking at the fast movement versus slow movement and these are some references of our past work, we will not.",
            "In this talk I will not focus on the use of this sinus is binary classification as we will see in a moment."
        ],
        [
            "So to summarize very briefly, this introductory part of my talk will focus on the BCI for neuromodulation is very different from the use of BCI for restoration or replacing a function and poses from some respects less constraints as we will see.",
            "I will focus and mood with movement related cortical potential.",
            "This slow negative deflection that I've shown before as control signals and they will explain you in a moment why.",
            "And we will use this signal to control artificial after and feedback to induce plasticity.",
            "So this leads me to."
        ],
        [
            "The second part of my talk which is."
        ],
        [
            "The way in which we proposed recently to change cortical excitability by BCI based system."
        ],
        [
            "So when he spied by other techniques in the classical era Physiology, one of these techniques goes under the name of pair associative stimulation.",
            "So this technique has nothing to do with PCI, but I will tell you about that about it anyway, because we translated it in certain BCI system into it.",
            "So Para searches simulation is based on an electrical stimulus in a peripheral nerve followed by a certain deley by a magnetic stimulus on the cortex.",
            "The magnetic stimulus is done with TMS and the electrical stimulus is done with surface electrodes in transcutaneous stimulation.",
            "If you time exactly these delaye in a very precise way, then you can demonstrate by repeating this intervention many times that the cortical excitability is changing.",
            "So if you test the excitability of your upper motor narrows before and after this intervention you will see that this Accessibility increases."
        ],
        [
            "This is tested by.",
            "DMZ in a target muscle and if the target muscle evoked potential increases, this means that the corticospinal pathway from the court's to the to the spinal motor neurons as increasing excitability.",
            "So this technique is called pair associative stimulation and the meaning of this name is obvious paired because you have a pair of stimulus and associative because the two stimuli has to be associated by very specific time dilay.",
            "And then the reason comes from even more basic and or physiological studies on long term potentiation and long-term depression.",
            "For which are, if you excite the synopsis, presynaptic potential in postsynaptic potential with a specific delay, you can announce the connectivity, and contrarily, if you excite them without delays, but is that somehow the human translation of this concept?",
            "So as I say, they repeat once more for this technique.",
            "It is critical that time delay."
        ],
        [
            "So what we did was to do something quite simple was to take this technique.",
            "It is the same sliders before and instead of having the.",
            "A transcranial stimulation."
        ],
        [
            "We substituted it with Kenny G signal.",
            "So our idea was to record any G signal, understand when the subject wanted to secure certain movement.",
            "Then we have this contingent contingent negative variation.",
            "And if we are able to understand when the subject wants or attempt to make a movement, then we have a peripheral stimulation that comes with a certain delay.",
            "So the idea in patients who cannot execute the movement but can retrain that movement was to strengthen the pathway from the Court's to the spinal motor neurons by artificially associating enough from feed, the brain would expect if the movement was executed.",
            "And of course, since the moment cannot be executed, they often see that comes from stimulating the muscle or the nerve.",
            "And then of course you can test if this idea works by again testing cortical excitability before and after this intervention."
        ],
        [
            "So we put up a study which is a basic physiological standing recently in which we were testing this idea and we're also looking at the criticality of the delay.",
            "So we did something like that.",
            "We recorded the movement related cortical potentials.",
            "There's this thing that I described before.",
            "And then we stimulated peripherally, either in a point corresponding to before the peak negativity or excited to pick negativity or after the pig negativity.",
            "Now remember the, normally the movement would be executed.",
            "Around the pig negativity and then we tested the cortical excitability by doing this intervention a number of times.",
            "And of course this was repeated in different days.",
            "So one day for this one day for these randomized and so.",
            "So the task is."
        ],
        [
            "AQ based task.",
            "In this case, the subject is asked to look at this trace.",
            "When he sees a diesel slope, imagine.",
            "A movement with which is dorsiflexion, in this case, with the tibialis anterior.",
            "And then the stimulation is triggered depending on the position that I described before.",
            "So before or corresponding to the picking activity or after the picnic activity.",
            "This is on one subject just."
        ],
        [
            "Sensitive data this is the motor evoked potential that remember.",
            "Is representing the cortical excitability before and after this intervention and this is what happens when the stimulation is before picking activity?",
            "This what happens when it is appearing activity in this subject and this would happen when it is after picking activity on this subject you will notice that only one case there is an effect.",
            "Now to make it more convincing I will show you the classic stimulus response curve.",
            "So here you have any."
        ],
        [
            "Density of magnetic stimulation at the cortex and here you have the motor evoked potential before and after the intervention, and this is fit by certain regression doesn't matter.",
            "What you can see here is what happens when the subject receives stimulation.",
            "At this point 50 times.",
            "So before these are 50 steam peripheral stimulation.",
            "At this point we have this curve and after this 50 stimulation, at this point we have a curd that as you can see is very similar.",
            "So cortical excitability is not."
        ],
        [
            "Injured much but then look what happens when we stimulated the picnic activity.",
            "So we have a very dramatic change in the excitability of that part way from the quarters to the motor neurons.",
            "And."
        ],
        [
            "And once we go to after after the pig negativity again, we have no effect.",
            "So what we have seen in this basic physiological study need is that indeed we can have a manipulation or modulation in excitability by this paradigma.",
            "Then now is triggered by imagining movement rather than by artificially stimulating the cortex.",
            "And we've also seen that the timing is critical and this is of course very reasonable and is very reasonable becausw the considered that the movement normally would be a secretary at this point.",
            "So the central nervous system would expect enough RNV immediately after this point.",
            "It doesn't expect an offer in volley before they doesn't respect enough for Invole too late, so excited this point.",
            "It expects enough renvall, and if you artificially provide that volley, then we have strengthening of synaptic connections.",
            "So in this kind of studies yet to do all the chi."
        ],
        [
            "Of controls that I will not describe you, but because you could also say that you could have a similar effect by imagining only by only metric stimulation, and if you read the original paper, we have done all type of controls that are requested by this basic physiological studies.",
            "So we had a control group with imagination only.",
            "A control group with an electrical stimulation.",
            "Only a control group with a certain type of visual attention to the screen that we are that we are showing and we even look to spinal excitability by measuring lifeless pathways.",
            "And their response with all these controls.",
            "That is really the excitability of the court as it will change so we are 100% sure of these and we are confirmed that with a number of other measure follow."
        ],
        [
            "So now to summarize these these part, the intervention that we propose implies a self generated physiological signal, which is an imagination of a movement or attempting a movement.",
            "And artificial afferent feedback for inducing plastic changes.",
            "Timing is critical and if timing is critical, it means that in order to apply this in a synchronous way, remember that was Q based.",
            "If you want to apply this in a synchronous way, you have to have assistant to online that at this kind of potential that I've shown you.",
            "So as a next step from this physiological study, what we have done is to look if we could detect these MCPS or contingent negative variation online with reasonably.",
            "Reasonable sensitivity and specificity, and that's what I'm showing you in a second.",
            "So."
        ],
        [
            "To that end them we have implemented a very simple system that I will not even bother you to look at from the scene opposing POV is simply a match filter because this is a sort of a systematic event and we have implemented optimized special filter in a very in a very simple way.",
            "With 911"
        ],
        [
            "Codes.",
            "These are just example of a row signals, so this is the cortical activity after optimize special filtering.",
            "This our manifestation variable and the."
        ],
        [
            "There is a threshold.",
            "But to go to the point our question was, is it possible to online that at these signals with the limited false alarm rate and I sensitivity?",
            "Well, it is possible at least within certain limits, so with the best we can do from the processing point of view, we have around 80% of true positive rate and a limited number of false positives.",
            "In this case for positive are counted per minute or para interval of time because this continues.",
            "A recording and continuous processing.",
            "So every time the system.",
            "Identify a potential contingent negative variation which is not.",
            "A contingent negative variation.",
            "We have false positive, but these numbers are reasonable, reasonably high."
        ],
        [
            "And then very important point actually was not.",
            "Well, of course was sensitivity, specificity, but especially was the latency with which we could detect these negative variation because we remember the timing is critical.",
            "So if you're not fast enough.",
            "And then you trigger an electrical stimulation.",
            "Then it's too late, so the critical point was to have a processing that allowed to detect it with latency close to zero with respect to the pic.",
            "Negative attention to you, and these are the latency we could obtain in this in this study, and as you can see, on average they are indeed around 0 for some subjects, around 100 milliseconds for some subjects are around minus 100 millisecond, which means that you anticipate anticipated attention, but All in all, is quite good.",
            "In parentheses, you can detect it, which much better sensitivity if you allow.",
            "A longer latency is because you can use the entire template, but we wanted to have very short latency.",
            "So.",
            "To finish with the possibility of detecting these."
        ],
        [
            "Cigna's online I have also to say that the.",
            "Interest of this signal is that you don't even need to have a subject specific training for detecting these signals, because this shape is characteristic.",
            "So if you collect a database of sinus is you can see from many different subjects and we've done it.",
            "Also even instruct patients they say and you make an average template then you can detect this signal with a sensitivity that drop of only two 3%.",
            "So you don't even have to train a system for this.",
            "You can have an average template.",
            "From a database of signal, the subject to put electrodes on and without any training, you can detect that potential.",
            "So to summarize, this is this subpart.",
            "And these are signals that are slowly negative variation associated to movement."
        ],
        [
            "Imagination can be detected.",
            "With around 80% sensitivity and with what we think is a limited number of false positives, the latency on average is around minus 50 milliseconds with respect to the pig negativity.",
            "Which means basically that we are in time for an external stimulation according to the non physiological investigation.",
            "There is no need for a subject specific training so you don't need any training for this detection.",
            "And District points implies that it is possible to develop a full online self paced system.",
            "That's what we did in this other step.",
            "So in this ad."
        ],
        [
            "Instead, we put the all these kind of concepts together.",
            "Now the subject is looking at the screen.",
            "There is no queue anymore, so the subject is left there for half an hour and he's asked at some points to imagine a movement and now the system record e.g the G is processed in the way that I've shown you.",
            "So there is a detector that tries to detect the contingent negative variations in time enough to trigger an electric stimulator.",
            "That will provide artificial feedback that will go to the cortex and the question for this study was if still we can modulate cortical excitability in this completely self paced system where we have a false positive airway, limited ability to detect, and so on.",
            "And we have also when we have latency that is a bit less could control."
        ],
        [
            "So the idea is that you have now understood that is to detect that potential into stimulator."
        ],
        [
            "On that point, so this is an example of what happens in a couple of such, and then I will show you the group data and is very interesting because again.",
            "If you look at the pre intervention then you leave the subject.",
            "Alone up to 50 of these kind of stimulations and this is completely self paced and then you test the Accessibility afterwards then you can see that there is an increase and this a second subject and here you can see a group data from 8 subjects.",
            "In the published paper there are a few more but."
        ],
        [
            "That doesn't matter.",
            "And you can see also what happens in the control conditions control conditions.",
            "Again, our imagination only stimulation randomly and so on.",
            "So as you can see now 100% implies that cortical excitability is not changing at all.",
            "And as you can see only in the Intervention Intervention Group, the one that had the stimulation triggered by the detention.",
            "With this online self paced system we have an increase in excitability of around 50% which.",
            "By the way, is very very large even compared with the classic methods like parasocial stimulation.",
            "Previous developed in class, ignore physiological investigation, so it's quite large."
        ],
        [
            "It's a quite large increase.",
            "So this implies that online detection is sufficiently accuracy in sufficiently small latency to induce plastic changes.",
            "This will Lt. Subject.",
            "By the way, the system is full paste.",
            "There is a possibility for clinical studies and one can ask which is the functional relevance.",
            "So does this implies that if we apply this in patients we have an improvement in their capacities or not?",
            "And this leads me to."
        ],
        [
            "Last part of my."
        ],
        [
            "Presentation where I will show you this time some very new data on application of this approach in a structure abilitation and specifically."
        ],
        [
            "We have a couple of studies running, but I will present you one of these two which is the one that is that has the most completed data analysis.",
            "So in this study we had 13 stroke patients so that you can see reported here.",
            "Now this table is not for you to go line by line, but it just indicates the type of ischemic lesion and the time after stroke and so on.",
            "It is not too relevant at this point.",
            "They are stroke patients with different type of.",
            "In abilities."
        ],
        [
            "These are the movement right cortical potentials recording from these patients.",
            "They are surprisingly very similar to healthy subjects apart from the pic negativity, which is less than Alpha than what we usually record in Lt subject.",
            "I don't know if you've paid particular attention at the values between Lt Surge at these values around minus 10 microvolts and dear, it's it's almost half, but you can see a quite nice negative variation.",
            "You can see quite nice rebound.",
            "And also you can see the measure of a Mississippi in three days in this patient.",
            "Because our first question was if these measures were reliable enough in these patients over different days and you can see that this is quite reliable.",
            "Of course, this is an average of this potential over several trials, so obviously."
        ],
        [
            "Also, our question was if we could attack in this patient these potentials with short enough latency.",
            "Again, in patients you have to ask these questions again because the symmetrization that kind of sinus can be different and you can see these are the latency is in this 13 patients.",
            "For example in the tension there a bit larger in average with respect to the Lt subject if you remember, but still they are not that far from zero that indicated the pic negativity.",
            "So we had some open at the intervention would work.",
            "Also."
        ],
        [
            "In these in these patients.",
            "And these were that pencil representative again in one patient.",
            "And this was.",
            "Again, particularly interesting because the technique works surprisingly well.",
            "You have the same kind of plot as before.",
            "This is a stimulus response curve.",
            "And this is pre intervention and then what you can see is after the intervention.",
            "So for patients we have an intervention that is much longer.",
            "We actually had three weeks to tamper weeks and the bit longer intervention because we expect that it would have been more difficult to have this plastic changes with respect to wealthy individuals.",
            "But there is a quite quite."
        ],
        [
            "Had to change."
        ],
        [
            "This is another patient and this is the the group data that again show.",
            "A quite remarkable increase.",
            "You can see the second bar quite remarkable increase in cortical excitability with respect to pre to pre intervention.",
            "All the other bars by the way our controls with stroke patients we have even more controlled because you have to have a control group who does nothing.",
            "A control group doesn't classify therapy and so on and so on.",
            "So I will not go into details but we have quite exhaustive number of control trials.",
            "Together with the main domain trial, so the main message of this graph is that even in patient we have an increase increasing cortical excitability with this intervention, which is fully self paced.",
            "And so in stroke we have this tablet."
        ],
        [
            "RCP is confirmed in the history of patients.",
            "The amplitude of the motor evoked potential increased significantly following the intervention, so we have increased cortical plasticity.",
            "I have not shown you the statistic, but very interesting.",
            "We have a functional improvement, so this changes in cortical excitability are associated to functional improvement, at least for some of the clinical scales.",
            "One of the easiest is the time to make a 10 meter work, and this increased significantly with respect to a number of control groups.",
            "So this is the first Association with clinical functional improvements, even if it is very preliminary.",
            "The clinical part I have to I have to admit.",
            "And of course, every nurse in these results you can imagine any kind of variations of these this kind of technique, because at the moment we are just produce a single electrical stimuli, but you can induce afferent feedback in many different ways.",
            "You can, for example, apply a proper function, electrical stimulation, so that you would move the limb as if it was normally moved, or you can even ever robotic device.",
            "That move the limb and that excite afferent feedback because of this.",
            "Because of this moment, so we have also started to investigate these these aspects."
        ],
        [
            "And we have a few studies on FPS that I will not mention because they are very similar to what we are doing that I just described with single Africa stimuli.",
            "But there is a train of of stimuli.",
            "What I will, On the contrary show you is control of robotic device is not not for establishing function, not not for walking but again for abilitation following the same kind of idea and walking is a very particular.",
            "Task with respect to the to the task that I have described before.",
            "Because walking is a semi automatic is very much controlled by spinal circuits by central pattern generator.",
            "But there is one part of the working which is particularly interesting, which is the initiation of the step.",
            "So the first step that you do that is very much cortically corticale coded and that's also very interesting.",
            "The clinically because there are many disorders that actually target the gait initiation because after that.",
            "Depression can work much better.",
            "So join these two ideas.",
            "The first is that cortically we may have a large potential at the gate initiation.",
            "Becausw get initiation is very much court recorded and the Fed the clinical is important.",
            "What we are doing in this study indicated here this the lokomat, by the way, is to control the beginning of passive working by the robo.",
            "Given the imagination of gait initiation from the stroke patient.",
            "So this seems very far from what I've described before, but is exactly the same.",
            "So we have a cortical potential which is again a movement related cortical potential.",
            "If we are able to detect that, we can send the offering feedback in time so that the brain thinks that that's the actual movement.",
            "And the afferent feedback is here sent by moving the limb with Robo and before it was sent by giving adapt to the nerve.",
            "The concept is the same.",
            "So we have again done."
        ],
        [
            "Series of studies which are still to be finalized, but one of them is to see if we can have those kind of potential in gait initiation condition.",
            "So we have a subject onto platform that measure force and the subject goes from one platform to the ad.",
            "And we record of course, the the the initiation of the movement by looking at the 4th accepted setting on the platform and at the same time we look at the potentials cortical potential again e.g and we would like to understand if we can dictate sufficiently soon when the subject would like to move.",
            "And that this is possible.",
            "Also, quite Interestingly, what you can see on your left are the movement letter, cortical potential of a number of subjects there very similar to before, but this time."
        ],
        [
            "And it corresponds to initiating a step.",
            "So as you can see, the characteristics are very similar.",
            "As you can see, you are picking activity and so on.",
            "And what you can see on the right at the rock receiving operating curse that indicates which is the ability to detect online those kind of inner cities.",
            "And again you can see by looking at the red dots that you can arrive at around 80 or even more percent of true positives.",
            "So again you can detect that and we have now a clinical study that is running for which I. I don't have the results unfortunately, but he's running on this concept so that these patients have electrodes and there are both start to move and once we start to move it continue to move and then he stops and then again the subject is to think actively strongly that he wants to initiate the step and once the system that acts and their intention to initiate the step than Robusta."
        ],
        [
            "Block alright so I I have been brief enough so that we've also gained some time.",
            "I will finish by presenting again my outline, which is also the summary of my talk at the beginning.",
            "I hope I have explained to you which is the main difference of this type of visa application with respect to restoring or replacing a movement.",
            "Here we don't want to restore anything, we just want to change excitability of certain pathways.",
            "In the second part of my talk I have presented you what was our idea to use the BC ice for this proposal, and basically it's a very simple idea of having a cows and Association between a motor command decoder, the cortical level and an artificial afferent input, and in the last part I've shown you preliminary, but in some case in my opinion quite convinced results on Stroker abilitation using these techniques, and with this I thank you very much for the attention."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, good morning to everybody.",
                    "label": 0
                },
                {
                    "sent": "And first of all I would like to thank Klaus for the kind invitation.",
                    "label": 0
                },
                {
                    "sent": "It is close aide.",
                    "label": 0
                },
                {
                    "sent": "I my group work in Gottingen also in the best and focus their technology.",
                    "label": 0
                },
                {
                    "sent": "Now our activities are mostly related to the peripheral nervous system actually.",
                    "label": 0
                },
                {
                    "sent": "So controlling prosthesis with the nerve and muscle signals.",
                    "label": 0
                },
                {
                    "sent": "But then when the signal is invitation, I voted to present some of our work also in brain computer interfaces, especially because the topic I thought to present seemed not covered, at least extensively by the other speakers.",
                    "label": 0
                },
                {
                    "sent": "So I will talk about the use of brain, computer interfacing systems and not to replace or restore motor function or similar application.",
                    "label": 0
                },
                {
                    "sent": "But to change a narrow pathways with the aim of training or rehabilitate patients.",
                    "label": 0
                },
                {
                    "sent": "So with this application would like to change the excitability specific neural pathways so that they re learning of a task that has been lost by patients.",
                    "label": 0
                },
                {
                    "sent": "For example you to stroke can be done in a faster way.",
                    "label": 0
                },
                {
                    "sent": "And we think that interface in the brain can be a potentially very interesting approach for this problem.",
                    "label": 0
                },
                {
                    "sent": "So accordingly I will divide my presentation in the trip part.",
                    "label": 0
                },
                {
                    "sent": "The first is very introductory and.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It relates mainly to the type of brain signals we use and to the type of application we focus.",
                    "label": 1
                },
                {
                    "sent": "The second part is the core part of the method we use to change excitability of cortical areas in a controlled way, and then the third party will present you very new studies.",
                    "label": 0
                },
                {
                    "sent": "Still not published, but in revision on stroke abilitation.",
                    "label": 0
                },
                {
                    "sent": "With these methods of the last part is somehow the probably the most interesting part.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to start with very simple introduction, we have heard from the previous speakers that BC operation is the interaction between two adaptive controllers.",
                    "label": 1
                },
                {
                    "sent": "So the user produce signals machine interpret this signals.",
                    "label": 0
                },
                {
                    "sent": "A new skill is learned and in this operational behavior there is the fundamental concept of feedback that those are into.",
                    "label": 1
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Use just before.",
                    "label": 0
                },
                {
                    "sent": "So this kind of system can work for communication for control of environmental control, robotics, neural prosthetics and what I will focus on is neuro modulation.",
                    "label": 1
                },
                {
                    "sent": "So as I said before we neuromodulation, I mean the use of the feedback that the BCI naturally provide in order to change neural pathways in the way that we would like to change them.",
                    "label": 0
                },
                {
                    "sent": "Pacifically to train patients.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And to finish with this introductory part, the type of signal that we use have also been introduced by Jose, just in the last part of his presentation when he talked about contingent negative variation, and this is the type of signal that we showed in this case.",
                    "label": 0
                },
                {
                    "sent": "It's a signal produced by a different movement, but basically when a subject intended to do a movement, what can be observed quite before the execution of that movement that they e.g signal.",
                    "label": 0
                },
                {
                    "sent": "Is a negative deflection and then a rebound and this signal is being described in several decades and is particularly interesting because as you can see, this is the point in which the movement started.",
                    "label": 0
                },
                {
                    "sent": "Then this see no start to indicate the intention to secure the movement quite before the movement is actually executed, and the same can be said when the movement is only imagined or attempted in case it cannot be executed because the patient cannot execute them.",
                    "label": 0
                },
                {
                    "sent": "So these signals that I will refer to as movement related cortical potentials.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Can also be referred to as contingent.",
                    "label": 0
                },
                {
                    "sent": "Negative variation are different depending on the way the movement is imagined or executor.",
                    "label": 0
                },
                {
                    "sent": "So if we intended to do a fast movement, we will have usually a faster negative slope with respect to slower movements, and they're also modulated by the way in which the movement is a security in terms of the force that is put into the movement.",
                    "label": 0
                },
                {
                    "sent": "And this means that they can be used and we have used it in the past for controlling bind.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The BCI system of the classic type by classifying, for example, the imagination of a subject.",
                    "label": 0
                },
                {
                    "sent": "Thinking at the fast movement versus slow movement and these are some references of our past work, we will not.",
                    "label": 0
                },
                {
                    "sent": "In this talk I will not focus on the use of this sinus is binary classification as we will see in a moment.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to summarize very briefly, this introductory part of my talk will focus on the BCI for neuromodulation is very different from the use of BCI for restoration or replacing a function and poses from some respects less constraints as we will see.",
                    "label": 1
                },
                {
                    "sent": "I will focus and mood with movement related cortical potential.",
                    "label": 0
                },
                {
                    "sent": "This slow negative deflection that I've shown before as control signals and they will explain you in a moment why.",
                    "label": 1
                },
                {
                    "sent": "And we will use this signal to control artificial after and feedback to induce plasticity.",
                    "label": 0
                },
                {
                    "sent": "So this leads me to.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The second part of my talk which is.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The way in which we proposed recently to change cortical excitability by BCI based system.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So when he spied by other techniques in the classical era Physiology, one of these techniques goes under the name of pair associative stimulation.",
                    "label": 0
                },
                {
                    "sent": "So this technique has nothing to do with PCI, but I will tell you about that about it anyway, because we translated it in certain BCI system into it.",
                    "label": 0
                },
                {
                    "sent": "So Para searches simulation is based on an electrical stimulus in a peripheral nerve followed by a certain deley by a magnetic stimulus on the cortex.",
                    "label": 1
                },
                {
                    "sent": "The magnetic stimulus is done with TMS and the electrical stimulus is done with surface electrodes in transcutaneous stimulation.",
                    "label": 0
                },
                {
                    "sent": "If you time exactly these delaye in a very precise way, then you can demonstrate by repeating this intervention many times that the cortical excitability is changing.",
                    "label": 0
                },
                {
                    "sent": "So if you test the excitability of your upper motor narrows before and after this intervention you will see that this Accessibility increases.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is tested by.",
                    "label": 0
                },
                {
                    "sent": "DMZ in a target muscle and if the target muscle evoked potential increases, this means that the corticospinal pathway from the court's to the to the spinal motor neurons as increasing excitability.",
                    "label": 1
                },
                {
                    "sent": "So this technique is called pair associative stimulation and the meaning of this name is obvious paired because you have a pair of stimulus and associative because the two stimuli has to be associated by very specific time dilay.",
                    "label": 0
                },
                {
                    "sent": "And then the reason comes from even more basic and or physiological studies on long term potentiation and long-term depression.",
                    "label": 0
                },
                {
                    "sent": "For which are, if you excite the synopsis, presynaptic potential in postsynaptic potential with a specific delay, you can announce the connectivity, and contrarily, if you excite them without delays, but is that somehow the human translation of this concept?",
                    "label": 0
                },
                {
                    "sent": "So as I say, they repeat once more for this technique.",
                    "label": 0
                },
                {
                    "sent": "It is critical that time delay.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what we did was to do something quite simple was to take this technique.",
                    "label": 0
                },
                {
                    "sent": "It is the same sliders before and instead of having the.",
                    "label": 0
                },
                {
                    "sent": "A transcranial stimulation.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We substituted it with Kenny G signal.",
                    "label": 0
                },
                {
                    "sent": "So our idea was to record any G signal, understand when the subject wanted to secure certain movement.",
                    "label": 0
                },
                {
                    "sent": "Then we have this contingent contingent negative variation.",
                    "label": 0
                },
                {
                    "sent": "And if we are able to understand when the subject wants or attempt to make a movement, then we have a peripheral stimulation that comes with a certain delay.",
                    "label": 0
                },
                {
                    "sent": "So the idea in patients who cannot execute the movement but can retrain that movement was to strengthen the pathway from the Court's to the spinal motor neurons by artificially associating enough from feed, the brain would expect if the movement was executed.",
                    "label": 0
                },
                {
                    "sent": "And of course, since the moment cannot be executed, they often see that comes from stimulating the muscle or the nerve.",
                    "label": 0
                },
                {
                    "sent": "And then of course you can test if this idea works by again testing cortical excitability before and after this intervention.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we put up a study which is a basic physiological standing recently in which we were testing this idea and we're also looking at the criticality of the delay.",
                    "label": 0
                },
                {
                    "sent": "So we did something like that.",
                    "label": 0
                },
                {
                    "sent": "We recorded the movement related cortical potentials.",
                    "label": 0
                },
                {
                    "sent": "There's this thing that I described before.",
                    "label": 0
                },
                {
                    "sent": "And then we stimulated peripherally, either in a point corresponding to before the peak negativity or excited to pick negativity or after the pig negativity.",
                    "label": 0
                },
                {
                    "sent": "Now remember the, normally the movement would be executed.",
                    "label": 0
                },
                {
                    "sent": "Around the pig negativity and then we tested the cortical excitability by doing this intervention a number of times.",
                    "label": 0
                },
                {
                    "sent": "And of course this was repeated in different days.",
                    "label": 0
                },
                {
                    "sent": "So one day for this one day for these randomized and so.",
                    "label": 0
                },
                {
                    "sent": "So the task is.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "AQ based task.",
                    "label": 0
                },
                {
                    "sent": "In this case, the subject is asked to look at this trace.",
                    "label": 0
                },
                {
                    "sent": "When he sees a diesel slope, imagine.",
                    "label": 0
                },
                {
                    "sent": "A movement with which is dorsiflexion, in this case, with the tibialis anterior.",
                    "label": 0
                },
                {
                    "sent": "And then the stimulation is triggered depending on the position that I described before.",
                    "label": 0
                },
                {
                    "sent": "So before or corresponding to the picking activity or after the picnic activity.",
                    "label": 0
                },
                {
                    "sent": "This is on one subject just.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sensitive data this is the motor evoked potential that remember.",
                    "label": 0
                },
                {
                    "sent": "Is representing the cortical excitability before and after this intervention and this is what happens when the stimulation is before picking activity?",
                    "label": 0
                },
                {
                    "sent": "This what happens when it is appearing activity in this subject and this would happen when it is after picking activity on this subject you will notice that only one case there is an effect.",
                    "label": 0
                },
                {
                    "sent": "Now to make it more convincing I will show you the classic stimulus response curve.",
                    "label": 0
                },
                {
                    "sent": "So here you have any.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Density of magnetic stimulation at the cortex and here you have the motor evoked potential before and after the intervention, and this is fit by certain regression doesn't matter.",
                    "label": 0
                },
                {
                    "sent": "What you can see here is what happens when the subject receives stimulation.",
                    "label": 0
                },
                {
                    "sent": "At this point 50 times.",
                    "label": 0
                },
                {
                    "sent": "So before these are 50 steam peripheral stimulation.",
                    "label": 0
                },
                {
                    "sent": "At this point we have this curve and after this 50 stimulation, at this point we have a curd that as you can see is very similar.",
                    "label": 0
                },
                {
                    "sent": "So cortical excitability is not.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Injured much but then look what happens when we stimulated the picnic activity.",
                    "label": 0
                },
                {
                    "sent": "So we have a very dramatic change in the excitability of that part way from the quarters to the motor neurons.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And once we go to after after the pig negativity again, we have no effect.",
                    "label": 0
                },
                {
                    "sent": "So what we have seen in this basic physiological study need is that indeed we can have a manipulation or modulation in excitability by this paradigma.",
                    "label": 0
                },
                {
                    "sent": "Then now is triggered by imagining movement rather than by artificially stimulating the cortex.",
                    "label": 0
                },
                {
                    "sent": "And we've also seen that the timing is critical and this is of course very reasonable and is very reasonable becausw the considered that the movement normally would be a secretary at this point.",
                    "label": 0
                },
                {
                    "sent": "So the central nervous system would expect enough RNV immediately after this point.",
                    "label": 0
                },
                {
                    "sent": "It doesn't expect an offer in volley before they doesn't respect enough for Invole too late, so excited this point.",
                    "label": 0
                },
                {
                    "sent": "It expects enough renvall, and if you artificially provide that volley, then we have strengthening of synaptic connections.",
                    "label": 0
                },
                {
                    "sent": "So in this kind of studies yet to do all the chi.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of controls that I will not describe you, but because you could also say that you could have a similar effect by imagining only by only metric stimulation, and if you read the original paper, we have done all type of controls that are requested by this basic physiological studies.",
                    "label": 0
                },
                {
                    "sent": "So we had a control group with imagination only.",
                    "label": 0
                },
                {
                    "sent": "A control group with an electrical stimulation.",
                    "label": 1
                },
                {
                    "sent": "Only a control group with a certain type of visual attention to the screen that we are that we are showing and we even look to spinal excitability by measuring lifeless pathways.",
                    "label": 0
                },
                {
                    "sent": "And their response with all these controls.",
                    "label": 0
                },
                {
                    "sent": "That is really the excitability of the court as it will change so we are 100% sure of these and we are confirmed that with a number of other measure follow.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now to summarize these these part, the intervention that we propose implies a self generated physiological signal, which is an imagination of a movement or attempting a movement.",
                    "label": 0
                },
                {
                    "sent": "And artificial afferent feedback for inducing plastic changes.",
                    "label": 1
                },
                {
                    "sent": "Timing is critical and if timing is critical, it means that in order to apply this in a synchronous way, remember that was Q based.",
                    "label": 0
                },
                {
                    "sent": "If you want to apply this in a synchronous way, you have to have assistant to online that at this kind of potential that I've shown you.",
                    "label": 0
                },
                {
                    "sent": "So as a next step from this physiological study, what we have done is to look if we could detect these MCPS or contingent negative variation online with reasonably.",
                    "label": 0
                },
                {
                    "sent": "Reasonable sensitivity and specificity, and that's what I'm showing you in a second.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To that end them we have implemented a very simple system that I will not even bother you to look at from the scene opposing POV is simply a match filter because this is a sort of a systematic event and we have implemented optimized special filter in a very in a very simple way.",
                    "label": 0
                },
                {
                    "sent": "With 911",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Codes.",
                    "label": 0
                },
                {
                    "sent": "These are just example of a row signals, so this is the cortical activity after optimize special filtering.",
                    "label": 0
                },
                {
                    "sent": "This our manifestation variable and the.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There is a threshold.",
                    "label": 0
                },
                {
                    "sent": "But to go to the point our question was, is it possible to online that at these signals with the limited false alarm rate and I sensitivity?",
                    "label": 0
                },
                {
                    "sent": "Well, it is possible at least within certain limits, so with the best we can do from the processing point of view, we have around 80% of true positive rate and a limited number of false positives.",
                    "label": 0
                },
                {
                    "sent": "In this case for positive are counted per minute or para interval of time because this continues.",
                    "label": 0
                },
                {
                    "sent": "A recording and continuous processing.",
                    "label": 0
                },
                {
                    "sent": "So every time the system.",
                    "label": 0
                },
                {
                    "sent": "Identify a potential contingent negative variation which is not.",
                    "label": 0
                },
                {
                    "sent": "A contingent negative variation.",
                    "label": 0
                },
                {
                    "sent": "We have false positive, but these numbers are reasonable, reasonably high.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then very important point actually was not.",
                    "label": 0
                },
                {
                    "sent": "Well, of course was sensitivity, specificity, but especially was the latency with which we could detect these negative variation because we remember the timing is critical.",
                    "label": 0
                },
                {
                    "sent": "So if you're not fast enough.",
                    "label": 0
                },
                {
                    "sent": "And then you trigger an electrical stimulation.",
                    "label": 0
                },
                {
                    "sent": "Then it's too late, so the critical point was to have a processing that allowed to detect it with latency close to zero with respect to the pic.",
                    "label": 0
                },
                {
                    "sent": "Negative attention to you, and these are the latency we could obtain in this in this study, and as you can see, on average they are indeed around 0 for some subjects, around 100 milliseconds for some subjects are around minus 100 millisecond, which means that you anticipate anticipated attention, but All in all, is quite good.",
                    "label": 0
                },
                {
                    "sent": "In parentheses, you can detect it, which much better sensitivity if you allow.",
                    "label": 0
                },
                {
                    "sent": "A longer latency is because you can use the entire template, but we wanted to have very short latency.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "To finish with the possibility of detecting these.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Cigna's online I have also to say that the.",
                    "label": 0
                },
                {
                    "sent": "Interest of this signal is that you don't even need to have a subject specific training for detecting these signals, because this shape is characteristic.",
                    "label": 1
                },
                {
                    "sent": "So if you collect a database of sinus is you can see from many different subjects and we've done it.",
                    "label": 0
                },
                {
                    "sent": "Also even instruct patients they say and you make an average template then you can detect this signal with a sensitivity that drop of only two 3%.",
                    "label": 0
                },
                {
                    "sent": "So you don't even have to train a system for this.",
                    "label": 0
                },
                {
                    "sent": "You can have an average template.",
                    "label": 1
                },
                {
                    "sent": "From a database of signal, the subject to put electrodes on and without any training, you can detect that potential.",
                    "label": 1
                },
                {
                    "sent": "So to summarize, this is this subpart.",
                    "label": 0
                },
                {
                    "sent": "And these are signals that are slowly negative variation associated to movement.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Imagination can be detected.",
                    "label": 0
                },
                {
                    "sent": "With around 80% sensitivity and with what we think is a limited number of false positives, the latency on average is around minus 50 milliseconds with respect to the pig negativity.",
                    "label": 0
                },
                {
                    "sent": "Which means basically that we are in time for an external stimulation according to the non physiological investigation.",
                    "label": 0
                },
                {
                    "sent": "There is no need for a subject specific training so you don't need any training for this detection.",
                    "label": 1
                },
                {
                    "sent": "And District points implies that it is possible to develop a full online self paced system.",
                    "label": 0
                },
                {
                    "sent": "That's what we did in this other step.",
                    "label": 0
                },
                {
                    "sent": "So in this ad.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Instead, we put the all these kind of concepts together.",
                    "label": 0
                },
                {
                    "sent": "Now the subject is looking at the screen.",
                    "label": 0
                },
                {
                    "sent": "There is no queue anymore, so the subject is left there for half an hour and he's asked at some points to imagine a movement and now the system record e.g the G is processed in the way that I've shown you.",
                    "label": 0
                },
                {
                    "sent": "So there is a detector that tries to detect the contingent negative variations in time enough to trigger an electric stimulator.",
                    "label": 0
                },
                {
                    "sent": "That will provide artificial feedback that will go to the cortex and the question for this study was if still we can modulate cortical excitability in this completely self paced system where we have a false positive airway, limited ability to detect, and so on.",
                    "label": 0
                },
                {
                    "sent": "And we have also when we have latency that is a bit less could control.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the idea is that you have now understood that is to detect that potential into stimulator.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On that point, so this is an example of what happens in a couple of such, and then I will show you the group data and is very interesting because again.",
                    "label": 0
                },
                {
                    "sent": "If you look at the pre intervention then you leave the subject.",
                    "label": 0
                },
                {
                    "sent": "Alone up to 50 of these kind of stimulations and this is completely self paced and then you test the Accessibility afterwards then you can see that there is an increase and this a second subject and here you can see a group data from 8 subjects.",
                    "label": 0
                },
                {
                    "sent": "In the published paper there are a few more but.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That doesn't matter.",
                    "label": 0
                },
                {
                    "sent": "And you can see also what happens in the control conditions control conditions.",
                    "label": 0
                },
                {
                    "sent": "Again, our imagination only stimulation randomly and so on.",
                    "label": 0
                },
                {
                    "sent": "So as you can see now 100% implies that cortical excitability is not changing at all.",
                    "label": 0
                },
                {
                    "sent": "And as you can see only in the Intervention Intervention Group, the one that had the stimulation triggered by the detention.",
                    "label": 0
                },
                {
                    "sent": "With this online self paced system we have an increase in excitability of around 50% which.",
                    "label": 0
                },
                {
                    "sent": "By the way, is very very large even compared with the classic methods like parasocial stimulation.",
                    "label": 0
                },
                {
                    "sent": "Previous developed in class, ignore physiological investigation, so it's quite large.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's a quite large increase.",
                    "label": 0
                },
                {
                    "sent": "So this implies that online detection is sufficiently accuracy in sufficiently small latency to induce plastic changes.",
                    "label": 1
                },
                {
                    "sent": "This will Lt. Subject.",
                    "label": 0
                },
                {
                    "sent": "By the way, the system is full paste.",
                    "label": 0
                },
                {
                    "sent": "There is a possibility for clinical studies and one can ask which is the functional relevance.",
                    "label": 1
                },
                {
                    "sent": "So does this implies that if we apply this in patients we have an improvement in their capacities or not?",
                    "label": 0
                },
                {
                    "sent": "And this leads me to.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Last part of my.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Presentation where I will show you this time some very new data on application of this approach in a structure abilitation and specifically.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have a couple of studies running, but I will present you one of these two which is the one that is that has the most completed data analysis.",
                    "label": 0
                },
                {
                    "sent": "So in this study we had 13 stroke patients so that you can see reported here.",
                    "label": 0
                },
                {
                    "sent": "Now this table is not for you to go line by line, but it just indicates the type of ischemic lesion and the time after stroke and so on.",
                    "label": 0
                },
                {
                    "sent": "It is not too relevant at this point.",
                    "label": 0
                },
                {
                    "sent": "They are stroke patients with different type of.",
                    "label": 0
                },
                {
                    "sent": "In abilities.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These are the movement right cortical potentials recording from these patients.",
                    "label": 0
                },
                {
                    "sent": "They are surprisingly very similar to healthy subjects apart from the pic negativity, which is less than Alpha than what we usually record in Lt subject.",
                    "label": 0
                },
                {
                    "sent": "I don't know if you've paid particular attention at the values between Lt Surge at these values around minus 10 microvolts and dear, it's it's almost half, but you can see a quite nice negative variation.",
                    "label": 0
                },
                {
                    "sent": "You can see quite nice rebound.",
                    "label": 0
                },
                {
                    "sent": "And also you can see the measure of a Mississippi in three days in this patient.",
                    "label": 0
                },
                {
                    "sent": "Because our first question was if these measures were reliable enough in these patients over different days and you can see that this is quite reliable.",
                    "label": 0
                },
                {
                    "sent": "Of course, this is an average of this potential over several trials, so obviously.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also, our question was if we could attack in this patient these potentials with short enough latency.",
                    "label": 0
                },
                {
                    "sent": "Again, in patients you have to ask these questions again because the symmetrization that kind of sinus can be different and you can see these are the latency is in this 13 patients.",
                    "label": 0
                },
                {
                    "sent": "For example in the tension there a bit larger in average with respect to the Lt subject if you remember, but still they are not that far from zero that indicated the pic negativity.",
                    "label": 0
                },
                {
                    "sent": "So we had some open at the intervention would work.",
                    "label": 0
                },
                {
                    "sent": "Also.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In these in these patients.",
                    "label": 0
                },
                {
                    "sent": "And these were that pencil representative again in one patient.",
                    "label": 0
                },
                {
                    "sent": "And this was.",
                    "label": 0
                },
                {
                    "sent": "Again, particularly interesting because the technique works surprisingly well.",
                    "label": 0
                },
                {
                    "sent": "You have the same kind of plot as before.",
                    "label": 0
                },
                {
                    "sent": "This is a stimulus response curve.",
                    "label": 0
                },
                {
                    "sent": "And this is pre intervention and then what you can see is after the intervention.",
                    "label": 0
                },
                {
                    "sent": "So for patients we have an intervention that is much longer.",
                    "label": 0
                },
                {
                    "sent": "We actually had three weeks to tamper weeks and the bit longer intervention because we expect that it would have been more difficult to have this plastic changes with respect to wealthy individuals.",
                    "label": 0
                },
                {
                    "sent": "But there is a quite quite.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Had to change.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is another patient and this is the the group data that again show.",
                    "label": 0
                },
                {
                    "sent": "A quite remarkable increase.",
                    "label": 0
                },
                {
                    "sent": "You can see the second bar quite remarkable increase in cortical excitability with respect to pre to pre intervention.",
                    "label": 0
                },
                {
                    "sent": "All the other bars by the way our controls with stroke patients we have even more controlled because you have to have a control group who does nothing.",
                    "label": 0
                },
                {
                    "sent": "A control group doesn't classify therapy and so on and so on.",
                    "label": 0
                },
                {
                    "sent": "So I will not go into details but we have quite exhaustive number of control trials.",
                    "label": 0
                },
                {
                    "sent": "Together with the main domain trial, so the main message of this graph is that even in patient we have an increase increasing cortical excitability with this intervention, which is fully self paced.",
                    "label": 0
                },
                {
                    "sent": "And so in stroke we have this tablet.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "RCP is confirmed in the history of patients.",
                    "label": 1
                },
                {
                    "sent": "The amplitude of the motor evoked potential increased significantly following the intervention, so we have increased cortical plasticity.",
                    "label": 1
                },
                {
                    "sent": "I have not shown you the statistic, but very interesting.",
                    "label": 0
                },
                {
                    "sent": "We have a functional improvement, so this changes in cortical excitability are associated to functional improvement, at least for some of the clinical scales.",
                    "label": 0
                },
                {
                    "sent": "One of the easiest is the time to make a 10 meter work, and this increased significantly with respect to a number of control groups.",
                    "label": 0
                },
                {
                    "sent": "So this is the first Association with clinical functional improvements, even if it is very preliminary.",
                    "label": 0
                },
                {
                    "sent": "The clinical part I have to I have to admit.",
                    "label": 0
                },
                {
                    "sent": "And of course, every nurse in these results you can imagine any kind of variations of these this kind of technique, because at the moment we are just produce a single electrical stimuli, but you can induce afferent feedback in many different ways.",
                    "label": 0
                },
                {
                    "sent": "You can, for example, apply a proper function, electrical stimulation, so that you would move the limb as if it was normally moved, or you can even ever robotic device.",
                    "label": 0
                },
                {
                    "sent": "That move the limb and that excite afferent feedback because of this.",
                    "label": 0
                },
                {
                    "sent": "Because of this moment, so we have also started to investigate these these aspects.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we have a few studies on FPS that I will not mention because they are very similar to what we are doing that I just described with single Africa stimuli.",
                    "label": 0
                },
                {
                    "sent": "But there is a train of of stimuli.",
                    "label": 0
                },
                {
                    "sent": "What I will, On the contrary show you is control of robotic device is not not for establishing function, not not for walking but again for abilitation following the same kind of idea and walking is a very particular.",
                    "label": 1
                },
                {
                    "sent": "Task with respect to the to the task that I have described before.",
                    "label": 0
                },
                {
                    "sent": "Because walking is a semi automatic is very much controlled by spinal circuits by central pattern generator.",
                    "label": 0
                },
                {
                    "sent": "But there is one part of the working which is particularly interesting, which is the initiation of the step.",
                    "label": 0
                },
                {
                    "sent": "So the first step that you do that is very much cortically corticale coded and that's also very interesting.",
                    "label": 0
                },
                {
                    "sent": "The clinically because there are many disorders that actually target the gait initiation because after that.",
                    "label": 0
                },
                {
                    "sent": "Depression can work much better.",
                    "label": 0
                },
                {
                    "sent": "So join these two ideas.",
                    "label": 0
                },
                {
                    "sent": "The first is that cortically we may have a large potential at the gate initiation.",
                    "label": 0
                },
                {
                    "sent": "Becausw get initiation is very much court recorded and the Fed the clinical is important.",
                    "label": 0
                },
                {
                    "sent": "What we are doing in this study indicated here this the lokomat, by the way, is to control the beginning of passive working by the robo.",
                    "label": 0
                },
                {
                    "sent": "Given the imagination of gait initiation from the stroke patient.",
                    "label": 0
                },
                {
                    "sent": "So this seems very far from what I've described before, but is exactly the same.",
                    "label": 0
                },
                {
                    "sent": "So we have a cortical potential which is again a movement related cortical potential.",
                    "label": 0
                },
                {
                    "sent": "If we are able to detect that, we can send the offering feedback in time so that the brain thinks that that's the actual movement.",
                    "label": 0
                },
                {
                    "sent": "And the afferent feedback is here sent by moving the limb with Robo and before it was sent by giving adapt to the nerve.",
                    "label": 0
                },
                {
                    "sent": "The concept is the same.",
                    "label": 0
                },
                {
                    "sent": "So we have again done.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Series of studies which are still to be finalized, but one of them is to see if we can have those kind of potential in gait initiation condition.",
                    "label": 1
                },
                {
                    "sent": "So we have a subject onto platform that measure force and the subject goes from one platform to the ad.",
                    "label": 0
                },
                {
                    "sent": "And we record of course, the the the initiation of the movement by looking at the 4th accepted setting on the platform and at the same time we look at the potentials cortical potential again e.g and we would like to understand if we can dictate sufficiently soon when the subject would like to move.",
                    "label": 0
                },
                {
                    "sent": "And that this is possible.",
                    "label": 0
                },
                {
                    "sent": "Also, quite Interestingly, what you can see on your left are the movement letter, cortical potential of a number of subjects there very similar to before, but this time.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And it corresponds to initiating a step.",
                    "label": 0
                },
                {
                    "sent": "So as you can see, the characteristics are very similar.",
                    "label": 0
                },
                {
                    "sent": "As you can see, you are picking activity and so on.",
                    "label": 0
                },
                {
                    "sent": "And what you can see on the right at the rock receiving operating curse that indicates which is the ability to detect online those kind of inner cities.",
                    "label": 0
                },
                {
                    "sent": "And again you can see by looking at the red dots that you can arrive at around 80 or even more percent of true positives.",
                    "label": 0
                },
                {
                    "sent": "So again you can detect that and we have now a clinical study that is running for which I. I don't have the results unfortunately, but he's running on this concept so that these patients have electrodes and there are both start to move and once we start to move it continue to move and then he stops and then again the subject is to think actively strongly that he wants to initiate the step and once the system that acts and their intention to initiate the step than Robusta.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Block alright so I I have been brief enough so that we've also gained some time.",
                    "label": 0
                },
                {
                    "sent": "I will finish by presenting again my outline, which is also the summary of my talk at the beginning.",
                    "label": 0
                },
                {
                    "sent": "I hope I have explained to you which is the main difference of this type of visa application with respect to restoring or replacing a movement.",
                    "label": 0
                },
                {
                    "sent": "Here we don't want to restore anything, we just want to change excitability of certain pathways.",
                    "label": 0
                },
                {
                    "sent": "In the second part of my talk I have presented you what was our idea to use the BC ice for this proposal, and basically it's a very simple idea of having a cows and Association between a motor command decoder, the cortical level and an artificial afferent input, and in the last part I've shown you preliminary, but in some case in my opinion quite convinced results on Stroker abilitation using these techniques, and with this I thank you very much for the attention.",
                    "label": 0
                }
            ]
        }
    }
}