{
    "id": "x66vq5wpdx6wyll26pkrlwclrpwgwijk",
    "title": "Nano-Solutions for Sustainable Development",
    "info": {
        "author": [
            "Eric Gaffet, University of Technology Belfort-Montbéliard"
        ],
        "published": "June 8, 2011",
        "recorded": "May 2011",
        "category": [
            "Top->Technology->Nanotechnology->Nanomaterials"
        ]
    },
    "url": "http://videolectures.net/nanomaterials2011_gaffet_development/",
    "segmentation": [
        [
            "I would like to 1st thank the organizer for giving me the opportunity to come here to give this conference.",
            "The field of.",
            "In the field of nanomaterial toxicity, ecotoxicity and regulation I come from the."
        ],
        [
            "Part of nano material chemistry I'm working in this field since now long time 30 years now and working in the field of synthesis by mechanical alloying and which is a mechanical one of the process to produce new materials and we produce little fine particles, nanostructure particles."
        ],
        [
            "Consolidated by your specific device, which is called Spark plasma centering, and we have patterns with US team in California and we have also know how to answer questions with Germany people Company which is called French producer this meeting."
        ],
        [
            "So the outline of this conference would be this one, and just to put the context of this, I just want to remember that this."
        ],
        [
            "Field of nanomaterials and nanotechnology is not.",
            "Consider in France as a revolution, but a strong evolution, which is slightly different and it started factor."
        ],
        [
            "Uh, from the modern edge with this manager.",
            "Feminine 1959 with this well known conference."
        ],
        [
            "And for the first time, the world nanotechnology was used in 74, and so it is a real longer way to come now."
        ],
        [
            "Go to the prediction and prediction in mass on the market of nanomaterials and watch is observer on the right curve is that we are in the critical phase."
        ],
        [
            "With introduction of several kind of nanomaterial Nanosystems and here you have the 4th step passive nanostructure.",
            "An active nanostructure.",
            "Now, we are in the 2011 between the 1st and 2nd step, and we will go to system on nano system and molecular."
        ],
        [
            "Systems so introduction of this product number product on the market.",
            "Muslim interrogating question on the properties of these materials.",
            "So absence of knowledge or quasi absence of knowledge on the toxicity.",
            "And it could take CC in the beginning of 2000 or puts on the table.",
            "The question of how to manage it.",
            "And if you are not able to manage it by regulation or something else.",
            "Or it may be.",
            "Positive an opener regulation and not a strong one.",
            "For example, the development maybe stop.",
            "I will show you in some later."
        ],
        [
            "So the question is also related.",
            "Now even if we do not know exactly the worldwide level were concerned by this potential exposition to nanomaterials at work place, for example, there is only one country Italy was produced.",
            "Strict analysis of the people for the full field of nanomaterials, nanotechnology as they remember, and then the number 300 are in 50.",
            "1000 people were potentially exposed to no particular in workplace."
        ],
        [
            "So."
        ],
        [
            "Go to definition, even if it's their own way for this nanotechnology and a new fields, or even if scientist, it is easy to speak on this and we use a similar language and some words and animator means the same thing.",
            "If you want to go to regulation, you need to have the same common language that stand out in 2008.",
            "I know process state of the art concludes that there is absence of any terminology, common terminology or definition for the older reader.",
            "One here that means that there is the necessity if you want to introduce international organization to other common language at the work under."
        ],
        [
            "Taken and you have to work until September 2008 and have the first definition of these three simple materials on an object or particle road and plates.",
            "And in 2008 it is.",
            "It is only three non object were well known, well defined as a common label at international level.",
            "Now in 2010 as are several other definition coming from I so and also in 2000.",
            "11"
        ],
        [
            "And we have to wait October 2010 from the European Community Commission for not a regulation, but our recommendation on the definition of the term of nanomaterials and what is important in this field are is it is the first time that we see the introduction of the specific surface area which is not the specific surface in this one, But this specific surface area by volume, which is not very simple because not only you have to manage and to measure the surface.",
            "As a specific surface which is less equal but you have to have also the density of the materials to obtain this value, and if you know the difficulty to measure the density, it is even if it is a step forward to really taking into account the effect of nanomaterials which is due in part to the surface.",
            "It is not so easy to manage from experimental point of view and from technological."
        ],
        [
            "Interview so specificity of nanomaterials.",
            "So if you want to regulate or to manage, or at least for mandatory or lab level, it is the question that for the same process you are able to produce many many nanomaterials.",
            "Here.",
            "For example is it is 1 labs were able to produce all this set of nanoparticles based on one single process."
        ],
        [
            "So.",
            "The future is us when you are able to manage the nucleation and growth of the particulare.",
            "This level for the same chemistry you have many feature, many structure, many morphology which will induce a different interaction with environment and also."
        ],
        [
            "Human people.",
            "Uh, so specificity of nanomaterials is the fact that when you go from a millimetric to nanometric scales, when you have one gram of 10 nanometers of 10 nanometer scale titanium oxide, you have ten millions of billions of nanoparticles.",
            "And so here is the question.",
            "Still open question on how to manage a statistic of sampling.",
            "Of this materials to be sure that you're sampling our present it if of the all the matter, and it's clearly still an open question or the the working party on manufacture nanomaterials community of practice on the physical chemistry of this one.",
            "It is not yet answer how to sampler, how to manage the statistique of this.",
            "Millions of billions of."
        ],
        [
            "Tickles what is the effect I adjustment I have yet mentioned is it is a specific surface and when you come from nano Meter to 1 centimeter to nano meter you have a huge increase of the surface or 10 billions."
        ],
        [
            "And it's representative of four foot place for examples and on this surface are you have a deposition of a monolayer you made a deposition of a monolayer of any contamination, gas, or something else, and this layer may represent 50% in weight.",
            "Of all the matter.",
            "So when you consider the matter at this level, you have not only to consider the core of the particulars, also the surface.",
            "And in many case you don't know you have no information on 50."
        ],
        [
            "Of this matter."
        ],
        [
            "Looking at our the market and why out, why so many country work and develop this and invest in research and application is filler.",
            "Here you have many perspective based on the private think tanks or there is no governmental perspective or holds the plot here or the point here are individual prospective and you have at the end are two scenario.",
            "Optimistic one and pessimistic one.",
            "And now we are just below just over the possibilities pessimistic one.",
            "In 2000"
        ],
        [
            "11 I."
        ],
        [
            "Exam system what is?"
        ],
        [
            "Also important is a stronger investment in research and it is not a continuous one.",
            "There is a strong increase during the last year or so with a factor of 2.",
            "In improving increase of this."
        ],
        [
            "Ben some and what is also changing is the ratio of the private or in the thrill investissement or to the government were one and in 2010 as a research and development investment corresponding to the industrial engagement is equal to 80%.",
            "So it is stronger pressure also in labs to promote this material.",
            "So to push this on this the research on the market and there is also stronger pressure for regulation or to manage."
        ],
        [
            "And so there is also a stronger as I have mentioned from worldwide competition is not more worldwide.",
            "That means that all the countries in some specificity for someones are leaders or there is a stronger."
        ],
        [
            "Also, involvement of foreign with perspective multiplies this but is also."
        ],
        [
            "Useful because for example, in France this concern in perspective will involve any prior and you are concerned with initiative not going over.",
            "For example in 2009 and 9 oh 2012, with two .3 billion euro in research and development for nanotechnology and."
        ],
        [
            "Informatics for example."
        ],
        [
            "So how to put our produces?",
            "Nanomaterials are two way top down and bottom up so I."
        ],
        [
            "I just remember this and with so we are able to produce this nano device.",
            "For example we say for example interaction with nano Informatics and Brandon at the bottom left."
        ],
        [
            "Alright for you sorry and also one particular idea of this failure is a development of nano tools to manage to under this nano object.",
            "Here we have some gripper here."
        ],
        [
            "Non degree power to manage nanotubes and we are able to put to work and to meet."
        ],
        [
            "Just scared to producer some specific feature, but what does even if it is spectacular.",
            "So so physical, stronger new physical properties or you have to realize that manage unlink of this matter at individual level, just to correspond to 10 to the minus 14 grams of material per year.",
            "And so the question is not, regulation is not in this field, even if it is a very nice and all the cover of any scientific literature."
        ],
        [
            "So, but the question is better address.",
            "If you look on mechanical processing, physical processing, chemical processing or which are classical.",
            "Produce single method to produce powders or any massive materials, but adapt to produce."
        ],
        [
            "Nano meter scale materials and if you look on this three mechanical, chemical and physical processing it no more 10 to the minus 14 grams per year.",
            "But it is more to close to 2 million stone of silica.",
            "For example 2 million tons of titanium oxide or for example, so 10,000,000 tons per year worldwide of course."
        ],
        [
            "Black and also one specificity.",
            "When I mentioned that there's this huge producer, methods are, well, control.",
            "There are for example able to control the size of aggregate at the size of primary particle in the range of the nanometer.",
            "Here another example from Roger for Silica used for example in tires and they are able to control this independently.",
            "The size of the Premier practical and the size of the."
        ],
        [
            "Aggregate."
        ],
        [
            "If you look now in the field of application, it is clear that.",
            "For all materials are the effect of nanostructure ornano sizer is well known, even if it is not managed by these people.",
            "But here, for example, on the glass from Catterall.",
            "Color on their left out only due to the size of the particle in Golden and the color on the right side is Jones to the size in silver of this nanoparticles.",
            "But you have also for the same part size of particulars, the importance of the shape and giving you the color yellow and red, for example, on the on the."
        ],
        [
            "At.",
            "And I've also carbon nanotube on domestic Subs, so that means that Nano Effect was using the."
        ],
        [
            "To produce ancient materials.",
            "Now if you come to a modern edge, you have nano Silica which is produced since 1949 by degreaser.",
            "Even if now this nano particulars is not claim as Nano but Millie microns, that means clearly nanometer scale and it was used for food addition."
        ],
        [
            "Paint and so on, and also in the field of nanosilver.",
            "The first registered one was in 1970.",
            "54 and we have to wait until 95 and 94 to ever registered, particular which are not nano size are in."
        ],
        [
            "Silver, so that means that in two day life we have a use for.",
            "We use today nanometer scale materials nano device in here for exam."
        ],
        [
            "Calling this place you used today hold this nano device or nanomaterials another application.",
            "I sure now that you can Live Today without this material so well.",
            "It could be relatively difficult in some specific."
        ],
        [
            "Area.",
            "In the food I'm sorry for the slide in French, which is extracted from an official.",
            "Website just to show that if you want to find information it is possible even from industry here from DocuSign Ebonic.",
            "They claim that they produce no signature for all the powder food here which are listed."
        ],
        [
            "Yeah, and you have here inventory from ALIVM and this alone the agency in 2010 would quantify the nano silica in a mini food product which are listed on the list."
        ],
        [
            "Able and you have new application, old one which are active packaging or passive packaging active which are biases or versus passive.",
            "Because the the decrease of penetration of oxygen inside the container."
        ],
        [
            "But you never thought on new ones, which are called edible packaging, which are directly applied.",
            "This nanostructure firmer on the fruit or vegetables, and you are claimed to be edible without any problems."
        ],
        [
            "And as you see, it is necessary to get an official inventory, because if you want to regulate product on the market, it will be necessary to know what is what has to be regulated and you will see here some difficulty becausw one claim for all the application more than 1030 and water projects and one NGO in US on cosmetic claim that they find 9.",
            "1500 for projects and for Nanosilver.",
            "There are more than 500."
        ],
        [
            "System, so there's a necessity to clearly to put on the table a clear and official inventory of the new product.",
            "And if you look on the products that are used, at least on the woodwork project Woodwork Institute, which is a think tank American system, you see that there are six nanoparticle which are well developed, and in particular silver, for example, which represent more than 55 products, that not the quantity, but it's."
        ],
        [
            "Number of projects that have been identified and in Europe a it started to inventory from NGO.",
            "Maybe it is also supported by Asia.",
            "Welcome in recent very recently that they would like to also to introduce their own inventory on the table.",
            "But here what is clearly that there is not yet a state agency or state are in."
        ],
        [
            "Battery of Fishel, 11 particularity of this application is illustrated here for example in this one which is a lap on it and what used by Canadian industry.",
            "It is clay nanoparticulate artificial clay you have here hold this information are coming from their website official website.",
            "This is clearly known that they produce nanopore."
        ],
        [
            "You know, and they use here for the same particles.",
            "If you have many, many different applications with many potential exposition, different potential exposition of producer but also of user and many different end user potential and use on."
        ],
        [
            "Environment so."
        ],
        [
            "So if we are here, we do not.",
            "Do not forget we have not to forget that it's because.",
            "At the beginning of 2000, Zar Zar Gino NGO sorry Elliot from ET C particular but you have also green person but you have also a friend of the Earth who asked to agency and state if if we know any knowledge on the toxicity on toxicity of the nanoparticles and what has to be clearly mentioned.",
            "It's the title of this.",
            "Harriet was sent toxic warnings.",
            "All this paper who are here it is just a part.",
            "I've not been reproduced.",
            "Now there are still questionary and we know now why they are question Arianne, why they are not being over produced but the beginning of the question."
        ],
        [
            "Here at official level and when if you compare thus interrogation or the question from the NGO, here we have official position from a smaller enterprise in Europe and you find that the question of regulation or the question of turned out of the question of public social acceptance was not considered as a break from the development of nanomaterials."
        ],
        [
            "I know technology, but the situation is changing.",
            "If we were, you see at the World Economic Forum, in divorce in 2008, the question of nanotechnology risk as emerge and it is core for risk for development at the worldwide level."
        ],
        [
            "So so so strong development and soil improvement is a question of this one effect of the first knowledge of 1st answer to this question of toxicity and nano toxicity.",
            "Is this one here you have to invest risk capital investment at the worldwide level and you see that there is a slope decreasing this local.",
            "Which is coded to the first report on the no toxicity and.",
            "Because of this question and on the size, are stronger population questionary on Huawei do develop our way introduced another projects on the market.",
            "If you do not know the toxicity.",
            "If you are not able to manage it."
        ],
        [
            "When also effect, for example here you all you know, the paper on nanotubes with effect.",
            "We are clear at this data equal to asbestos and and immediately matrices temporarily stop the production of their nanotubes.",
            "But they are under the pressure of the capital investor Sir and not from the scientific.",
            "And thank Technologic development of this company which is just for the question of risk.",
            "On the field of investment.",
            "And so in."
        ],
        [
            "Respond to this one.",
            "They are now stronger development and coordination of.",
            "Research and technological development to improve the protection and provision ways."
        ],
        [
            "To prevent any programs to address this question from a prediction of the particle to environment at the end of the life of this product."
        ],
        [
            "And the.",
            "HUD here just to remember that nanoparticle even product in one way in one point in the world, all the people are concerned.",
            "We have example of Volcano in Iceland.",
            "And the particular coming environment are three times the background level.",
            "Here in this capital, I think that it is a three weeks or later at the beginning of this."
        ],
        [
            "Eruption, so if you look at just the summaries service come and to confirm the risk is hazards and toxicity and acquisition and not only results."
        ],
        [
            "Turn the exposition.",
            "As I mentioned, so they take to take into account the necessity to promote toxicity, research and equity research.",
            "Our strong cooperation and development of this field and you see from 2000, strong improvement of research and publication.",
            "But it is.",
            "It may be a mistake if you just consider the rough data like this cause.",
            "For example in 2005.",
            "The number of publication is not to be considered as original publication Alpha.",
            "This big medication or review of review.",
            "And not publishing clearly original data on the toxicity.",
            "We just sign of the pressure of statement asking to research Gemma, to know to every port on the data concerning the toxicity.",
            "And they took Botox City after 2005.",
            "There are now original data producing it is the classical wave form."
        ],
        [
            "So to produce at the international level, you have this data.",
            "This website will officially summarize and comment all the literature with way too.",
            "It is also the first time in the research field that you have a soap and and so collective work."
        ],
        [
            "It has to be on the line and one critical point is a field of ecotoxicology corner filler.",
            "Since I in 2009, if you look on the review of all the literature, there are only two 26 ecotoxicology published works which can be user and the set of particles are under the research relatively."
        ],
        [
            "So to summarize, a human exposure routes are inhalation, dermal.",
            "That means skin ingestion."
        ],
        [
            "Objection.",
            "But you have a stronger question.",
            "If you look you have a toxicity development and research in the field of language, meaning the inhalation for workplace.",
            "It's normal skin because cosmetic industry's work in this field since many years brand because it is for medicine user and also.",
            "Practical application but you have no or relative no less.",
            "Program in the field of ingestion, and so it is questionnaire because I have shown you that nano food exists since many years and and also up to 90% of the particles that go into the lines are at the end in just a fork.",
            "By cleaning this language.",
            "And so the question."
        ],
        [
            "Is still open on this field.",
            "What is also question I'm in the field of regulation and it is not only a regulation of the production way, but it also question of regulate the nano products and and if you look the the publication and you find that the publication applied to nano enabled products are very few compared to basic materials which reference material for research but not really."
        ],
        [
            "Really useful for a clear application in terms of regulation one.",
            "Also, data has to be clear if you look if you want to analyze all the nano products on the market.",
            "With the men available now human and technology called once it takes a long time.",
            "More than 50 years, so you have to consider it and."
        ],
        [
            "Under the scale, and if you want to effectively put.",
            "Test toxicologic tests on animal or equivalent of animal.",
            "Are there are too many animals to sacrifice and so it is not on this way that maybe."
        ],
        [
            "The question has to be addressed.",
            "I speak on the cooperation and I speak on the organization of researcher and it is done at European level, but also at OECD liver and what's the conclusion among all this parameter?",
            "For the first time, or people agrees that the main parameter critical for toxicity and ecotoxicity are the 1810, the one which are listed here."
        ],
        [
            "No, and if you do not promote if you do not give this parameter in publication, you could not compare the result from one to the other one.",
            "And here from the paper from uncertain publishers.",
            "Some years ago, 80% of the publication do not give any information on one of these eight parameters.",
            "So that means that it is impossible to conclude, and to generalize the results, it is only specific to the product to the powder, and in some cases we do not know the shape.",
            "The size we know we know only the chemical composition which had been used to buy this powder."
        ],
        [
            "Producer if you want to conclude on this field of toxicity, what is really known is that no toxicity is different from micro toxicity, which is a general conclusion.",
            "Different doesn't mean that.",
            "The particulars are more dangerous than micro ones, and there are some examples from which exhibits that microparticle are more dangerous that nanoparticles or the same chemistry.",
            "This specific toxicity of the nanoparticles, and that means that if you change the protocol to put to introduce this particular in the test, for example device, or you will observe a distinct rich results and also you have a trillion.",
            "Effect on that means that this it is used in medicine to introduce by vectorization active principle, and it is also a mechanism of Cal option for example."
        ],
        [
            "I would."
        ],
        [
            "Chances and also stronger question which which is difficult to manage in research in this field.",
            "But it is a present value transference are now.",
            "Many publication was proved that no particular will inject or foot on the scanner may be transferred to this sentence here."
        ],
        [
            "Been clearly proven with effect on the brain of the disabled and so due to this incertitude or absence of knowledge on the toxicity of any nanoparticles, one solution to manager risk is to manage the."
        ],
        [
            "Position it may be the only ones, but we are not to consider only the classical production or put on the market.",
            "But you have also to introduce the accidental E vendor."
        ],
        [
            "Elitism.",
            "And so all the recommendation in the field of.",
            "Solitary safety agency or the following 123 engineer nanoparticle?",
            "As if a there as others, and so pollute exposition."
        ],
        [
            "Column where the field one and here I would just illustrated by this slide.",
            "Here.",
            "For example, production unit of production of titanium dioxide in China, which is a common work and yet published work form between Japan and China.",
            "And here you have a first.",
            "You can easily see the which one with the older production wave with the smog and clearly this morning and after here on the back.",
            "On the left side, after clear management of the exposition and provision, wait is possible to work without any exposition of the work."
        ],
        [
            "People are here.",
            "And so the question is not at the industry level, but also in the lab are for example here in California they notice that there is a sense it could be an increase of 10 to 6 particular person server of nanoparticulate depending on the way the introduce a nanotube in their solution."
        ],
        [
            "By your question or something else, and for example, you have now many, many workplace guide liner first or 41R in front.",
            "But they also this translator and there also.",
            "Federal level and so for people who want to work with the good practice, it is possible to find a recommendation and practical recommendation."
        ],
        [
            "With the use of filter and so on."
        ],
        [
            "To apply this, there is one point which is.",
            "In the field of regulation, if you want you have to introduce a critical level for two exposition of people.",
            "And here for example.",
            "Is our recommendation and there are only a recommendation of higher level of various nanoparticle or nano objective growth in Celebran cerebrum, but they are not.",
            "Correlated to any publications is just a factor of correction to apply to micro powder, and you have a factor question of 10 or 15 to which is."
        ],
        [
            "Value.",
            "Just to confirm this, for example, in the field of nanotube, a bias proposal level or higher level for exposition and nano sealer on their own are no particular nanotube proposal, another one."
        ],
        [
            "If you go to my OSHA USI agency Institute, so you have another one.",
            "So that means that up to now we are not official and we are not still in position to propose a well defined and well discussed Level 4."
        ],
        [
            "And a very recently just released Wichita Nioce proposal.",
            "Some new recommendation for no particular in the field of titanium dioxide, and this proposal is different from the ones that they are proposed in the center.",
            "Location five years ago, so this is a situation is still in evolution, and so the better way."
        ],
        [
            "To propose a lesser exposition."
        ],
        [
            "To control this.",
            "In France at least, there is a question of analysis benefits to the risk in application, and it is in terms of the Grenell too low for example, and so you have to compare the effect.",
            "The positive effect of this particle to the potential or demonstrator effect on human element in the field of nanosilver.",
            "For example, you have a recommendation of the icons.",
            "Public is not to use this nanosilver, which can be deliverin environment due to the absence of any knowledge on this.",
            "Toxicity."
        ],
        [
            "Eco toxicity and you have also for example here.",
            "As I mentioned, the only 26 ecotoxicological publication in this field, but some are clearly demonstrating their real applications at the new silver, for example, can significantly I tell the when."
        ],
        [
            "The plant growth another way is it is not only a question of toxicity and ecotoxicity direct introduced by the particular, but here for example the introduction of dioxide, Syria.",
            "Scatter is a enough fuel insurance.",
            "Barely decrease the competition temperatures.",
            "That means that there is no more at least graphite, particular the end of the motor.",
            "But in comparison you have also secondary emission of byproducts or for example benzene with again fully automatic hydrogen cycle.",
            "Knox also made maybe chance or increase of C. Oh, so that mean in this field that you over to consider.",
            "Chancellor of the material that only the direct effects that may be promoted by the producer industrial want to introduce it on the market, but a clear introduction and clear cycle analysis to be done and just to remember this.",
            "This knowledge is has been produced by the Yeast Effect Institute in US since 2001.",
            "It is relatively confidential, but it's a."
        ],
        [
            "Maybe it's clearly accessible for anyone, so I know the pointer before concluding.",
            "It is clear that this management of toxicity and ecotoxicity of particle of any products may be a constraint for any of this world also for research.",
            "But it is also user and yet user by some industry for communication, transparency, an information to consumer.",
            "It is also a way to introduce confidence with consumer and if they are for example my kernel are claiming are claiming that they are.",
            "Effectively, positive results in the management of toxicity and ecotoxicity of the products introduced confidence in the.",
            "In their own products on the market and also for example, you have another example from Nano Phase.",
            "Or if you go some years ago on the first page of their website, they introduce the fact that they manage is they take into account the position, potentially position of their workers and they manage safety of their nano."
        ],
        [
            "Product so to conclude, we have to scale.",
            "It seems that this nano products are not only in labs, but they are yet on the market.",
            "And since many years in some cases in 50 years for nano, silica for example, and there are user for many many application and one way to manage incertitude may be saved by design.",
            "That means that controller, the toxicity and or exposition level by changing the surface for example or the structure.",
            "Or the aggregate sales, for example, of the particular which are used in cosmetic cream.",
            "For example, survey process.",
            "That means that you are supposed to use no more dry process but you mid process or liquid suspension, for example.",
            "And it's clearly a necessity for inventory and not only voluntary one, but state Agency's to manage hit in France, for example, has been started in 2008 and 2009.",
            "I participate to this one.",
            "And the question of risk to benefit us to being clearly managed integrating the full life cycle of the materials and the products.",
            "And it has to be done in open analysis and public discussion.",
            "For example in France we have the frenzy bat debate on a nanotechnology nanoparticles.",
            "Several agencies are now thinking to introduce a permanent concealer, introducing people and consumer not only to discuss in terms of crisis or because it's too later.",
            "But hold the day and all the life of the products.",
            "And it's undertaken now in France.",
            "Thank you very much for attention.",
            "Thank you.",
            "Mini, so to speak.",
            "Aspects that need clarification.",
            "Are there questions, comments or criticism?",
            "Please do not hesitate.",
            "We have enough time.",
            "Will break the ice.",
            "Yes please.",
            "I felt one with device and other partners is something which is lower than 60 square centimeters per give you free.",
            "So.",
            "We analyze the thing about with different particle size and surface area and you found for example that one of the powers we expected the least toxic.",
            "It was the most toxic, but it has very low surface area.",
            "So I see a danger here to put such agreements between nanoparticles and micro size or submicron particles, because this will open the door for toxic powder without being classified as nanoparticles.",
            "OK, I think Part 2 the skinnier.",
            "Welcome group on the No definition.",
            "And if you looked on TV to the last version of the document, you will see that this question has been addressed.",
            "OK.",
            "So.",
            "It is a question if you ask to scientific people their knowledge on the clear short liner or cut off for defining nanoparticles.",
            "Zone Sir, will be that it is not possible because the effect of sizer.",
            "On the change of properties and in some cases for example start.",
            "We have in this report for 500 nanometer.",
            "In some cases we have a 1000 nanometer.",
            "So the difficulty if you introduce them.",
            "1.",
            "0.1 micro meter.",
            "OK, you have many many many particles.",
            "OK if you introduce us as a pressure now to introduce 3930 nanometer which is a US pressure based on nature publication from a French team.",
            "For example, you lose too many particles.",
            "And so again, if you want to start something, you have to put on the table proposition of definition, which is representative of the field.",
            "The question is that maybe as to be introduced, not exclusively.",
            "Among mental to the definition, and if you have, for example some specific results from research literature, demonstrated that for a given particular, in some cases of exposition, in some cases of user, for example, at 150 nanometer you have a specific behavior.",
            "It has to be added.",
            "But in any case, you are not supposed to introduce on the market and your product you are supposed to alter the ears of anyone.",
            "So if there is any publication who demonstrates that you are any effect at any size you are supposed to, not to put it on the market so.",
            "In front of this, like this, if it's demonstrate you are not supposed to put so.",
            "The question is if you do not know.",
            "So your question is.",
            "OK, it's but if you look even on this definition, for example of 60.",
            "Meter square per cent.",
            "Emet Schumer in the field of nanotubes, then density.",
            "There is a variation of density of 900 person between the lower and the iron density dense nature.",
            "So even in this case, which density do you use?",
            "OK, if you use the density of the graph item, you are wrong.",
            "It is recommended to use the density of the bug but.",
            "What what will you do will do do when you do not have any massive material, for example.",
            "We are supposed to measure the density of nanotubes.",
            "And which method will you use?",
            "Or there are no standard method to do this?",
            "It's may be difficult to.",
            "Thank you and recover from.",
            "European Commission was one of.",
            "Lot of people behind the recommendation that was put in public consultation and I would just like to comment it.",
            "In a sense, we are slightly the.",
            "At the mercy of the scientific community, when does regulators we try to introduce that definition into the regulatory context but still keep it?",
            "Science based in store?",
            "And yes, we have tried as hard as we can to keep within the recommendations provided by skinnier and skinnier.",
            "Has introduced the 60 and skinnier his injury specific surface area per volume which will agree has challenges and there's even recognizing that.",
            "Senior document just two commands is this value is just the surface of particular 100 nanometer with one gram in density which is not mysterious.",
            "It's just the application of.",
            "They need to produce a necessity or the possibility to measure not only the size of the specific surface.",
            "Which is for me, it is a positive way because you introduce the notion of a specific surface, which is well known as being one of the major parameter for toxicity so.",
            "Yeah, yeah, exactly don't going there.",
            "The definition is essentially about recognizing that the definition should be only both sides and then the specific surface area is introduced as a.",
            "As a way is an alternative way is an easy way.",
            "In order to assess whether you're really in that in that range.",
            "But I completely agree with you.",
            "The 60 has been pulled out essentially from a very crude assumption of 100 nanometer particles and sprinkle shake and so on.",
            "And we know that we always have size distribution.",
            "We know that we have different shapes and so on, so that is one point.",
            "But what is maybe a bit what I really wanted to comment on is that the definition cell, at least this used in regular purpose, it is not.",
            "Has not been intended to communicate, risk or hazard better.",
            "It has not been used because we also stand behind.",
            "Now I'm losing a bit of suspense.",
            "I have presentation in the afternoon.",
            "I hope you're still here though I will steal all our secrets, but the fact is we need to ensure as you put it, safe use of all substances, materials that are on the market or that we are able at least to understand that we are.",
            "Adequately controlling the risk that may be from using from using these materials and none of it here are no exception, and defining something as non material or maybe failing to define is not a material does not really take that obligation away.",
            "So the definition by itself it will not solve or exacerbate the problem.",
            "It might take what we expect is that it will facilitate some of the activities.",
            "In order to do so that this application can be more effectively pursued for this specific materials, but it cannot really.",
            "Yeah, it cannot really change the basic applications that we have.",
            "So this is one of many important point to make it, and of course we also recognize it's not just the size of the material system, and it's not just, it's not just the material itself, it's also the coding.",
            "It's also the shape.",
            "It's it's very many things that address that might affect the hazard and just buy buy size.",
            "We cannot really coming close to that assessment.",
            "Yes, but if you are over larger over that these size are so user parameter you mentioned are not supposed to have a strong effect.",
            "Because it's just controlled by the chemistry.",
            "OK, up to now, some materials just been estimated as a function of the chemistry in the turns on any other parameters.",
            "So it is just if you want are in the field of nanomaterials that this eight parameter I mentioned, for example.",
            "Oh, I've been demonstrated to take a strong place and maybe I have to be considered and not only chemistry.",
            "It is just because why it is important to introduce a cut off.",
            "Maybe if it is a large cut of meat baby between 100 two, 8 S 1000 nanometer it it is not a question but it is important to take into account that the chemistry is not the only parameter for this filter and that all the tests that has been.",
            "Classic Lee use has to be carefully check for example, there is now a paper net nature.",
            "Nanotechnology would demonstrate that if you put the cell here, the test cells or to put them here on your suspension, you do not observe the same results because you just do the suspensions of the particular you have.",
            "Not the same were in contact with the cells.",
            "It is not the case in the large particular because gravitation occur and large particular always on control the cell.",
            "If you look on nanometer science, you can give nanoparticle in suspension and if you put very fast experiment, you will see only the large one in the field and nano meter.",
            "And if you wait a long time you will see the smaller one.",
            "But after the large one we have yet interact with the cells.",
            "And so you have to.",
            "Beyond the lights, the protocols of the test to be sure, and if you do this, you are supposed to control the distribution in this in the suspension, which is not done now.",
            "So it just to to see that completely agree with yes exactly what I want to say.",
            "It's not clear in the in in just stating it by having such definitions and so on.",
            "It helps you to facilitate to be more effective in ensuring that once you do the testing you're doing properly, you should be doing the testing on materials as well as on along the others.",
            "That was essentially my phone and on the point where where some of these properties become relevant or not.",
            "Reservit Lee agree with you.",
            "I mean I just it's just one explicit example and that is that you can find for some.",
            "For some metals you can find metal in metal bulk and metal powder in actually different hazard class.",
            "Edit It is because of the size, but we're still talking micro micro sized Raiders.",
            "So the size the size can actually affect the toxicity of other materials as well.",
            "You don't need to go into the nanoscale to see that.",
            "For me, there's no skill is also now suture materials.",
            "So for me, a powder which are which is micro powder.",
            "I work on this and if you are nanostructures or the reactivity of the particle while on the surface at the grain boundary diffusion which has been multiplied by 10 to factor to the major 10 up to 20 and the supersaturated solution are affected by this nanostructure of the matter, and they will affect on the material.",
            "So in this film it is not a question of the size of the particular the size of the.",
            "Quantity nanostructure Asian number to iteration which can be nanoparticle individual one, but also nanostructure materials which can be massive.",
            "We welcome this to accelerator for centering, for example.",
            "So we have our activity of surface but also in the in other matters."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I would like to 1st thank the organizer for giving me the opportunity to come here to give this conference.",
                    "label": 0
                },
                {
                    "sent": "The field of.",
                    "label": 0
                },
                {
                    "sent": "In the field of nanomaterial toxicity, ecotoxicity and regulation I come from the.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Part of nano material chemistry I'm working in this field since now long time 30 years now and working in the field of synthesis by mechanical alloying and which is a mechanical one of the process to produce new materials and we produce little fine particles, nanostructure particles.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Consolidated by your specific device, which is called Spark plasma centering, and we have patterns with US team in California and we have also know how to answer questions with Germany people Company which is called French producer this meeting.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the outline of this conference would be this one, and just to put the context of this, I just want to remember that this.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Field of nanomaterials and nanotechnology is not.",
                    "label": 0
                },
                {
                    "sent": "Consider in France as a revolution, but a strong evolution, which is slightly different and it started factor.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Uh, from the modern edge with this manager.",
                    "label": 0
                },
                {
                    "sent": "Feminine 1959 with this well known conference.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And for the first time, the world nanotechnology was used in 74, and so it is a real longer way to come now.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Go to the prediction and prediction in mass on the market of nanomaterials and watch is observer on the right curve is that we are in the critical phase.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With introduction of several kind of nanomaterial Nanosystems and here you have the 4th step passive nanostructure.",
                    "label": 0
                },
                {
                    "sent": "An active nanostructure.",
                    "label": 0
                },
                {
                    "sent": "Now, we are in the 2011 between the 1st and 2nd step, and we will go to system on nano system and molecular.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Systems so introduction of this product number product on the market.",
                    "label": 0
                },
                {
                    "sent": "Muslim interrogating question on the properties of these materials.",
                    "label": 0
                },
                {
                    "sent": "So absence of knowledge or quasi absence of knowledge on the toxicity.",
                    "label": 0
                },
                {
                    "sent": "And it could take CC in the beginning of 2000 or puts on the table.",
                    "label": 0
                },
                {
                    "sent": "The question of how to manage it.",
                    "label": 0
                },
                {
                    "sent": "And if you are not able to manage it by regulation or something else.",
                    "label": 0
                },
                {
                    "sent": "Or it may be.",
                    "label": 0
                },
                {
                    "sent": "Positive an opener regulation and not a strong one.",
                    "label": 0
                },
                {
                    "sent": "For example, the development maybe stop.",
                    "label": 0
                },
                {
                    "sent": "I will show you in some later.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the question is also related.",
                    "label": 0
                },
                {
                    "sent": "Now even if we do not know exactly the worldwide level were concerned by this potential exposition to nanomaterials at work place, for example, there is only one country Italy was produced.",
                    "label": 0
                },
                {
                    "sent": "Strict analysis of the people for the full field of nanomaterials, nanotechnology as they remember, and then the number 300 are in 50.",
                    "label": 0
                },
                {
                    "sent": "1000 people were potentially exposed to no particular in workplace.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Go to definition, even if it's their own way for this nanotechnology and a new fields, or even if scientist, it is easy to speak on this and we use a similar language and some words and animator means the same thing.",
                    "label": 0
                },
                {
                    "sent": "If you want to go to regulation, you need to have the same common language that stand out in 2008.",
                    "label": 0
                },
                {
                    "sent": "I know process state of the art concludes that there is absence of any terminology, common terminology or definition for the older reader.",
                    "label": 0
                },
                {
                    "sent": "One here that means that there is the necessity if you want to introduce international organization to other common language at the work under.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Taken and you have to work until September 2008 and have the first definition of these three simple materials on an object or particle road and plates.",
                    "label": 0
                },
                {
                    "sent": "And in 2008 it is.",
                    "label": 0
                },
                {
                    "sent": "It is only three non object were well known, well defined as a common label at international level.",
                    "label": 0
                },
                {
                    "sent": "Now in 2010 as are several other definition coming from I so and also in 2000.",
                    "label": 0
                },
                {
                    "sent": "11",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we have to wait October 2010 from the European Community Commission for not a regulation, but our recommendation on the definition of the term of nanomaterials and what is important in this field are is it is the first time that we see the introduction of the specific surface area which is not the specific surface in this one, But this specific surface area by volume, which is not very simple because not only you have to manage and to measure the surface.",
                    "label": 0
                },
                {
                    "sent": "As a specific surface which is less equal but you have to have also the density of the materials to obtain this value, and if you know the difficulty to measure the density, it is even if it is a step forward to really taking into account the effect of nanomaterials which is due in part to the surface.",
                    "label": 0
                },
                {
                    "sent": "It is not so easy to manage from experimental point of view and from technological.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Interview so specificity of nanomaterials.",
                    "label": 0
                },
                {
                    "sent": "So if you want to regulate or to manage, or at least for mandatory or lab level, it is the question that for the same process you are able to produce many many nanomaterials.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "For example is it is 1 labs were able to produce all this set of nanoparticles based on one single process.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The future is us when you are able to manage the nucleation and growth of the particulare.",
                    "label": 0
                },
                {
                    "sent": "This level for the same chemistry you have many feature, many structure, many morphology which will induce a different interaction with environment and also.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Human people.",
                    "label": 0
                },
                {
                    "sent": "Uh, so specificity of nanomaterials is the fact that when you go from a millimetric to nanometric scales, when you have one gram of 10 nanometers of 10 nanometer scale titanium oxide, you have ten millions of billions of nanoparticles.",
                    "label": 0
                },
                {
                    "sent": "And so here is the question.",
                    "label": 0
                },
                {
                    "sent": "Still open question on how to manage a statistic of sampling.",
                    "label": 0
                },
                {
                    "sent": "Of this materials to be sure that you're sampling our present it if of the all the matter, and it's clearly still an open question or the the working party on manufacture nanomaterials community of practice on the physical chemistry of this one.",
                    "label": 0
                },
                {
                    "sent": "It is not yet answer how to sampler, how to manage the statistique of this.",
                    "label": 0
                },
                {
                    "sent": "Millions of billions of.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tickles what is the effect I adjustment I have yet mentioned is it is a specific surface and when you come from nano Meter to 1 centimeter to nano meter you have a huge increase of the surface or 10 billions.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And it's representative of four foot place for examples and on this surface are you have a deposition of a monolayer you made a deposition of a monolayer of any contamination, gas, or something else, and this layer may represent 50% in weight.",
                    "label": 0
                },
                {
                    "sent": "Of all the matter.",
                    "label": 0
                },
                {
                    "sent": "So when you consider the matter at this level, you have not only to consider the core of the particulars, also the surface.",
                    "label": 0
                },
                {
                    "sent": "And in many case you don't know you have no information on 50.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of this matter.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Looking at our the market and why out, why so many country work and develop this and invest in research and application is filler.",
                    "label": 0
                },
                {
                    "sent": "Here you have many perspective based on the private think tanks or there is no governmental perspective or holds the plot here or the point here are individual prospective and you have at the end are two scenario.",
                    "label": 0
                },
                {
                    "sent": "Optimistic one and pessimistic one.",
                    "label": 0
                },
                {
                    "sent": "And now we are just below just over the possibilities pessimistic one.",
                    "label": 0
                },
                {
                    "sent": "In 2000",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "11 I.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Exam system what is?",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also important is a stronger investment in research and it is not a continuous one.",
                    "label": 0
                },
                {
                    "sent": "There is a strong increase during the last year or so with a factor of 2.",
                    "label": 0
                },
                {
                    "sent": "In improving increase of this.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ben some and what is also changing is the ratio of the private or in the thrill investissement or to the government were one and in 2010 as a research and development investment corresponding to the industrial engagement is equal to 80%.",
                    "label": 1
                },
                {
                    "sent": "So it is stronger pressure also in labs to promote this material.",
                    "label": 1
                },
                {
                    "sent": "So to push this on this the research on the market and there is also stronger pressure for regulation or to manage.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so there is also a stronger as I have mentioned from worldwide competition is not more worldwide.",
                    "label": 0
                },
                {
                    "sent": "That means that all the countries in some specificity for someones are leaders or there is a stronger.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also, involvement of foreign with perspective multiplies this but is also.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Useful because for example, in France this concern in perspective will involve any prior and you are concerned with initiative not going over.",
                    "label": 0
                },
                {
                    "sent": "For example in 2009 and 9 oh 2012, with two .3 billion euro in research and development for nanotechnology and.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Informatics for example.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So how to put our produces?",
                    "label": 0
                },
                {
                    "sent": "Nanomaterials are two way top down and bottom up so I.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I just remember this and with so we are able to produce this nano device.",
                    "label": 0
                },
                {
                    "sent": "For example we say for example interaction with nano Informatics and Brandon at the bottom left.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Alright for you sorry and also one particular idea of this failure is a development of nano tools to manage to under this nano object.",
                    "label": 0
                },
                {
                    "sent": "Here we have some gripper here.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Non degree power to manage nanotubes and we are able to put to work and to meet.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just scared to producer some specific feature, but what does even if it is spectacular.",
                    "label": 0
                },
                {
                    "sent": "So so physical, stronger new physical properties or you have to realize that manage unlink of this matter at individual level, just to correspond to 10 to the minus 14 grams of material per year.",
                    "label": 0
                },
                {
                    "sent": "And so the question is not, regulation is not in this field, even if it is a very nice and all the cover of any scientific literature.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So, but the question is better address.",
                    "label": 0
                },
                {
                    "sent": "If you look on mechanical processing, physical processing, chemical processing or which are classical.",
                    "label": 1
                },
                {
                    "sent": "Produce single method to produce powders or any massive materials, but adapt to produce.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nano meter scale materials and if you look on this three mechanical, chemical and physical processing it no more 10 to the minus 14 grams per year.",
                    "label": 0
                },
                {
                    "sent": "But it is more to close to 2 million stone of silica.",
                    "label": 0
                },
                {
                    "sent": "For example 2 million tons of titanium oxide or for example, so 10,000,000 tons per year worldwide of course.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Black and also one specificity.",
                    "label": 0
                },
                {
                    "sent": "When I mentioned that there's this huge producer, methods are, well, control.",
                    "label": 0
                },
                {
                    "sent": "There are for example able to control the size of aggregate at the size of primary particle in the range of the nanometer.",
                    "label": 0
                },
                {
                    "sent": "Here another example from Roger for Silica used for example in tires and they are able to control this independently.",
                    "label": 0
                },
                {
                    "sent": "The size of the Premier practical and the size of the.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Aggregate.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you look now in the field of application, it is clear that.",
                    "label": 0
                },
                {
                    "sent": "For all materials are the effect of nanostructure ornano sizer is well known, even if it is not managed by these people.",
                    "label": 0
                },
                {
                    "sent": "But here, for example, on the glass from Catterall.",
                    "label": 0
                },
                {
                    "sent": "Color on their left out only due to the size of the particle in Golden and the color on the right side is Jones to the size in silver of this nanoparticles.",
                    "label": 0
                },
                {
                    "sent": "But you have also for the same part size of particulars, the importance of the shape and giving you the color yellow and red, for example, on the on the.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At.",
                    "label": 0
                },
                {
                    "sent": "And I've also carbon nanotube on domestic Subs, so that means that Nano Effect was using the.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To produce ancient materials.",
                    "label": 0
                },
                {
                    "sent": "Now if you come to a modern edge, you have nano Silica which is produced since 1949 by degreaser.",
                    "label": 0
                },
                {
                    "sent": "Even if now this nano particulars is not claim as Nano but Millie microns, that means clearly nanometer scale and it was used for food addition.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Paint and so on, and also in the field of nanosilver.",
                    "label": 0
                },
                {
                    "sent": "The first registered one was in 1970.",
                    "label": 0
                },
                {
                    "sent": "54 and we have to wait until 95 and 94 to ever registered, particular which are not nano size are in.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Silver, so that means that in two day life we have a use for.",
                    "label": 0
                },
                {
                    "sent": "We use today nanometer scale materials nano device in here for exam.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Calling this place you used today hold this nano device or nanomaterials another application.",
                    "label": 0
                },
                {
                    "sent": "I sure now that you can Live Today without this material so well.",
                    "label": 0
                },
                {
                    "sent": "It could be relatively difficult in some specific.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Area.",
                    "label": 0
                },
                {
                    "sent": "In the food I'm sorry for the slide in French, which is extracted from an official.",
                    "label": 0
                },
                {
                    "sent": "Website just to show that if you want to find information it is possible even from industry here from DocuSign Ebonic.",
                    "label": 0
                },
                {
                    "sent": "They claim that they produce no signature for all the powder food here which are listed.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, and you have here inventory from ALIVM and this alone the agency in 2010 would quantify the nano silica in a mini food product which are listed on the list.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Able and you have new application, old one which are active packaging or passive packaging active which are biases or versus passive.",
                    "label": 0
                },
                {
                    "sent": "Because the the decrease of penetration of oxygen inside the container.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But you never thought on new ones, which are called edible packaging, which are directly applied.",
                    "label": 0
                },
                {
                    "sent": "This nanostructure firmer on the fruit or vegetables, and you are claimed to be edible without any problems.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And as you see, it is necessary to get an official inventory, because if you want to regulate product on the market, it will be necessary to know what is what has to be regulated and you will see here some difficulty becausw one claim for all the application more than 1030 and water projects and one NGO in US on cosmetic claim that they find 9.",
                    "label": 0
                },
                {
                    "sent": "1500 for projects and for Nanosilver.",
                    "label": 0
                },
                {
                    "sent": "There are more than 500.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "System, so there's a necessity to clearly to put on the table a clear and official inventory of the new product.",
                    "label": 0
                },
                {
                    "sent": "And if you look on the products that are used, at least on the woodwork project Woodwork Institute, which is a think tank American system, you see that there are six nanoparticle which are well developed, and in particular silver, for example, which represent more than 55 products, that not the quantity, but it's.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Number of projects that have been identified and in Europe a it started to inventory from NGO.",
                    "label": 0
                },
                {
                    "sent": "Maybe it is also supported by Asia.",
                    "label": 0
                },
                {
                    "sent": "Welcome in recent very recently that they would like to also to introduce their own inventory on the table.",
                    "label": 0
                },
                {
                    "sent": "But here what is clearly that there is not yet a state agency or state are in.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Battery of Fishel, 11 particularity of this application is illustrated here for example in this one which is a lap on it and what used by Canadian industry.",
                    "label": 0
                },
                {
                    "sent": "It is clay nanoparticulate artificial clay you have here hold this information are coming from their website official website.",
                    "label": 0
                },
                {
                    "sent": "This is clearly known that they produce nanopore.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You know, and they use here for the same particles.",
                    "label": 0
                },
                {
                    "sent": "If you have many, many different applications with many potential exposition, different potential exposition of producer but also of user and many different end user potential and use on.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Environment so.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So if we are here, we do not.",
                    "label": 0
                },
                {
                    "sent": "Do not forget we have not to forget that it's because.",
                    "label": 0
                },
                {
                    "sent": "At the beginning of 2000, Zar Zar Gino NGO sorry Elliot from ET C particular but you have also green person but you have also a friend of the Earth who asked to agency and state if if we know any knowledge on the toxicity on toxicity of the nanoparticles and what has to be clearly mentioned.",
                    "label": 0
                },
                {
                    "sent": "It's the title of this.",
                    "label": 0
                },
                {
                    "sent": "Harriet was sent toxic warnings.",
                    "label": 0
                },
                {
                    "sent": "All this paper who are here it is just a part.",
                    "label": 0
                },
                {
                    "sent": "I've not been reproduced.",
                    "label": 0
                },
                {
                    "sent": "Now there are still questionary and we know now why they are question Arianne, why they are not being over produced but the beginning of the question.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here at official level and when if you compare thus interrogation or the question from the NGO, here we have official position from a smaller enterprise in Europe and you find that the question of regulation or the question of turned out of the question of public social acceptance was not considered as a break from the development of nanomaterials.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I know technology, but the situation is changing.",
                    "label": 0
                },
                {
                    "sent": "If we were, you see at the World Economic Forum, in divorce in 2008, the question of nanotechnology risk as emerge and it is core for risk for development at the worldwide level.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So so so strong development and soil improvement is a question of this one effect of the first knowledge of 1st answer to this question of toxicity and nano toxicity.",
                    "label": 0
                },
                {
                    "sent": "Is this one here you have to invest risk capital investment at the worldwide level and you see that there is a slope decreasing this local.",
                    "label": 0
                },
                {
                    "sent": "Which is coded to the first report on the no toxicity and.",
                    "label": 0
                },
                {
                    "sent": "Because of this question and on the size, are stronger population questionary on Huawei do develop our way introduced another projects on the market.",
                    "label": 0
                },
                {
                    "sent": "If you do not know the toxicity.",
                    "label": 0
                },
                {
                    "sent": "If you are not able to manage it.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When also effect, for example here you all you know, the paper on nanotubes with effect.",
                    "label": 0
                },
                {
                    "sent": "We are clear at this data equal to asbestos and and immediately matrices temporarily stop the production of their nanotubes.",
                    "label": 0
                },
                {
                    "sent": "But they are under the pressure of the capital investor Sir and not from the scientific.",
                    "label": 0
                },
                {
                    "sent": "And thank Technologic development of this company which is just for the question of risk.",
                    "label": 0
                },
                {
                    "sent": "On the field of investment.",
                    "label": 0
                },
                {
                    "sent": "And so in.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Respond to this one.",
                    "label": 0
                },
                {
                    "sent": "They are now stronger development and coordination of.",
                    "label": 0
                },
                {
                    "sent": "Research and technological development to improve the protection and provision ways.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To prevent any programs to address this question from a prediction of the particle to environment at the end of the life of this product.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the.",
                    "label": 0
                },
                {
                    "sent": "HUD here just to remember that nanoparticle even product in one way in one point in the world, all the people are concerned.",
                    "label": 0
                },
                {
                    "sent": "We have example of Volcano in Iceland.",
                    "label": 0
                },
                {
                    "sent": "And the particular coming environment are three times the background level.",
                    "label": 0
                },
                {
                    "sent": "Here in this capital, I think that it is a three weeks or later at the beginning of this.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Eruption, so if you look at just the summaries service come and to confirm the risk is hazards and toxicity and acquisition and not only results.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Turn the exposition.",
                    "label": 0
                },
                {
                    "sent": "As I mentioned, so they take to take into account the necessity to promote toxicity, research and equity research.",
                    "label": 0
                },
                {
                    "sent": "Our strong cooperation and development of this field and you see from 2000, strong improvement of research and publication.",
                    "label": 0
                },
                {
                    "sent": "But it is.",
                    "label": 0
                },
                {
                    "sent": "It may be a mistake if you just consider the rough data like this cause.",
                    "label": 0
                },
                {
                    "sent": "For example in 2005.",
                    "label": 0
                },
                {
                    "sent": "The number of publication is not to be considered as original publication Alpha.",
                    "label": 0
                },
                {
                    "sent": "This big medication or review of review.",
                    "label": 0
                },
                {
                    "sent": "And not publishing clearly original data on the toxicity.",
                    "label": 0
                },
                {
                    "sent": "We just sign of the pressure of statement asking to research Gemma, to know to every port on the data concerning the toxicity.",
                    "label": 0
                },
                {
                    "sent": "And they took Botox City after 2005.",
                    "label": 0
                },
                {
                    "sent": "There are now original data producing it is the classical wave form.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to produce at the international level, you have this data.",
                    "label": 0
                },
                {
                    "sent": "This website will officially summarize and comment all the literature with way too.",
                    "label": 0
                },
                {
                    "sent": "It is also the first time in the research field that you have a soap and and so collective work.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It has to be on the line and one critical point is a field of ecotoxicology corner filler.",
                    "label": 0
                },
                {
                    "sent": "Since I in 2009, if you look on the review of all the literature, there are only two 26 ecotoxicology published works which can be user and the set of particles are under the research relatively.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to summarize, a human exposure routes are inhalation, dermal.",
                    "label": 0
                },
                {
                    "sent": "That means skin ingestion.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Objection.",
                    "label": 0
                },
                {
                    "sent": "But you have a stronger question.",
                    "label": 0
                },
                {
                    "sent": "If you look you have a toxicity development and research in the field of language, meaning the inhalation for workplace.",
                    "label": 0
                },
                {
                    "sent": "It's normal skin because cosmetic industry's work in this field since many years brand because it is for medicine user and also.",
                    "label": 0
                },
                {
                    "sent": "Practical application but you have no or relative no less.",
                    "label": 0
                },
                {
                    "sent": "Program in the field of ingestion, and so it is questionnaire because I have shown you that nano food exists since many years and and also up to 90% of the particles that go into the lines are at the end in just a fork.",
                    "label": 0
                },
                {
                    "sent": "By cleaning this language.",
                    "label": 0
                },
                {
                    "sent": "And so the question.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is still open on this field.",
                    "label": 0
                },
                {
                    "sent": "What is also question I'm in the field of regulation and it is not only a regulation of the production way, but it also question of regulate the nano products and and if you look the the publication and you find that the publication applied to nano enabled products are very few compared to basic materials which reference material for research but not really.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Really useful for a clear application in terms of regulation one.",
                    "label": 0
                },
                {
                    "sent": "Also, data has to be clear if you look if you want to analyze all the nano products on the market.",
                    "label": 0
                },
                {
                    "sent": "With the men available now human and technology called once it takes a long time.",
                    "label": 0
                },
                {
                    "sent": "More than 50 years, so you have to consider it and.",
                    "label": 0
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Under the scale, and if you want to effectively put.",
                    "label": 0
                },
                {
                    "sent": "Test toxicologic tests on animal or equivalent of animal.",
                    "label": 0
                },
                {
                    "sent": "Are there are too many animals to sacrifice and so it is not on this way that maybe.",
                    "label": 0
                }
            ]
        },
        "clip_72": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The question has to be addressed.",
                    "label": 0
                },
                {
                    "sent": "I speak on the cooperation and I speak on the organization of researcher and it is done at European level, but also at OECD liver and what's the conclusion among all this parameter?",
                    "label": 0
                },
                {
                    "sent": "For the first time, or people agrees that the main parameter critical for toxicity and ecotoxicity are the 1810, the one which are listed here.",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No, and if you do not promote if you do not give this parameter in publication, you could not compare the result from one to the other one.",
                    "label": 0
                },
                {
                    "sent": "And here from the paper from uncertain publishers.",
                    "label": 0
                },
                {
                    "sent": "Some years ago, 80% of the publication do not give any information on one of these eight parameters.",
                    "label": 0
                },
                {
                    "sent": "So that means that it is impossible to conclude, and to generalize the results, it is only specific to the product to the powder, and in some cases we do not know the shape.",
                    "label": 0
                },
                {
                    "sent": "The size we know we know only the chemical composition which had been used to buy this powder.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Producer if you want to conclude on this field of toxicity, what is really known is that no toxicity is different from micro toxicity, which is a general conclusion.",
                    "label": 0
                },
                {
                    "sent": "Different doesn't mean that.",
                    "label": 0
                },
                {
                    "sent": "The particulars are more dangerous than micro ones, and there are some examples from which exhibits that microparticle are more dangerous that nanoparticles or the same chemistry.",
                    "label": 0
                },
                {
                    "sent": "This specific toxicity of the nanoparticles, and that means that if you change the protocol to put to introduce this particular in the test, for example device, or you will observe a distinct rich results and also you have a trillion.",
                    "label": 0
                },
                {
                    "sent": "Effect on that means that this it is used in medicine to introduce by vectorization active principle, and it is also a mechanism of Cal option for example.",
                    "label": 0
                }
            ]
        },
        "clip_75": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I would.",
                    "label": 0
                }
            ]
        },
        "clip_76": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Chances and also stronger question which which is difficult to manage in research in this field.",
                    "label": 0
                },
                {
                    "sent": "But it is a present value transference are now.",
                    "label": 0
                },
                {
                    "sent": "Many publication was proved that no particular will inject or foot on the scanner may be transferred to this sentence here.",
                    "label": 0
                }
            ]
        },
        "clip_77": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Been clearly proven with effect on the brain of the disabled and so due to this incertitude or absence of knowledge on the toxicity of any nanoparticles, one solution to manager risk is to manage the.",
                    "label": 0
                }
            ]
        },
        "clip_78": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Position it may be the only ones, but we are not to consider only the classical production or put on the market.",
                    "label": 0
                },
                {
                    "sent": "But you have also to introduce the accidental E vendor.",
                    "label": 0
                }
            ]
        },
        "clip_79": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Elitism.",
                    "label": 0
                },
                {
                    "sent": "And so all the recommendation in the field of.",
                    "label": 0
                },
                {
                    "sent": "Solitary safety agency or the following 123 engineer nanoparticle?",
                    "label": 0
                },
                {
                    "sent": "As if a there as others, and so pollute exposition.",
                    "label": 0
                }
            ]
        },
        "clip_80": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Column where the field one and here I would just illustrated by this slide.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "For example, production unit of production of titanium dioxide in China, which is a common work and yet published work form between Japan and China.",
                    "label": 0
                },
                {
                    "sent": "And here you have a first.",
                    "label": 0
                },
                {
                    "sent": "You can easily see the which one with the older production wave with the smog and clearly this morning and after here on the back.",
                    "label": 0
                },
                {
                    "sent": "On the left side, after clear management of the exposition and provision, wait is possible to work without any exposition of the work.",
                    "label": 0
                }
            ]
        },
        "clip_81": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "People are here.",
                    "label": 0
                },
                {
                    "sent": "And so the question is not at the industry level, but also in the lab are for example here in California they notice that there is a sense it could be an increase of 10 to 6 particular person server of nanoparticulate depending on the way the introduce a nanotube in their solution.",
                    "label": 0
                }
            ]
        },
        "clip_82": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "By your question or something else, and for example, you have now many, many workplace guide liner first or 41R in front.",
                    "label": 0
                },
                {
                    "sent": "But they also this translator and there also.",
                    "label": 0
                },
                {
                    "sent": "Federal level and so for people who want to work with the good practice, it is possible to find a recommendation and practical recommendation.",
                    "label": 0
                }
            ]
        },
        "clip_83": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With the use of filter and so on.",
                    "label": 0
                }
            ]
        },
        "clip_84": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To apply this, there is one point which is.",
                    "label": 0
                },
                {
                    "sent": "In the field of regulation, if you want you have to introduce a critical level for two exposition of people.",
                    "label": 0
                },
                {
                    "sent": "And here for example.",
                    "label": 0
                },
                {
                    "sent": "Is our recommendation and there are only a recommendation of higher level of various nanoparticle or nano objective growth in Celebran cerebrum, but they are not.",
                    "label": 0
                },
                {
                    "sent": "Correlated to any publications is just a factor of correction to apply to micro powder, and you have a factor question of 10 or 15 to which is.",
                    "label": 0
                }
            ]
        },
        "clip_85": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Value.",
                    "label": 0
                },
                {
                    "sent": "Just to confirm this, for example, in the field of nanotube, a bias proposal level or higher level for exposition and nano sealer on their own are no particular nanotube proposal, another one.",
                    "label": 0
                }
            ]
        },
        "clip_86": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you go to my OSHA USI agency Institute, so you have another one.",
                    "label": 0
                },
                {
                    "sent": "So that means that up to now we are not official and we are not still in position to propose a well defined and well discussed Level 4.",
                    "label": 0
                }
            ]
        },
        "clip_87": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And a very recently just released Wichita Nioce proposal.",
                    "label": 0
                },
                {
                    "sent": "Some new recommendation for no particular in the field of titanium dioxide, and this proposal is different from the ones that they are proposed in the center.",
                    "label": 0
                },
                {
                    "sent": "Location five years ago, so this is a situation is still in evolution, and so the better way.",
                    "label": 0
                }
            ]
        },
        "clip_88": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To propose a lesser exposition.",
                    "label": 0
                }
            ]
        },
        "clip_89": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To control this.",
                    "label": 0
                },
                {
                    "sent": "In France at least, there is a question of analysis benefits to the risk in application, and it is in terms of the Grenell too low for example, and so you have to compare the effect.",
                    "label": 0
                },
                {
                    "sent": "The positive effect of this particle to the potential or demonstrator effect on human element in the field of nanosilver.",
                    "label": 0
                },
                {
                    "sent": "For example, you have a recommendation of the icons.",
                    "label": 0
                },
                {
                    "sent": "Public is not to use this nanosilver, which can be deliverin environment due to the absence of any knowledge on this.",
                    "label": 0
                },
                {
                    "sent": "Toxicity.",
                    "label": 0
                }
            ]
        },
        "clip_90": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Eco toxicity and you have also for example here.",
                    "label": 0
                },
                {
                    "sent": "As I mentioned, the only 26 ecotoxicological publication in this field, but some are clearly demonstrating their real applications at the new silver, for example, can significantly I tell the when.",
                    "label": 0
                }
            ]
        },
        "clip_91": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The plant growth another way is it is not only a question of toxicity and ecotoxicity direct introduced by the particular, but here for example the introduction of dioxide, Syria.",
                    "label": 0
                },
                {
                    "sent": "Scatter is a enough fuel insurance.",
                    "label": 0
                },
                {
                    "sent": "Barely decrease the competition temperatures.",
                    "label": 0
                },
                {
                    "sent": "That means that there is no more at least graphite, particular the end of the motor.",
                    "label": 0
                },
                {
                    "sent": "But in comparison you have also secondary emission of byproducts or for example benzene with again fully automatic hydrogen cycle.",
                    "label": 0
                },
                {
                    "sent": "Knox also made maybe chance or increase of C. Oh, so that mean in this field that you over to consider.",
                    "label": 0
                },
                {
                    "sent": "Chancellor of the material that only the direct effects that may be promoted by the producer industrial want to introduce it on the market, but a clear introduction and clear cycle analysis to be done and just to remember this.",
                    "label": 0
                },
                {
                    "sent": "This knowledge is has been produced by the Yeast Effect Institute in US since 2001.",
                    "label": 0
                },
                {
                    "sent": "It is relatively confidential, but it's a.",
                    "label": 0
                }
            ]
        },
        "clip_92": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Maybe it's clearly accessible for anyone, so I know the pointer before concluding.",
                    "label": 0
                },
                {
                    "sent": "It is clear that this management of toxicity and ecotoxicity of particle of any products may be a constraint for any of this world also for research.",
                    "label": 0
                },
                {
                    "sent": "But it is also user and yet user by some industry for communication, transparency, an information to consumer.",
                    "label": 0
                },
                {
                    "sent": "It is also a way to introduce confidence with consumer and if they are for example my kernel are claiming are claiming that they are.",
                    "label": 0
                },
                {
                    "sent": "Effectively, positive results in the management of toxicity and ecotoxicity of the products introduced confidence in the.",
                    "label": 0
                },
                {
                    "sent": "In their own products on the market and also for example, you have another example from Nano Phase.",
                    "label": 0
                },
                {
                    "sent": "Or if you go some years ago on the first page of their website, they introduce the fact that they manage is they take into account the position, potentially position of their workers and they manage safety of their nano.",
                    "label": 0
                }
            ]
        },
        "clip_93": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Product so to conclude, we have to scale.",
                    "label": 0
                },
                {
                    "sent": "It seems that this nano products are not only in labs, but they are yet on the market.",
                    "label": 1
                },
                {
                    "sent": "And since many years in some cases in 50 years for nano, silica for example, and there are user for many many application and one way to manage incertitude may be saved by design.",
                    "label": 1
                },
                {
                    "sent": "That means that controller, the toxicity and or exposition level by changing the surface for example or the structure.",
                    "label": 0
                },
                {
                    "sent": "Or the aggregate sales, for example, of the particular which are used in cosmetic cream.",
                    "label": 0
                },
                {
                    "sent": "For example, survey process.",
                    "label": 0
                },
                {
                    "sent": "That means that you are supposed to use no more dry process but you mid process or liquid suspension, for example.",
                    "label": 0
                },
                {
                    "sent": "And it's clearly a necessity for inventory and not only voluntary one, but state Agency's to manage hit in France, for example, has been started in 2008 and 2009.",
                    "label": 0
                },
                {
                    "sent": "I participate to this one.",
                    "label": 0
                },
                {
                    "sent": "And the question of risk to benefit us to being clearly managed integrating the full life cycle of the materials and the products.",
                    "label": 1
                },
                {
                    "sent": "And it has to be done in open analysis and public discussion.",
                    "label": 0
                },
                {
                    "sent": "For example in France we have the frenzy bat debate on a nanotechnology nanoparticles.",
                    "label": 0
                },
                {
                    "sent": "Several agencies are now thinking to introduce a permanent concealer, introducing people and consumer not only to discuss in terms of crisis or because it's too later.",
                    "label": 0
                },
                {
                    "sent": "But hold the day and all the life of the products.",
                    "label": 0
                },
                {
                    "sent": "And it's undertaken now in France.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much for attention.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Mini, so to speak.",
                    "label": 0
                },
                {
                    "sent": "Aspects that need clarification.",
                    "label": 0
                },
                {
                    "sent": "Are there questions, comments or criticism?",
                    "label": 0
                },
                {
                    "sent": "Please do not hesitate.",
                    "label": 0
                },
                {
                    "sent": "We have enough time.",
                    "label": 0
                },
                {
                    "sent": "Will break the ice.",
                    "label": 0
                },
                {
                    "sent": "Yes please.",
                    "label": 0
                },
                {
                    "sent": "I felt one with device and other partners is something which is lower than 60 square centimeters per give you free.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We analyze the thing about with different particle size and surface area and you found for example that one of the powers we expected the least toxic.",
                    "label": 0
                },
                {
                    "sent": "It was the most toxic, but it has very low surface area.",
                    "label": 0
                },
                {
                    "sent": "So I see a danger here to put such agreements between nanoparticles and micro size or submicron particles, because this will open the door for toxic powder without being classified as nanoparticles.",
                    "label": 0
                },
                {
                    "sent": "OK, I think Part 2 the skinnier.",
                    "label": 0
                },
                {
                    "sent": "Welcome group on the No definition.",
                    "label": 0
                },
                {
                    "sent": "And if you looked on TV to the last version of the document, you will see that this question has been addressed.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "It is a question if you ask to scientific people their knowledge on the clear short liner or cut off for defining nanoparticles.",
                    "label": 0
                },
                {
                    "sent": "Zone Sir, will be that it is not possible because the effect of sizer.",
                    "label": 0
                },
                {
                    "sent": "On the change of properties and in some cases for example start.",
                    "label": 0
                },
                {
                    "sent": "We have in this report for 500 nanometer.",
                    "label": 0
                },
                {
                    "sent": "In some cases we have a 1000 nanometer.",
                    "label": 0
                },
                {
                    "sent": "So the difficulty if you introduce them.",
                    "label": 0
                },
                {
                    "sent": "1.",
                    "label": 0
                },
                {
                    "sent": "0.1 micro meter.",
                    "label": 0
                },
                {
                    "sent": "OK, you have many many many particles.",
                    "label": 0
                },
                {
                    "sent": "OK if you introduce us as a pressure now to introduce 3930 nanometer which is a US pressure based on nature publication from a French team.",
                    "label": 0
                },
                {
                    "sent": "For example, you lose too many particles.",
                    "label": 0
                },
                {
                    "sent": "And so again, if you want to start something, you have to put on the table proposition of definition, which is representative of the field.",
                    "label": 0
                },
                {
                    "sent": "The question is that maybe as to be introduced, not exclusively.",
                    "label": 0
                },
                {
                    "sent": "Among mental to the definition, and if you have, for example some specific results from research literature, demonstrated that for a given particular, in some cases of exposition, in some cases of user, for example, at 150 nanometer you have a specific behavior.",
                    "label": 0
                },
                {
                    "sent": "It has to be added.",
                    "label": 0
                },
                {
                    "sent": "But in any case, you are not supposed to introduce on the market and your product you are supposed to alter the ears of anyone.",
                    "label": 0
                },
                {
                    "sent": "So if there is any publication who demonstrates that you are any effect at any size you are supposed to, not to put it on the market so.",
                    "label": 0
                },
                {
                    "sent": "In front of this, like this, if it's demonstrate you are not supposed to put so.",
                    "label": 0
                },
                {
                    "sent": "The question is if you do not know.",
                    "label": 0
                },
                {
                    "sent": "So your question is.",
                    "label": 0
                },
                {
                    "sent": "OK, it's but if you look even on this definition, for example of 60.",
                    "label": 0
                },
                {
                    "sent": "Meter square per cent.",
                    "label": 0
                },
                {
                    "sent": "Emet Schumer in the field of nanotubes, then density.",
                    "label": 0
                },
                {
                    "sent": "There is a variation of density of 900 person between the lower and the iron density dense nature.",
                    "label": 0
                },
                {
                    "sent": "So even in this case, which density do you use?",
                    "label": 0
                },
                {
                    "sent": "OK, if you use the density of the graph item, you are wrong.",
                    "label": 0
                },
                {
                    "sent": "It is recommended to use the density of the bug but.",
                    "label": 0
                },
                {
                    "sent": "What what will you do will do do when you do not have any massive material, for example.",
                    "label": 0
                },
                {
                    "sent": "We are supposed to measure the density of nanotubes.",
                    "label": 0
                },
                {
                    "sent": "And which method will you use?",
                    "label": 0
                },
                {
                    "sent": "Or there are no standard method to do this?",
                    "label": 0
                },
                {
                    "sent": "It's may be difficult to.",
                    "label": 0
                },
                {
                    "sent": "Thank you and recover from.",
                    "label": 0
                },
                {
                    "sent": "European Commission was one of.",
                    "label": 0
                },
                {
                    "sent": "Lot of people behind the recommendation that was put in public consultation and I would just like to comment it.",
                    "label": 0
                },
                {
                    "sent": "In a sense, we are slightly the.",
                    "label": 0
                },
                {
                    "sent": "At the mercy of the scientific community, when does regulators we try to introduce that definition into the regulatory context but still keep it?",
                    "label": 0
                },
                {
                    "sent": "Science based in store?",
                    "label": 0
                },
                {
                    "sent": "And yes, we have tried as hard as we can to keep within the recommendations provided by skinnier and skinnier.",
                    "label": 0
                },
                {
                    "sent": "Has introduced the 60 and skinnier his injury specific surface area per volume which will agree has challenges and there's even recognizing that.",
                    "label": 0
                },
                {
                    "sent": "Senior document just two commands is this value is just the surface of particular 100 nanometer with one gram in density which is not mysterious.",
                    "label": 0
                },
                {
                    "sent": "It's just the application of.",
                    "label": 0
                },
                {
                    "sent": "They need to produce a necessity or the possibility to measure not only the size of the specific surface.",
                    "label": 0
                },
                {
                    "sent": "Which is for me, it is a positive way because you introduce the notion of a specific surface, which is well known as being one of the major parameter for toxicity so.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah, exactly don't going there.",
                    "label": 0
                },
                {
                    "sent": "The definition is essentially about recognizing that the definition should be only both sides and then the specific surface area is introduced as a.",
                    "label": 0
                },
                {
                    "sent": "As a way is an alternative way is an easy way.",
                    "label": 0
                },
                {
                    "sent": "In order to assess whether you're really in that in that range.",
                    "label": 0
                },
                {
                    "sent": "But I completely agree with you.",
                    "label": 0
                },
                {
                    "sent": "The 60 has been pulled out essentially from a very crude assumption of 100 nanometer particles and sprinkle shake and so on.",
                    "label": 0
                },
                {
                    "sent": "And we know that we always have size distribution.",
                    "label": 0
                },
                {
                    "sent": "We know that we have different shapes and so on, so that is one point.",
                    "label": 0
                },
                {
                    "sent": "But what is maybe a bit what I really wanted to comment on is that the definition cell, at least this used in regular purpose, it is not.",
                    "label": 0
                },
                {
                    "sent": "Has not been intended to communicate, risk or hazard better.",
                    "label": 0
                },
                {
                    "sent": "It has not been used because we also stand behind.",
                    "label": 0
                },
                {
                    "sent": "Now I'm losing a bit of suspense.",
                    "label": 0
                },
                {
                    "sent": "I have presentation in the afternoon.",
                    "label": 0
                },
                {
                    "sent": "I hope you're still here though I will steal all our secrets, but the fact is we need to ensure as you put it, safe use of all substances, materials that are on the market or that we are able at least to understand that we are.",
                    "label": 0
                },
                {
                    "sent": "Adequately controlling the risk that may be from using from using these materials and none of it here are no exception, and defining something as non material or maybe failing to define is not a material does not really take that obligation away.",
                    "label": 0
                },
                {
                    "sent": "So the definition by itself it will not solve or exacerbate the problem.",
                    "label": 0
                },
                {
                    "sent": "It might take what we expect is that it will facilitate some of the activities.",
                    "label": 0
                },
                {
                    "sent": "In order to do so that this application can be more effectively pursued for this specific materials, but it cannot really.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it cannot really change the basic applications that we have.",
                    "label": 0
                },
                {
                    "sent": "So this is one of many important point to make it, and of course we also recognize it's not just the size of the material system, and it's not just, it's not just the material itself, it's also the coding.",
                    "label": 0
                },
                {
                    "sent": "It's also the shape.",
                    "label": 0
                },
                {
                    "sent": "It's it's very many things that address that might affect the hazard and just buy buy size.",
                    "label": 0
                },
                {
                    "sent": "We cannot really coming close to that assessment.",
                    "label": 0
                },
                {
                    "sent": "Yes, but if you are over larger over that these size are so user parameter you mentioned are not supposed to have a strong effect.",
                    "label": 0
                },
                {
                    "sent": "Because it's just controlled by the chemistry.",
                    "label": 0
                },
                {
                    "sent": "OK, up to now, some materials just been estimated as a function of the chemistry in the turns on any other parameters.",
                    "label": 0
                },
                {
                    "sent": "So it is just if you want are in the field of nanomaterials that this eight parameter I mentioned, for example.",
                    "label": 0
                },
                {
                    "sent": "Oh, I've been demonstrated to take a strong place and maybe I have to be considered and not only chemistry.",
                    "label": 0
                },
                {
                    "sent": "It is just because why it is important to introduce a cut off.",
                    "label": 0
                },
                {
                    "sent": "Maybe if it is a large cut of meat baby between 100 two, 8 S 1000 nanometer it it is not a question but it is important to take into account that the chemistry is not the only parameter for this filter and that all the tests that has been.",
                    "label": 0
                },
                {
                    "sent": "Classic Lee use has to be carefully check for example, there is now a paper net nature.",
                    "label": 0
                },
                {
                    "sent": "Nanotechnology would demonstrate that if you put the cell here, the test cells or to put them here on your suspension, you do not observe the same results because you just do the suspensions of the particular you have.",
                    "label": 0
                },
                {
                    "sent": "Not the same were in contact with the cells.",
                    "label": 0
                },
                {
                    "sent": "It is not the case in the large particular because gravitation occur and large particular always on control the cell.",
                    "label": 0
                },
                {
                    "sent": "If you look on nanometer science, you can give nanoparticle in suspension and if you put very fast experiment, you will see only the large one in the field and nano meter.",
                    "label": 0
                },
                {
                    "sent": "And if you wait a long time you will see the smaller one.",
                    "label": 0
                },
                {
                    "sent": "But after the large one we have yet interact with the cells.",
                    "label": 0
                },
                {
                    "sent": "And so you have to.",
                    "label": 0
                },
                {
                    "sent": "Beyond the lights, the protocols of the test to be sure, and if you do this, you are supposed to control the distribution in this in the suspension, which is not done now.",
                    "label": 0
                },
                {
                    "sent": "So it just to to see that completely agree with yes exactly what I want to say.",
                    "label": 0
                },
                {
                    "sent": "It's not clear in the in in just stating it by having such definitions and so on.",
                    "label": 0
                },
                {
                    "sent": "It helps you to facilitate to be more effective in ensuring that once you do the testing you're doing properly, you should be doing the testing on materials as well as on along the others.",
                    "label": 0
                },
                {
                    "sent": "That was essentially my phone and on the point where where some of these properties become relevant or not.",
                    "label": 0
                },
                {
                    "sent": "Reservit Lee agree with you.",
                    "label": 0
                },
                {
                    "sent": "I mean I just it's just one explicit example and that is that you can find for some.",
                    "label": 0
                },
                {
                    "sent": "For some metals you can find metal in metal bulk and metal powder in actually different hazard class.",
                    "label": 0
                },
                {
                    "sent": "Edit It is because of the size, but we're still talking micro micro sized Raiders.",
                    "label": 0
                },
                {
                    "sent": "So the size the size can actually affect the toxicity of other materials as well.",
                    "label": 0
                },
                {
                    "sent": "You don't need to go into the nanoscale to see that.",
                    "label": 0
                },
                {
                    "sent": "For me, there's no skill is also now suture materials.",
                    "label": 0
                },
                {
                    "sent": "So for me, a powder which are which is micro powder.",
                    "label": 0
                },
                {
                    "sent": "I work on this and if you are nanostructures or the reactivity of the particle while on the surface at the grain boundary diffusion which has been multiplied by 10 to factor to the major 10 up to 20 and the supersaturated solution are affected by this nanostructure of the matter, and they will affect on the material.",
                    "label": 0
                },
                {
                    "sent": "So in this film it is not a question of the size of the particular the size of the.",
                    "label": 0
                },
                {
                    "sent": "Quantity nanostructure Asian number to iteration which can be nanoparticle individual one, but also nanostructure materials which can be massive.",
                    "label": 0
                },
                {
                    "sent": "We welcome this to accelerator for centering, for example.",
                    "label": 0
                },
                {
                    "sent": "So we have our activity of surface but also in the in other matters.",
                    "label": 0
                }
            ]
        }
    }
}