{
    "id": "x6zlw7w6izk5f4biwpmrg3mlk3ttyvxq",
    "title": "Hands-on Natural Language Processing for Information Access Applications (NLPIAA)",
    "info": {
        "author": [
            "Horacio Saggion, Departament of Information and Communication Technologies, Pompeu Fabra University"
        ],
        "published": "Nov. 4, 2008",
        "recorded": "September 2008",
        "category": [
            "Top->Computer Science->Natural Language Processing"
        ]
    },
    "url": "http://videolectures.net/russir08_saggion_nlpiaa/",
    "segmentation": [
        [
            "So hello, my name is Sarah Souza.",
            "John and I work for the natural Language Processing Group in the Department of Computer Science in the University of Sheffield.",
            "And this is the course hands-on natural language processing for information access applications.",
            "I would like to thank the organizers of the school for having selected this series of lectures in natural language processing.",
            "That is related to information retrieval.",
            "And I would like to apologize because I couldn't come yesterday and becausw of we couldn't find an appropriate flight for me to come and.",
            "And also I would like to apologize if I look a little bit tired, but I have a very difficult connection in from Moscow to come here so.",
            "If I say anything that is sounds a little bit silly, I do apologize.",
            "Anne.",
            "The idea of the course is that we will see some natural language processing technology and tools.",
            "More or less in the 1st and 2nd day of the of the course, probably also on the third day.",
            "And then we will give some introduction to question answering and text summarization.",
            "The whole series of lectures are introductory, so for you to family."
        ],
        [
            "To get familiar with a set of tools that you can use to create a natural language processing applications."
        ],
        [
            "The first part of the course will have this outline.",
            "I will very briefly introduce a four different information access task information retrieval.",
            "Information extraction, pick summarization and question answering.",
            "And I will present a case study of a project and a system that we developed at the University of Sheffield a few years ago.",
            "In the context of the Capra Porter project, I will explain what it is.",
            "And then I will present some applications that we are developing now in particular associated with information extraction, trying to extract semantic information from text.",
            "Anne.",
            "The first 2 days we will concentrate on the use of a system.",
            "That is, Colgate is a system to develop natural language processing applications.",
            "I will present the component some of the components of this system that are components to perform tokenization over text, to identify sentences to apply, to identify a part of speech tags in four different words, to perform name, entity recognition analysis, morphological analysis and parsing.",
            "And I will show the most rationes.",
            "What I will do is to open the gate system and show you how the different components are used and how the different components can be combined to create applications.",
            "And that's why I put their demonstrations, and that's why this is a hands-on course.",
            "We will see a few practical sessions in the lectures."
        ],
        [
            "So if you definitions at first, so information extraction is a task where you are given a document collection and you have a user that has an information need and the task of the information retrieval system is produced to return to you a list of documents that match the information needs of the user.",
            "And this information needs can be expressed, for example, as a set of keywords.",
            "And in general, in information retrieval, the documents are processed in order to produce terms that are being used that are going to be used for indexing.",
            "And by preprocessing the document collection, what you know is which particular terms belong to which particular documents.",
            "Obviously, in information retrieval, decision has to be taken on the concept of a term is a term award is determined.",
            "Part of Award is a term, a combination of words and so on.",
            "Information retrieval.",
            "We also need a method to decide on the similarity between documents an and the user need and the queries that the user has put to the system.",
            "But what the information retrieval gives you is a list of documents.",
            "So the user has to go to each document and decide by himself or herself on the value of the document for the particular.",
            "Particular query that has been put into the system information retrieval can be applied to any domain, so you can get a document collection that is on a number of topics on many topics, all of them different.",
            "Anne and the field of information retrieval has been fooled by the foil by the development of the text Retrieval Conference is.",
            "Our systems have been tested to see how they perform.",
            "Different from information."
        ],
        [
            "31 is information extraction where instead of getting back documents what you get."
        ],
        [
            "Back is facts from documents.",
            "An information extraction is based on the idea of a scenario template that will model A particular application domain.",
            "And so a template is basically a set of slots or fields in a record, and what you want the information extraction system is to fill those slots with strings or information extracted from the text.",
            "An information extraction each domain dependent because it's attached to this idea of scenario template, an information extraction has also been fueled by the development of a particular evaluation.",
            "Programs called the Message Understanding conferences for 10 years since 87 until 97.",
            "And the this evaluation programs.",
            "American evaluation programs made possible advances in many different fields related to information extraction, notably in name entity recognition.",
            "From the year 2000, there is another evaluation of information extraction system called a program automatic content extraction program."
        ],
        [
            "This is what we have in an information extraction task.",
            "You are given a particular document in a particular domain and you have a particular template that has been defined where you have a slot like that.",
            "The number of these people injure people.",
            "Epicenter, intensity for a domain of earthquakes, natural disasters, what you want from the text.",
            "There is the system to instantiate the template with the relevant information.",
            "And what they have done is to highlight in different colors different different types of information in the text, like locations, dates and particular numbers.",
            "So what we can see here in the text is that there is a mention of a particular earthquake.",
            "Another mention of the particular earthquake and these two things are related.",
            "You also have a mentions of dates and here you have another date and these two days are related because Wednesday is related to.",
            "To make 22 Wednesday is the day before to May 22.",
            "So by doing that you can instantiate the date of that template with the date of the earthquake, yeah?",
            "You have here a number so you have a number of people and you have ever there.",
            "That amount of people were killed.",
            "When?",
            "A powerful earthquake extract so you have a particular syntactic structure that tells you that that particular number of people are the people dead in that particular earthquake, so you can use that information to instantiate this lot of how many there in this earthquake.",
            "You have another number there, and this in Vista.",
            "In this occasion that number is qualified by the verb injure.",
            "And you have that that amount of people were injured when the earthquake struck.",
            "So you can use that number to instantiate this particular slot in the template.",
            "And then you have a particular mention of the location and you have the phrase the epicenter of the quake, that is the same as the quick that was mentioned before.",
            "Was located at that particular place, so you can use that to instantiate that slot.",
            "And if you have some additional knowledge, like a database that contains information about particular cities, in which countries they they are, so you can also enrich that information with the with the country where the.",
            "The earthquakes occur.",
            "And then you have there a particular number associated to that particular expression that says that that number is an intensity.",
            "And you can see that there is an expression there that says the quake which measure.",
            "5.2 On the Richter scale, so you can use that particular pattern to instantiate the intensity of the earthquake.",
            "Anne."
        ],
        [
            "This template can be used to populate the database of earthquakes, for example, or and.",
            "So you can perform search over each and the template can also be used to generate a short summary of a document where you will use this.",
            "The strings that have been used to instantiate.",
            "As a template to generate a very short text.",
            "A database that you populate with the the templates can be used to perform some reasoning, so you can imagine a question like this one which particular earthquake killed more people so you can search over an instructor database instead of over attacks in order to get some valuable information.",
            "There are a number of different tasks in information extraction.",
            "1 task is subtasks.",
            "One is known as name, entity recognition and."
        ],
        [
            "What we do here is to try to find an classification, classify names in text names such as locations, organizations, names of people, and so on.",
            "There is another sub task that is called coreference resolution which will identify if entity relations between entity syntax, for example then to fication that the extreme a powerful earthquake.",
            "Is the same as this prediction earthquake in the text that we saw before?",
            "Then we have a task called template Element construction that will have descriptive information to the result of the name entity recognition tasks.",
            "So for example, if you have a location, maybe you want to know in which country is that location, or if you find a particular person you may want to know that that person works for a particular organization and so on.",
            "And then you have the scenario template production that basically is the whole instantiation instantiation of the template."
        ],
        [
            "So some examples of the different subtasks for the example of the earthquake.",
            "So you have locations Latania Alger May 22 at 8:00 Wednesday, another date you have.",
            "Coreference like a powerful earthquake and the quake an algerin all in uppercase with Algeria in only upper capital.",
            "And template elements, so tenure is in Algeria in Algeria.",
            "Is the capital, Algiers is the capital of Algeria and this scenario can place.",
            "Finally that is the instantiation of the whole template."
        ],
        [
            "Another extraction task is another information access task is question answering where here what you are given is a document collection and can be an open document collection like they were.",
            "Unlike information retrieval, where you put only keywords here, what you put to the system is a well formed question.",
            "And the objective of the system is to extract the answer the correct answer to the question from the document collection.",
            "In principle, Becausw question answering is open an open domain.",
            "We can look for answers of many different types, but in general question will refer to questions will be about names of people, about locations, about the dates, and so on.",
            "Question answering also had made a lot of progress thanks to evaluation programs such as the text retrieval conferences.",
            "In particular, the question answering track.",
            "Anne.",
            "Which provided.",
            "At tools for the evaluation of question answering systems and Question Answering System is in test since this year by the text Analysis Conference is another evaluation program."
        ],
        [
            "M. And in the particular in the thread question answering evaluation, three types of questions are identified and one type of question is called.",
            "Factoid would be a question that asks for specific facts in the tax collection, such as Chris Tom Cruise married to.",
            "Another type of question is the least question where you have to provide a list of answers.",
            "A list of facts that satisfy the particular question in the document collection.",
            "So what countries have atomic bombs and you will have a list of countries as answers.",
            "It doesn't matter the order in which you produce the answers and another type of question was called definition questions in the past and now is called other type of question.",
            "Where the objective is to obtain answers to questions such as who is name of person or what is an A particular term or what is a particular organization for example.",
            "So what you are looking for here is specifically a profile of a person or definition of attack."
        ],
        [
            "The 4th Task of information access is texturization, where here you are given a document or a set of documents and what you want the system to do is to extract the most important content from the document on from the collection of documents.",
            "And you want the system to present that information in a condensed version in a condensed form.",
            "And there are two ways in which the system can do that.",
            "One way will be just to select sentences from the document or from the collection an concatenate the sentence together and present that to you as a summary.",
            "Or the other way will be that the system produce an abstract that is a new version of the document where the information has been for every 10, or transforming some way.",
            "Take summarization, it's useful in a decision making process because it allows you to decide whether or not you will read the full document.",
            "So it says your time into instead of reading a 20 page document, you read a very short two or three sentence summary, and you decide whether or not the document is valuable for you.",
            "It can be used as a surrogate in indexing in the creation of indexing terms and so on.",
            "Text summarization is open domain in general, but knowledge about the particular domain.",
            "If you encode knowledge in the system about a particular domain you are dealing with, you may produce better summaries.",
            "And here as well, there was an evaluation program called the Document Understanding Conference is that was running since the year 2000 that also contributed with much development in the field and also developments in the creation of evaluation metrics for text realization.",
            "Since this year, evaluation of Texturization system is being done by the text analysis conferences where we also saw that they are doing Question answer."
        ],
        [
            "Now what I would like to introduce is a system that we have developed in the context of a project called.",
            "The couple reported project that integrates information retrieval, question answering, text summarization and some aspects of information extraction.",
            "We have developed a system that combines these four technologies.",
            "Anne Anne this specific?",
            "Context of this project was to help journalists.",
            "From a particular news agency in the UK, to find information to create what is called.",
            "Create what is called a background.",
            "And.",
            "What happened is the following when when you have a breaking news story, like for example today, there was a particular Healthways you don't have much information about the earthquake that just happened OK.",
            "But a journalist may be asked to produce attacks that will contextualize the information about the earthquake.",
            "In order to do that, the journalist has to go to different extra sources, for example to text archive and extract information that will contextualize the news.",
            "So for example, elements that will contextualize the news will be past earthquakes in the in the region.",
            "Definitions of what is an earthquake and so on that will give some background information from there for the reader.",
            "Because as the news just happen, you don't have much information to report about that particular events, but you have information about past events.",
            "And we have work in collaboration with the presentation who has given us.",
            "There is a subset of their archive 11 years of their type with more than 8 million stories for us to carry out information retrieval question answering text summarization.",
            "And it to perform."
        ],
        [
            "To develop a system.",
            "So here is the example.",
            "So for example you have these breaking news story.",
            "There was a health wake in Turkey, so you will like to have as background information.",
            "For example another earthquake in Turkey.",
            "You will also like to have from the list of earthquakes.",
            "They want that it was the most powerful.",
            "For example, you may also want to have some definitions of what is health wake or what is the cost of Healthways and so on.",
            "And you want to retrieve that all that from a collection.",
            "And in order to support the identification of these elements in a tax collection, we have used the previous described."
        ],
        [
            "Ologist and in order to implement the system we have use assistant at this develop in shift at Sheffield a general detector for text engineering is a system which has provided the basic tools for text analysis, tokenization, sentence signification, part of speech, tagging, named entity recognition.",
            "We have used a parcel to analyze parts of the text, in particular for a question.",
            "Answering is a system that not only produces.",
            "Syntactic parsing, but also creates a semantic representation of the sentences.",
            "We have use also a summarization tool kit that is implemented following the gates paradigm.",
            "And we have also you."
        ],
        [
            "For information retrieval, they loose in information retrieval system.",
            "Without any particular modification to it.",
            "Here are some details about some of the components of the system, but I I will see that on the appropriate lecture on summarization and question answering and so on.",
            "The summarization system, what it does is to extract a set of representative sentences from a document or a set of documents based on the Association of a particular score to each sentence.",
            "This particular score for each sentence is compute based on a set of features of individual features that are mentioned there.",
            "We will not enter into detail because we see them an in their summarization lecture.",
            "And these features are somehow come combined with with values to obtain a score and then once we have all the sentences core, we extract the top ranked sentences.",
            "And.",
            "We also use.",
            "Summarization and question answering techniques to produce profiles or definitions of peoples and that appear in the news."
        ],
        [
            "For question answering, we will also see the technique in detail in the question answering lecture.",
            "But what we do is an indexing of each passage of the collection of the text collection using.",
            "A.",
            "Hey there, Lucian information retrieval system.",
            "And in order to answer a question, what we do is to use the question as a query today information retrieval system and we retrieve the indexes passages.",
            "And then what we do is an analysis of each question and each passage that has been returned using a parser.",
            "So we obtain for the questions and for the sentences we obtain.",
            "A logical representation that basically contains the entities and the events that are mentioned in the texts and also relations such as the logical subject of a particular error.",
            "Which entities is logical subject of a particular, where which entities the logical subject of a particular parable sower.",
            "And in the question what we do is to dentify the type of answer that is expected.",
            "So is this question asking for the name of the person?",
            "Is this question asking for a location and so on?",
            "And each entity in the sentences that come back from the document collection is considered a candidate answer, but we need to escort them.",
            "And the score that each entity receives is based on a score that is given to a sentence where the entity occurs.",
            "The similarity between the type of the candidate and the expected answer that we have to provide and also logical relations matching between logical relations between entities and in the sentence and entities in the question.",
            "And with, although, that information with."
        ],
        [
            "Score I would choose the highest score entity as allies.",
            "In order to search for to support the search for similar events.",
            "So for example, you have a text that mentions a health quick and you want to retrieve.",
            "Similar events, like other earthquakes that happen in Turkey.",
            "What we do is to produce.",
            "A semantic representations for each living paragraph.",
            "So basically the first few sentences of each story and will create semantic representations like the one shown in the in this slide.",
            "So for example, there you can see that you will have a resignation event they are resigning and you will have a relation like logical subject.",
            "Of that, resignation events and that points to a particular entity that is the head of the bank.",
            "OK.",
            "So, given that we have parsed and created this semantic representation for each sentence, then we can create a database where we will have all day.",
            "Or the entities and their types.",
            "All the events under types and associations.",
            "For example, this event is associated with this entity by illogical subject.",
            "This event is associated to this entity by logical objects.",
            "Or this event is associated with this entity by a prepositional attachment of a particular type.",
            "So with that we can create an in store.",
            "This information is database and then we can perform search not over the text collection, but over this representation that is in the database.",
            "OK."
        ],
        [
            "So this is what the system gives us output, but we'll see the demo so you get back story with a summary.",
            "The first win automatically created.",
            "An if you.",
            "Put the question to the system, you will get the exact answer plus a context where they answer.",
            "Of course in a document so you can check whether or not the answer is correct.",
            "If you want to search for similar events, what you will get?",
            "Back our tests where.",
            "The logical relations in the input text that you put are somehow expressed in those documents that are coming back from the document collection.",
            "So what I will show is there more of the system?",
            "So this is the system.",
            "I don't know if this is clear, so there are various options.",
            "The first option is simple information retrieval, where you put any any set of keywords can be also sentence and you query the collection.",
            "There are various ways to do that, so you can put for example, restric by dates and so on.",
            "What this system does, I will advance a little bit.",
            "I will stop here.",
            "So what the system does is to recognize that in that particular input string there are two names of people.",
            "In this case Tony Blair and George George Bush, and tells you that there are profiles available.",
            "That you can consult if you want OK and then there are the typical output of an information retrieval system where you have the documents and the documents that come with some metadata.",
            "And also some.",
            "Some information that has been produced by the summarization system short summaries that tells you what the document is about.",
            "When you want to explore each story, stories have been linked.",
            "Want to another?",
            "If they are part of the same story?",
            "So we haven't been together so you can navigate from one story to the other.",
            "What you can do is to, because the Journal is usually need to reduce text from their civs, so you can save.",
            "Obviously the stories to disk for.",
            "Processing later.",
            "You can perform search not only by the type the key was that you enter, but also by by dates and you can go now to the different profiles that are found in their chi about Tony Blair.",
            "Those profiles that you're looking at here are profiles that already exist in the original archive.",
            "For people that do not have profiles, we create them automatically using a summarization system.",
            "OK, so from a set of documents that mention the person name we create an automatic server.",
            "Here is what you can do is also navigate the collection or cells in the collection by.",
            "Exploring the information on the meta data so we have different types of metadata, topic, headline and so on.",
            "And you can also search by by date.",
            "So you want to see some earthquakes in Turkey before a particular date?",
            "This would be just accessing the access to the story is the same.",
            "Lower the system.",
            "Now here what you can do is to access the collection.",
            "Asking putting a question to the system.",
            "A well formed question in natural language.",
            "So when was Queen Elizabeth the second Crown for example and we have two systems to do that.",
            "One is the system that I have described, the one that performs a full analysis.",
            "Over the sentences and the questions.",
            "And then it's course each entity according to a number of linguistic linguistic features.",
            "Last week we did this.",
            "And there you get the answers, so you get answers with a context and then access to the to the full document so you can verify whether or not the answer is correct, for example.",
            "So question answering systems do not perform at 100% accuracy, so you have to check whether the answer that comes back from the system is good.",
            "This is another system that performs.",
            "Question answering.",
            "You've seen some regular patterns and information on main entities only say more performance system and has.",
            "And is faster than the previous system that I have I have described.",
            "And the functionalities are the same, so you can access the documents and verify.",
            "And.",
            "Dialysis.",
            "OK, and now the.",
            "Next functionality is to search for a similar event, so here the example is US jets.",
            "Dropped bombs in Iraq.",
            "So you would like to find in the collection.",
            "Similar events so jets dropping bombs, so in that particular case of this particular text that I have input into the system, what we have is.",
            "So you have jets drop bones so you have an event that is the dropping of the bomb.",
            "The Jets is who is dropping the bombs and the bombs are the things that have been dropped.",
            "So basically you have here 2 relations that you want the jet dropping and dropping of the bomb and you want to retrieve text that contains those relations attacks that match the two relations will be highly relevant for the search and it takes that contains.",
            "One of their relations will be less relevant.",
            "It takes that contains just the mention of it dropping.",
            "Will not be as relevant as they want.",
            "It contains the appropriate relations, so that's what you get back from the collection.",
            "Texts which are ranked according to the presence of this logical relations.",
            "So you see there, for example, that the exact relation.",
            "He's been found in a top document top ranked document.",
            "On the second document.",
            "We only have one of the relations, so the dropping of bombs, but it doesn't say that Egypt was dropping those bombs OK. That's why this one is less relevant than the previous one.",
            "OK, so you can also track these stories in the user interface so you can put them in a basket and then go and look at the stories that you have.",
            "Track and maybe do some more intelligent processing over them.",
            "OK, so I think that I will.",
            "All the rest is similar.",
            "Close this here and I will now show.",
            "Describe another set of applications that we are developing now.",
            "So these are applications that are information extraction applications for business intelligence.",
            "This is work that we are doing in the context of an UN project is called Museum project that aims to integrate natural language processing and ontologies for business intelligence.",
            "The idea is that the ontology defines the information that needs to be extracted and that we go to different texts of different sources and we try to extract.",
            "Information that is expressed in the ontology and we have been concentrating on applications that extract information.",
            "Company information, so given a company you are interested in knowing the executives of the company, the location of the company, their website of the company, the telephone numbers of the company, and so on, we are interested in extracting information about countries and regions, especially economy.",
            "Economic indicate."
        ],
        [
            "Because, for example, the density of the population.",
            "Hey there old system."
        ],
        [
            "The country and so on.",
            "And we are also interested in defying opinions about, for example, companies on Prada."
        ],
        [
            "Asphalt in text.",
            "This is the.",
            "How we?"
        ],
        [
            "See the information extraction process in this project museum.",
            "So we have an ontology that is being manually defined by experts and by ontology creators.",
            "We have a lot of providers that gave us a document that we store somewhere and we have an ontology based document annotation system that performs that is used for manual rotation of documents and also for automatic extraction with a manual annotation.",
            "System is domain expert can take a document, use the tool and annotated documents and we can use the automatic system.",
            "We can train the automatic system or develop rules based on what the domain expert has identified in text.",
            "In order to create our ontology base system and given a new document, we can annotate the document and then use this for ontology population.",
            "And once we have the information in the ontology or their knowledge base associated to the ontology, we can use that information in a number of applications for business Intel."
        ],
        [
            "So the data sources that we use come from different places, so we can for example, newspapers from an Italian.",
            "News provider we have companies web pages.",
            "So basically we concentrate on the main page of the company.",
            "The page of the company that provides information about the company or other state of the company, and we use also public sources like Wikipedia they say are facts book and so on.",
            "And as I said, the ontology is being manually developed and is based on an extension of a particular existence ontology."
        ],
        [
            "This is how we see the ontology in the gate tool that I will present later on.",
            "So here for example you have all the class.",
            "Here are key and you have company there than they are here.",
            "What you have is all the properties that need to be extracted for the class company."
        ],
        [
            "And this is the house.",
            "The system is seen in also indicate an.",
            "Dig a graphical user interface so this is a particular text about a profile about the company and then highlighted are the different types of information that we want to extract.",
            "OK and with that.",
            "Formation that has been identified.",
            "We can use it to populate a knowledge base."
        ],
        [
            "Anne.",
            "So let's see how this works for this application.",
            "So this is the particular company profile is a semi structured document, so you have some structural information and some text that also describe activities of the company and so on.",
            "And what we want to extract is a subset of the information that is expressed in the ontology for a company.",
            "So this is just a very simple user interface that allows.",
            "You to call a particular service where the information extraction system is ram, you send a document with that service and you get back a kind of template, an LDF representation of the information that we want to extract.",
            "For example, the representation of the address of the company or representation of the executives and their names for that particular company or information about the number of employees and the dates for those particular numbers of employees and so on.",
            "And with that you can use this to send back the information to the ontology or to the knowledge base.",
            "OK so I would have lost it because this is too much.",
            "And we will see.",
            "So you can save the information you in the future.",
            "The information will be uploaded in apology.",
            "But what they want to show now is.",
            "How this is how the information extraction system is seeing also indicate tools.",
            "So you have a number of resources there.",
            "Basically algorithms that will be run in sequence to to produce.",
            "Select the information from the text.",
            "Will we see this in detail later on when I present the tool?",
            "Yeah, what we have is a document and the HTML markup.",
            "So this is a profile as the one that was shown in the beginning of the of the video clip.",
            "And now.",
            "That thing they're contains information extraction system that is run over the system, and as result of these the document will be process annotated with information, and that information will be used to generate the statements for ontology population.",
            "And what they show here we see this also in detail later on, is that some information that has been identified in the text with the tool.",
            "And that information that has been identified contains.",
            "Contains some attributes and values that are used to populate the knowledge base.",
            "OK, so this is basically there.",
            "The template is large and the values that have been obtained from the text.",
            "OK, so I think I'll stop here please.",
            "Demo and we'll start with the tool that we use.",
            "One of the tools that we used to develop all these applications.",
            "So the general detector for tech engineer indicate system say framework for the development and deployment of natural language processing applications and if you have access to the web you can go to that site and download.",
            "The tool is a tool that you can use in any platform because it's been written in Java.",
            "And in the lectures I will demonstrate the tools.",
            "So if you want to practice after the lectures, it will be.",
            "It will be useful.",
            "And the tool comes with a graphical user interface that allows a user.",
            "In general, user will be a programmer.",
            "National linguists or a computer scientist to access, to compose and to visualize different components and to carry out experimentation.",
            "But in addition to the graphical user interface that you will use in to test applications and to do some experiments, the system comes with a Java library negate dot jar that programmers can use to create a full fledge information extraction.",
            "An other types of applications that will work with text OK."
        ],
        [
            "So basically what you do is to have a Java program of your own.",
            "You import the gate Dodger Library and then you start programming engage and you program your applications.",
            "We will see some examples of how to do that.",
            "Gate is based on this model.",
            "So gate pass components that are divided in language resources that basically refer to data, for example documents, processing resources that are basically the algorithms that you will run over the data and visualization resources that are composed by all the elements of the graphical user interface that comes with gate and all the components.",
            "These three types of components can be extended or can be.",
            "Customize so you can, for example, adapt an information extraction application to a new domain.",
            "So you have today you have an application to extract company information.",
            "You can adapt that to extract for example, information about another type of entity.",
            "You can allow the application to deal with a new language, for example OK.",
            "In one central concept engages the concept of documents."
        ],
        [
            "That are created from a.",
            "From a file can be a file that is in your disk or can be a file that is in a remote place a webpage.",
            "And so you provide an URL to create the document or can be a string of text, so you can write a string of text that will be your document.",
            "And again, document is structuring gate is a language resource that contains the text of the original file that you have.",
            "Used to create the documents and will have a set of annotations.",
            "Yeah.",
            "And this annotations are useful to contain syntactic semantic linguistic information.",
            "So when when you create a document engaged, if the original file had a particular format, OK, will deal with.",
            "It will call a particular document analyzer and will parse it and will create a set of annotations based on the markup of the document.",
            "OK.",
            "Documents engaged can also have features, so you can for example, add features to the document like this document is from this particular rate or the author of the document is such and such, or the language of the document is such and such.",
            "The headline of the document is such and such.",
            "And.",
            "As I said, they gave the gate documents are language resources, as are the annotations."
        ],
        [
            "So the notations in gates have a particular type an belong to a particular rotation set.",
            "We have in the document and start and end offsets.",
            "That represents the part of the document that you are taking.",
            "And we have also features and values that you will use the store at different types of information.",
            "And documenting gate can be grouped in in corpus, so you may have a collection of documents that you want to group together so it gives you the possibility of doing that.",
            "Corpus engage are also another type of language."
        ],
        [
            "So.",
            "So this is how you will see a document.",
            "A document processed by Gates Ann with all the annotations.",
            "So this is the gate user interface.",
            "So here what you have on the top is a set of process of resources, language, resources and processing resources.",
            "In the middle top you have the documents, the text of the documents.",
            "Here what you have is the annotations that had been produced by applications or by the human.",
            "And what they have done is to highlight some annotations by clicking on them.",
            "And here what you have is the annotations in this middle.",
            "Bottom panel OK, so as you can see the annotations have.",
            "Have here inside yeah, organization semantics.",
            "Location organization semantics.",
            "They have offsets begin and end.",
            "And then they have features called different types of information.",
            "OK. OK, let's see then how we?",
            "Open gates."
        ],
        [
            "So here if you install gate in your computer, there are various ways in which you can call gate.",
            "You can call it from the command line, for example something that will do now.",
            "Or you can probably will have a program from the old programs in Windows OK.",
            "So the way in which I call it is by using.",
            "They aren't program.",
            "Will take awhile until it loads.",
            "But what I will get is that particular user interface and we will see how we can open a document and see what Kate give us back.",
            "Do you have any questions?",
            "Yes.",
            "Any kind of?",
            "Hey Dan, notations you can produce annotations in different ways.",
            "We will see little by little how this is done.",
            "But one way is that the human uses the user interface and.",
            "Produces annotation manually so they tool gives you that possibility.",
            "The other possibility is that they use the language, the processing resources to create annotations over the document.",
            "So you process the document and the system.",
            "The particular system will create different types of annotations.",
            "The creation of these annotations can be done by a program that has been manually developed or can be done by a system that has been training a machine learning system, for example.",
            "So there are different possibilities.",
            "OK, this is what you get when you call Gates.",
            "And so you have here language resources.",
            "OK, so I can come here and what I can do is."
        ],
        [
            "To create a gate document, yeah.",
            "So if I click here, I will get a dialog box where I can put all the parameters to create that particular gate document.",
            "So you can give a name.",
            "So I can put any name I want.",
            "And then what you have to provide all the sum, you can change some of the parameters.",
            "The most important that we're going to demonstrate here is this one, that is from which file you want to create your gate documents.",
            "OK, so there are different possibilities.",
            "One is to create from.",
            "As I said from disk from a particular file that is injured is another is from a string.",
            "So let's go.",
            "One of those, for example, I take this one that is in my base is an XML file.",
            "If I open it.",
            "And I give OK here.",
            "So God will create a great document for me.",
            "At least this one OK.",
            "When you get, here is the text of the documents.",
            "Yeah, and then what you also get?",
            "Because this is an XML file that I just used to create the document.",
            "When you get also is this annotation sets.",
            "One annotation service call Originel markups that will contain the XML that was found in the document.",
            "An another notation said is this one.",
            "That is for the moment empty.",
            "That is called default annotation set OK.",
            "So if we go into.",
            "Some of them.",
            "So for example, if I think here in headline.",
            "So this is the notation.",
            "Yeah, if I want to see it, I click on this annotation list.",
            "And what I see here is the annotations.",
            "So it's telling me that.",
            "This piece of text from position Zero, Proposition 57.",
            "Is the location of type headline that belongs to this set origonal markers OK. An here has no features.",
            "Yeah.",
            "And.",
            "If we click on another one, for example, this one is so you see that.",
            "Well, basically these represent sentences.",
            "So for example, here I have a sentence that goes or an annotation of Type S that goes from position 60 to 310.",
            "That belongs to original markups, and you can see that there are number of features and values in the annotation, OK?",
            "So you can see here name of feature value of that particular feature and so on.",
            "OK.",
            "The other possibility is that you want to create a document from a string, and this is very simple to do.",
            "So here you have two possibilities, URL or string.",
            "So here I can put anything I like.",
            "And.",
            "I didn't put a name, but this is the document and the only thing I have is the text of the document OK. And I don't have any markup because this was created from a string.",
            "The only thing I have is this default annotation set.",
            "OK.",
            "So then in the document we have.",
            "The text of the document.",
            "A number of.",
            "Annotations sets.",
            "And in each set a number of annotations OK, and you can have as many annotation sets if you want.",
            "The document also will have features here.",
            "Yeah, where you can put any metadata that you want for that particular document."
        ],
        [
            "OK, so I said that there are three methods, two methods.",
            "One is the human can create annotation will see a little bit later.",
            "An example how to do that.",
            "And why we need humans to annotate documents where humans don't take documents because they know the task that the automatic system has to carry out.",
            "If I want to do an extraction system that will identify, say, names of.",
            "Programming languages in documents in computer science?",
            "Well, I need a human that is an expert in.",
            "Names of languages in computer science to mark up in a document which are possible.",
            "Names of languages.",
            "OK, if I want someone to annotate particular language of drugs in the Pharmaceutical industry, I need a human to tell me what are valid names of drugs or so that I will be able to develop a system that will be able to recognize names of tracks in text.",
            "In general, when you have to annotate documents for an information extraction task, you need to give people clear definitions of what connotated in the documents.",
            "So you need guidelines to tell people how to annotate.",
            "For example, if you some people if if they find a name like Mr John Smith, some people may decide that Mr is part of the name of the person.",
            "Some people may decide that Mr is not part of the name of the person.",
            "OK, so you need clear guidelines in such situations, what they're going to do.",
            "OK, so we will start with a set of annotations.",
            "You start with people that will start annotating.",
            "Then you what you do is to try to see how they agree on what they annotate until they get used to the annotation guidelines to produce improved guidelines, and then you can really go to the documents and annotate.",
            "So engage what you have as well as a language.",
            "Resources are annotation schemas that basically."
        ],
        [
            "Tells you what you are going to annotate and what are the components of the things that you want to update.",
            "So this is an innovation schema and."
        ],
        [
            "This is a more complex one that allows you to.",
            "To specify what features the annotator has to update.",
            "If we go back to.",
            "To get here.",
            "Let's suppose that they want to.",
            "Annotate.",
            "As a human, I want to annotate a particular piece of text with a particular type of entity.",
            "For example, here Mr. To chiwan OK.",
            "I want to annotate this one as a person.",
            "So gate already give me the possibility of give me a name and number of."
        ],
        [
            "Hey Gordy, semantic categories or types of name entities that I can use to annotate my text?",
            "For example, I can say this is a purse.",
            "OK.",
            "So now in this annotation set that before was empty, I have one annotation that this person OK.",
            "Here it is in the annotations.",
            "What you can do is correct the annotation, so if you made a mistake, you can correct it so you can come here.",
            "And for example, if you decide that Mr is not part of the full annotation.",
            "You can correct using these things here.",
            "OK. You can also eat that particular annotation schema, allows you to put some features or ask for some features and values.",
            "You can put them here, for example.",
            "Here.",
            "OK. And now we have.",
            "You can see here pictures of the location.",
            "Surname equals one.",
            "You can also.",
            "This side will delete some of the annotations so you can delete this one here.",
            "Yeah.",
            "Right clicking on.",
            "With a mouth, or you can just delete all the annotations of that particular type.",
            "F here from the user interface.",
            "As a human, you can create new annotation sets using this part of the gate GUI, so I can create an annotation set that is called.",
            "I would ask you that is anything I can go there and then.",
            "Annotate.",
            "This for example.",
            "A country or location maybe?",
            "And this is the way in which you can annotate different things, put things in different sets and so on.",
            "OK, as a human?",
            "OK.",
            "So I'm basically this is what we have here.",
            "So you have that this is an old interface, but you can do all that we we saw in the.",
            "Small Dick OK so you can ask.",
            "You can create validation text.",
            "We can add annotations to the different annotation sets.",
            "We can modify the edges of the annotation.",
            "You know the boundaries where you can do also other fancy things like change the colors and and so on.",
            "And obviously, if a person is annotating a document using the Get user interface, that person would like to save the documents for future use.",
            "And or save a whole collection of documents for future use so that there is a way to do that.",
            "Engage and what you can do is to save the annotations within the gate documents.",
            "Or you can save the annotations.",
            "In in, in different formats OK. And if you have different documents that have been put into a corpus, what you can do is also to save the corpus."
        ],
        [
            "I hope.",
            "OK.",
            "So this.",
            "Idea of annotating texts and producing annotated corpora an it's been done for system development.",
            "So basically what you need to do, what you need to do is to have a set of humans to create what is called the standard that will contain the manual annotations.",
            "This call list and are usually is divided into 3 parts."
        ],
        [
            "Well can be 2 parts, but sometimes it's better than three, so training part A testing part and an evaluation portion.",
            "So what you do is to basically take the training part device or develop your system or learn your system based on the training part and then you can use the testing part to adjust some parameters and then finally when you have decided that all the parameters had been optimized you use evaluation portion of the.",
            "System to measure the performance of the extraction system.",
            "In this case OK. Anne."
        ],
        [
            "OK, this is the only things that we will see about my rotations.",
            "Now we're going."
        ],
        [
            "To see a little bit about applications engage.",
            "So applications engage I created by sequencing processing resources and these applications can be run over a corpus of documents, and in this case we call this applications in corpus pipeline.",
            "So basically you sequence a set of components and then each one will be applied over a document in the corpus of sequence.",
            "And sometimes what you want is not to have my corpus associated with the task, not a corpus inputs, and in this case what you will use is pipeline instead of corpus pipeline."
        ],
        [
            "So we saw this before, but this is a typical application of of gates where you will have this.",
            "Set of components here have been somehow sequences.",
            "In this application an applied to this particular corpus that contains this particular documents.",
            "To produce these annotations OK.",
            "So we will see a little."
        ],
        [
            "In detail, this processing tools from gates.",
            "First, what we have is a documented structural horizon, but this one is called automatically when you load it documenting gates so you don't need to.",
            "To call it in particular, then we will see a process of tokenization.",
            "Identifying words in text, process of sentence, identification of sentences, splitting that identify sentence in documents, and process that associated lexical categories to words in documents.",
            "Process of morphological analysis, analysis and also understanding process.",
            "Anne.",
            "And all these things that I mentioned here have our language processing resources.",
            "There is an error there.",
            "Is this language resources.",
            "Processing resources that have runtime parameters that you can set."
        ],
        [
            "OK, so engage.",
            "These resources are known as a collection of reusable objects for language engineering or kreole.",
            "And are specified in Creole idiotic DOT XML file.",
            "So basically what this file provides is any specification of all the components that Gates understands.",
            "Each components Becausw gate is in Java, each component is implemented in a Java class.",
            "OK, so in this Crayola dot XML file what you have to say is which which jar files to use and which Java class implements the components.",
            "So this is an example of, for example, of the tokenizer, as it is specified in the qualifier, and it's a bit small."
        ],
        [
            "But here you say the name of the component, and here you specify the class which will implement the component indicator chart library.",
            "In this case, and these are from here to.",
            "Here are parameters that that component will need.",
            "For to be able to run."
        ],
        [
            "OK. OK, the first process that we're going to see is that organization process that identifies different types of words in texts can be numbers, symbols, or words.",
            "It is worth noting that is not only sequences of.",
            "Characters between spaces or separators, but for example, some consideration had to be taken for particular types of words, for example to.",
            "Call on to South East, North to.",
            "Add 2, and procedures, but will be a whole entity so that things have to be taken into account in that organization process and that the form I for example will be recognized as as 2 words.",
            "I know something like basis 20 will be recognized at two different tokens and we will leave the process of grouping together these two things for, for example, for a mobile offer named entity recognition, if that would be appropriate.",
            "At organization Engage is based on rules, so you have rules of that form.",
            "A left hand side and around high side.",
            "In the left hand side what you specify is a regular expression over character classes and the some examples of.",
            "Offers are there in the right hand side.",
            "What you specify is the type of annotation to be created and the features and values that you want to add to the annotation.",
            "When that particular expressions found in text.",
            "So for example, the first rule says that if you find a sequence of digital of digits, basically what you will create in the with that.",
            "Create is a token annotation and you will put a feature kind number to that particular annotation.",
            "The Tokenizer will produce one type of annotation."
        ],
        [
            "Produces the token type of annotation.",
            "And the features that will be given to that particular type of annotation are the string that was identified, the orthography of the string can be, for example, that they work starts with an uppercase upper cap."
        ],
        [
            "Or that they were installing capitals, or that the world is mixed mixture between uppercase and lowercase, the length of the token and the kind of token order type.",
            "Like if it is awarded symbol iteration and number, and the Tokenizer will also produces paper space tokens to a story.",
            "Information about control characters and spaces.",
            "Let's see how we call it.",
            "OK, nicely engage so things will become a little bit clearer.",
            "I will close this document here.",
            "And the first thing I will do is to create a corpus that we mentioned before.",
            "So here it gets called, pushes the language resource.",
            "You can give a name to it.",
            "And if you double click in the corpus, you get a screen where you can add documents to the corpus OK.",
            "So you can.",
            "For example, use these to add a particular document to the corpus.",
            "We have only one document, so we put it there OK. You can also eliminate documents from corpus with this code OK. And now what we're going to do is to create a tokenizer.",
            "Is this component that is here in our new English tokenizer?",
            "So I click on it.",
            "There are a number of parameters.",
            "The parameters that are here are basically the rules of the tokenizer.",
            "The rules that we just saw in the previous slide, and these rules can be modified by you, so you can copy that slide to other place in your disk.",
            "You can modify the rules and generate rules for another tokenization process.",
            "OK.",
            "So all this comes with the gate distribution, so you can.",
            "Other.",
            "This rules to your particular application.",
            "So I can give a name to look and I said I won't be rich because it will create one by default.",
            "So now what the system has done is create a tokenizer that is available for me to use.",
            "And I want to run this tokenizer over all the documents in this corpus.",
            "So what they would do is to create an application and I said that you can do two things.",
            "One is a pipeline that doesn't need a corpus and another is a corpus pipeline.",
            "That will work over a corpus, so I will.",
            "I will create a corpus pipeline application.",
            "And again, if I double click on this I also get.",
            "An interface.",
            "What I can do is to add components to this application.",
            "OK, the only component available is the tokenizer, so I will put it there.",
            "OK, so this has the components that make up this application.",
            "In this navigation screen, what you have also is a parameter to set the corpus that you want to use to run your application.",
            "So there is only one corpus available here, so I will select that one and what they will use to run.",
            "There the application over that corpus if we look at the documents again.",
            "What I will do is to 1st delete this.",
            "Delete this.",
            "Did this OK, so that the corpus looks like the corpus of with the document of help originally.",
            "And now what they will do is to run this application over the corpus with this run.",
            "And now again, there is something here you see.",
            "The top case of the documents.",
            "So things that have been produced.",
            "So for example, it says that there is a token from position 95 to position and TAS and you have the features.",
            "It should not be sent word of length three of an upper initial Ann Street.",
            "OK.",
            "The other annotation that was produced, this one is space token.",
            "Where basically you have the spaces on the control characters.",
            "The SEC.",
            "Process that we're going to see is the sentence."
        ],
        [
            "Splitter that is the process that has to create sentences.",
            "Sentence annotations for the documents.",
            "Basically what we have to decide is whether or not where a sentence ends.",
            "So if you use just punctuation, you will not get it because there are conditions under which.",
            "Is not.",
            "Is not the marker for end of sentences.",
            "So there is a rule use engage to identify sentence boundaries.",
            "It uses a list of abbreviations.",
            "And like Doctor for example to decide whether or not a.",
            "A full stop is the end of the sentence.",
            "And the role that this uses that will that second bullet point.",
            "So it.",
            "The sentence great if it is preceded by an abbreviation and followed by an uppercase common word and the sentences splitter engaged produces a sentence type of annotation.",
            "So if we go now to.",
            "I would example.",
            "So, so the synthesis splitter is another processing reserve.",
            "So is this one?",
            "So if we call it?",
            "So what you have here is.",
            "The parameters that you're going to use.",
            "One is the list of abbreviations that the system uses.",
            "You can modify that and adapt it to your own language.",
            "And then there is a set of grammars.",
            "We will see grammars later on.",
            "But basically if you add up the list of abbreviations, you will get the new sentences picture.",
            "So I will leave OK and create this intense splitter.",
            "I have it there now.",
            "And now if we go to the application.",
            "Here again.",
            "So we can add after the tokenization process.",
            "We cannot process of sentence identification.",
            "OK, so first the tokenization process and then sentence identification OK.",
            "Sometimes it is useful when you are testing with the gate user interface to have a process that is called annotation document reset.",
            "That what we'll do is to delete all the annotations in the default annotation set.",
            "So it's useful to have it because sometimes you are testing things you want to run it again without the previous annotations as well generated.",
            "So what we do is to put this here as well, but we want this to be the first element to be applied to the document, OK?",
            "So basically this will remove all the rotations.",
            "Basically will remove space token and token OK. Then will run the tokenizer and then cause the sentence splitter needs the tokenizer.",
            "Then we run the sentences, but.",
            "So again, I will come here and I will run it over the corpus.",
            "So if we go through the documents now we have.",
            "In addition to the tokens.",
            "And the space.",
            "OK, we have just one location that tells me.",
            "Where the sentence starts and where the sentence adds OK. OK."
        ],
        [
            "The third process that we are going to, the third component that we're going to see is the part of speech tagger that these days on the water bike Mark Whipple and part of speech tagger.",
            "What it does is procs part of speech tag or a lexical category to each word in the document, and attacks come from a particular set of tasks.",
            "That is the.",
            "Ben at three bank corpus.",
            "And the method that is used to produce the tax is based on.",
            "Well known methods developed by Brill.",
            "But in order to produce the tagger, people uses a different learning approach where he doesn't need to renovate corpus to learn the different rules of the system.",
            "And.",
            "The system is based on the guessing of an initial tag for each word in the document, so each usually each word will have multiple possible tags, so the system first associate the most probable category to each word and then has a set of rules to correct.",
            "To correct state to correct the initial tax based on context."
        ],
        [
            "So this is a.",
            "This is the set of tags that is being used by this particular tagger.",
            "And."
        ],
        [
            "The part of speech tagging process uses 2 resources.",
            "One is the lexecon that has been collected from a corpus.",
            "And the form of the lexicon is that you have a warm and then at least of possible tags.",
            "So for example the.",
            "The word employees has only one tag that is.",
            "Adverb a third person.",
            "And they were like empty, fast, three different interpretations.",
            "The order of the tags.",
            "Object if there were not third person.",
            "And so the order represents the frequency in which this tax has been observed in the corpus associated to the particular world.",
            "The system also customary sticks to tag words that are not known that were not in the original colors.",
            "For example, a word that ends in PNG probably will be tagged as in our assay.",
            "An initial guess.",
            "And then there are the rules to correct mistakes are.",
            "Of that form, for example.",
            "The second bullet point an that basically they said they tell you change attack A by attack B if a particular condition occurs.",
            "And what does the part of speech tagger engaged is to produce a feature for each token in the document?",
            "The feature is the feature category and the value of that particular feature will be one of the."
        ],
        [
            "Part of his speech tags that appear in this list OK.",
            "So let's see how we produce.",
            "We annotate with part of speech taxes, document.",
            "And.",
            "So this is the resource any of stagger, and these are the two sets of parameters.",
            "What is the lexicon that you can modify and the other is the set of rules.",
            "Sometimes you can put some rules that you believe will work, but obviously it's better to have the rules learn from a corpus.",
            "And then what I will do is to come here again and create up to this application the part of speech tagger OK?",
            "And then I run it over.",
            "The corpus if I go to the document.",
            "So we said that there is nothing new that is created, but in the token what you will have now is the feature category.",
            "Equals for example.",
            "In this case an MP, so it properly OK. For example here that they go request.",
            "OK. OK, any questions?",
            "Yes.",
            "Can we sorry?",
            "There is.",
            "There is a way to do that and we will.",
            "We will see it tomorrow when I show how you can use.",
            "A Java program to do that.",
            "OK, we see that tomorrow will start doing.",
            "We start doing exactly what we have done here in a Java program.",
            "So you see how you can create your applications without relying on the graphical user interface.",
            "And later on we will see how to select particular things from the documents.",
            "OK, I think that we have to close now.",
            "Anymore questions.",
            "Yes.",
            "The K distribution.",
            "I think you have to go to SourceForge and install it.",
            "Sorry.",
            "OK. OK try but if I will be able to do it I will try."
        ],
        [
            "More questions.",
            "OK, thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So hello, my name is Sarah Souza.",
                    "label": 0
                },
                {
                    "sent": "John and I work for the natural Language Processing Group in the Department of Computer Science in the University of Sheffield.",
                    "label": 1
                },
                {
                    "sent": "And this is the course hands-on natural language processing for information access applications.",
                    "label": 0
                },
                {
                    "sent": "I would like to thank the organizers of the school for having selected this series of lectures in natural language processing.",
                    "label": 0
                },
                {
                    "sent": "That is related to information retrieval.",
                    "label": 0
                },
                {
                    "sent": "And I would like to apologize because I couldn't come yesterday and becausw of we couldn't find an appropriate flight for me to come and.",
                    "label": 0
                },
                {
                    "sent": "And also I would like to apologize if I look a little bit tired, but I have a very difficult connection in from Moscow to come here so.",
                    "label": 0
                },
                {
                    "sent": "If I say anything that is sounds a little bit silly, I do apologize.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "The idea of the course is that we will see some natural language processing technology and tools.",
                    "label": 0
                },
                {
                    "sent": "More or less in the 1st and 2nd day of the of the course, probably also on the third day.",
                    "label": 0
                },
                {
                    "sent": "And then we will give some introduction to question answering and text summarization.",
                    "label": 0
                },
                {
                    "sent": "The whole series of lectures are introductory, so for you to family.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To get familiar with a set of tools that you can use to create a natural language processing applications.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The first part of the course will have this outline.",
                    "label": 0
                },
                {
                    "sent": "I will very briefly introduce a four different information access task information retrieval.",
                    "label": 1
                },
                {
                    "sent": "Information extraction, pick summarization and question answering.",
                    "label": 1
                },
                {
                    "sent": "And I will present a case study of a project and a system that we developed at the University of Sheffield a few years ago.",
                    "label": 0
                },
                {
                    "sent": "In the context of the Capra Porter project, I will explain what it is.",
                    "label": 0
                },
                {
                    "sent": "And then I will present some applications that we are developing now in particular associated with information extraction, trying to extract semantic information from text.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "The first 2 days we will concentrate on the use of a system.",
                    "label": 0
                },
                {
                    "sent": "That is, Colgate is a system to develop natural language processing applications.",
                    "label": 0
                },
                {
                    "sent": "I will present the component some of the components of this system that are components to perform tokenization over text, to identify sentences to apply, to identify a part of speech tags in four different words, to perform name, entity recognition analysis, morphological analysis and parsing.",
                    "label": 1
                },
                {
                    "sent": "And I will show the most rationes.",
                    "label": 0
                },
                {
                    "sent": "What I will do is to open the gate system and show you how the different components are used and how the different components can be combined to create applications.",
                    "label": 0
                },
                {
                    "sent": "And that's why I put their demonstrations, and that's why this is a hands-on course.",
                    "label": 0
                },
                {
                    "sent": "We will see a few practical sessions in the lectures.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So if you definitions at first, so information extraction is a task where you are given a document collection and you have a user that has an information need and the task of the information retrieval system is produced to return to you a list of documents that match the information needs of the user.",
                    "label": 1
                },
                {
                    "sent": "And this information needs can be expressed, for example, as a set of keywords.",
                    "label": 0
                },
                {
                    "sent": "And in general, in information retrieval, the documents are processed in order to produce terms that are being used that are going to be used for indexing.",
                    "label": 0
                },
                {
                    "sent": "And by preprocessing the document collection, what you know is which particular terms belong to which particular documents.",
                    "label": 0
                },
                {
                    "sent": "Obviously, in information retrieval, decision has to be taken on the concept of a term is a term award is determined.",
                    "label": 0
                },
                {
                    "sent": "Part of Award is a term, a combination of words and so on.",
                    "label": 0
                },
                {
                    "sent": "Information retrieval.",
                    "label": 0
                },
                {
                    "sent": "We also need a method to decide on the similarity between documents an and the user need and the queries that the user has put to the system.",
                    "label": 0
                },
                {
                    "sent": "But what the information retrieval gives you is a list of documents.",
                    "label": 0
                },
                {
                    "sent": "So the user has to go to each document and decide by himself or herself on the value of the document for the particular.",
                    "label": 0
                },
                {
                    "sent": "Particular query that has been put into the system information retrieval can be applied to any domain, so you can get a document collection that is on a number of topics on many topics, all of them different.",
                    "label": 0
                },
                {
                    "sent": "Anne and the field of information retrieval has been fooled by the foil by the development of the text Retrieval Conference is.",
                    "label": 0
                },
                {
                    "sent": "Our systems have been tested to see how they perform.",
                    "label": 0
                },
                {
                    "sent": "Different from information.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "31 is information extraction where instead of getting back documents what you get.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Back is facts from documents.",
                    "label": 0
                },
                {
                    "sent": "An information extraction is based on the idea of a scenario template that will model A particular application domain.",
                    "label": 1
                },
                {
                    "sent": "And so a template is basically a set of slots or fields in a record, and what you want the information extraction system is to fill those slots with strings or information extracted from the text.",
                    "label": 0
                },
                {
                    "sent": "An information extraction each domain dependent because it's attached to this idea of scenario template, an information extraction has also been fueled by the development of a particular evaluation.",
                    "label": 0
                },
                {
                    "sent": "Programs called the Message Understanding conferences for 10 years since 87 until 97.",
                    "label": 0
                },
                {
                    "sent": "And the this evaluation programs.",
                    "label": 1
                },
                {
                    "sent": "American evaluation programs made possible advances in many different fields related to information extraction, notably in name entity recognition.",
                    "label": 0
                },
                {
                    "sent": "From the year 2000, there is another evaluation of information extraction system called a program automatic content extraction program.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is what we have in an information extraction task.",
                    "label": 0
                },
                {
                    "sent": "You are given a particular document in a particular domain and you have a particular template that has been defined where you have a slot like that.",
                    "label": 0
                },
                {
                    "sent": "The number of these people injure people.",
                    "label": 0
                },
                {
                    "sent": "Epicenter, intensity for a domain of earthquakes, natural disasters, what you want from the text.",
                    "label": 0
                },
                {
                    "sent": "There is the system to instantiate the template with the relevant information.",
                    "label": 0
                },
                {
                    "sent": "And what they have done is to highlight in different colors different different types of information in the text, like locations, dates and particular numbers.",
                    "label": 0
                },
                {
                    "sent": "So what we can see here in the text is that there is a mention of a particular earthquake.",
                    "label": 0
                },
                {
                    "sent": "Another mention of the particular earthquake and these two things are related.",
                    "label": 0
                },
                {
                    "sent": "You also have a mentions of dates and here you have another date and these two days are related because Wednesday is related to.",
                    "label": 0
                },
                {
                    "sent": "To make 22 Wednesday is the day before to May 22.",
                    "label": 0
                },
                {
                    "sent": "So by doing that you can instantiate the date of that template with the date of the earthquake, yeah?",
                    "label": 0
                },
                {
                    "sent": "You have here a number so you have a number of people and you have ever there.",
                    "label": 0
                },
                {
                    "sent": "That amount of people were killed.",
                    "label": 0
                },
                {
                    "sent": "When?",
                    "label": 0
                },
                {
                    "sent": "A powerful earthquake extract so you have a particular syntactic structure that tells you that that particular number of people are the people dead in that particular earthquake, so you can use that information to instantiate this lot of how many there in this earthquake.",
                    "label": 0
                },
                {
                    "sent": "You have another number there, and this in Vista.",
                    "label": 0
                },
                {
                    "sent": "In this occasion that number is qualified by the verb injure.",
                    "label": 0
                },
                {
                    "sent": "And you have that that amount of people were injured when the earthquake struck.",
                    "label": 0
                },
                {
                    "sent": "So you can use that number to instantiate this particular slot in the template.",
                    "label": 0
                },
                {
                    "sent": "And then you have a particular mention of the location and you have the phrase the epicenter of the quake, that is the same as the quick that was mentioned before.",
                    "label": 0
                },
                {
                    "sent": "Was located at that particular place, so you can use that to instantiate that slot.",
                    "label": 0
                },
                {
                    "sent": "And if you have some additional knowledge, like a database that contains information about particular cities, in which countries they they are, so you can also enrich that information with the with the country where the.",
                    "label": 0
                },
                {
                    "sent": "The earthquakes occur.",
                    "label": 0
                },
                {
                    "sent": "And then you have there a particular number associated to that particular expression that says that that number is an intensity.",
                    "label": 0
                },
                {
                    "sent": "And you can see that there is an expression there that says the quake which measure.",
                    "label": 0
                },
                {
                    "sent": "5.2 On the Richter scale, so you can use that particular pattern to instantiate the intensity of the earthquake.",
                    "label": 1
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This template can be used to populate the database of earthquakes, for example, or and.",
                    "label": 1
                },
                {
                    "sent": "So you can perform search over each and the template can also be used to generate a short summary of a document where you will use this.",
                    "label": 1
                },
                {
                    "sent": "The strings that have been used to instantiate.",
                    "label": 0
                },
                {
                    "sent": "As a template to generate a very short text.",
                    "label": 0
                },
                {
                    "sent": "A database that you populate with the the templates can be used to perform some reasoning, so you can imagine a question like this one which particular earthquake killed more people so you can search over an instructor database instead of over attacks in order to get some valuable information.",
                    "label": 0
                },
                {
                    "sent": "There are a number of different tasks in information extraction.",
                    "label": 0
                },
                {
                    "sent": "1 task is subtasks.",
                    "label": 0
                },
                {
                    "sent": "One is known as name, entity recognition and.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What we do here is to try to find an classification, classify names in text names such as locations, organizations, names of people, and so on.",
                    "label": 0
                },
                {
                    "sent": "There is another sub task that is called coreference resolution which will identify if entity relations between entity syntax, for example then to fication that the extreme a powerful earthquake.",
                    "label": 0
                },
                {
                    "sent": "Is the same as this prediction earthquake in the text that we saw before?",
                    "label": 0
                },
                {
                    "sent": "Then we have a task called template Element construction that will have descriptive information to the result of the name entity recognition tasks.",
                    "label": 1
                },
                {
                    "sent": "So for example, if you have a location, maybe you want to know in which country is that location, or if you find a particular person you may want to know that that person works for a particular organization and so on.",
                    "label": 0
                },
                {
                    "sent": "And then you have the scenario template production that basically is the whole instantiation instantiation of the template.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So some examples of the different subtasks for the example of the earthquake.",
                    "label": 0
                },
                {
                    "sent": "So you have locations Latania Alger May 22 at 8:00 Wednesday, another date you have.",
                    "label": 0
                },
                {
                    "sent": "Coreference like a powerful earthquake and the quake an algerin all in uppercase with Algeria in only upper capital.",
                    "label": 1
                },
                {
                    "sent": "And template elements, so tenure is in Algeria in Algeria.",
                    "label": 1
                },
                {
                    "sent": "Is the capital, Algiers is the capital of Algeria and this scenario can place.",
                    "label": 0
                },
                {
                    "sent": "Finally that is the instantiation of the whole template.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Another extraction task is another information access task is question answering where here what you are given is a document collection and can be an open document collection like they were.",
                    "label": 0
                },
                {
                    "sent": "Unlike information retrieval, where you put only keywords here, what you put to the system is a well formed question.",
                    "label": 0
                },
                {
                    "sent": "And the objective of the system is to extract the answer the correct answer to the question from the document collection.",
                    "label": 1
                },
                {
                    "sent": "In principle, Becausw question answering is open an open domain.",
                    "label": 1
                },
                {
                    "sent": "We can look for answers of many different types, but in general question will refer to questions will be about names of people, about locations, about the dates, and so on.",
                    "label": 0
                },
                {
                    "sent": "Question answering also had made a lot of progress thanks to evaluation programs such as the text retrieval conferences.",
                    "label": 1
                },
                {
                    "sent": "In particular, the question answering track.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Which provided.",
                    "label": 0
                },
                {
                    "sent": "At tools for the evaluation of question answering systems and Question Answering System is in test since this year by the text Analysis Conference is another evaluation program.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "M. And in the particular in the thread question answering evaluation, three types of questions are identified and one type of question is called.",
                    "label": 1
                },
                {
                    "sent": "Factoid would be a question that asks for specific facts in the tax collection, such as Chris Tom Cruise married to.",
                    "label": 0
                },
                {
                    "sent": "Another type of question is the least question where you have to provide a list of answers.",
                    "label": 0
                },
                {
                    "sent": "A list of facts that satisfy the particular question in the document collection.",
                    "label": 1
                },
                {
                    "sent": "So what countries have atomic bombs and you will have a list of countries as answers.",
                    "label": 0
                },
                {
                    "sent": "It doesn't matter the order in which you produce the answers and another type of question was called definition questions in the past and now is called other type of question.",
                    "label": 1
                },
                {
                    "sent": "Where the objective is to obtain answers to questions such as who is name of person or what is an A particular term or what is a particular organization for example.",
                    "label": 0
                },
                {
                    "sent": "So what you are looking for here is specifically a profile of a person or definition of attack.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The 4th Task of information access is texturization, where here you are given a document or a set of documents and what you want the system to do is to extract the most important content from the document on from the collection of documents.",
                    "label": 1
                },
                {
                    "sent": "And you want the system to present that information in a condensed version in a condensed form.",
                    "label": 0
                },
                {
                    "sent": "And there are two ways in which the system can do that.",
                    "label": 0
                },
                {
                    "sent": "One way will be just to select sentences from the document or from the collection an concatenate the sentence together and present that to you as a summary.",
                    "label": 0
                },
                {
                    "sent": "Or the other way will be that the system produce an abstract that is a new version of the document where the information has been for every 10, or transforming some way.",
                    "label": 0
                },
                {
                    "sent": "Take summarization, it's useful in a decision making process because it allows you to decide whether or not you will read the full document.",
                    "label": 0
                },
                {
                    "sent": "So it says your time into instead of reading a 20 page document, you read a very short two or three sentence summary, and you decide whether or not the document is valuable for you.",
                    "label": 0
                },
                {
                    "sent": "It can be used as a surrogate in indexing in the creation of indexing terms and so on.",
                    "label": 0
                },
                {
                    "sent": "Text summarization is open domain in general, but knowledge about the particular domain.",
                    "label": 0
                },
                {
                    "sent": "If you encode knowledge in the system about a particular domain you are dealing with, you may produce better summaries.",
                    "label": 1
                },
                {
                    "sent": "And here as well, there was an evaluation program called the Document Understanding Conference is that was running since the year 2000 that also contributed with much development in the field and also developments in the creation of evaluation metrics for text realization.",
                    "label": 0
                },
                {
                    "sent": "Since this year, evaluation of Texturization system is being done by the text analysis conferences where we also saw that they are doing Question answer.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now what I would like to introduce is a system that we have developed in the context of a project called.",
                    "label": 0
                },
                {
                    "sent": "The couple reported project that integrates information retrieval, question answering, text summarization and some aspects of information extraction.",
                    "label": 0
                },
                {
                    "sent": "We have developed a system that combines these four technologies.",
                    "label": 0
                },
                {
                    "sent": "Anne Anne this specific?",
                    "label": 0
                },
                {
                    "sent": "Context of this project was to help journalists.",
                    "label": 0
                },
                {
                    "sent": "From a particular news agency in the UK, to find information to create what is called.",
                    "label": 0
                },
                {
                    "sent": "Create what is called a background.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "What happened is the following when when you have a breaking news story, like for example today, there was a particular Healthways you don't have much information about the earthquake that just happened OK.",
                    "label": 1
                },
                {
                    "sent": "But a journalist may be asked to produce attacks that will contextualize the information about the earthquake.",
                    "label": 0
                },
                {
                    "sent": "In order to do that, the journalist has to go to different extra sources, for example to text archive and extract information that will contextualize the news.",
                    "label": 0
                },
                {
                    "sent": "So for example, elements that will contextualize the news will be past earthquakes in the in the region.",
                    "label": 1
                },
                {
                    "sent": "Definitions of what is an earthquake and so on that will give some background information from there for the reader.",
                    "label": 1
                },
                {
                    "sent": "Because as the news just happen, you don't have much information to report about that particular events, but you have information about past events.",
                    "label": 0
                },
                {
                    "sent": "And we have work in collaboration with the presentation who has given us.",
                    "label": 0
                },
                {
                    "sent": "There is a subset of their archive 11 years of their type with more than 8 million stories for us to carry out information retrieval question answering text summarization.",
                    "label": 1
                },
                {
                    "sent": "And it to perform.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To develop a system.",
                    "label": 0
                },
                {
                    "sent": "So here is the example.",
                    "label": 0
                },
                {
                    "sent": "So for example you have these breaking news story.",
                    "label": 0
                },
                {
                    "sent": "There was a health wake in Turkey, so you will like to have as background information.",
                    "label": 0
                },
                {
                    "sent": "For example another earthquake in Turkey.",
                    "label": 0
                },
                {
                    "sent": "You will also like to have from the list of earthquakes.",
                    "label": 0
                },
                {
                    "sent": "They want that it was the most powerful.",
                    "label": 0
                },
                {
                    "sent": "For example, you may also want to have some definitions of what is health wake or what is the cost of Healthways and so on.",
                    "label": 0
                },
                {
                    "sent": "And you want to retrieve that all that from a collection.",
                    "label": 0
                },
                {
                    "sent": "And in order to support the identification of these elements in a tax collection, we have used the previous described.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ologist and in order to implement the system we have use assistant at this develop in shift at Sheffield a general detector for text engineering is a system which has provided the basic tools for text analysis, tokenization, sentence signification, part of speech, tagging, named entity recognition.",
                    "label": 1
                },
                {
                    "sent": "We have used a parcel to analyze parts of the text, in particular for a question.",
                    "label": 0
                },
                {
                    "sent": "Answering is a system that not only produces.",
                    "label": 1
                },
                {
                    "sent": "Syntactic parsing, but also creates a semantic representation of the sentences.",
                    "label": 0
                },
                {
                    "sent": "We have use also a summarization tool kit that is implemented following the gates paradigm.",
                    "label": 0
                },
                {
                    "sent": "And we have also you.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For information retrieval, they loose in information retrieval system.",
                    "label": 0
                },
                {
                    "sent": "Without any particular modification to it.",
                    "label": 0
                },
                {
                    "sent": "Here are some details about some of the components of the system, but I I will see that on the appropriate lecture on summarization and question answering and so on.",
                    "label": 0
                },
                {
                    "sent": "The summarization system, what it does is to extract a set of representative sentences from a document or a set of documents based on the Association of a particular score to each sentence.",
                    "label": 1
                },
                {
                    "sent": "This particular score for each sentence is compute based on a set of features of individual features that are mentioned there.",
                    "label": 0
                },
                {
                    "sent": "We will not enter into detail because we see them an in their summarization lecture.",
                    "label": 1
                },
                {
                    "sent": "And these features are somehow come combined with with values to obtain a score and then once we have all the sentences core, we extract the top ranked sentences.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "We also use.",
                    "label": 0
                },
                {
                    "sent": "Summarization and question answering techniques to produce profiles or definitions of peoples and that appear in the news.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For question answering, we will also see the technique in detail in the question answering lecture.",
                    "label": 0
                },
                {
                    "sent": "But what we do is an indexing of each passage of the collection of the text collection using.",
                    "label": 0
                },
                {
                    "sent": "A.",
                    "label": 0
                },
                {
                    "sent": "Hey there, Lucian information retrieval system.",
                    "label": 0
                },
                {
                    "sent": "And in order to answer a question, what we do is to use the question as a query today information retrieval system and we retrieve the indexes passages.",
                    "label": 0
                },
                {
                    "sent": "And then what we do is an analysis of each question and each passage that has been returned using a parser.",
                    "label": 1
                },
                {
                    "sent": "So we obtain for the questions and for the sentences we obtain.",
                    "label": 0
                },
                {
                    "sent": "A logical representation that basically contains the entities and the events that are mentioned in the texts and also relations such as the logical subject of a particular error.",
                    "label": 0
                },
                {
                    "sent": "Which entities is logical subject of a particular, where which entities the logical subject of a particular parable sower.",
                    "label": 0
                },
                {
                    "sent": "And in the question what we do is to dentify the type of answer that is expected.",
                    "label": 0
                },
                {
                    "sent": "So is this question asking for the name of the person?",
                    "label": 0
                },
                {
                    "sent": "Is this question asking for a location and so on?",
                    "label": 0
                },
                {
                    "sent": "And each entity in the sentences that come back from the document collection is considered a candidate answer, but we need to escort them.",
                    "label": 1
                },
                {
                    "sent": "And the score that each entity receives is based on a score that is given to a sentence where the entity occurs.",
                    "label": 0
                },
                {
                    "sent": "The similarity between the type of the candidate and the expected answer that we have to provide and also logical relations matching between logical relations between entities and in the sentence and entities in the question.",
                    "label": 0
                },
                {
                    "sent": "And with, although, that information with.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Score I would choose the highest score entity as allies.",
                    "label": 0
                },
                {
                    "sent": "In order to search for to support the search for similar events.",
                    "label": 1
                },
                {
                    "sent": "So for example, you have a text that mentions a health quick and you want to retrieve.",
                    "label": 0
                },
                {
                    "sent": "Similar events, like other earthquakes that happen in Turkey.",
                    "label": 0
                },
                {
                    "sent": "What we do is to produce.",
                    "label": 1
                },
                {
                    "sent": "A semantic representations for each living paragraph.",
                    "label": 0
                },
                {
                    "sent": "So basically the first few sentences of each story and will create semantic representations like the one shown in the in this slide.",
                    "label": 0
                },
                {
                    "sent": "So for example, there you can see that you will have a resignation event they are resigning and you will have a relation like logical subject.",
                    "label": 1
                },
                {
                    "sent": "Of that, resignation events and that points to a particular entity that is the head of the bank.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So, given that we have parsed and created this semantic representation for each sentence, then we can create a database where we will have all day.",
                    "label": 0
                },
                {
                    "sent": "Or the entities and their types.",
                    "label": 0
                },
                {
                    "sent": "All the events under types and associations.",
                    "label": 0
                },
                {
                    "sent": "For example, this event is associated with this entity by illogical subject.",
                    "label": 1
                },
                {
                    "sent": "This event is associated to this entity by logical objects.",
                    "label": 0
                },
                {
                    "sent": "Or this event is associated with this entity by a prepositional attachment of a particular type.",
                    "label": 0
                },
                {
                    "sent": "So with that we can create an in store.",
                    "label": 0
                },
                {
                    "sent": "This information is database and then we can perform search not over the text collection, but over this representation that is in the database.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is what the system gives us output, but we'll see the demo so you get back story with a summary.",
                    "label": 0
                },
                {
                    "sent": "The first win automatically created.",
                    "label": 0
                },
                {
                    "sent": "An if you.",
                    "label": 0
                },
                {
                    "sent": "Put the question to the system, you will get the exact answer plus a context where they answer.",
                    "label": 0
                },
                {
                    "sent": "Of course in a document so you can check whether or not the answer is correct.",
                    "label": 0
                },
                {
                    "sent": "If you want to search for similar events, what you will get?",
                    "label": 0
                },
                {
                    "sent": "Back our tests where.",
                    "label": 0
                },
                {
                    "sent": "The logical relations in the input text that you put are somehow expressed in those documents that are coming back from the document collection.",
                    "label": 0
                },
                {
                    "sent": "So what I will show is there more of the system?",
                    "label": 0
                },
                {
                    "sent": "So this is the system.",
                    "label": 0
                },
                {
                    "sent": "I don't know if this is clear, so there are various options.",
                    "label": 0
                },
                {
                    "sent": "The first option is simple information retrieval, where you put any any set of keywords can be also sentence and you query the collection.",
                    "label": 0
                },
                {
                    "sent": "There are various ways to do that, so you can put for example, restric by dates and so on.",
                    "label": 0
                },
                {
                    "sent": "What this system does, I will advance a little bit.",
                    "label": 0
                },
                {
                    "sent": "I will stop here.",
                    "label": 0
                },
                {
                    "sent": "So what the system does is to recognize that in that particular input string there are two names of people.",
                    "label": 0
                },
                {
                    "sent": "In this case Tony Blair and George George Bush, and tells you that there are profiles available.",
                    "label": 0
                },
                {
                    "sent": "That you can consult if you want OK and then there are the typical output of an information retrieval system where you have the documents and the documents that come with some metadata.",
                    "label": 0
                },
                {
                    "sent": "And also some.",
                    "label": 0
                },
                {
                    "sent": "Some information that has been produced by the summarization system short summaries that tells you what the document is about.",
                    "label": 0
                },
                {
                    "sent": "When you want to explore each story, stories have been linked.",
                    "label": 0
                },
                {
                    "sent": "Want to another?",
                    "label": 0
                },
                {
                    "sent": "If they are part of the same story?",
                    "label": 0
                },
                {
                    "sent": "So we haven't been together so you can navigate from one story to the other.",
                    "label": 0
                },
                {
                    "sent": "What you can do is to, because the Journal is usually need to reduce text from their civs, so you can save.",
                    "label": 0
                },
                {
                    "sent": "Obviously the stories to disk for.",
                    "label": 0
                },
                {
                    "sent": "Processing later.",
                    "label": 0
                },
                {
                    "sent": "You can perform search not only by the type the key was that you enter, but also by by dates and you can go now to the different profiles that are found in their chi about Tony Blair.",
                    "label": 0
                },
                {
                    "sent": "Those profiles that you're looking at here are profiles that already exist in the original archive.",
                    "label": 0
                },
                {
                    "sent": "For people that do not have profiles, we create them automatically using a summarization system.",
                    "label": 0
                },
                {
                    "sent": "OK, so from a set of documents that mention the person name we create an automatic server.",
                    "label": 0
                },
                {
                    "sent": "Here is what you can do is also navigate the collection or cells in the collection by.",
                    "label": 0
                },
                {
                    "sent": "Exploring the information on the meta data so we have different types of metadata, topic, headline and so on.",
                    "label": 0
                },
                {
                    "sent": "And you can also search by by date.",
                    "label": 0
                },
                {
                    "sent": "So you want to see some earthquakes in Turkey before a particular date?",
                    "label": 0
                },
                {
                    "sent": "This would be just accessing the access to the story is the same.",
                    "label": 0
                },
                {
                    "sent": "Lower the system.",
                    "label": 0
                },
                {
                    "sent": "Now here what you can do is to access the collection.",
                    "label": 0
                },
                {
                    "sent": "Asking putting a question to the system.",
                    "label": 0
                },
                {
                    "sent": "A well formed question in natural language.",
                    "label": 0
                },
                {
                    "sent": "So when was Queen Elizabeth the second Crown for example and we have two systems to do that.",
                    "label": 0
                },
                {
                    "sent": "One is the system that I have described, the one that performs a full analysis.",
                    "label": 0
                },
                {
                    "sent": "Over the sentences and the questions.",
                    "label": 0
                },
                {
                    "sent": "And then it's course each entity according to a number of linguistic linguistic features.",
                    "label": 0
                },
                {
                    "sent": "Last week we did this.",
                    "label": 0
                },
                {
                    "sent": "And there you get the answers, so you get answers with a context and then access to the to the full document so you can verify whether or not the answer is correct, for example.",
                    "label": 0
                },
                {
                    "sent": "So question answering systems do not perform at 100% accuracy, so you have to check whether the answer that comes back from the system is good.",
                    "label": 0
                },
                {
                    "sent": "This is another system that performs.",
                    "label": 0
                },
                {
                    "sent": "Question answering.",
                    "label": 0
                },
                {
                    "sent": "You've seen some regular patterns and information on main entities only say more performance system and has.",
                    "label": 0
                },
                {
                    "sent": "And is faster than the previous system that I have I have described.",
                    "label": 0
                },
                {
                    "sent": "And the functionalities are the same, so you can access the documents and verify.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Dialysis.",
                    "label": 0
                },
                {
                    "sent": "OK, and now the.",
                    "label": 0
                },
                {
                    "sent": "Next functionality is to search for a similar event, so here the example is US jets.",
                    "label": 0
                },
                {
                    "sent": "Dropped bombs in Iraq.",
                    "label": 0
                },
                {
                    "sent": "So you would like to find in the collection.",
                    "label": 0
                },
                {
                    "sent": "Similar events so jets dropping bombs, so in that particular case of this particular text that I have input into the system, what we have is.",
                    "label": 0
                },
                {
                    "sent": "So you have jets drop bones so you have an event that is the dropping of the bomb.",
                    "label": 0
                },
                {
                    "sent": "The Jets is who is dropping the bombs and the bombs are the things that have been dropped.",
                    "label": 0
                },
                {
                    "sent": "So basically you have here 2 relations that you want the jet dropping and dropping of the bomb and you want to retrieve text that contains those relations attacks that match the two relations will be highly relevant for the search and it takes that contains.",
                    "label": 0
                },
                {
                    "sent": "One of their relations will be less relevant.",
                    "label": 0
                },
                {
                    "sent": "It takes that contains just the mention of it dropping.",
                    "label": 0
                },
                {
                    "sent": "Will not be as relevant as they want.",
                    "label": 0
                },
                {
                    "sent": "It contains the appropriate relations, so that's what you get back from the collection.",
                    "label": 0
                },
                {
                    "sent": "Texts which are ranked according to the presence of this logical relations.",
                    "label": 0
                },
                {
                    "sent": "So you see there, for example, that the exact relation.",
                    "label": 0
                },
                {
                    "sent": "He's been found in a top document top ranked document.",
                    "label": 0
                },
                {
                    "sent": "On the second document.",
                    "label": 0
                },
                {
                    "sent": "We only have one of the relations, so the dropping of bombs, but it doesn't say that Egypt was dropping those bombs OK. That's why this one is less relevant than the previous one.",
                    "label": 0
                },
                {
                    "sent": "OK, so you can also track these stories in the user interface so you can put them in a basket and then go and look at the stories that you have.",
                    "label": 0
                },
                {
                    "sent": "Track and maybe do some more intelligent processing over them.",
                    "label": 0
                },
                {
                    "sent": "OK, so I think that I will.",
                    "label": 0
                },
                {
                    "sent": "All the rest is similar.",
                    "label": 0
                },
                {
                    "sent": "Close this here and I will now show.",
                    "label": 0
                },
                {
                    "sent": "Describe another set of applications that we are developing now.",
                    "label": 0
                },
                {
                    "sent": "So these are applications that are information extraction applications for business intelligence.",
                    "label": 0
                },
                {
                    "sent": "This is work that we are doing in the context of an UN project is called Museum project that aims to integrate natural language processing and ontologies for business intelligence.",
                    "label": 0
                },
                {
                    "sent": "The idea is that the ontology defines the information that needs to be extracted and that we go to different texts of different sources and we try to extract.",
                    "label": 0
                },
                {
                    "sent": "Information that is expressed in the ontology and we have been concentrating on applications that extract information.",
                    "label": 0
                },
                {
                    "sent": "Company information, so given a company you are interested in knowing the executives of the company, the location of the company, their website of the company, the telephone numbers of the company, and so on, we are interested in extracting information about countries and regions, especially economy.",
                    "label": 0
                },
                {
                    "sent": "Economic indicate.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Because, for example, the density of the population.",
                    "label": 0
                },
                {
                    "sent": "Hey there old system.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The country and so on.",
                    "label": 0
                },
                {
                    "sent": "And we are also interested in defying opinions about, for example, companies on Prada.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Asphalt in text.",
                    "label": 0
                },
                {
                    "sent": "This is the.",
                    "label": 0
                },
                {
                    "sent": "How we?",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "See the information extraction process in this project museum.",
                    "label": 0
                },
                {
                    "sent": "So we have an ontology that is being manually defined by experts and by ontology creators.",
                    "label": 0
                },
                {
                    "sent": "We have a lot of providers that gave us a document that we store somewhere and we have an ontology based document annotation system that performs that is used for manual rotation of documents and also for automatic extraction with a manual annotation.",
                    "label": 0
                },
                {
                    "sent": "System is domain expert can take a document, use the tool and annotated documents and we can use the automatic system.",
                    "label": 1
                },
                {
                    "sent": "We can train the automatic system or develop rules based on what the domain expert has identified in text.",
                    "label": 1
                },
                {
                    "sent": "In order to create our ontology base system and given a new document, we can annotate the document and then use this for ontology population.",
                    "label": 0
                },
                {
                    "sent": "And once we have the information in the ontology or their knowledge base associated to the ontology, we can use that information in a number of applications for business Intel.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the data sources that we use come from different places, so we can for example, newspapers from an Italian.",
                    "label": 1
                },
                {
                    "sent": "News provider we have companies web pages.",
                    "label": 1
                },
                {
                    "sent": "So basically we concentrate on the main page of the company.",
                    "label": 0
                },
                {
                    "sent": "The page of the company that provides information about the company or other state of the company, and we use also public sources like Wikipedia they say are facts book and so on.",
                    "label": 1
                },
                {
                    "sent": "And as I said, the ontology is being manually developed and is based on an extension of a particular existence ontology.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is how we see the ontology in the gate tool that I will present later on.",
                    "label": 0
                },
                {
                    "sent": "So here for example you have all the class.",
                    "label": 0
                },
                {
                    "sent": "Here are key and you have company there than they are here.",
                    "label": 0
                },
                {
                    "sent": "What you have is all the properties that need to be extracted for the class company.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this is the house.",
                    "label": 0
                },
                {
                    "sent": "The system is seen in also indicate an.",
                    "label": 0
                },
                {
                    "sent": "Dig a graphical user interface so this is a particular text about a profile about the company and then highlighted are the different types of information that we want to extract.",
                    "label": 1
                },
                {
                    "sent": "OK and with that.",
                    "label": 0
                },
                {
                    "sent": "Formation that has been identified.",
                    "label": 0
                },
                {
                    "sent": "We can use it to populate a knowledge base.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "So let's see how this works for this application.",
                    "label": 0
                },
                {
                    "sent": "So this is the particular company profile is a semi structured document, so you have some structural information and some text that also describe activities of the company and so on.",
                    "label": 0
                },
                {
                    "sent": "And what we want to extract is a subset of the information that is expressed in the ontology for a company.",
                    "label": 0
                },
                {
                    "sent": "So this is just a very simple user interface that allows.",
                    "label": 0
                },
                {
                    "sent": "You to call a particular service where the information extraction system is ram, you send a document with that service and you get back a kind of template, an LDF representation of the information that we want to extract.",
                    "label": 0
                },
                {
                    "sent": "For example, the representation of the address of the company or representation of the executives and their names for that particular company or information about the number of employees and the dates for those particular numbers of employees and so on.",
                    "label": 0
                },
                {
                    "sent": "And with that you can use this to send back the information to the ontology or to the knowledge base.",
                    "label": 0
                },
                {
                    "sent": "OK so I would have lost it because this is too much.",
                    "label": 0
                },
                {
                    "sent": "And we will see.",
                    "label": 0
                },
                {
                    "sent": "So you can save the information you in the future.",
                    "label": 0
                },
                {
                    "sent": "The information will be uploaded in apology.",
                    "label": 0
                },
                {
                    "sent": "But what they want to show now is.",
                    "label": 0
                },
                {
                    "sent": "How this is how the information extraction system is seeing also indicate tools.",
                    "label": 0
                },
                {
                    "sent": "So you have a number of resources there.",
                    "label": 0
                },
                {
                    "sent": "Basically algorithms that will be run in sequence to to produce.",
                    "label": 0
                },
                {
                    "sent": "Select the information from the text.",
                    "label": 0
                },
                {
                    "sent": "Will we see this in detail later on when I present the tool?",
                    "label": 0
                },
                {
                    "sent": "Yeah, what we have is a document and the HTML markup.",
                    "label": 0
                },
                {
                    "sent": "So this is a profile as the one that was shown in the beginning of the of the video clip.",
                    "label": 0
                },
                {
                    "sent": "And now.",
                    "label": 0
                },
                {
                    "sent": "That thing they're contains information extraction system that is run over the system, and as result of these the document will be process annotated with information, and that information will be used to generate the statements for ontology population.",
                    "label": 0
                },
                {
                    "sent": "And what they show here we see this also in detail later on, is that some information that has been identified in the text with the tool.",
                    "label": 0
                },
                {
                    "sent": "And that information that has been identified contains.",
                    "label": 0
                },
                {
                    "sent": "Contains some attributes and values that are used to populate the knowledge base.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is basically there.",
                    "label": 0
                },
                {
                    "sent": "The template is large and the values that have been obtained from the text.",
                    "label": 0
                },
                {
                    "sent": "OK, so I think I'll stop here please.",
                    "label": 0
                },
                {
                    "sent": "Demo and we'll start with the tool that we use.",
                    "label": 0
                },
                {
                    "sent": "One of the tools that we used to develop all these applications.",
                    "label": 0
                },
                {
                    "sent": "So the general detector for tech engineer indicate system say framework for the development and deployment of natural language processing applications and if you have access to the web you can go to that site and download.",
                    "label": 1
                },
                {
                    "sent": "The tool is a tool that you can use in any platform because it's been written in Java.",
                    "label": 0
                },
                {
                    "sent": "And in the lectures I will demonstrate the tools.",
                    "label": 0
                },
                {
                    "sent": "So if you want to practice after the lectures, it will be.",
                    "label": 0
                },
                {
                    "sent": "It will be useful.",
                    "label": 1
                },
                {
                    "sent": "And the tool comes with a graphical user interface that allows a user.",
                    "label": 0
                },
                {
                    "sent": "In general, user will be a programmer.",
                    "label": 0
                },
                {
                    "sent": "National linguists or a computer scientist to access, to compose and to visualize different components and to carry out experimentation.",
                    "label": 0
                },
                {
                    "sent": "But in addition to the graphical user interface that you will use in to test applications and to do some experiments, the system comes with a Java library negate dot jar that programmers can use to create a full fledge information extraction.",
                    "label": 0
                },
                {
                    "sent": "An other types of applications that will work with text OK.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So basically what you do is to have a Java program of your own.",
                    "label": 0
                },
                {
                    "sent": "You import the gate Dodger Library and then you start programming engage and you program your applications.",
                    "label": 0
                },
                {
                    "sent": "We will see some examples of how to do that.",
                    "label": 0
                },
                {
                    "sent": "Gate is based on this model.",
                    "label": 0
                },
                {
                    "sent": "So gate pass components that are divided in language resources that basically refer to data, for example documents, processing resources that are basically the algorithms that you will run over the data and visualization resources that are composed by all the elements of the graphical user interface that comes with gate and all the components.",
                    "label": 0
                },
                {
                    "sent": "These three types of components can be extended or can be.",
                    "label": 0
                },
                {
                    "sent": "Customize so you can, for example, adapt an information extraction application to a new domain.",
                    "label": 1
                },
                {
                    "sent": "So you have today you have an application to extract company information.",
                    "label": 0
                },
                {
                    "sent": "You can adapt that to extract for example, information about another type of entity.",
                    "label": 1
                },
                {
                    "sent": "You can allow the application to deal with a new language, for example OK.",
                    "label": 0
                },
                {
                    "sent": "In one central concept engages the concept of documents.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That are created from a.",
                    "label": 1
                },
                {
                    "sent": "From a file can be a file that is in your disk or can be a file that is in a remote place a webpage.",
                    "label": 1
                },
                {
                    "sent": "And so you provide an URL to create the document or can be a string of text, so you can write a string of text that will be your document.",
                    "label": 0
                },
                {
                    "sent": "And again, document is structuring gate is a language resource that contains the text of the original file that you have.",
                    "label": 0
                },
                {
                    "sent": "Used to create the documents and will have a set of annotations.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "And this annotations are useful to contain syntactic semantic linguistic information.",
                    "label": 0
                },
                {
                    "sent": "So when when you create a document engaged, if the original file had a particular format, OK, will deal with.",
                    "label": 0
                },
                {
                    "sent": "It will call a particular document analyzer and will parse it and will create a set of annotations based on the markup of the document.",
                    "label": 1
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Documents engaged can also have features, so you can for example, add features to the document like this document is from this particular rate or the author of the document is such and such, or the language of the document is such and such.",
                    "label": 0
                },
                {
                    "sent": "The headline of the document is such and such.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "As I said, they gave the gate documents are language resources, as are the annotations.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the notations in gates have a particular type an belong to a particular rotation set.",
                    "label": 0
                },
                {
                    "sent": "We have in the document and start and end offsets.",
                    "label": 1
                },
                {
                    "sent": "That represents the part of the document that you are taking.",
                    "label": 1
                },
                {
                    "sent": "And we have also features and values that you will use the store at different types of information.",
                    "label": 1
                },
                {
                    "sent": "And documenting gate can be grouped in in corpus, so you may have a collection of documents that you want to group together so it gives you the possibility of doing that.",
                    "label": 0
                },
                {
                    "sent": "Corpus engage are also another type of language.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "So this is how you will see a document.",
                    "label": 0
                },
                {
                    "sent": "A document processed by Gates Ann with all the annotations.",
                    "label": 0
                },
                {
                    "sent": "So this is the gate user interface.",
                    "label": 0
                },
                {
                    "sent": "So here what you have on the top is a set of process of resources, language, resources and processing resources.",
                    "label": 0
                },
                {
                    "sent": "In the middle top you have the documents, the text of the documents.",
                    "label": 0
                },
                {
                    "sent": "Here what you have is the annotations that had been produced by applications or by the human.",
                    "label": 0
                },
                {
                    "sent": "And what they have done is to highlight some annotations by clicking on them.",
                    "label": 0
                },
                {
                    "sent": "And here what you have is the annotations in this middle.",
                    "label": 0
                },
                {
                    "sent": "Bottom panel OK, so as you can see the annotations have.",
                    "label": 0
                },
                {
                    "sent": "Have here inside yeah, organization semantics.",
                    "label": 0
                },
                {
                    "sent": "Location organization semantics.",
                    "label": 0
                },
                {
                    "sent": "They have offsets begin and end.",
                    "label": 0
                },
                {
                    "sent": "And then they have features called different types of information.",
                    "label": 0
                },
                {
                    "sent": "OK. OK, let's see then how we?",
                    "label": 0
                },
                {
                    "sent": "Open gates.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here if you install gate in your computer, there are various ways in which you can call gate.",
                    "label": 0
                },
                {
                    "sent": "You can call it from the command line, for example something that will do now.",
                    "label": 0
                },
                {
                    "sent": "Or you can probably will have a program from the old programs in Windows OK.",
                    "label": 0
                },
                {
                    "sent": "So the way in which I call it is by using.",
                    "label": 0
                },
                {
                    "sent": "They aren't program.",
                    "label": 0
                },
                {
                    "sent": "Will take awhile until it loads.",
                    "label": 0
                },
                {
                    "sent": "But what I will get is that particular user interface and we will see how we can open a document and see what Kate give us back.",
                    "label": 0
                },
                {
                    "sent": "Do you have any questions?",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Any kind of?",
                    "label": 0
                },
                {
                    "sent": "Hey Dan, notations you can produce annotations in different ways.",
                    "label": 0
                },
                {
                    "sent": "We will see little by little how this is done.",
                    "label": 0
                },
                {
                    "sent": "But one way is that the human uses the user interface and.",
                    "label": 0
                },
                {
                    "sent": "Produces annotation manually so they tool gives you that possibility.",
                    "label": 0
                },
                {
                    "sent": "The other possibility is that they use the language, the processing resources to create annotations over the document.",
                    "label": 0
                },
                {
                    "sent": "So you process the document and the system.",
                    "label": 0
                },
                {
                    "sent": "The particular system will create different types of annotations.",
                    "label": 0
                },
                {
                    "sent": "The creation of these annotations can be done by a program that has been manually developed or can be done by a system that has been training a machine learning system, for example.",
                    "label": 0
                },
                {
                    "sent": "So there are different possibilities.",
                    "label": 0
                },
                {
                    "sent": "OK, this is what you get when you call Gates.",
                    "label": 0
                },
                {
                    "sent": "And so you have here language resources.",
                    "label": 0
                },
                {
                    "sent": "OK, so I can come here and what I can do is.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To create a gate document, yeah.",
                    "label": 0
                },
                {
                    "sent": "So if I click here, I will get a dialog box where I can put all the parameters to create that particular gate document.",
                    "label": 0
                },
                {
                    "sent": "So you can give a name.",
                    "label": 0
                },
                {
                    "sent": "So I can put any name I want.",
                    "label": 0
                },
                {
                    "sent": "And then what you have to provide all the sum, you can change some of the parameters.",
                    "label": 0
                },
                {
                    "sent": "The most important that we're going to demonstrate here is this one, that is from which file you want to create your gate documents.",
                    "label": 0
                },
                {
                    "sent": "OK, so there are different possibilities.",
                    "label": 0
                },
                {
                    "sent": "One is to create from.",
                    "label": 0
                },
                {
                    "sent": "As I said from disk from a particular file that is injured is another is from a string.",
                    "label": 0
                },
                {
                    "sent": "So let's go.",
                    "label": 0
                },
                {
                    "sent": "One of those, for example, I take this one that is in my base is an XML file.",
                    "label": 0
                },
                {
                    "sent": "If I open it.",
                    "label": 0
                },
                {
                    "sent": "And I give OK here.",
                    "label": 0
                },
                {
                    "sent": "So God will create a great document for me.",
                    "label": 0
                },
                {
                    "sent": "At least this one OK.",
                    "label": 0
                },
                {
                    "sent": "When you get, here is the text of the documents.",
                    "label": 0
                },
                {
                    "sent": "Yeah, and then what you also get?",
                    "label": 0
                },
                {
                    "sent": "Because this is an XML file that I just used to create the document.",
                    "label": 0
                },
                {
                    "sent": "When you get also is this annotation sets.",
                    "label": 0
                },
                {
                    "sent": "One annotation service call Originel markups that will contain the XML that was found in the document.",
                    "label": 0
                },
                {
                    "sent": "An another notation said is this one.",
                    "label": 0
                },
                {
                    "sent": "That is for the moment empty.",
                    "label": 0
                },
                {
                    "sent": "That is called default annotation set OK.",
                    "label": 0
                },
                {
                    "sent": "So if we go into.",
                    "label": 0
                },
                {
                    "sent": "Some of them.",
                    "label": 0
                },
                {
                    "sent": "So for example, if I think here in headline.",
                    "label": 0
                },
                {
                    "sent": "So this is the notation.",
                    "label": 0
                },
                {
                    "sent": "Yeah, if I want to see it, I click on this annotation list.",
                    "label": 0
                },
                {
                    "sent": "And what I see here is the annotations.",
                    "label": 0
                },
                {
                    "sent": "So it's telling me that.",
                    "label": 0
                },
                {
                    "sent": "This piece of text from position Zero, Proposition 57.",
                    "label": 0
                },
                {
                    "sent": "Is the location of type headline that belongs to this set origonal markers OK. An here has no features.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "If we click on another one, for example, this one is so you see that.",
                    "label": 0
                },
                {
                    "sent": "Well, basically these represent sentences.",
                    "label": 0
                },
                {
                    "sent": "So for example, here I have a sentence that goes or an annotation of Type S that goes from position 60 to 310.",
                    "label": 0
                },
                {
                    "sent": "That belongs to original markups, and you can see that there are number of features and values in the annotation, OK?",
                    "label": 0
                },
                {
                    "sent": "So you can see here name of feature value of that particular feature and so on.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "The other possibility is that you want to create a document from a string, and this is very simple to do.",
                    "label": 0
                },
                {
                    "sent": "So here you have two possibilities, URL or string.",
                    "label": 0
                },
                {
                    "sent": "So here I can put anything I like.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "I didn't put a name, but this is the document and the only thing I have is the text of the document OK. And I don't have any markup because this was created from a string.",
                    "label": 0
                },
                {
                    "sent": "The only thing I have is this default annotation set.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So then in the document we have.",
                    "label": 0
                },
                {
                    "sent": "The text of the document.",
                    "label": 0
                },
                {
                    "sent": "A number of.",
                    "label": 0
                },
                {
                    "sent": "Annotations sets.",
                    "label": 0
                },
                {
                    "sent": "And in each set a number of annotations OK, and you can have as many annotation sets if you want.",
                    "label": 0
                },
                {
                    "sent": "The document also will have features here.",
                    "label": 0
                },
                {
                    "sent": "Yeah, where you can put any metadata that you want for that particular document.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so I said that there are three methods, two methods.",
                    "label": 0
                },
                {
                    "sent": "One is the human can create annotation will see a little bit later.",
                    "label": 0
                },
                {
                    "sent": "An example how to do that.",
                    "label": 0
                },
                {
                    "sent": "And why we need humans to annotate documents where humans don't take documents because they know the task that the automatic system has to carry out.",
                    "label": 0
                },
                {
                    "sent": "If I want to do an extraction system that will identify, say, names of.",
                    "label": 0
                },
                {
                    "sent": "Programming languages in documents in computer science?",
                    "label": 0
                },
                {
                    "sent": "Well, I need a human that is an expert in.",
                    "label": 0
                },
                {
                    "sent": "Names of languages in computer science to mark up in a document which are possible.",
                    "label": 0
                },
                {
                    "sent": "Names of languages.",
                    "label": 0
                },
                {
                    "sent": "OK, if I want someone to annotate particular language of drugs in the Pharmaceutical industry, I need a human to tell me what are valid names of drugs or so that I will be able to develop a system that will be able to recognize names of tracks in text.",
                    "label": 0
                },
                {
                    "sent": "In general, when you have to annotate documents for an information extraction task, you need to give people clear definitions of what connotated in the documents.",
                    "label": 1
                },
                {
                    "sent": "So you need guidelines to tell people how to annotate.",
                    "label": 0
                },
                {
                    "sent": "For example, if you some people if if they find a name like Mr John Smith, some people may decide that Mr is part of the name of the person.",
                    "label": 0
                },
                {
                    "sent": "Some people may decide that Mr is not part of the name of the person.",
                    "label": 1
                },
                {
                    "sent": "OK, so you need clear guidelines in such situations, what they're going to do.",
                    "label": 0
                },
                {
                    "sent": "OK, so we will start with a set of annotations.",
                    "label": 0
                },
                {
                    "sent": "You start with people that will start annotating.",
                    "label": 0
                },
                {
                    "sent": "Then you what you do is to try to see how they agree on what they annotate until they get used to the annotation guidelines to produce improved guidelines, and then you can really go to the documents and annotate.",
                    "label": 1
                },
                {
                    "sent": "So engage what you have as well as a language.",
                    "label": 0
                },
                {
                    "sent": "Resources are annotation schemas that basically.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tells you what you are going to annotate and what are the components of the things that you want to update.",
                    "label": 0
                },
                {
                    "sent": "So this is an innovation schema and.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is a more complex one that allows you to.",
                    "label": 0
                },
                {
                    "sent": "To specify what features the annotator has to update.",
                    "label": 0
                },
                {
                    "sent": "If we go back to.",
                    "label": 0
                },
                {
                    "sent": "To get here.",
                    "label": 0
                },
                {
                    "sent": "Let's suppose that they want to.",
                    "label": 0
                },
                {
                    "sent": "Annotate.",
                    "label": 0
                },
                {
                    "sent": "As a human, I want to annotate a particular piece of text with a particular type of entity.",
                    "label": 0
                },
                {
                    "sent": "For example, here Mr. To chiwan OK.",
                    "label": 0
                },
                {
                    "sent": "I want to annotate this one as a person.",
                    "label": 0
                },
                {
                    "sent": "So gate already give me the possibility of give me a name and number of.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hey Gordy, semantic categories or types of name entities that I can use to annotate my text?",
                    "label": 0
                },
                {
                    "sent": "For example, I can say this is a purse.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So now in this annotation set that before was empty, I have one annotation that this person OK.",
                    "label": 0
                },
                {
                    "sent": "Here it is in the annotations.",
                    "label": 0
                },
                {
                    "sent": "What you can do is correct the annotation, so if you made a mistake, you can correct it so you can come here.",
                    "label": 0
                },
                {
                    "sent": "And for example, if you decide that Mr is not part of the full annotation.",
                    "label": 0
                },
                {
                    "sent": "You can correct using these things here.",
                    "label": 0
                },
                {
                    "sent": "OK. You can also eat that particular annotation schema, allows you to put some features or ask for some features and values.",
                    "label": 0
                },
                {
                    "sent": "You can put them here, for example.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "OK. And now we have.",
                    "label": 0
                },
                {
                    "sent": "You can see here pictures of the location.",
                    "label": 0
                },
                {
                    "sent": "Surname equals one.",
                    "label": 0
                },
                {
                    "sent": "You can also.",
                    "label": 0
                },
                {
                    "sent": "This side will delete some of the annotations so you can delete this one here.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Right clicking on.",
                    "label": 0
                },
                {
                    "sent": "With a mouth, or you can just delete all the annotations of that particular type.",
                    "label": 0
                },
                {
                    "sent": "F here from the user interface.",
                    "label": 0
                },
                {
                    "sent": "As a human, you can create new annotation sets using this part of the gate GUI, so I can create an annotation set that is called.",
                    "label": 1
                },
                {
                    "sent": "I would ask you that is anything I can go there and then.",
                    "label": 0
                },
                {
                    "sent": "Annotate.",
                    "label": 0
                },
                {
                    "sent": "This for example.",
                    "label": 0
                },
                {
                    "sent": "A country or location maybe?",
                    "label": 0
                },
                {
                    "sent": "And this is the way in which you can annotate different things, put things in different sets and so on.",
                    "label": 0
                },
                {
                    "sent": "OK, as a human?",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So I'm basically this is what we have here.",
                    "label": 0
                },
                {
                    "sent": "So you have that this is an old interface, but you can do all that we we saw in the.",
                    "label": 0
                },
                {
                    "sent": "Small Dick OK so you can ask.",
                    "label": 0
                },
                {
                    "sent": "You can create validation text.",
                    "label": 0
                },
                {
                    "sent": "We can add annotations to the different annotation sets.",
                    "label": 0
                },
                {
                    "sent": "We can modify the edges of the annotation.",
                    "label": 0
                },
                {
                    "sent": "You know the boundaries where you can do also other fancy things like change the colors and and so on.",
                    "label": 0
                },
                {
                    "sent": "And obviously, if a person is annotating a document using the Get user interface, that person would like to save the documents for future use.",
                    "label": 0
                },
                {
                    "sent": "And or save a whole collection of documents for future use so that there is a way to do that.",
                    "label": 0
                },
                {
                    "sent": "Engage and what you can do is to save the annotations within the gate documents.",
                    "label": 0
                },
                {
                    "sent": "Or you can save the annotations.",
                    "label": 0
                },
                {
                    "sent": "In in, in different formats OK. And if you have different documents that have been put into a corpus, what you can do is also to save the corpus.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I hope.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So this.",
                    "label": 0
                },
                {
                    "sent": "Idea of annotating texts and producing annotated corpora an it's been done for system development.",
                    "label": 0
                },
                {
                    "sent": "So basically what you need to do, what you need to do is to have a set of humans to create what is called the standard that will contain the manual annotations.",
                    "label": 0
                },
                {
                    "sent": "This call list and are usually is divided into 3 parts.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well can be 2 parts, but sometimes it's better than three, so training part A testing part and an evaluation portion.",
                    "label": 0
                },
                {
                    "sent": "So what you do is to basically take the training part device or develop your system or learn your system based on the training part and then you can use the testing part to adjust some parameters and then finally when you have decided that all the parameters had been optimized you use evaluation portion of the.",
                    "label": 0
                },
                {
                    "sent": "System to measure the performance of the extraction system.",
                    "label": 0
                },
                {
                    "sent": "In this case OK. Anne.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, this is the only things that we will see about my rotations.",
                    "label": 0
                },
                {
                    "sent": "Now we're going.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To see a little bit about applications engage.",
                    "label": 0
                },
                {
                    "sent": "So applications engage I created by sequencing processing resources and these applications can be run over a corpus of documents, and in this case we call this applications in corpus pipeline.",
                    "label": 1
                },
                {
                    "sent": "So basically you sequence a set of components and then each one will be applied over a document in the corpus of sequence.",
                    "label": 0
                },
                {
                    "sent": "And sometimes what you want is not to have my corpus associated with the task, not a corpus inputs, and in this case what you will use is pipeline instead of corpus pipeline.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we saw this before, but this is a typical application of of gates where you will have this.",
                    "label": 0
                },
                {
                    "sent": "Set of components here have been somehow sequences.",
                    "label": 0
                },
                {
                    "sent": "In this application an applied to this particular corpus that contains this particular documents.",
                    "label": 0
                },
                {
                    "sent": "To produce these annotations OK.",
                    "label": 0
                },
                {
                    "sent": "So we will see a little.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In detail, this processing tools from gates.",
                    "label": 1
                },
                {
                    "sent": "First, what we have is a documented structural horizon, but this one is called automatically when you load it documenting gates so you don't need to.",
                    "label": 0
                },
                {
                    "sent": "To call it in particular, then we will see a process of tokenization.",
                    "label": 0
                },
                {
                    "sent": "Identifying words in text, process of sentence, identification of sentences, splitting that identify sentence in documents, and process that associated lexical categories to words in documents.",
                    "label": 1
                },
                {
                    "sent": "Process of morphological analysis, analysis and also understanding process.",
                    "label": 1
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "And all these things that I mentioned here have our language processing resources.",
                    "label": 0
                },
                {
                    "sent": "There is an error there.",
                    "label": 0
                },
                {
                    "sent": "Is this language resources.",
                    "label": 0
                },
                {
                    "sent": "Processing resources that have runtime parameters that you can set.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so engage.",
                    "label": 0
                },
                {
                    "sent": "These resources are known as a collection of reusable objects for language engineering or kreole.",
                    "label": 1
                },
                {
                    "sent": "And are specified in Creole idiotic DOT XML file.",
                    "label": 0
                },
                {
                    "sent": "So basically what this file provides is any specification of all the components that Gates understands.",
                    "label": 0
                },
                {
                    "sent": "Each components Becausw gate is in Java, each component is implemented in a Java class.",
                    "label": 0
                },
                {
                    "sent": "OK, so in this Crayola dot XML file what you have to say is which which jar files to use and which Java class implements the components.",
                    "label": 0
                },
                {
                    "sent": "So this is an example of, for example, of the tokenizer, as it is specified in the qualifier, and it's a bit small.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But here you say the name of the component, and here you specify the class which will implement the component indicator chart library.",
                    "label": 0
                },
                {
                    "sent": "In this case, and these are from here to.",
                    "label": 0
                },
                {
                    "sent": "Here are parameters that that component will need.",
                    "label": 0
                },
                {
                    "sent": "For to be able to run.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK. OK, the first process that we're going to see is that organization process that identifies different types of words in texts can be numbers, symbols, or words.",
                    "label": 0
                },
                {
                    "sent": "It is worth noting that is not only sequences of.",
                    "label": 1
                },
                {
                    "sent": "Characters between spaces or separators, but for example, some consideration had to be taken for particular types of words, for example to.",
                    "label": 0
                },
                {
                    "sent": "Call on to South East, North to.",
                    "label": 0
                },
                {
                    "sent": "Add 2, and procedures, but will be a whole entity so that things have to be taken into account in that organization process and that the form I for example will be recognized as as 2 words.",
                    "label": 0
                },
                {
                    "sent": "I know something like basis 20 will be recognized at two different tokens and we will leave the process of grouping together these two things for, for example, for a mobile offer named entity recognition, if that would be appropriate.",
                    "label": 0
                },
                {
                    "sent": "At organization Engage is based on rules, so you have rules of that form.",
                    "label": 0
                },
                {
                    "sent": "A left hand side and around high side.",
                    "label": 0
                },
                {
                    "sent": "In the left hand side what you specify is a regular expression over character classes and the some examples of.",
                    "label": 0
                },
                {
                    "sent": "Offers are there in the right hand side.",
                    "label": 1
                },
                {
                    "sent": "What you specify is the type of annotation to be created and the features and values that you want to add to the annotation.",
                    "label": 0
                },
                {
                    "sent": "When that particular expressions found in text.",
                    "label": 0
                },
                {
                    "sent": "So for example, the first rule says that if you find a sequence of digital of digits, basically what you will create in the with that.",
                    "label": 0
                },
                {
                    "sent": "Create is a token annotation and you will put a feature kind number to that particular annotation.",
                    "label": 0
                },
                {
                    "sent": "The Tokenizer will produce one type of annotation.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Produces the token type of annotation.",
                    "label": 0
                },
                {
                    "sent": "And the features that will be given to that particular type of annotation are the string that was identified, the orthography of the string can be, for example, that they work starts with an uppercase upper cap.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Or that they were installing capitals, or that the world is mixed mixture between uppercase and lowercase, the length of the token and the kind of token order type.",
                    "label": 1
                },
                {
                    "sent": "Like if it is awarded symbol iteration and number, and the Tokenizer will also produces paper space tokens to a story.",
                    "label": 0
                },
                {
                    "sent": "Information about control characters and spaces.",
                    "label": 0
                },
                {
                    "sent": "Let's see how we call it.",
                    "label": 0
                },
                {
                    "sent": "OK, nicely engage so things will become a little bit clearer.",
                    "label": 0
                },
                {
                    "sent": "I will close this document here.",
                    "label": 0
                },
                {
                    "sent": "And the first thing I will do is to create a corpus that we mentioned before.",
                    "label": 0
                },
                {
                    "sent": "So here it gets called, pushes the language resource.",
                    "label": 0
                },
                {
                    "sent": "You can give a name to it.",
                    "label": 0
                },
                {
                    "sent": "And if you double click in the corpus, you get a screen where you can add documents to the corpus OK.",
                    "label": 0
                },
                {
                    "sent": "So you can.",
                    "label": 0
                },
                {
                    "sent": "For example, use these to add a particular document to the corpus.",
                    "label": 0
                },
                {
                    "sent": "We have only one document, so we put it there OK. You can also eliminate documents from corpus with this code OK. And now what we're going to do is to create a tokenizer.",
                    "label": 0
                },
                {
                    "sent": "Is this component that is here in our new English tokenizer?",
                    "label": 0
                },
                {
                    "sent": "So I click on it.",
                    "label": 0
                },
                {
                    "sent": "There are a number of parameters.",
                    "label": 0
                },
                {
                    "sent": "The parameters that are here are basically the rules of the tokenizer.",
                    "label": 0
                },
                {
                    "sent": "The rules that we just saw in the previous slide, and these rules can be modified by you, so you can copy that slide to other place in your disk.",
                    "label": 0
                },
                {
                    "sent": "You can modify the rules and generate rules for another tokenization process.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So all this comes with the gate distribution, so you can.",
                    "label": 0
                },
                {
                    "sent": "Other.",
                    "label": 0
                },
                {
                    "sent": "This rules to your particular application.",
                    "label": 0
                },
                {
                    "sent": "So I can give a name to look and I said I won't be rich because it will create one by default.",
                    "label": 0
                },
                {
                    "sent": "So now what the system has done is create a tokenizer that is available for me to use.",
                    "label": 0
                },
                {
                    "sent": "And I want to run this tokenizer over all the documents in this corpus.",
                    "label": 0
                },
                {
                    "sent": "So what they would do is to create an application and I said that you can do two things.",
                    "label": 0
                },
                {
                    "sent": "One is a pipeline that doesn't need a corpus and another is a corpus pipeline.",
                    "label": 0
                },
                {
                    "sent": "That will work over a corpus, so I will.",
                    "label": 0
                },
                {
                    "sent": "I will create a corpus pipeline application.",
                    "label": 0
                },
                {
                    "sent": "And again, if I double click on this I also get.",
                    "label": 0
                },
                {
                    "sent": "An interface.",
                    "label": 0
                },
                {
                    "sent": "What I can do is to add components to this application.",
                    "label": 0
                },
                {
                    "sent": "OK, the only component available is the tokenizer, so I will put it there.",
                    "label": 0
                },
                {
                    "sent": "OK, so this has the components that make up this application.",
                    "label": 0
                },
                {
                    "sent": "In this navigation screen, what you have also is a parameter to set the corpus that you want to use to run your application.",
                    "label": 0
                },
                {
                    "sent": "So there is only one corpus available here, so I will select that one and what they will use to run.",
                    "label": 0
                },
                {
                    "sent": "There the application over that corpus if we look at the documents again.",
                    "label": 0
                },
                {
                    "sent": "What I will do is to 1st delete this.",
                    "label": 0
                },
                {
                    "sent": "Delete this.",
                    "label": 0
                },
                {
                    "sent": "Did this OK, so that the corpus looks like the corpus of with the document of help originally.",
                    "label": 0
                },
                {
                    "sent": "And now what they will do is to run this application over the corpus with this run.",
                    "label": 0
                },
                {
                    "sent": "And now again, there is something here you see.",
                    "label": 1
                },
                {
                    "sent": "The top case of the documents.",
                    "label": 0
                },
                {
                    "sent": "So things that have been produced.",
                    "label": 0
                },
                {
                    "sent": "So for example, it says that there is a token from position 95 to position and TAS and you have the features.",
                    "label": 0
                },
                {
                    "sent": "It should not be sent word of length three of an upper initial Ann Street.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "The other annotation that was produced, this one is space token.",
                    "label": 0
                },
                {
                    "sent": "Where basically you have the spaces on the control characters.",
                    "label": 0
                },
                {
                    "sent": "The SEC.",
                    "label": 0
                },
                {
                    "sent": "Process that we're going to see is the sentence.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Splitter that is the process that has to create sentences.",
                    "label": 0
                },
                {
                    "sent": "Sentence annotations for the documents.",
                    "label": 0
                },
                {
                    "sent": "Basically what we have to decide is whether or not where a sentence ends.",
                    "label": 1
                },
                {
                    "sent": "So if you use just punctuation, you will not get it because there are conditions under which.",
                    "label": 0
                },
                {
                    "sent": "Is not.",
                    "label": 0
                },
                {
                    "sent": "Is not the marker for end of sentences.",
                    "label": 1
                },
                {
                    "sent": "So there is a rule use engage to identify sentence boundaries.",
                    "label": 0
                },
                {
                    "sent": "It uses a list of abbreviations.",
                    "label": 1
                },
                {
                    "sent": "And like Doctor for example to decide whether or not a.",
                    "label": 0
                },
                {
                    "sent": "A full stop is the end of the sentence.",
                    "label": 0
                },
                {
                    "sent": "And the role that this uses that will that second bullet point.",
                    "label": 0
                },
                {
                    "sent": "So it.",
                    "label": 0
                },
                {
                    "sent": "The sentence great if it is preceded by an abbreviation and followed by an uppercase common word and the sentences splitter engaged produces a sentence type of annotation.",
                    "label": 1
                },
                {
                    "sent": "So if we go now to.",
                    "label": 0
                },
                {
                    "sent": "I would example.",
                    "label": 0
                },
                {
                    "sent": "So, so the synthesis splitter is another processing reserve.",
                    "label": 0
                },
                {
                    "sent": "So is this one?",
                    "label": 0
                },
                {
                    "sent": "So if we call it?",
                    "label": 0
                },
                {
                    "sent": "So what you have here is.",
                    "label": 0
                },
                {
                    "sent": "The parameters that you're going to use.",
                    "label": 0
                },
                {
                    "sent": "One is the list of abbreviations that the system uses.",
                    "label": 0
                },
                {
                    "sent": "You can modify that and adapt it to your own language.",
                    "label": 0
                },
                {
                    "sent": "And then there is a set of grammars.",
                    "label": 0
                },
                {
                    "sent": "We will see grammars later on.",
                    "label": 0
                },
                {
                    "sent": "But basically if you add up the list of abbreviations, you will get the new sentences picture.",
                    "label": 0
                },
                {
                    "sent": "So I will leave OK and create this intense splitter.",
                    "label": 0
                },
                {
                    "sent": "I have it there now.",
                    "label": 0
                },
                {
                    "sent": "And now if we go to the application.",
                    "label": 0
                },
                {
                    "sent": "Here again.",
                    "label": 0
                },
                {
                    "sent": "So we can add after the tokenization process.",
                    "label": 0
                },
                {
                    "sent": "We cannot process of sentence identification.",
                    "label": 0
                },
                {
                    "sent": "OK, so first the tokenization process and then sentence identification OK.",
                    "label": 0
                },
                {
                    "sent": "Sometimes it is useful when you are testing with the gate user interface to have a process that is called annotation document reset.",
                    "label": 0
                },
                {
                    "sent": "That what we'll do is to delete all the annotations in the default annotation set.",
                    "label": 0
                },
                {
                    "sent": "So it's useful to have it because sometimes you are testing things you want to run it again without the previous annotations as well generated.",
                    "label": 0
                },
                {
                    "sent": "So what we do is to put this here as well, but we want this to be the first element to be applied to the document, OK?",
                    "label": 0
                },
                {
                    "sent": "So basically this will remove all the rotations.",
                    "label": 0
                },
                {
                    "sent": "Basically will remove space token and token OK. Then will run the tokenizer and then cause the sentence splitter needs the tokenizer.",
                    "label": 0
                },
                {
                    "sent": "Then we run the sentences, but.",
                    "label": 0
                },
                {
                    "sent": "So again, I will come here and I will run it over the corpus.",
                    "label": 0
                },
                {
                    "sent": "So if we go through the documents now we have.",
                    "label": 0
                },
                {
                    "sent": "In addition to the tokens.",
                    "label": 0
                },
                {
                    "sent": "And the space.",
                    "label": 0
                },
                {
                    "sent": "OK, we have just one location that tells me.",
                    "label": 0
                },
                {
                    "sent": "Where the sentence starts and where the sentence adds OK. OK.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The third process that we are going to, the third component that we're going to see is the part of speech tagger that these days on the water bike Mark Whipple and part of speech tagger.",
                    "label": 0
                },
                {
                    "sent": "What it does is procs part of speech tag or a lexical category to each word in the document, and attacks come from a particular set of tasks.",
                    "label": 1
                },
                {
                    "sent": "That is the.",
                    "label": 0
                },
                {
                    "sent": "Ben at three bank corpus.",
                    "label": 1
                },
                {
                    "sent": "And the method that is used to produce the tax is based on.",
                    "label": 0
                },
                {
                    "sent": "Well known methods developed by Brill.",
                    "label": 1
                },
                {
                    "sent": "But in order to produce the tagger, people uses a different learning approach where he doesn't need to renovate corpus to learn the different rules of the system.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 1
                },
                {
                    "sent": "The system is based on the guessing of an initial tag for each word in the document, so each usually each word will have multiple possible tags, so the system first associate the most probable category to each word and then has a set of rules to correct.",
                    "label": 0
                },
                {
                    "sent": "To correct state to correct the initial tax based on context.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is a.",
                    "label": 0
                },
                {
                    "sent": "This is the set of tags that is being used by this particular tagger.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The part of speech tagging process uses 2 resources.",
                    "label": 0
                },
                {
                    "sent": "One is the lexecon that has been collected from a corpus.",
                    "label": 0
                },
                {
                    "sent": "And the form of the lexicon is that you have a warm and then at least of possible tags.",
                    "label": 0
                },
                {
                    "sent": "So for example the.",
                    "label": 0
                },
                {
                    "sent": "The word employees has only one tag that is.",
                    "label": 0
                },
                {
                    "sent": "Adverb a third person.",
                    "label": 0
                },
                {
                    "sent": "And they were like empty, fast, three different interpretations.",
                    "label": 0
                },
                {
                    "sent": "The order of the tags.",
                    "label": 1
                },
                {
                    "sent": "Object if there were not third person.",
                    "label": 0
                },
                {
                    "sent": "And so the order represents the frequency in which this tax has been observed in the corpus associated to the particular world.",
                    "label": 0
                },
                {
                    "sent": "The system also customary sticks to tag words that are not known that were not in the original colors.",
                    "label": 0
                },
                {
                    "sent": "For example, a word that ends in PNG probably will be tagged as in our assay.",
                    "label": 0
                },
                {
                    "sent": "An initial guess.",
                    "label": 0
                },
                {
                    "sent": "And then there are the rules to correct mistakes are.",
                    "label": 0
                },
                {
                    "sent": "Of that form, for example.",
                    "label": 0
                },
                {
                    "sent": "The second bullet point an that basically they said they tell you change attack A by attack B if a particular condition occurs.",
                    "label": 0
                },
                {
                    "sent": "And what does the part of speech tagger engaged is to produce a feature for each token in the document?",
                    "label": 1
                },
                {
                    "sent": "The feature is the feature category and the value of that particular feature will be one of the.",
                    "label": 1
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Part of his speech tags that appear in this list OK.",
                    "label": 0
                },
                {
                    "sent": "So let's see how we produce.",
                    "label": 0
                },
                {
                    "sent": "We annotate with part of speech taxes, document.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "So this is the resource any of stagger, and these are the two sets of parameters.",
                    "label": 0
                },
                {
                    "sent": "What is the lexicon that you can modify and the other is the set of rules.",
                    "label": 1
                },
                {
                    "sent": "Sometimes you can put some rules that you believe will work, but obviously it's better to have the rules learn from a corpus.",
                    "label": 0
                },
                {
                    "sent": "And then what I will do is to come here again and create up to this application the part of speech tagger OK?",
                    "label": 0
                },
                {
                    "sent": "And then I run it over.",
                    "label": 1
                },
                {
                    "sent": "The corpus if I go to the document.",
                    "label": 1
                },
                {
                    "sent": "So we said that there is nothing new that is created, but in the token what you will have now is the feature category.",
                    "label": 0
                },
                {
                    "sent": "Equals for example.",
                    "label": 0
                },
                {
                    "sent": "In this case an MP, so it properly OK. For example here that they go request.",
                    "label": 0
                },
                {
                    "sent": "OK. OK, any questions?",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Can we sorry?",
                    "label": 0
                },
                {
                    "sent": "There is.",
                    "label": 0
                },
                {
                    "sent": "There is a way to do that and we will.",
                    "label": 0
                },
                {
                    "sent": "We will see it tomorrow when I show how you can use.",
                    "label": 0
                },
                {
                    "sent": "A Java program to do that.",
                    "label": 0
                },
                {
                    "sent": "OK, we see that tomorrow will start doing.",
                    "label": 1
                },
                {
                    "sent": "We start doing exactly what we have done here in a Java program.",
                    "label": 0
                },
                {
                    "sent": "So you see how you can create your applications without relying on the graphical user interface.",
                    "label": 0
                },
                {
                    "sent": "And later on we will see how to select particular things from the documents.",
                    "label": 0
                },
                {
                    "sent": "OK, I think that we have to close now.",
                    "label": 0
                },
                {
                    "sent": "Anymore questions.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "The K distribution.",
                    "label": 0
                },
                {
                    "sent": "I think you have to go to SourceForge and install it.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "OK. OK try but if I will be able to do it I will try.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "More questions.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}