{
    "id": "xammq6kelgwj7u7yy3s6l4oaitknlmnw",
    "title": "Building Reconstruction using Manhattan-World Grammars",
    "info": {
        "author": [
            "Carlos A. Vanegas, Department of Computer Science, Purdue University"
        ],
        "published": "July 19, 2010",
        "recorded": "June 2010",
        "category": [
            "Top->Computer Science->Computer Vision->Shape Analysis"
        ]
    },
    "url": "http://videolectures.net/cvpr2010_vanegas_brum/",
    "segmentation": [
        [
            "Alright, so our next speaker is Carlos Vanegas and he's going to talk about building reconstruction using Manhattan World grammars.",
            "OK, thanks for the introduction."
        ],
        [
            "The objective of this work is to create a passive method for automatic reconstruction of buildings from existing object angle images and GIS databases."
        ],
        [
            "So the problem of creating 3D texture models of buildings is relevant to multiple applications, including navigation, urban planning and visualization, simulation and training, and different types of real time graphics."
        ],
        [
            "The motivation for our approach came from realizing that a large amount of aerial imagery of urban areas has become available recently and has been made available through Internet based services such as Bing Maps and Google Maps and so on.",
            "So."
        ],
        [
            "Sort of developing a passive approach that specifically exploits this data for building reconstruction."
        ],
        [
            "The problem we aim to solve here is how to go from oblock angle aerial images with register partial geometry."
        ],
        [
            "Two 3D texture models of buildings."
        ],
        [
            "So to solve this problem which we face the usual challenges of image based reconstruction, including noise and input data, the lack of photos from certain angles, different lighting conditions in photos taken from different angles or also at different times of the day occlusion shadows.",
            "And then in this work, we have particularly focused on the 1st three challenges."
        ],
        [
            "So we have observed that in many buildings there is a predominance of three mutually orthogonal phase directions, and this is called a Manhattan world assumption.",
            "And then these buildings can be represented by a parametric grammar describing a complex set of transitions between consecutive floors, and then we have.",
            "So we would like eventually to come out with the grammar that encodes these transition types and also with a set of parameters that encode the exact shape.",
            "So parameters for the rules of the grammar that encodes the exact shape of the building."
        ],
        [
            "Our approaches stand roughly as follows.",
            "First we generate an initial 3D building envelope."
        ],
        [
            "And for this we just extrude the bounding box of the building footprint that is extracted from the calibrated GIS data."
        ],
        [
            "Next we divide the initial model into a sequence of floors."
        ],
        [
            "And then for each of those floors, we automatically refine the initial geometry so that we can better match the geometry of the model that is observed in the images."
        ],
        [
            "Here's an example results showing different steps.",
            "So these are the type of kind of input photos that we get from Bing Maps."
        ],
        [
            "Then we apply a mean shift color segmentation and do Windows removal from those images."
        ],
        [
            "And this yellow contours are the refined geometry for the floors."
        ],
        [
            "And finally, the reconstructed 3D model together with projective texture mapping."
        ],
        [
            "So this is the outline for the rest of the talk."
        ],
        [
            "Briefly going to talk about previous work."
        ],
        [
            "So of course there have been quite a number of methods for building acquisition, including method space on laser scanning and lighter.",
            "There are also methods for ground level video and then some methods in manual reconstruction from photographs."
        ],
        [
            "Grammars have also been used in the past for building reconstruction and procedural modeling.",
            "There have been works in single View reconstruction, procedural modeling of buildings and facades, an other works, and then some common limitations of these approaches are robustness to noise in input data and missing surface is so we attempt to overcome these limitations using the Manhattan world assumption and coming up with a with a grammar that will help us to do so."
        ],
        [
            "The Manhattan world assumption was defined by coughing and oil in 99 and it just says that in and observe scene there is a predominance of three mutually orthogonal face directions.",
            "This has been used in the past in computer vision methods for reconstructing building interiors, and also multiview stereo for outdoor buildings, among others."
        ],
        [
            "So let me know briefly explain the Manhattan building grammar that we developed for this particular method."
        ],
        [
            "Our grammar exploits the constraints that are present amongst the floors of a building.",
            "Those constraints, sorry, an.",
            "It also provides compact representation of the building envelope.",
            "It allows for successive applications of rewriting rule that modifies the initial building geometry."
        ],
        [
            "And then this is the building representation.",
            "the Manhattan worldbuilding representation that we use within these grammar.",
            "So each building is represented as a sequence of floor, and each of those floors is represented as a sequence of faces.",
            "And then the string representation of a building floor uses an alphabet A where FL is a floor contour segment of length L, and then the symbols plus and minus are operations that change the orientation of the next segment by 90 degrees.",
            "So to convey."
        ],
        [
            "To string into floor geometry, as you might have noticed, we basically just use it.",
            "Total graphics formulation and this is an example of a floor geometry and its corresponding string."
        ],
        [
            "To modify the building geometry, we define a rewriting system.",
            "And we also notice that floor shape changes from one floor to another can be achieved with one or more of three transitions that we call L shape U shape and pushbacks and these are."
        ],
        [
            "Illustrations of each type of transition."
        ],
        [
            "Now it turns out that we can encode all of these transitions into one single rule with this form that you see in the slide.",
            "And then for non zero values with a B&C we have a U shape transition and then if one or more of a B and CR0 we have either an L shape transition or push back transition but thing to notice here is that they are all represented with the same transition rule."
        ],
        [
            "When we applied the generalized rewriting rule above, we consider some constraints to ensure a plausible structure.",
            "For instance, we consider of close floor constraint, nonintersecting floor constraint and upwards containment constraint.",
            "And also a minimum interfloor an intra interfloor changes constraints, more details of these are in the paper of course."
        ],
        [
            "So let me now describe how the building reconstruction process works."
        ],
        [
            "The method consists of modifying each floor string to improve a measure of consistency between the building model and the capture images.",
            "The process starts from the ground floor and computes the consistency for each floor, and then when the consistency is low, we compute the parameter values for one or more applications of our generalized rewriting rule to modify the geometry."
        ],
        [
            "A key component of this reconstruction process is the computation of two signal functions.",
            "So there's a signal G that contains the geometric event and there's a signal I which registers the photometric events.",
            "And it used to find us so that your metric events are defined as turns in the floor contour of the building model and the photometric events are defined as significant pixel value changes along the projection of the contour onto the photos."
        ],
        [
            "This signal functions exploit exploit the observation that faces with different Manhattan world allowing normals will typically have different observed pixel values, and for this to be true, we assume that the captured images are taken from camera locations such as two adjacent faces are colored differently, and also that the appearance of Windows in shadows is not dominant in the photos."
        ],
        [
            "To compute the geometric signal G at a given floor."
        ],
        [
            "Register the corners of the contour as events along the signal, so we basically unwrap the contour into this axis that you see at the bottom of the slide, and then each turn is."
        ],
        [
            "Registered as an impulse in this signal."
        ],
        [
            "And then we wait each event based on its distance to neighboring events.",
            "We want until really, we just want to give higher importance to events that are more distant from other events as ignoring such events could result in a large error in the overall floor shape.",
            "And Conversely, we want to give less importance to events that are very close to each other as they can just be details and they might add up for.",
            "It will make the approach less robust in general."
        ],
        [
            "So we the signals are dance move it to remove some noise that can lead to misinterpretation during the reconstruction."
        ],
        [
            "And this is what the geometric signal looks like.",
            "For this particular case."
        ],
        [
            "Ann, this is the symbolic form of the geometric signal."
        ],
        [
            "Now, regarding the image signal or the photometric signal, excuse me, pixel value changes in the input photos along the projected contour are also registered as events.",
            "So for the photo that you see on the left of the slide."
        ],
        [
            "This would be the events that."
        ],
        [
            "Are detected."
        ],
        [
            "And this is not only done for one image, but for all the available input photos that can be taken from different angles and all of the events are actually registered in a single signal."
        ],
        [
            "So this is the combination of signals from two different photos.",
            "Notice that this is very useful to support an arbitrary number of input photos, each of which can contribute more detail to the reconstruction."
        ],
        [
            "This is the signal computed from the events in observing all the."
        ],
        [
            "Photos and the same weighting and smoothing scheme are applied to this signal."
        ],
        [
            "So in general, the mismatches between signals G and I occur when the counter geometry has not yet been refined or or modified.",
            "As you can notice in this image, there is a mismatch in the area enclosed by the yellow circle and then after the automatic geometry refinement."
        ],
        [
            "The signals that geometric signal in the photometric signal improve their matching a lot."
        ],
        [
            "And here's the matching improvement after geometry refinement in a real world example.",
            "So this is the matching error initially."
        ],
        [
            "And this is the matching of the geometric and photometric signals after geometry refinement."
        ],
        [
            "So the thought refining procedure determines if the geometry of the next floor up the building requires refinement or alteration.",
            "It also determines which segments of each floor need to be rewritten and also determines the parameter values for each application of the generalized rewriting rule."
        ],
        [
            "The rule is only applied when the correlation between the two signals is low.",
            "An only to the segments where the signal local mismatch.",
            "And we do this to speed up the process a little bit."
        ],
        [
            "Applying the generalized rewriting rule to a segment consists of determining the values of a B&C that maximize the correlation between the geometric signal and the photometric signal, and this is the correlation expression."
        ],
        [
            "So now the question is how to compute the rule parameter values AB&C."
        ],
        [
            "We run some experiments that show that the correlation of value varies smoothly.",
            "Here are some results of that experiment, so the the top image shows the correlation for in the vertical axis is the correlation for varying values of a B anfora constant value C. And then the bottom images show the surface is for three correlation values in the A * B * C space.",
            "So you can see that for increasing values of correlation in general the the areas of higher correlation converge to well localized optimums."
        ],
        [
            "So we exploit this behavior an our approach to find the near optimal ABC values consists of coarsely sampling the space ABC 1st and then we run a nonlinear least squares optimization starting from the triples ABC of highest correlation values."
        ],
        [
            "So."
        ],
        [
            "Here are some results obtained with our method.",
            "The building in the first row is reconstructed by applying a sequence of pushbacks at different Heights in two of the building facades.",
            "And then the building in the 2nd row shows a.",
            "It's a building obtained by applying two U shape instances of the generalized rewriting rule in two of the facades.",
            "So these are fairly simple cases of rule application.",
            "In this results, the first roll shows a building with an instance of an L shape rule applied on a lower."
        ],
        [
            "Floor followed by several pushbacks in the upper floors.",
            "Notice at the lower part of two of the facades is included either by neighboring buildings or by trees.",
            "These occlusions are overcome by the fact that the generalized rewriting the rule that we use is only applied if the correlation is significantly improved after the application of the rule.",
            "If it's not improved, we just ignore it and the geometry is not changed until the correlation is actually improved by rule application.",
            "The 2nd row shows a more complex building resulting from a sequence of L shape and pushback instances.",
            "One of the facades does not strictly follow the Manhattan world assumption, as you can see in the photo, maybe, but there's still enough difference of intensity with respect to the neighboring phases of that facade.",
            "So are reasonable flat faces reconstructed for that fragment of the facade.",
            "So even if the building does not follow the Manhattan world assumption, we can match a flat face that more or less can reconstruct that curved facade."
        ],
        [
            "To conclude the talk, we have presented an automatic method to reconstruct 3D building models from calibrated aerial imagery.",
            "The math develops a grammar based representation of Manhattan World buildings.",
            "The reconstruction process consists of sequentially refining a coarse initial building model, which can be just a box using a generalized rewriting rule.",
            "And the parameters for the generalized rewriting rule are computed based on color segment public angle images."
        ],
        [
            "Regarding future working limitations, it would be nice to explore the possibility of supporting simultaneous applications of the generalized rewriting rule to be able to expand the space of buildings that we are able to reconstruct.",
            "We would also like to better handle Shadows and Windows an for that we would explore some techniques in Windows symmetries and also perhaps some methods on like normal clustering.",
            "We would also like to add some symmetry based methods to improve the reconstruction of buildings with high occlusion.",
            "And finally, we would like to extend the grammar to buildings that lay in non Manhattan world."
        ],
        [
            "So that's it for the talk.",
            "I'll be happy to take your questions now or after the end of session.",
            "Thank you.",
            "Well, the purpose is to exploit these huge databases that we currently have.",
            "So let me repeat the question he's asking me basically why I'm doing this work.",
            "The purposes then to exploit the huge databases that there are available in the Internet for.",
            "3D reconstruction of buildings.",
            "So there is data out there that can be exploited to create 3D models or approximated 3D models, and that's what we intended to do with this method.",
            "Yes.",
            "Right, so so the question is if basically how strong the shadows and Windows assumption is.",
            "Well, the shadows are a problem and I'll be honest about the examples that we did.",
            "Straight in the paper, we actually try to avoid shadows because we're not explicitly dealing with shadows right now and again I mention it as part of future works because it would be nice to be able to remove the impact that shadows have on the reconstruction.",
            "So yeah, you're right about that.",
            "Yes, so maybe I'm missing one thing, but are you refining the floor from like bottom to top?",
            "That's right, so do you have a problem when you make a mistake in one floor?",
            "And I want if you mention some failure cases, that's that's a very good question.",
            "Actually, we thought about that an we still don't handle the case of if we make a mistake at the bottom then we would like to run the whole optimization again from the bottom.",
            "It's certainly an expansion of the work and it would make the method much more.",
            "Robust, so yeah, that's a very good point.",
            "OK.",
            "I'll thank you the speaker."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Alright, so our next speaker is Carlos Vanegas and he's going to talk about building reconstruction using Manhattan World grammars.",
                    "label": 0
                },
                {
                    "sent": "OK, thanks for the introduction.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The objective of this work is to create a passive method for automatic reconstruction of buildings from existing object angle images and GIS databases.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the problem of creating 3D texture models of buildings is relevant to multiple applications, including navigation, urban planning and visualization, simulation and training, and different types of real time graphics.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The motivation for our approach came from realizing that a large amount of aerial imagery of urban areas has become available recently and has been made available through Internet based services such as Bing Maps and Google Maps and so on.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sort of developing a passive approach that specifically exploits this data for building reconstruction.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The problem we aim to solve here is how to go from oblock angle aerial images with register partial geometry.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Two 3D texture models of buildings.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to solve this problem which we face the usual challenges of image based reconstruction, including noise and input data, the lack of photos from certain angles, different lighting conditions in photos taken from different angles or also at different times of the day occlusion shadows.",
                    "label": 0
                },
                {
                    "sent": "And then in this work, we have particularly focused on the 1st three challenges.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we have observed that in many buildings there is a predominance of three mutually orthogonal phase directions, and this is called a Manhattan world assumption.",
                    "label": 0
                },
                {
                    "sent": "And then these buildings can be represented by a parametric grammar describing a complex set of transitions between consecutive floors, and then we have.",
                    "label": 0
                },
                {
                    "sent": "So we would like eventually to come out with the grammar that encodes these transition types and also with a set of parameters that encode the exact shape.",
                    "label": 0
                },
                {
                    "sent": "So parameters for the rules of the grammar that encodes the exact shape of the building.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our approaches stand roughly as follows.",
                    "label": 0
                },
                {
                    "sent": "First we generate an initial 3D building envelope.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And for this we just extrude the bounding box of the building footprint that is extracted from the calibrated GIS data.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Next we divide the initial model into a sequence of floors.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then for each of those floors, we automatically refine the initial geometry so that we can better match the geometry of the model that is observed in the images.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here's an example results showing different steps.",
                    "label": 0
                },
                {
                    "sent": "So these are the type of kind of input photos that we get from Bing Maps.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then we apply a mean shift color segmentation and do Windows removal from those images.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this yellow contours are the refined geometry for the floors.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And finally, the reconstructed 3D model together with projective texture mapping.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is the outline for the rest of the talk.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Briefly going to talk about previous work.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So of course there have been quite a number of methods for building acquisition, including method space on laser scanning and lighter.",
                    "label": 0
                },
                {
                    "sent": "There are also methods for ground level video and then some methods in manual reconstruction from photographs.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Grammars have also been used in the past for building reconstruction and procedural modeling.",
                    "label": 0
                },
                {
                    "sent": "There have been works in single View reconstruction, procedural modeling of buildings and facades, an other works, and then some common limitations of these approaches are robustness to noise in input data and missing surface is so we attempt to overcome these limitations using the Manhattan world assumption and coming up with a with a grammar that will help us to do so.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The Manhattan world assumption was defined by coughing and oil in 99 and it just says that in and observe scene there is a predominance of three mutually orthogonal face directions.",
                    "label": 0
                },
                {
                    "sent": "This has been used in the past in computer vision methods for reconstructing building interiors, and also multiview stereo for outdoor buildings, among others.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let me know briefly explain the Manhattan building grammar that we developed for this particular method.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our grammar exploits the constraints that are present amongst the floors of a building.",
                    "label": 0
                },
                {
                    "sent": "Those constraints, sorry, an.",
                    "label": 0
                },
                {
                    "sent": "It also provides compact representation of the building envelope.",
                    "label": 0
                },
                {
                    "sent": "It allows for successive applications of rewriting rule that modifies the initial building geometry.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then this is the building representation.",
                    "label": 1
                },
                {
                    "sent": "the Manhattan worldbuilding representation that we use within these grammar.",
                    "label": 0
                },
                {
                    "sent": "So each building is represented as a sequence of floor, and each of those floors is represented as a sequence of faces.",
                    "label": 1
                },
                {
                    "sent": "And then the string representation of a building floor uses an alphabet A where FL is a floor contour segment of length L, and then the symbols plus and minus are operations that change the orientation of the next segment by 90 degrees.",
                    "label": 1
                },
                {
                    "sent": "So to convey.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To string into floor geometry, as you might have noticed, we basically just use it.",
                    "label": 0
                },
                {
                    "sent": "Total graphics formulation and this is an example of a floor geometry and its corresponding string.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To modify the building geometry, we define a rewriting system.",
                    "label": 0
                },
                {
                    "sent": "And we also notice that floor shape changes from one floor to another can be achieved with one or more of three transitions that we call L shape U shape and pushbacks and these are.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Illustrations of each type of transition.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now it turns out that we can encode all of these transitions into one single rule with this form that you see in the slide.",
                    "label": 0
                },
                {
                    "sent": "And then for non zero values with a B&C we have a U shape transition and then if one or more of a B and CR0 we have either an L shape transition or push back transition but thing to notice here is that they are all represented with the same transition rule.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When we applied the generalized rewriting rule above, we consider some constraints to ensure a plausible structure.",
                    "label": 0
                },
                {
                    "sent": "For instance, we consider of close floor constraint, nonintersecting floor constraint and upwards containment constraint.",
                    "label": 0
                },
                {
                    "sent": "And also a minimum interfloor an intra interfloor changes constraints, more details of these are in the paper of course.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let me now describe how the building reconstruction process works.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The method consists of modifying each floor string to improve a measure of consistency between the building model and the capture images.",
                    "label": 0
                },
                {
                    "sent": "The process starts from the ground floor and computes the consistency for each floor, and then when the consistency is low, we compute the parameter values for one or more applications of our generalized rewriting rule to modify the geometry.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A key component of this reconstruction process is the computation of two signal functions.",
                    "label": 0
                },
                {
                    "sent": "So there's a signal G that contains the geometric event and there's a signal I which registers the photometric events.",
                    "label": 0
                },
                {
                    "sent": "And it used to find us so that your metric events are defined as turns in the floor contour of the building model and the photometric events are defined as significant pixel value changes along the projection of the contour onto the photos.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This signal functions exploit exploit the observation that faces with different Manhattan world allowing normals will typically have different observed pixel values, and for this to be true, we assume that the captured images are taken from camera locations such as two adjacent faces are colored differently, and also that the appearance of Windows in shadows is not dominant in the photos.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To compute the geometric signal G at a given floor.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Register the corners of the contour as events along the signal, so we basically unwrap the contour into this axis that you see at the bottom of the slide, and then each turn is.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Registered as an impulse in this signal.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then we wait each event based on its distance to neighboring events.",
                    "label": 0
                },
                {
                    "sent": "We want until really, we just want to give higher importance to events that are more distant from other events as ignoring such events could result in a large error in the overall floor shape.",
                    "label": 0
                },
                {
                    "sent": "And Conversely, we want to give less importance to events that are very close to each other as they can just be details and they might add up for.",
                    "label": 0
                },
                {
                    "sent": "It will make the approach less robust in general.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we the signals are dance move it to remove some noise that can lead to misinterpretation during the reconstruction.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is what the geometric signal looks like.",
                    "label": 0
                },
                {
                    "sent": "For this particular case.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ann, this is the symbolic form of the geometric signal.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now, regarding the image signal or the photometric signal, excuse me, pixel value changes in the input photos along the projected contour are also registered as events.",
                    "label": 0
                },
                {
                    "sent": "So for the photo that you see on the left of the slide.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This would be the events that.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Are detected.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is not only done for one image, but for all the available input photos that can be taken from different angles and all of the events are actually registered in a single signal.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is the combination of signals from two different photos.",
                    "label": 0
                },
                {
                    "sent": "Notice that this is very useful to support an arbitrary number of input photos, each of which can contribute more detail to the reconstruction.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the signal computed from the events in observing all the.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Photos and the same weighting and smoothing scheme are applied to this signal.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in general, the mismatches between signals G and I occur when the counter geometry has not yet been refined or or modified.",
                    "label": 0
                },
                {
                    "sent": "As you can notice in this image, there is a mismatch in the area enclosed by the yellow circle and then after the automatic geometry refinement.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The signals that geometric signal in the photometric signal improve their matching a lot.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And here's the matching improvement after geometry refinement in a real world example.",
                    "label": 0
                },
                {
                    "sent": "So this is the matching error initially.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is the matching of the geometric and photometric signals after geometry refinement.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the thought refining procedure determines if the geometry of the next floor up the building requires refinement or alteration.",
                    "label": 0
                },
                {
                    "sent": "It also determines which segments of each floor need to be rewritten and also determines the parameter values for each application of the generalized rewriting rule.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The rule is only applied when the correlation between the two signals is low.",
                    "label": 0
                },
                {
                    "sent": "An only to the segments where the signal local mismatch.",
                    "label": 0
                },
                {
                    "sent": "And we do this to speed up the process a little bit.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Applying the generalized rewriting rule to a segment consists of determining the values of a B&C that maximize the correlation between the geometric signal and the photometric signal, and this is the correlation expression.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now the question is how to compute the rule parameter values AB&C.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We run some experiments that show that the correlation of value varies smoothly.",
                    "label": 0
                },
                {
                    "sent": "Here are some results of that experiment, so the the top image shows the correlation for in the vertical axis is the correlation for varying values of a B anfora constant value C. And then the bottom images show the surface is for three correlation values in the A * B * C space.",
                    "label": 0
                },
                {
                    "sent": "So you can see that for increasing values of correlation in general the the areas of higher correlation converge to well localized optimums.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we exploit this behavior an our approach to find the near optimal ABC values consists of coarsely sampling the space ABC 1st and then we run a nonlinear least squares optimization starting from the triples ABC of highest correlation values.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here are some results obtained with our method.",
                    "label": 0
                },
                {
                    "sent": "The building in the first row is reconstructed by applying a sequence of pushbacks at different Heights in two of the building facades.",
                    "label": 0
                },
                {
                    "sent": "And then the building in the 2nd row shows a.",
                    "label": 0
                },
                {
                    "sent": "It's a building obtained by applying two U shape instances of the generalized rewriting rule in two of the facades.",
                    "label": 0
                },
                {
                    "sent": "So these are fairly simple cases of rule application.",
                    "label": 0
                },
                {
                    "sent": "In this results, the first roll shows a building with an instance of an L shape rule applied on a lower.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Floor followed by several pushbacks in the upper floors.",
                    "label": 0
                },
                {
                    "sent": "Notice at the lower part of two of the facades is included either by neighboring buildings or by trees.",
                    "label": 0
                },
                {
                    "sent": "These occlusions are overcome by the fact that the generalized rewriting the rule that we use is only applied if the correlation is significantly improved after the application of the rule.",
                    "label": 0
                },
                {
                    "sent": "If it's not improved, we just ignore it and the geometry is not changed until the correlation is actually improved by rule application.",
                    "label": 0
                },
                {
                    "sent": "The 2nd row shows a more complex building resulting from a sequence of L shape and pushback instances.",
                    "label": 0
                },
                {
                    "sent": "One of the facades does not strictly follow the Manhattan world assumption, as you can see in the photo, maybe, but there's still enough difference of intensity with respect to the neighboring phases of that facade.",
                    "label": 0
                },
                {
                    "sent": "So are reasonable flat faces reconstructed for that fragment of the facade.",
                    "label": 0
                },
                {
                    "sent": "So even if the building does not follow the Manhattan world assumption, we can match a flat face that more or less can reconstruct that curved facade.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To conclude the talk, we have presented an automatic method to reconstruct 3D building models from calibrated aerial imagery.",
                    "label": 0
                },
                {
                    "sent": "The math develops a grammar based representation of Manhattan World buildings.",
                    "label": 0
                },
                {
                    "sent": "The reconstruction process consists of sequentially refining a coarse initial building model, which can be just a box using a generalized rewriting rule.",
                    "label": 0
                },
                {
                    "sent": "And the parameters for the generalized rewriting rule are computed based on color segment public angle images.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Regarding future working limitations, it would be nice to explore the possibility of supporting simultaneous applications of the generalized rewriting rule to be able to expand the space of buildings that we are able to reconstruct.",
                    "label": 0
                },
                {
                    "sent": "We would also like to better handle Shadows and Windows an for that we would explore some techniques in Windows symmetries and also perhaps some methods on like normal clustering.",
                    "label": 0
                },
                {
                    "sent": "We would also like to add some symmetry based methods to improve the reconstruction of buildings with high occlusion.",
                    "label": 0
                },
                {
                    "sent": "And finally, we would like to extend the grammar to buildings that lay in non Manhattan world.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that's it for the talk.",
                    "label": 0
                },
                {
                    "sent": "I'll be happy to take your questions now or after the end of session.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Well, the purpose is to exploit these huge databases that we currently have.",
                    "label": 0
                },
                {
                    "sent": "So let me repeat the question he's asking me basically why I'm doing this work.",
                    "label": 0
                },
                {
                    "sent": "The purposes then to exploit the huge databases that there are available in the Internet for.",
                    "label": 0
                },
                {
                    "sent": "3D reconstruction of buildings.",
                    "label": 0
                },
                {
                    "sent": "So there is data out there that can be exploited to create 3D models or approximated 3D models, and that's what we intended to do with this method.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Right, so so the question is if basically how strong the shadows and Windows assumption is.",
                    "label": 0
                },
                {
                    "sent": "Well, the shadows are a problem and I'll be honest about the examples that we did.",
                    "label": 0
                },
                {
                    "sent": "Straight in the paper, we actually try to avoid shadows because we're not explicitly dealing with shadows right now and again I mention it as part of future works because it would be nice to be able to remove the impact that shadows have on the reconstruction.",
                    "label": 0
                },
                {
                    "sent": "So yeah, you're right about that.",
                    "label": 0
                },
                {
                    "sent": "Yes, so maybe I'm missing one thing, but are you refining the floor from like bottom to top?",
                    "label": 0
                },
                {
                    "sent": "That's right, so do you have a problem when you make a mistake in one floor?",
                    "label": 0
                },
                {
                    "sent": "And I want if you mention some failure cases, that's that's a very good question.",
                    "label": 0
                },
                {
                    "sent": "Actually, we thought about that an we still don't handle the case of if we make a mistake at the bottom then we would like to run the whole optimization again from the bottom.",
                    "label": 0
                },
                {
                    "sent": "It's certainly an expansion of the work and it would make the method much more.",
                    "label": 0
                },
                {
                    "sent": "Robust, so yeah, that's a very good point.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "I'll thank you the speaker.",
                    "label": 0
                }
            ]
        }
    }
}