{
    "id": "xc2uhbotwol4rc62vyew54xkergvd4lw",
    "title": "In Praise of Simplicity: Lexicographic Lightweight Markup Language",
    "info": {
        "author": [
            "Vladimír Benko, Faculty of Education, Comenius University in Bratislava, Comenius University in Bratislava"
        ],
        "published": "July 27, 2018",
        "recorded": "July 2018",
        "category": [
            "Top->Humanities->Linguistics->Lexicography",
            "Top->Social Sciences->Society",
            "Top->Computer Science"
        ]
    },
    "url": "http://videolectures.net/euralex2018_benko_lightweight/",
    "segmentation": [
        [
            "Hello hello everybody.",
            "One of the reviewers of my paper remarked that it's a more a note historical note.",
            "The current research trend.",
            "I will comment on the very end of my presentation."
        ],
        [
            "Under very abstract way.",
            "How can we represent lexicographic data?",
            "There are two.",
            "Very extreme positions.",
            "One is as formatted text.",
            "For example, by means of 1/4 processor like Microsoft Word.",
            "The lexicographers work in a busy week environment.",
            "And the information fields in the dictionary are indicated by typography, font sizes, color sizes.",
            "Punctuation formatting, sometimes with styles.",
            "What are the advantages of such an approach?",
            "You don't need a new software because word processor is usually available everywhere.",
            "No extensive training for the team is necessary.",
            "It requires only limited human ID resources.",
            "And usually no conversion is needed, especially if the output is to be on the paper.",
            "The main advantage is that the mental model.",
            "Of traditional lexicographer is very similar to what they see at the screen.",
            "What are they?"
        ],
        [
            "Reason voltages.",
            "They are obvious.",
            "There is no explicit.",
            "Encoding of complex structures.",
            "It is very difficult to impose uniformity over the text.",
            "It is very difficult to validate the data.",
            "Anybody who has tried to do some checking of Microsoft Word document?",
            "Knowledge with them to speaking about and it's difficult to reuse the data."
        ],
        [
            "Is it the money today using this approach?",
            "Surprisingly, as there are even new projects.",
            "Starting some years ago that are using Microsoft Word as a environment for producing addiction.",
            "This is an example for a new large multi volume Russian dictionary.",
            "Editor of Chief is professor oppression.",
            "The famous linguist and they're producing the hard words just by Microsoft Word at the.",
            "Structure is very similar.",
            "Well this will be like when it's printed.",
            "This the headboards for beside means Pearl."
        ],
        [
            "This is how it looks like in a printed column only.",
            "Very minor minor modifications are reasonable there."
        ],
        [
            "On the other side of the scale is that different way off of?",
            "Station.",
            "So as a structured text.",
            "You need some markup language.",
            "Today's usually XML.",
            "Some data definition tools.",
            "And lexicographers have to work in 2 two spaces in a structured space in a presentation space.",
            "What are the advantages?",
            "Everything is encoded explicitly.",
            "Uniformity can be easily imposed.",
            "Strong data validation is possible.",
            "And it is currently the data is reproducible."
        ],
        [
            "What are the disadvantages?",
            "You need specialized software, often quite expensive.",
            "You need to train the team.",
            "You need.",
            "Intensive human height engagement.",
            "Yes, this is.",
            "This line is not OK. You always need some data conversion.",
            "And an important isn't vantage.",
            "Is that the mental model?",
            "Of an entry.",
            "In the heads of lexicographers differs very much from the structure in the data.",
            "To persuade Lady in retirement age that the entry is infected, three it's it's.",
            "It's really very tough work."
        ],
        [
            "This is a typical example of a DI encoded dictionary.",
            "It's a historical dictionary.",
            "Original Digitized Dictionary of German.",
            "You can see it's not very legible.",
            "What can be helpful is the syntax highlighting.",
            "And here you can see another drawback."
        ],
        [
            "The proportion of the text and markup is in favor of markup.",
            "So the space in the screen is scarce.",
            "Usually cannot see more than one sense, even sometimes even one, since is not visible on one screen."
        ],
        [
            "So why people even today try to use the easy way?",
            "They claim it's too complex to complicate it.",
            "Too expensive.",
            "Older members of the team are reluctant to learn something new.",
            "And for a long time project because.",
            "Dictionary projects tend to be very long years, sometimes decades.",
            "So there is one mode cannot afford changing the workflow each decade.",
            "So do not."
        ],
        [
            "As a compromise between 2 extreme approaches and, the compromise is called lightweight.",
            "A markup language.",
            "This definition from Wikipedia.",
            "So it's such a language.",
            "That is readable.",
            "And it's simple.",
            "Generic editor can be used for editing it.",
            "We"
        ],
        [
            "Peter itself is using such type of Markham Black Witch.",
            "If you ever try to edit Wikipedia, you have encountered that, so the information fields are indicated by punctuations apostrophes.",
            "There is sort of breaking single and double brackets and so on."
        ],
        [
            "So something about our language.",
            "We have developed the language.",
            "Long time ago, in early 1990s, and it was developed to represent a slog, monologue monolingual dictionary that has been converting from what has been called at the time typesetting tape.",
            "It was a typesetting system called Ferranti.",
            "A large mainframe machine.",
            "With no documentation so.",
            "Vinyl under task during the conversion was not was the analysis for this boat.",
            "And what we had at time only images machines, no local area network, let alone the Internet.",
            "And.",
            "Only simple tools.",
            "Command line tools could be used and very little ITIT capacity.",
            "I was only only.",
            "Single 80 guy at the time at the Institute is a part time job.",
            "This system was used in preparation for repression of new dictionaries or later.",
            "And it is for some reasons used until today.",
            "This is the list of the dictionaries that are that have been produced by."
        ],
        [
            "This system new additions of the Concept Dictionary, dictionary, slack synonyms.",
            "Dictionary of Slovak Dialects, Historical dictionary.",
            "And now the current project.",
            "Dictionary of the Contemporary slug language.",
            "Three volumes have been published, published already, and five more volumes to come."
        ],
        [
            "This dictionary is published this l'accademia Sciences.",
            "There are some other publishers that use the the System Dictionary of Long words.",
            "Passport English log dictionary.",
            "It was licensed by K Dictionaries.",
            "Compact ignition against Log dictionary in Russian Slang Dictionary of idioms that it has been also used in other."
        ],
        [
            "Install pedia of the Slovak folk culture and the global password series.",
            "Avis K dictionaries.",
            "The initial conversion from Topa graphical format for certain languages have been done using this this this language."
        ],
        [
            "And this is the language itself.",
            "Basically all the syntax can be seen in one slide.",
            "It uses double quotes, single quotes, brackets.",
            "Vertical bars and some modification characters at the beginning after the first opening bracket here so.",
            "Edwards is indicated in double quotes.",
            "The punctuation Brown Station is indicated in in square brackets.",
            "All sorts of metal language labels are in vertical bars at the myologie in angle brackets, and examples are in apostrophes."
        ],
        [
            "This is how.",
            "An entry of the dictionary looks like you can see tomorrow objects their line starting with within a. Exclamation marks is an ID line align starting with a question mark is is our comments.",
            "Comments are used for communication between compilers and editors.",
            "This was for the long time.",
            "Do they have added it recently?",
            "We managed to.",
            "To switch to editor called Notepad Plus."
        ],
        [
            "Plus with syntax highlighting where you can easily define the colors for various information fields.",
            "So this is what made the structure of the dictionary quite quite easy to read.",
            "The editor has a tools for defining user defined language.",
            "It was originally meant to be used for programming languages, but as the syntax is very similar to programming languages and all these forms of labels.",
            "Can be considered keyboards of the language, so it is quite easy to define the colors."
        ],
        [
            "We have some tools, tools for data validation, command line tools.",
            "The simple validation is doing 2 two types of things.",
            "It checks well formed us.",
            "Elementary syntax in typography, missing spaces or extra spaces, or missing unbalanced around reason so old it tries all the times.",
            "Play the number numbers of lines vary.",
            "The issue probably appears, so the first errors tells that there is a missing space after after the comma and 2nd floor lines indicate there is.",
            "Probably missing missing science or sense number out of order."
        ],
        [
            "It is quite easy to do a batch.",
            "Validation.",
            "A simple script can derive, say all references from the from the data sorted and unique it and you get.",
            "Out of all references, will get something like 10 pages that can be checked manually in several hours.",
            "Here you can see."
        ],
        [
            "Hold off 4 lines.",
            "You usually even don't have to look.",
            "Or is the correct form becausw 26 occurrences of something that is correct plus some.",
            "Minor minor number of incorrect incorrect forms."
        ],
        [
            "We have a very simple program that can be each each team member of the team can use this program anytime generates an VRT file.",
            "For proofreading.",
            "For providing the.",
            "The the lines line numbers are are preserved, so it is quite easy then to do editing of the file."
        ],
        [
            "And this is the final conversion.",
            "To the terrific paper format."
        ],
        [
            "So why we use this our language even today?",
            "First thing is yes.",
            "We are reluctant to change from the very beginning.",
            "We we considered it as something temporary.",
            "And we have checked several times some options how to change it?",
            "But it turned out that the overhead would be would be probably too high for like for a project that is already.",
            "Did the Lions already for many years?",
            "But there are also special cases when.",
            "It is reasonable to use this system for new project as well.",
            "We have used for richer digitization of 1st and 2nd volume of the historical dictionary.",
            "That has been published before the data were available from the from the publisher.",
            "So after scanning plus OCR Inc. We produced and out I format in RTF.",
            "Out our artist data.",
            "In a format where Page allowed was preserved, so so it means that each line was each line break and each page break was preserved.",
            "Then we used mass collection of meta language.",
            "By the methodology I have shown in the previous slide.",
            "Then we spell check the definitions because the efficiency use the current spelling.",
            "And then we use manual corrections in the texting historical tagra fi.",
            "It also just required to."
        ],
        [
            "We found the new color scheme.",
            "For the same text.",
            "Highlighting what has to be checked.",
            "So.",
            "Definitions that are in present day Slovak are shadowed.",
            "So the day they don't interfere with reading and all the historical text is highlighted.",
            "So did the corrector.",
            "Can read it quite quite easily.",
            "So.",
            "My conclusion is.",
            "The motivation in the very beginning was that we had to find something very simple.",
            "We had to find something very simple because without being able to do there would be nothing at all.",
            "And.",
            "After this, these years of using it, we get accustomed to it and.",
            "We think we will probably not be able.",
            "We might not be willing to change for current projects.",
            "Of course, in the future we want to convert all our data to something more standard, but the conversion will be automatical, possibly without massive human interface.",
            "So thank you very much.",
            "Thank you, yes, you seem to be presenting your lightweight markup language as some sort of a historical curiosity, but I don't think it is only that becausw.",
            "Lightweight markup languages are generally a thing.",
            "You know they're not just something that existed for awhile and has gone away.",
            "Now that we have XML or and things like that, you know lock lightweight markup languages are being used in sort of other areas outside lexicography such as markdown for text input, and so on.",
            "So I I like the idea and I would be interested in maybe exploring.",
            "The possibility of designing a lexicographic lightweight markup language which can sort of be losslessly converted into XML and then back into the markup language.",
            "Now, if you follow what's happening in in XML circles, people are now talking about a new thing called Invisible XML, which is the idea that you could have sort of lightweight markup languages which are easy for humans to work with, and then you could sort of seamlessly behind the scenes, convert them into XML for machine processing.",
            "And then convert back into the markup language.",
            "The markdown language for for humans to work with.",
            "So this is not just a historical curiosity.",
            "This is something that actually I think has some potential that we should possibly explore as a lexicographic community, or those of us who are interested in building tools for lexicographers.",
            "Becausw XML has this well known problem that it's readable, and it's very explicit.",
            "It's great for machines, but it's difficult for humans to work with, so this is very interesting, lots of.",
            "Ideas are sort of popping up in my head now.",
            "OK, I don't really have a question, sorry.",
            "Thank you for your comment is.",
            "Any other questions?",
            "Yes.",
            "Yeah, yeah, this is actually also a comment.",
            "I mean we we work with a commercial program that is XML based, but where you can switch between equally settings or views.",
            "So actually you can build a view where you don't see any text at all, but it is formatted like a show in italics or colors or whatever you like, and you can then switch back and see the structure and all the text if you want that.",
            "Or you can switch to the.",
            "We see week like you and you can edit and do anything in any of these use, But the I mean the drawback is that you have to pay for a license for this is this is the Alex system by in silence and if some of you might know it but we have been working with that for 15 years and we are quite satisfied with it except that it is not being developed much at the at the time and it cost some money of course so but it exists and it works.",
            "And it's very easy to work in an.",
            "The data is in XML, so we just don't see it.",
            "If you don't want to see it.",
            "Yes, the money official usually is the problem, especially for academic institutions.",
            "And even though some companies have special academic licenses, once you start to prepare to sell your dictionaries, you usually lose the you are not eligible to have academic license.",
            "And in our situation, we are selling our dictionaries, not we, but the the publishing House of the Soul Academy of Sciences.",
            "But the the price is just covering the distribution and printing.",
            "Everything else has to be financed from public sources.",
            "So we are not considering it to be a commercial problem project, but this license schemes usually do not take it into account.",
            "For example for 40 licks once you start selling your dictionary.",
            "You are not eligible for academic license.",
            "So there's time for one last question or comment.",
            "If there is 1.",
            "It seems not so so.",
            "Thanks again, Wladimir."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hello hello everybody.",
                    "label": 0
                },
                {
                    "sent": "One of the reviewers of my paper remarked that it's a more a note historical note.",
                    "label": 0
                },
                {
                    "sent": "The current research trend.",
                    "label": 0
                },
                {
                    "sent": "I will comment on the very end of my presentation.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Under very abstract way.",
                    "label": 0
                },
                {
                    "sent": "How can we represent lexicographic data?",
                    "label": 1
                },
                {
                    "sent": "There are two.",
                    "label": 0
                },
                {
                    "sent": "Very extreme positions.",
                    "label": 1
                },
                {
                    "sent": "One is as formatted text.",
                    "label": 1
                },
                {
                    "sent": "For example, by means of 1/4 processor like Microsoft Word.",
                    "label": 0
                },
                {
                    "sent": "The lexicographers work in a busy week environment.",
                    "label": 1
                },
                {
                    "sent": "And the information fields in the dictionary are indicated by typography, font sizes, color sizes.",
                    "label": 1
                },
                {
                    "sent": "Punctuation formatting, sometimes with styles.",
                    "label": 0
                },
                {
                    "sent": "What are the advantages of such an approach?",
                    "label": 0
                },
                {
                    "sent": "You don't need a new software because word processor is usually available everywhere.",
                    "label": 0
                },
                {
                    "sent": "No extensive training for the team is necessary.",
                    "label": 0
                },
                {
                    "sent": "It requires only limited human ID resources.",
                    "label": 0
                },
                {
                    "sent": "And usually no conversion is needed, especially if the output is to be on the paper.",
                    "label": 0
                },
                {
                    "sent": "The main advantage is that the mental model.",
                    "label": 0
                },
                {
                    "sent": "Of traditional lexicographer is very similar to what they see at the screen.",
                    "label": 1
                },
                {
                    "sent": "What are they?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Reason voltages.",
                    "label": 0
                },
                {
                    "sent": "They are obvious.",
                    "label": 0
                },
                {
                    "sent": "There is no explicit.",
                    "label": 0
                },
                {
                    "sent": "Encoding of complex structures.",
                    "label": 0
                },
                {
                    "sent": "It is very difficult to impose uniformity over the text.",
                    "label": 1
                },
                {
                    "sent": "It is very difficult to validate the data.",
                    "label": 1
                },
                {
                    "sent": "Anybody who has tried to do some checking of Microsoft Word document?",
                    "label": 0
                },
                {
                    "sent": "Knowledge with them to speaking about and it's difficult to reuse the data.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is it the money today using this approach?",
                    "label": 0
                },
                {
                    "sent": "Surprisingly, as there are even new projects.",
                    "label": 0
                },
                {
                    "sent": "Starting some years ago that are using Microsoft Word as a environment for producing addiction.",
                    "label": 0
                },
                {
                    "sent": "This is an example for a new large multi volume Russian dictionary.",
                    "label": 0
                },
                {
                    "sent": "Editor of Chief is professor oppression.",
                    "label": 0
                },
                {
                    "sent": "The famous linguist and they're producing the hard words just by Microsoft Word at the.",
                    "label": 0
                },
                {
                    "sent": "Structure is very similar.",
                    "label": 0
                },
                {
                    "sent": "Well this will be like when it's printed.",
                    "label": 0
                },
                {
                    "sent": "This the headboards for beside means Pearl.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is how it looks like in a printed column only.",
                    "label": 0
                },
                {
                    "sent": "Very minor minor modifications are reasonable there.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On the other side of the scale is that different way off of?",
                    "label": 0
                },
                {
                    "sent": "Station.",
                    "label": 0
                },
                {
                    "sent": "So as a structured text.",
                    "label": 1
                },
                {
                    "sent": "You need some markup language.",
                    "label": 1
                },
                {
                    "sent": "Today's usually XML.",
                    "label": 0
                },
                {
                    "sent": "Some data definition tools.",
                    "label": 0
                },
                {
                    "sent": "And lexicographers have to work in 2 two spaces in a structured space in a presentation space.",
                    "label": 0
                },
                {
                    "sent": "What are the advantages?",
                    "label": 1
                },
                {
                    "sent": "Everything is encoded explicitly.",
                    "label": 0
                },
                {
                    "sent": "Uniformity can be easily imposed.",
                    "label": 1
                },
                {
                    "sent": "Strong data validation is possible.",
                    "label": 0
                },
                {
                    "sent": "And it is currently the data is reproducible.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What are the disadvantages?",
                    "label": 0
                },
                {
                    "sent": "You need specialized software, often quite expensive.",
                    "label": 0
                },
                {
                    "sent": "You need to train the team.",
                    "label": 0
                },
                {
                    "sent": "You need.",
                    "label": 0
                },
                {
                    "sent": "Intensive human height engagement.",
                    "label": 0
                },
                {
                    "sent": "Yes, this is.",
                    "label": 0
                },
                {
                    "sent": "This line is not OK. You always need some data conversion.",
                    "label": 1
                },
                {
                    "sent": "And an important isn't vantage.",
                    "label": 0
                },
                {
                    "sent": "Is that the mental model?",
                    "label": 1
                },
                {
                    "sent": "Of an entry.",
                    "label": 0
                },
                {
                    "sent": "In the heads of lexicographers differs very much from the structure in the data.",
                    "label": 1
                },
                {
                    "sent": "To persuade Lady in retirement age that the entry is infected, three it's it's.",
                    "label": 0
                },
                {
                    "sent": "It's really very tough work.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is a typical example of a DI encoded dictionary.",
                    "label": 0
                },
                {
                    "sent": "It's a historical dictionary.",
                    "label": 0
                },
                {
                    "sent": "Original Digitized Dictionary of German.",
                    "label": 0
                },
                {
                    "sent": "You can see it's not very legible.",
                    "label": 0
                },
                {
                    "sent": "What can be helpful is the syntax highlighting.",
                    "label": 0
                },
                {
                    "sent": "And here you can see another drawback.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The proportion of the text and markup is in favor of markup.",
                    "label": 0
                },
                {
                    "sent": "So the space in the screen is scarce.",
                    "label": 0
                },
                {
                    "sent": "Usually cannot see more than one sense, even sometimes even one, since is not visible on one screen.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So why people even today try to use the easy way?",
                    "label": 1
                },
                {
                    "sent": "They claim it's too complex to complicate it.",
                    "label": 0
                },
                {
                    "sent": "Too expensive.",
                    "label": 0
                },
                {
                    "sent": "Older members of the team are reluctant to learn something new.",
                    "label": 1
                },
                {
                    "sent": "And for a long time project because.",
                    "label": 0
                },
                {
                    "sent": "Dictionary projects tend to be very long years, sometimes decades.",
                    "label": 0
                },
                {
                    "sent": "So there is one mode cannot afford changing the workflow each decade.",
                    "label": 1
                },
                {
                    "sent": "So do not.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As a compromise between 2 extreme approaches and, the compromise is called lightweight.",
                    "label": 0
                },
                {
                    "sent": "A markup language.",
                    "label": 0
                },
                {
                    "sent": "This definition from Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "So it's such a language.",
                    "label": 0
                },
                {
                    "sent": "That is readable.",
                    "label": 0
                },
                {
                    "sent": "And it's simple.",
                    "label": 0
                },
                {
                    "sent": "Generic editor can be used for editing it.",
                    "label": 0
                },
                {
                    "sent": "We",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Peter itself is using such type of Markham Black Witch.",
                    "label": 0
                },
                {
                    "sent": "If you ever try to edit Wikipedia, you have encountered that, so the information fields are indicated by punctuations apostrophes.",
                    "label": 0
                },
                {
                    "sent": "There is sort of breaking single and double brackets and so on.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So something about our language.",
                    "label": 0
                },
                {
                    "sent": "We have developed the language.",
                    "label": 0
                },
                {
                    "sent": "Long time ago, in early 1990s, and it was developed to represent a slog, monologue monolingual dictionary that has been converting from what has been called at the time typesetting tape.",
                    "label": 1
                },
                {
                    "sent": "It was a typesetting system called Ferranti.",
                    "label": 0
                },
                {
                    "sent": "A large mainframe machine.",
                    "label": 0
                },
                {
                    "sent": "With no documentation so.",
                    "label": 0
                },
                {
                    "sent": "Vinyl under task during the conversion was not was the analysis for this boat.",
                    "label": 0
                },
                {
                    "sent": "And what we had at time only images machines, no local area network, let alone the Internet.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Only simple tools.",
                    "label": 0
                },
                {
                    "sent": "Command line tools could be used and very little ITIT capacity.",
                    "label": 0
                },
                {
                    "sent": "I was only only.",
                    "label": 1
                },
                {
                    "sent": "Single 80 guy at the time at the Institute is a part time job.",
                    "label": 1
                },
                {
                    "sent": "This system was used in preparation for repression of new dictionaries or later.",
                    "label": 0
                },
                {
                    "sent": "And it is for some reasons used until today.",
                    "label": 0
                },
                {
                    "sent": "This is the list of the dictionaries that are that have been produced by.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This system new additions of the Concept Dictionary, dictionary, slack synonyms.",
                    "label": 1
                },
                {
                    "sent": "Dictionary of Slovak Dialects, Historical dictionary.",
                    "label": 1
                },
                {
                    "sent": "And now the current project.",
                    "label": 1
                },
                {
                    "sent": "Dictionary of the Contemporary slug language.",
                    "label": 0
                },
                {
                    "sent": "Three volumes have been published, published already, and five more volumes to come.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This dictionary is published this l'accademia Sciences.",
                    "label": 0
                },
                {
                    "sent": "There are some other publishers that use the the System Dictionary of Long words.",
                    "label": 0
                },
                {
                    "sent": "Passport English log dictionary.",
                    "label": 0
                },
                {
                    "sent": "It was licensed by K Dictionaries.",
                    "label": 1
                },
                {
                    "sent": "Compact ignition against Log dictionary in Russian Slang Dictionary of idioms that it has been also used in other.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Install pedia of the Slovak folk culture and the global password series.",
                    "label": 1
                },
                {
                    "sent": "Avis K dictionaries.",
                    "label": 0
                },
                {
                    "sent": "The initial conversion from Topa graphical format for certain languages have been done using this this this language.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is the language itself.",
                    "label": 0
                },
                {
                    "sent": "Basically all the syntax can be seen in one slide.",
                    "label": 0
                },
                {
                    "sent": "It uses double quotes, single quotes, brackets.",
                    "label": 0
                },
                {
                    "sent": "Vertical bars and some modification characters at the beginning after the first opening bracket here so.",
                    "label": 0
                },
                {
                    "sent": "Edwards is indicated in double quotes.",
                    "label": 0
                },
                {
                    "sent": "The punctuation Brown Station is indicated in in square brackets.",
                    "label": 0
                },
                {
                    "sent": "All sorts of metal language labels are in vertical bars at the myologie in angle brackets, and examples are in apostrophes.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is how.",
                    "label": 0
                },
                {
                    "sent": "An entry of the dictionary looks like you can see tomorrow objects their line starting with within a. Exclamation marks is an ID line align starting with a question mark is is our comments.",
                    "label": 0
                },
                {
                    "sent": "Comments are used for communication between compilers and editors.",
                    "label": 0
                },
                {
                    "sent": "This was for the long time.",
                    "label": 0
                },
                {
                    "sent": "Do they have added it recently?",
                    "label": 0
                },
                {
                    "sent": "We managed to.",
                    "label": 0
                },
                {
                    "sent": "To switch to editor called Notepad Plus.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Plus with syntax highlighting where you can easily define the colors for various information fields.",
                    "label": 0
                },
                {
                    "sent": "So this is what made the structure of the dictionary quite quite easy to read.",
                    "label": 0
                },
                {
                    "sent": "The editor has a tools for defining user defined language.",
                    "label": 0
                },
                {
                    "sent": "It was originally meant to be used for programming languages, but as the syntax is very similar to programming languages and all these forms of labels.",
                    "label": 0
                },
                {
                    "sent": "Can be considered keyboards of the language, so it is quite easy to define the colors.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We have some tools, tools for data validation, command line tools.",
                    "label": 1
                },
                {
                    "sent": "The simple validation is doing 2 two types of things.",
                    "label": 0
                },
                {
                    "sent": "It checks well formed us.",
                    "label": 0
                },
                {
                    "sent": "Elementary syntax in typography, missing spaces or extra spaces, or missing unbalanced around reason so old it tries all the times.",
                    "label": 1
                },
                {
                    "sent": "Play the number numbers of lines vary.",
                    "label": 0
                },
                {
                    "sent": "The issue probably appears, so the first errors tells that there is a missing space after after the comma and 2nd floor lines indicate there is.",
                    "label": 0
                },
                {
                    "sent": "Probably missing missing science or sense number out of order.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It is quite easy to do a batch.",
                    "label": 0
                },
                {
                    "sent": "Validation.",
                    "label": 0
                },
                {
                    "sent": "A simple script can derive, say all references from the from the data sorted and unique it and you get.",
                    "label": 0
                },
                {
                    "sent": "Out of all references, will get something like 10 pages that can be checked manually in several hours.",
                    "label": 0
                },
                {
                    "sent": "Here you can see.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hold off 4 lines.",
                    "label": 0
                },
                {
                    "sent": "You usually even don't have to look.",
                    "label": 0
                },
                {
                    "sent": "Or is the correct form becausw 26 occurrences of something that is correct plus some.",
                    "label": 0
                },
                {
                    "sent": "Minor minor number of incorrect incorrect forms.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have a very simple program that can be each each team member of the team can use this program anytime generates an VRT file.",
                    "label": 0
                },
                {
                    "sent": "For proofreading.",
                    "label": 0
                },
                {
                    "sent": "For providing the.",
                    "label": 0
                },
                {
                    "sent": "The the lines line numbers are are preserved, so it is quite easy then to do editing of the file.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is the final conversion.",
                    "label": 0
                },
                {
                    "sent": "To the terrific paper format.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So why we use this our language even today?",
                    "label": 1
                },
                {
                    "sent": "First thing is yes.",
                    "label": 0
                },
                {
                    "sent": "We are reluctant to change from the very beginning.",
                    "label": 1
                },
                {
                    "sent": "We we considered it as something temporary.",
                    "label": 0
                },
                {
                    "sent": "And we have checked several times some options how to change it?",
                    "label": 0
                },
                {
                    "sent": "But it turned out that the overhead would be would be probably too high for like for a project that is already.",
                    "label": 1
                },
                {
                    "sent": "Did the Lions already for many years?",
                    "label": 0
                },
                {
                    "sent": "But there are also special cases when.",
                    "label": 0
                },
                {
                    "sent": "It is reasonable to use this system for new project as well.",
                    "label": 0
                },
                {
                    "sent": "We have used for richer digitization of 1st and 2nd volume of the historical dictionary.",
                    "label": 1
                },
                {
                    "sent": "That has been published before the data were available from the from the publisher.",
                    "label": 1
                },
                {
                    "sent": "So after scanning plus OCR Inc. We produced and out I format in RTF.",
                    "label": 0
                },
                {
                    "sent": "Out our artist data.",
                    "label": 0
                },
                {
                    "sent": "In a format where Page allowed was preserved, so so it means that each line was each line break and each page break was preserved.",
                    "label": 0
                },
                {
                    "sent": "Then we used mass collection of meta language.",
                    "label": 0
                },
                {
                    "sent": "By the methodology I have shown in the previous slide.",
                    "label": 0
                },
                {
                    "sent": "Then we spell check the definitions because the efficiency use the current spelling.",
                    "label": 0
                },
                {
                    "sent": "And then we use manual corrections in the texting historical tagra fi.",
                    "label": 0
                },
                {
                    "sent": "It also just required to.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We found the new color scheme.",
                    "label": 0
                },
                {
                    "sent": "For the same text.",
                    "label": 0
                },
                {
                    "sent": "Highlighting what has to be checked.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Definitions that are in present day Slovak are shadowed.",
                    "label": 0
                },
                {
                    "sent": "So the day they don't interfere with reading and all the historical text is highlighted.",
                    "label": 0
                },
                {
                    "sent": "So did the corrector.",
                    "label": 0
                },
                {
                    "sent": "Can read it quite quite easily.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "My conclusion is.",
                    "label": 0
                },
                {
                    "sent": "The motivation in the very beginning was that we had to find something very simple.",
                    "label": 0
                },
                {
                    "sent": "We had to find something very simple because without being able to do there would be nothing at all.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "After this, these years of using it, we get accustomed to it and.",
                    "label": 0
                },
                {
                    "sent": "We think we will probably not be able.",
                    "label": 0
                },
                {
                    "sent": "We might not be willing to change for current projects.",
                    "label": 0
                },
                {
                    "sent": "Of course, in the future we want to convert all our data to something more standard, but the conversion will be automatical, possibly without massive human interface.",
                    "label": 0
                },
                {
                    "sent": "So thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Thank you, yes, you seem to be presenting your lightweight markup language as some sort of a historical curiosity, but I don't think it is only that becausw.",
                    "label": 0
                },
                {
                    "sent": "Lightweight markup languages are generally a thing.",
                    "label": 0
                },
                {
                    "sent": "You know they're not just something that existed for awhile and has gone away.",
                    "label": 0
                },
                {
                    "sent": "Now that we have XML or and things like that, you know lock lightweight markup languages are being used in sort of other areas outside lexicography such as markdown for text input, and so on.",
                    "label": 0
                },
                {
                    "sent": "So I I like the idea and I would be interested in maybe exploring.",
                    "label": 0
                },
                {
                    "sent": "The possibility of designing a lexicographic lightweight markup language which can sort of be losslessly converted into XML and then back into the markup language.",
                    "label": 1
                },
                {
                    "sent": "Now, if you follow what's happening in in XML circles, people are now talking about a new thing called Invisible XML, which is the idea that you could have sort of lightweight markup languages which are easy for humans to work with, and then you could sort of seamlessly behind the scenes, convert them into XML for machine processing.",
                    "label": 0
                },
                {
                    "sent": "And then convert back into the markup language.",
                    "label": 0
                },
                {
                    "sent": "The markdown language for for humans to work with.",
                    "label": 0
                },
                {
                    "sent": "So this is not just a historical curiosity.",
                    "label": 0
                },
                {
                    "sent": "This is something that actually I think has some potential that we should possibly explore as a lexicographic community, or those of us who are interested in building tools for lexicographers.",
                    "label": 0
                },
                {
                    "sent": "Becausw XML has this well known problem that it's readable, and it's very explicit.",
                    "label": 0
                },
                {
                    "sent": "It's great for machines, but it's difficult for humans to work with, so this is very interesting, lots of.",
                    "label": 0
                },
                {
                    "sent": "Ideas are sort of popping up in my head now.",
                    "label": 0
                },
                {
                    "sent": "OK, I don't really have a question, sorry.",
                    "label": 0
                },
                {
                    "sent": "Thank you for your comment is.",
                    "label": 0
                },
                {
                    "sent": "Any other questions?",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah, this is actually also a comment.",
                    "label": 0
                },
                {
                    "sent": "I mean we we work with a commercial program that is XML based, but where you can switch between equally settings or views.",
                    "label": 0
                },
                {
                    "sent": "So actually you can build a view where you don't see any text at all, but it is formatted like a show in italics or colors or whatever you like, and you can then switch back and see the structure and all the text if you want that.",
                    "label": 0
                },
                {
                    "sent": "Or you can switch to the.",
                    "label": 0
                },
                {
                    "sent": "We see week like you and you can edit and do anything in any of these use, But the I mean the drawback is that you have to pay for a license for this is this is the Alex system by in silence and if some of you might know it but we have been working with that for 15 years and we are quite satisfied with it except that it is not being developed much at the at the time and it cost some money of course so but it exists and it works.",
                    "label": 0
                },
                {
                    "sent": "And it's very easy to work in an.",
                    "label": 0
                },
                {
                    "sent": "The data is in XML, so we just don't see it.",
                    "label": 0
                },
                {
                    "sent": "If you don't want to see it.",
                    "label": 0
                },
                {
                    "sent": "Yes, the money official usually is the problem, especially for academic institutions.",
                    "label": 0
                },
                {
                    "sent": "And even though some companies have special academic licenses, once you start to prepare to sell your dictionaries, you usually lose the you are not eligible to have academic license.",
                    "label": 0
                },
                {
                    "sent": "And in our situation, we are selling our dictionaries, not we, but the the publishing House of the Soul Academy of Sciences.",
                    "label": 0
                },
                {
                    "sent": "But the the price is just covering the distribution and printing.",
                    "label": 0
                },
                {
                    "sent": "Everything else has to be financed from public sources.",
                    "label": 0
                },
                {
                    "sent": "So we are not considering it to be a commercial problem project, but this license schemes usually do not take it into account.",
                    "label": 0
                },
                {
                    "sent": "For example for 40 licks once you start selling your dictionary.",
                    "label": 0
                },
                {
                    "sent": "You are not eligible for academic license.",
                    "label": 0
                },
                {
                    "sent": "So there's time for one last question or comment.",
                    "label": 0
                },
                {
                    "sent": "If there is 1.",
                    "label": 0
                },
                {
                    "sent": "It seems not so so.",
                    "label": 0
                },
                {
                    "sent": "Thanks again, Wladimir.",
                    "label": 0
                }
            ]
        }
    }
}