{
    "id": "xc6l3vohffbne5r3sf7wgm2bmhm7ap3u",
    "title": "Modeling Expressive Performances of the Singing Voice",
    "info": {
        "author": [
            "Maria Cristina Marinescu, MIT Media Lab, School of Architecture + Planning, Massachusetts Institute of Technology, MIT"
        ],
        "published": "Oct. 20, 2009",
        "recorded": "September 2009",
        "category": [
            "Top->Computer Science->Machine Learning"
        ]
    },
    "url": "http://videolectures.net/ecmlpkdd09_marinescu_mepsv/",
    "segmentation": [
        [
            "Today I'm going to tell you about some work we've been doing on modeling expressive performances of the human singing voice, and as I said, this is joint work with Sarah for amuse, from Bumper, Farrah in Barcelona."
        ],
        [
            "So.",
            "If you ask different people if you are someone what they like in a singer, they're going to tell you very different things."
        ],
        [
            "So maybe somebody is going to tell you.",
            "Well, I like the singer's voice, somebody else?",
            "Might tell you I'm just gonna put it here if you don't mind.",
            "Somebody else might tell you, well, I like their interpretation style.",
            "I like the timber over the voice, the interpretation, musicality, resonance.",
            "There all sorts of of terms that people might use when they want to characterize what they like in a singer.",
            "And some of these terms are actually pretty vague, but some of them are also overlapping, but in the end, in reality all you have is the waveform and all these terms refer to properties.",
            "Of this waveform.",
            "So.",
            "They specifically refer.",
            "Don't look at this first.",
            "They refer to acoustic features of the waveform, so things like.",
            "Bits, timing, timber articulation, spectral engine distribution and their other other ones that I'm not mentioning here.",
            "Specific focus in this work is vocal music, so there's an you semantic dimension that vocal that the fact that we're studying vocal music adds through what we call verbal features, and we we group the verbal features under what we call international phrasing.",
            "It's maybe a little vague, So what I mean by international phrasing or things like?",
            "Adding stress to words that otherwise otherwise would not be stressed.",
            "Over articulation micro pauses.",
            "Think of this type, for example, adding lengthening certain certain notes.",
            "There are pitch accented things like that, so there's things that are that are that add a bit of semantics.",
            "You get these from the fact that you also have the libretto, you only.",
            "You don't only have the score, but in fact if you look at all of these things that I told you, they also reflect in the waveform and properties as properties of the wafer.",
            "So, um.",
            "You have all these features separately, and what the singers do.",
            "They combine these features.",
            "And the way they combine these features to reach a specific specific affective emotional expressive effect is what they give the personal style.",
            "I'm going to use this word in a kind of a loose way, so a personal style is how we recognize a singer.",
            "What is specific to that singer?",
            "And that's what we're trying to figure out.",
            "What is?",
            "What does each singer do differently to what?",
            "How they do we want to understand how they do things, how they manipulate these features.",
            "This acoustic features and be able to.",
            "Generates performances in their style so as well filesets in the previous session.",
            "It is basically the personal style of a singer that that make.",
            "Record sales and concert attendance and things like that.",
            "So people, even if they are not well within what we culturally consider to be beautiful, what we're conditioned culturally to consider beautiful.",
            "Maybe we don't appreciate Chinese music as we have from having grown up with it and we don't understand it very well.",
            "But within Western music for example.",
            "We we have, even if we're not very musically educated, we have very strong preferences for a particular style or a particular singer, as opposed to another one.",
            "So we do recognize this specific style so."
        ],
        [
            "Our long-term goal, and this is the long term goal, and then I'm going to talk about the specific work that we're doing, which is quite preliminary.",
            "So our long-term goal is to develop models of operatic singers.",
            "And generate the expressive performances that are similar in interpretation and in voice quality.",
            "Two original performances by this by the singers.",
            "I don't know if it's necessary to explain again what expressive performances.",
            "I think it's clear whatever deviation you have from the score 'cause here we have a fixed score, it's considered an expressive deviation.",
            "Of course, it could be good deviation about deviation, but we're not talking about now about whether it's good or bad now.",
            "OK, so.",
            "Why did we choose opera?",
            "Basically for two reasons, well mainly for two reasons.",
            "One of them is that you have an environment that is relatively constrained, so you have this core and then you have the libretto.",
            "The lyrics and because you have this constrained environment, it's easier to measure.",
            "It's easier to say what it is or deviation, what's an expressive deviation, and it's kind of easier to compare singers in terms of this expressive deviations.",
            "It's also and this is something we're not.",
            "I'm not going to talk about, but I'm just going to mention it here and get it over with.",
            "It's also easier for listeners.",
            "That might or might not be educated to to label to identify what emotional content the particular expressive performance has.",
            "The second reason why we choose what, why we chose Opera is that generally the operatic singers have better voice within the whatever.",
            "It's not.",
            "That is not always true, but generally they have better voice and better technique than other singers.",
            "So there are more effective in in.",
            "Producing an expressive performance.",
            "So let's say that we returnable at some point of being able to understand how Braddock Singer specific operatic singers do what they do and generate expressive performances in their style, an with their voice features.",
            "How can we use this?",
            "Well, we can use this in four ways.",
            "First of all.",
            "We can generate interpretations of ideas of songs that were never recorded by the singers and, well, you can think of this, I suppose as an entertainment tool, you could also use this tool.",
            "Well, such a tool for learning purposes so music professionals could use it to figure out how to how to learn.",
            "Specific aspects of expressive singing and how to reach, for example, the same effect.",
            "Emotional effects via different ways and play with that for the singers that we're going to, we're going to be able to generate very good, very accurate models.",
            "We might be able to use these models to remaster old records.",
            "And Lastly, I think I maybe it's not an opinion that is shared by the others, but I think it would be interesting to figure out if you can.",
            "If you can understand the evolution of of of classical singing in terms of which Singer had an effect on other singers on other generations into in terms of technique and what are his own sources of inspiration.",
            "So figure out how different singers influenced each other.",
            "Technique wise.",
            "So."
        ],
        [
            "As we said, we have a lot of acoustic features, a lot of pretty much everybody talked about them in their talks before."
        ],
        [
            "I want to underline that what we're doing is understanding what the singers do and generate.",
            "Expressive performances is not recognizing which performer is singing a specific piece.",
            "So while as Raphael was saying in the previous session, when you recognize while a player or or singer.",
            "You mostly look at like a singer.",
            "You mostly look at timber.",
            "He had a graph and singer.",
            "Were all the way to the right where timber was the most important feature by which you could recognize a singer we're not doing.",
            "We're not recognizing.",
            "Singers were generating performances, so a model that is good.",
            "For recognizing a singer might not be good for generating and expressive performances in the style of that singer, nor the other way around.",
            "And information about timber is useful, but it's not enough.",
            "To generate something in the style of that singer, they're actually orthogonal.",
            "You have dynamics and timing.",
            "And other internodes features and context features about the how he sings are melodic line and then their internodes features and they.",
            "They work together too.",
            "To create a an expressive melody.",
            "So what we're this is, as I said, preliminary work an what I'm going to talk about now in this talk is simply about timing.",
            "And so."
        ],
        [
            "So that we can, we can actually do reasonable promising, promising stuff only with timing so.",
            "This is the basic approach.",
            "You start from existing audio commercial recordings.",
            "These are not even studio recordings.",
            "Their live performances of famous operatic singers and I'm specifically looking at the center voice.",
            "And from this from this audio recordings you extract a set of high level descriptors.",
            "I'm going to tell you what the specific descriptors are with the values, so you obtain a set of values for the high level descriptors from a set of ideas sang by the same center.",
            "Based on those you apply machine learning techniques to learn.",
            "A model that is specific to that Singer that sang all these ideas that you analyzed over here.",
            "So you build, you build a model.",
            "And you validate the model and then you have obviously a different set of training set that is different.",
            "Sorry, a test set that is different from the training set and you.",
            "You use the single specific model to generate new expressive performances of those scores in the test set, and then you can compare.",
            "Whatever expressive performance you got based on your model with the actual performance and see how well how well you are doing.",
            "So."
        ],
        [
            "High level descriptors are.",
            "Characterize a melodic line in terms of, well, two things.",
            "One of them is the musical events.",
            "And the musical events is practically a note.",
            "And the other thing is the context of musical events, so.",
            "Let's go through them in order.",
            "So first of all.",
            "We characterize the melody based on the score."
        ],
        [
            "Then on the performance.",
            "In terms of score, we extract first node node properties, specifically pitch duration of the nodes metric strength and no density metric strength.",
            "It's clear the magical strength associated with the notes.",
            "Corresponds to the position of the notes in the bar and also depends on the time signature of the of the melodic line.",
            "So if you have a four by four time signature, than the first beats in the bar is going to get stronger stress.",
            "And then in the in the decreasing following order you get the thirds.",
            "The third, then the 2nd and 4th, then the OFFBEATS and then Lastly the nodes that start at any other time that is not one of these gets the lowest stress.",
            "This is just an example.",
            "Not density.",
            "Initially we didn't have this this parameter and then we actually notice that it makes a difference, so no density.",
            "It's a measure of how fast the notes are sung, and you'll see in the next slide that we measure actual actual temple as well, so no density and actual tempo are complementing each other and.",
            "There there are away too.",
            "Away took to quantify a way to help classifying.",
            "And grouping the ideas in terms of.",
            "Whether they have the same style or the same feel.",
            "The other."
        ],
        [
            "Type of information that we're extracting from the scores, the context information.",
            "So practically what we extract is the relative.",
            "Pitch of the neighboring nodes.",
            "The the length of the neighboring intervals and to add structure.",
            "To our performance data we we apply the narmour's implication realization, theory of cognition and and perception.",
            "So I I'm not sure I don't think I have to go into that again 'cause.",
            "But I finally explained what it is about.",
            "This is just.",
            "An example of some of the patterns in armor theory.",
            "So."
        ],
        [
            "Top.",
            "Um information about musical events.",
            "Information about context of musical events.",
            "From the performance we get the note onset and duration.",
            "These are the things that we're trying to predict, so these are the things that we're learning, so these are sort of like the input parameters and these are the things that we're trying to predict.",
            "And we also need based on the score."
        ],
        [
            "And the performance we need.",
            "The actual temple of the pieces.",
            "So some of the pieces are annotated in the score with the temple, but some of them are not, and even the ones that are annotated are practically useless.",
            "You have to look at.",
            "How fast, so like what's the duration of the of the performance and then compute the actual temple based on that.",
            "And actually, for pretty much all the pieces that we computed, the differences in tempo is from 50% to even like 100%, usually faster then it's annotation in the score.",
            "So.",
            "Let's go back to."
        ],
        [
            "Our diagram.",
            "So I told you what the high level descriptors are that we're extracting, and now I'm going to tell you how we extract them shortly, how we extract them, and how we use them.",
            "Once we have them.",
            "So we start from.",
            "Life recordings, life, commercial recordings and we actually we.",
            "We start from, well, files.",
            "And.",
            "We extract the high level descriptors in.",
            "In different ways.",
            "So the annotation in the score is done manually, so you get the pitch and the duration of the notes from the score.",
            "That's done manually for getting the onset and note onset and duration of the actual performance.",
            "We applied sound analysis techniques based on spectral models.",
            "Um, metric meter metric strength is automatically computed based on.",
            "The note length.",
            "And obviously the score where the note starts in the bar.",
            "No density is computed manually for the whole melody, so.",
            "You look how many notes you have per bar, and you compute the node density.",
            "Normal structure is generated.",
            "For each node, you compute what you figure out which normal structure that notice part of, and that's done automatically based on analyzing the score and the actual tempo is computed manually based on the score and the duration of the melody.",
            "So once you extracted the high level descriptors."
        ],
        [
            "We use Wicca.",
            "To generate the single specific models and to validate them.",
            "So we tried several different learning algorithms.",
            "And we decided to choose model trees.",
            "I'm not going to go into any detail, but just in case, model trees in.",
            "In classification using model trees, you basically generate a decision.",
            "You have a regression problem.",
            "You generate the decision list.",
            "You build a tree.",
            "You pick the best rule, the best leaf, and you make it into a rule and you repeat this process and you generate a set of rules that are going to practically give you a predict.",
            "Whatever you're predicting, and in our case timing information, know duration, so you're going to get rules that are predicting the length, the duration of the notes.",
            "Based on patterns of high level descriptors.",
            "And then you have the test set, so you have the training set on which you generate the models and then you have the test set which is separate from the training set and for the test set.",
            "You you you.",
            "Validate the model on the test set and you generate expressive performances.",
            "And I'm going to give you numbers about the correlation between the predicted and the actual values of the note durations.",
            "So."
        ],
        [
            "Here's our data set.",
            "Somebody was saying, I think Darrell that you had.",
            "For little data, that's very little data, this is something else, so we have very little data and very very little data, and I'm going to explain why.",
            "And as I said, this is preliminary, so we're adding more data to it.",
            "So what we have right now, we have six tenor Arias from operas by Verdi that add up to 415 notes.",
            "And the criteria based on which we picked these ideas are the following.",
            "First of all, they obviously have to be operatic and tenor ideas.",
            "Second, they have to be a couple a, which is actually pretty hard.",
            "It's there are not very many.",
            "A couple of pieces.",
            "In the opera and it's it's very hard to separate voice from orchestra, so that's been a problem and we're working on it, but.",
            "It's slow progress.",
            "The third criteria that we have is that we want to.",
            "Generate single specific models from sets of ideas that have the same that share the same composition style.",
            "Why is this important?",
            "We were trying to learn patterns right?",
            "So for the same sets for the same values for the inputs, we want to be able, hopefully to learn the same outputs in order to reinforce that pattern right?",
            "And in that sense, what we need is we need to.",
            "To put together compositions by by authors world by, by composers that use the same expressive means to embody the musical message.",
            "Because if for the same context they have a different output because the style, the style is different, they want to reach.",
            "A different effects then you're not going to find a pattern.",
            "So you want to find.",
            "You want to only group consist of pieces with consistent composition style so."
        ],
        [
            "Practically, the six ideas are two ideas from from Traviata."
        ],
        [
            "One from Ballin Mascara, one from Lisa Miller one from Pattaya, Delany and or you want from Rigoletto.",
            "So maybe except for Rigoletto all of them share the composition style of where this middle years so they pretty much have the same composition style.",
            "I'm not an expert in composition style but so I can't there.",
            "There are a few things I can tell you.",
            "About how we got it all might be different, but.",
            "For now on take my word, so these are.",
            "These are pretty similar.",
            "The five of them, the one that is from Rigoletto, is slightly different composition style.",
            "The 4th criteria is we also want to have consistent interpretations though.",
            "So what do we want to do?",
            "Well, we want to learn singer specific models, so you're going to say, well, OK, so it's only one singer, so of course the singing style is going to be consistent 'cause it's the same singer all throughout, but that's not necessarily the same.",
            "Is not necessarily true because.",
            "Singers voices change overtime and also their interpretation style changes overtime so because of voice changes or or interpretation style changes, they might actually in the same context, they might choose to do things slightly differently.",
            "And then you're not going to have a pattern that reinforces itself.",
            "So in order to."
        ],
        [
            "We can't say minimize, but.",
            "Make that more.",
            "Make it more possible to extract these patterns.",
            "We focused on recordings by Joseph Karas from the Middle Middle 70s to the beginning of the 80s.",
            "That's the last criteria for which we chose.",
            "This ideas is that they are alive.",
            "I'm not saying so.",
            "Life means one, what means.",
            "They don't have any post processing.",
            "It's not possible to tell the singer what to sing or how to sing, or what expressive effects to look for when he's singing.",
            "And I'm not saying that studio recordings are not interesting.",
            "They're actually very interesting, and I think it would be very interesting to see whether the patterns differ in the case that you were looking at studio recordings of famous artists and live recordings, but for this particular piece of work, we're looking at live recordings.",
            "OK, so given our data.",
            "How much?"
        ],
        [
            "Rap.",
            "OK, given given our data, we we run our experiment.",
            "So what's our goal to accurately predict an alteration as a function of the of the values of the high level descriptors?",
            "This is I'm going to go pretty quick, so this is the list of ideas.",
            "This is the first.",
            "These are the six ideas that I was telling you about with the with the corresponding correlation coefficient.",
            "So the correlation coefficient is what is the degree to which.",
            "This the following two values.",
            "Correlate with each other the actual notes, the no duration.",
            "For every note in the test set as performed by that artist by Karas and the predicted no duration for the same notes.",
            "As predicted by the model, the singer specific model that we built, so the test set and the and the training set.",
            "If you look at only the first line, so this is for this idea.",
            "What did I do here?",
            "How did I get this coefficient I split?",
            "Um, the this idea in.",
            "8020 so 80% of the area I used it for training 20 for testing and you go like that for all the ideas separately.",
            "So you get these numbers right up until here.",
            "These are pretty good.",
            "These are not that great, but they are significant and these are just terrible, right?",
            "So there's no correlation.",
            "The reason I suspect we don't have enough data to be sure, but I suspect that because the pieces are relatively complex, but they're not very long, you don't have a lot of consistency.",
            "So in the same.",
            "You don't have enough parameters to distinguish between 2 cases, where apparently you have the same input parameters but a different out so.",
            "You're not able to distinguish between these, so this is a problem right?",
            "So that's where we go to the second step of the experiment.",
            "Anyway, so these are the results for each of the areas separately, and then we put all the areas together that have the same time signature and we obtain this coefficient correlation coefficient right so?",
            "It's important to only put ideas together that have the same time signature, because because of the way you associate metric strength with notes within a bar.",
            "So we get this number.",
            "It doesn't look great.",
            "The good news is that actually if you look at the areas that are grouped here, they have really different tempos, actual tempos, and they have very different density.",
            "So I was actually, well, pleasantly surprised that we even get over.",
            ".5 going from temples of 110 all the way to 54 and no density of I don't know 3.47 to 4.71, so they're pretty pretty.",
            "The other thing that it's important is."
        ],
        [
            "OK, you have this correlation coefficient.",
            "But if you actually look at the graphs of the predicted no duration and the actual perform, do they correlate well?",
            "Is it uniformly distributed the correlation?",
            "And this is one of the ideas.",
            "As I said before, So what is said before I think what is above 1, so these are not duration relative to the prescribed no duration in the score.",
            "So what's above one is lengthened was below, one is shortened.",
            "And you can see that you have certain points where.",
            "You're not, it's really, really close, but the shape of the of the graph is kind of the same.",
            "I'm only showing 20%.",
            "Of the 20% of the testing test set for this particular idea here, OK, so we build this."
        ],
        [
            "This model that only has.",
            "Why 56?",
            "But I'm actually pretty happy with it because of the diversity in actual tempozan no density.",
            "But now the real experiment is when you take this model and it tested on data that.",
            "That was not seen before, right?",
            "So these are the correlation coefficients for.",
            "Doing tests at a valuation of each of the areas separately against the model obtained from putting 80% of the data.",
            "Together to build the model right so.",
            "These two areas that used to have point 29.2 so they're completely irrelevant.",
            "There was no correlation.",
            "Now they jumped up to 61.8.",
            "So what it means is that once you put the data together from the other ideas as well, you started observing patterns that were not obvious when you only looked at one audience separation in isolation, excuse me.",
            "This jumped really high too, but it's understandable because it's not a very long idea.",
            "These two.",
            "OK, so this is the only one that went down and it went down from 74 to 62.",
            "What I think happens, but we don't have conclusive evidence 'cause we don't have that much data.",
            "This is the idea from Rigoletto.",
            "And I actually think that.",
            "That you notice here the difference in style that you group things that are not exactly the same style and because you put the data from these guys, which is not the same style, exactly the same style.",
            "With this idea, the correlation coefficient goes down while it was higher when you only look consistently at that that idea itself.",
            "But good news is that.",
            "You got pretty decent I think, and actually pretty good here.",
            "Correlation coefficients and putting together the all the ideas the data from all the ideas.",
            "You really strengthen the model and this is for."
        ],
        [
            "This other idea.",
            "This is how it looks like.",
            "The correlation coefficient for this one is actually really high, but the shape like here and here for example.",
            "I'm not following exactly the prediction and the and the actual performance don't follow each other very closely, but the general the general shape follow that the two shapes follow each other and actually quite surprisingly the last.",
            "Um?",
            "The last note was predicted very accurate, accurately, OK, I'm going to finish and .5 minutes.",
            "This is."
        ],
        [
            "Um, we're adding more ideas.",
            "As I said, it's a slow process because they're actually not a lot of acapella ideas and we either have to get them from somewhere.",
            "I'm not sure where from since we can't record a tenor singing a couple on the studio, or we haven't been able to.",
            "Um?",
            "We are adding more acoustic features because, well, fine, we got.",
            "Pretty good correlation coefficients, but we have even if we add more areas, our final goal is to generate expressive performances.",
            "You can generate expresses performances only with timing, so we're adding more things.",
            "Currently, we're in the process of adding an energy model to the timing model and in the future we're going to add.",
            "Well, timber exaggeration, which is the extra duration that you get around the pitch accented towards pitch range, action, shape and things about articulation, articulation, precision, things like that.",
            "And we're also in the process of OK, so these are outs.",
            "These are things that we want to predict in order to generate expressive performances, and these are things that input parameters to be able to classify more accurately.",
            "So we're in the process of adding.",
            "Syllable information we had actually pretty promising results.",
            "Adding information about whether syllables are stressed or unstressed.",
            "We got some pretty nice rules.",
            "Um, that were only obtained because we added this information.",
            "It's before everything was was clumped into one one plus and the.",
            "All the rules were confusing each other, and in the future we want to add more things about international phrasing.",
            "Given that a lot of these features from of international phrasing are the ones that actually make it possible to specify what.",
            "Emotional.",
            "What specific emotional state?",
            "The singer is trying to too.",
            "Reproduce and well.",
            "I hope you have."
        ],
        [
            "Questions, thank you very much.",
            "Two quick questions.",
            "I have a question now.",
            "Earlier you mentioned something about.",
            "Recognition and generation being orthogonal?",
            "Yeah.",
            "Why?",
            "Why can't good identification model be used somehow reversed to generate well, right?",
            "It seems excellent recognition model.",
            "You would also automatically have a good general if you have the bus recognition model, yes, but what I'm saying is that there might be things based on which it's clear that it's Domingo, not carreras, right?",
            "But if I'm trying to reproduce the way he's singing like his timber might, for example, his timber is completely different, right?",
            "If I'm reproducing if my classifier, for example looks only at timber.",
            "How can I generate something that sounds like a melody sung by him if the only information I have is intronaut is timber, I don't know whether I mean, he obviously does a lot of no duration transformations, and I'm sure that he's doing a lot of other stuff, but I wouldn't be able to know that if the only thing I'm looking at.",
            "I'm just giving an example is timber information, so sure if I have a recognizer, a single recognizer that looks at.",
            "A lot of features.",
            "Then I'm probably going to be able to have a.",
            "A good generator, but I'm sorry but distinguishing exactly what what difference between two singers like what it could be.",
            "Even one thing.",
            "The silliest thing.",
            "One thing that they do different that is very clearly not this but is this it passes the threshold.",
            "But that might be completely non representative.",
            "When I'm trying to reproduce a song in his style.",
            "I'm not sure whether and it's actually the other way around.",
            "2:00 if it's if it's a good.",
            "If it's a good generator, I might just miss the thing that.",
            "Differentiates them.",
            "I'm just I just had one further question.",
            "Yeah, how is no density of property of a single note?",
            "No, it's not.",
            "It's not, it's not OK.",
            "So what is it exactly is no density?",
            "Then it's how fast not notes or something.",
            "So I practically look at how many notes they are.",
            "Berbar on average, yeah.",
            "Right?",
            "My question.",
            "There's more things that you extract from the lyrics or right?",
            "Oh yeah, yeah, that's actually so.",
            "So there are two things that were.",
            "Adding or planning on adding so one of them is the.",
            "Well, the syllable information, like whether a syllable is closed or open, or stress or unstress, but this don't tell you anything about the meaning of the lyrics, right?",
            "There is a whole different ballpark, and it would be very useful to combine them.",
            "We're not doing that right now, and I'm not sure when we got some nice things like.",
            "It's it's interesting.",
            "It combines this work combines actually pretty well with things that you can.",
            "You can figure out about how artists recite a poem right?",
            "So there are certain there are certain things about reciting a poem expressively that.",
            "Might and we did the little barrel experiments that might apply here.",
            "So for example, if you stress a note that is in a weak position metrical position, but you actually stress it a lot, that gives you a kind of a.",
            "Forward movement, so you're not fulfilling their expectation, you're delaying the status, the satisfying the expectation until you hit the stress.",
            "The next stress point, which is also in a strong magical position, so that gives you.",
            "So if you notice from the score and from the performance that you have this pattern that shows up that is not represented in the score as such because you're supposed to have, you're supposed to be in a week metrical position, but you're actually stressing it.",
            "The syllable is stressed, so you added information about this level and you got you got a completely different feel from if you do not have this extra information.",
            "So we're looking at that, but we're not.",
            "There yeah.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Today I'm going to tell you about some work we've been doing on modeling expressive performances of the human singing voice, and as I said, this is joint work with Sarah for amuse, from Bumper, Farrah in Barcelona.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "If you ask different people if you are someone what they like in a singer, they're going to tell you very different things.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So maybe somebody is going to tell you.",
                    "label": 0
                },
                {
                    "sent": "Well, I like the singer's voice, somebody else?",
                    "label": 0
                },
                {
                    "sent": "Might tell you I'm just gonna put it here if you don't mind.",
                    "label": 0
                },
                {
                    "sent": "Somebody else might tell you, well, I like their interpretation style.",
                    "label": 0
                },
                {
                    "sent": "I like the timber over the voice, the interpretation, musicality, resonance.",
                    "label": 1
                },
                {
                    "sent": "There all sorts of of terms that people might use when they want to characterize what they like in a singer.",
                    "label": 0
                },
                {
                    "sent": "And some of these terms are actually pretty vague, but some of them are also overlapping, but in the end, in reality all you have is the waveform and all these terms refer to properties.",
                    "label": 0
                },
                {
                    "sent": "Of this waveform.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "They specifically refer.",
                    "label": 0
                },
                {
                    "sent": "Don't look at this first.",
                    "label": 0
                },
                {
                    "sent": "They refer to acoustic features of the waveform, so things like.",
                    "label": 0
                },
                {
                    "sent": "Bits, timing, timber articulation, spectral engine distribution and their other other ones that I'm not mentioning here.",
                    "label": 0
                },
                {
                    "sent": "Specific focus in this work is vocal music, so there's an you semantic dimension that vocal that the fact that we're studying vocal music adds through what we call verbal features, and we we group the verbal features under what we call international phrasing.",
                    "label": 0
                },
                {
                    "sent": "It's maybe a little vague, So what I mean by international phrasing or things like?",
                    "label": 0
                },
                {
                    "sent": "Adding stress to words that otherwise otherwise would not be stressed.",
                    "label": 0
                },
                {
                    "sent": "Over articulation micro pauses.",
                    "label": 0
                },
                {
                    "sent": "Think of this type, for example, adding lengthening certain certain notes.",
                    "label": 0
                },
                {
                    "sent": "There are pitch accented things like that, so there's things that are that are that add a bit of semantics.",
                    "label": 0
                },
                {
                    "sent": "You get these from the fact that you also have the libretto, you only.",
                    "label": 0
                },
                {
                    "sent": "You don't only have the score, but in fact if you look at all of these things that I told you, they also reflect in the waveform and properties as properties of the wafer.",
                    "label": 0
                },
                {
                    "sent": "So, um.",
                    "label": 0
                },
                {
                    "sent": "You have all these features separately, and what the singers do.",
                    "label": 0
                },
                {
                    "sent": "They combine these features.",
                    "label": 0
                },
                {
                    "sent": "And the way they combine these features to reach a specific specific affective emotional expressive effect is what they give the personal style.",
                    "label": 0
                },
                {
                    "sent": "I'm going to use this word in a kind of a loose way, so a personal style is how we recognize a singer.",
                    "label": 0
                },
                {
                    "sent": "What is specific to that singer?",
                    "label": 0
                },
                {
                    "sent": "And that's what we're trying to figure out.",
                    "label": 0
                },
                {
                    "sent": "What is?",
                    "label": 0
                },
                {
                    "sent": "What does each singer do differently to what?",
                    "label": 0
                },
                {
                    "sent": "How they do we want to understand how they do things, how they manipulate these features.",
                    "label": 1
                },
                {
                    "sent": "This acoustic features and be able to.",
                    "label": 0
                },
                {
                    "sent": "Generates performances in their style so as well filesets in the previous session.",
                    "label": 0
                },
                {
                    "sent": "It is basically the personal style of a singer that that make.",
                    "label": 0
                },
                {
                    "sent": "Record sales and concert attendance and things like that.",
                    "label": 0
                },
                {
                    "sent": "So people, even if they are not well within what we culturally consider to be beautiful, what we're conditioned culturally to consider beautiful.",
                    "label": 0
                },
                {
                    "sent": "Maybe we don't appreciate Chinese music as we have from having grown up with it and we don't understand it very well.",
                    "label": 0
                },
                {
                    "sent": "But within Western music for example.",
                    "label": 0
                },
                {
                    "sent": "We we have, even if we're not very musically educated, we have very strong preferences for a particular style or a particular singer, as opposed to another one.",
                    "label": 0
                },
                {
                    "sent": "So we do recognize this specific style so.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our long-term goal, and this is the long term goal, and then I'm going to talk about the specific work that we're doing, which is quite preliminary.",
                    "label": 0
                },
                {
                    "sent": "So our long-term goal is to develop models of operatic singers.",
                    "label": 1
                },
                {
                    "sent": "And generate the expressive performances that are similar in interpretation and in voice quality.",
                    "label": 0
                },
                {
                    "sent": "Two original performances by this by the singers.",
                    "label": 0
                },
                {
                    "sent": "I don't know if it's necessary to explain again what expressive performances.",
                    "label": 0
                },
                {
                    "sent": "I think it's clear whatever deviation you have from the score 'cause here we have a fixed score, it's considered an expressive deviation.",
                    "label": 0
                },
                {
                    "sent": "Of course, it could be good deviation about deviation, but we're not talking about now about whether it's good or bad now.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "Why did we choose opera?",
                    "label": 0
                },
                {
                    "sent": "Basically for two reasons, well mainly for two reasons.",
                    "label": 0
                },
                {
                    "sent": "One of them is that you have an environment that is relatively constrained, so you have this core and then you have the libretto.",
                    "label": 0
                },
                {
                    "sent": "The lyrics and because you have this constrained environment, it's easier to measure.",
                    "label": 0
                },
                {
                    "sent": "It's easier to say what it is or deviation, what's an expressive deviation, and it's kind of easier to compare singers in terms of this expressive deviations.",
                    "label": 0
                },
                {
                    "sent": "It's also and this is something we're not.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to talk about, but I'm just going to mention it here and get it over with.",
                    "label": 0
                },
                {
                    "sent": "It's also easier for listeners.",
                    "label": 0
                },
                {
                    "sent": "That might or might not be educated to to label to identify what emotional content the particular expressive performance has.",
                    "label": 0
                },
                {
                    "sent": "The second reason why we choose what, why we chose Opera is that generally the operatic singers have better voice within the whatever.",
                    "label": 0
                },
                {
                    "sent": "It's not.",
                    "label": 1
                },
                {
                    "sent": "That is not always true, but generally they have better voice and better technique than other singers.",
                    "label": 0
                },
                {
                    "sent": "So there are more effective in in.",
                    "label": 0
                },
                {
                    "sent": "Producing an expressive performance.",
                    "label": 0
                },
                {
                    "sent": "So let's say that we returnable at some point of being able to understand how Braddock Singer specific operatic singers do what they do and generate expressive performances in their style, an with their voice features.",
                    "label": 0
                },
                {
                    "sent": "How can we use this?",
                    "label": 0
                },
                {
                    "sent": "Well, we can use this in four ways.",
                    "label": 1
                },
                {
                    "sent": "First of all.",
                    "label": 1
                },
                {
                    "sent": "We can generate interpretations of ideas of songs that were never recorded by the singers and, well, you can think of this, I suppose as an entertainment tool, you could also use this tool.",
                    "label": 0
                },
                {
                    "sent": "Well, such a tool for learning purposes so music professionals could use it to figure out how to how to learn.",
                    "label": 0
                },
                {
                    "sent": "Specific aspects of expressive singing and how to reach, for example, the same effect.",
                    "label": 0
                },
                {
                    "sent": "Emotional effects via different ways and play with that for the singers that we're going to, we're going to be able to generate very good, very accurate models.",
                    "label": 1
                },
                {
                    "sent": "We might be able to use these models to remaster old records.",
                    "label": 0
                },
                {
                    "sent": "And Lastly, I think I maybe it's not an opinion that is shared by the others, but I think it would be interesting to figure out if you can.",
                    "label": 0
                },
                {
                    "sent": "If you can understand the evolution of of of classical singing in terms of which Singer had an effect on other singers on other generations into in terms of technique and what are his own sources of inspiration.",
                    "label": 0
                },
                {
                    "sent": "So figure out how different singers influenced each other.",
                    "label": 0
                },
                {
                    "sent": "Technique wise.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As we said, we have a lot of acoustic features, a lot of pretty much everybody talked about them in their talks before.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I want to underline that what we're doing is understanding what the singers do and generate.",
                    "label": 0
                },
                {
                    "sent": "Expressive performances is not recognizing which performer is singing a specific piece.",
                    "label": 1
                },
                {
                    "sent": "So while as Raphael was saying in the previous session, when you recognize while a player or or singer.",
                    "label": 0
                },
                {
                    "sent": "You mostly look at like a singer.",
                    "label": 0
                },
                {
                    "sent": "You mostly look at timber.",
                    "label": 0
                },
                {
                    "sent": "He had a graph and singer.",
                    "label": 0
                },
                {
                    "sent": "Were all the way to the right where timber was the most important feature by which you could recognize a singer we're not doing.",
                    "label": 0
                },
                {
                    "sent": "We're not recognizing.",
                    "label": 0
                },
                {
                    "sent": "Singers were generating performances, so a model that is good.",
                    "label": 0
                },
                {
                    "sent": "For recognizing a singer might not be good for generating and expressive performances in the style of that singer, nor the other way around.",
                    "label": 0
                },
                {
                    "sent": "And information about timber is useful, but it's not enough.",
                    "label": 0
                },
                {
                    "sent": "To generate something in the style of that singer, they're actually orthogonal.",
                    "label": 0
                },
                {
                    "sent": "You have dynamics and timing.",
                    "label": 0
                },
                {
                    "sent": "And other internodes features and context features about the how he sings are melodic line and then their internodes features and they.",
                    "label": 0
                },
                {
                    "sent": "They work together too.",
                    "label": 0
                },
                {
                    "sent": "To create a an expressive melody.",
                    "label": 0
                },
                {
                    "sent": "So what we're this is, as I said, preliminary work an what I'm going to talk about now in this talk is simply about timing.",
                    "label": 0
                },
                {
                    "sent": "And so.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So that we can, we can actually do reasonable promising, promising stuff only with timing so.",
                    "label": 0
                },
                {
                    "sent": "This is the basic approach.",
                    "label": 0
                },
                {
                    "sent": "You start from existing audio commercial recordings.",
                    "label": 0
                },
                {
                    "sent": "These are not even studio recordings.",
                    "label": 0
                },
                {
                    "sent": "Their live performances of famous operatic singers and I'm specifically looking at the center voice.",
                    "label": 0
                },
                {
                    "sent": "And from this from this audio recordings you extract a set of high level descriptors.",
                    "label": 1
                },
                {
                    "sent": "I'm going to tell you what the specific descriptors are with the values, so you obtain a set of values for the high level descriptors from a set of ideas sang by the same center.",
                    "label": 0
                },
                {
                    "sent": "Based on those you apply machine learning techniques to learn.",
                    "label": 0
                },
                {
                    "sent": "A model that is specific to that Singer that sang all these ideas that you analyzed over here.",
                    "label": 0
                },
                {
                    "sent": "So you build, you build a model.",
                    "label": 0
                },
                {
                    "sent": "And you validate the model and then you have obviously a different set of training set that is different.",
                    "label": 0
                },
                {
                    "sent": "Sorry, a test set that is different from the training set and you.",
                    "label": 0
                },
                {
                    "sent": "You use the single specific model to generate new expressive performances of those scores in the test set, and then you can compare.",
                    "label": 0
                },
                {
                    "sent": "Whatever expressive performance you got based on your model with the actual performance and see how well how well you are doing.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "High level descriptors are.",
                    "label": 0
                },
                {
                    "sent": "Characterize a melodic line in terms of, well, two things.",
                    "label": 0
                },
                {
                    "sent": "One of them is the musical events.",
                    "label": 0
                },
                {
                    "sent": "And the musical events is practically a note.",
                    "label": 0
                },
                {
                    "sent": "And the other thing is the context of musical events, so.",
                    "label": 0
                },
                {
                    "sent": "Let's go through them in order.",
                    "label": 0
                },
                {
                    "sent": "So first of all.",
                    "label": 0
                },
                {
                    "sent": "We characterize the melody based on the score.",
                    "label": 1
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then on the performance.",
                    "label": 0
                },
                {
                    "sent": "In terms of score, we extract first node node properties, specifically pitch duration of the nodes metric strength and no density metric strength.",
                    "label": 0
                },
                {
                    "sent": "It's clear the magical strength associated with the notes.",
                    "label": 0
                },
                {
                    "sent": "Corresponds to the position of the notes in the bar and also depends on the time signature of the of the melodic line.",
                    "label": 0
                },
                {
                    "sent": "So if you have a four by four time signature, than the first beats in the bar is going to get stronger stress.",
                    "label": 0
                },
                {
                    "sent": "And then in the in the decreasing following order you get the thirds.",
                    "label": 0
                },
                {
                    "sent": "The third, then the 2nd and 4th, then the OFFBEATS and then Lastly the nodes that start at any other time that is not one of these gets the lowest stress.",
                    "label": 0
                },
                {
                    "sent": "This is just an example.",
                    "label": 0
                },
                {
                    "sent": "Not density.",
                    "label": 0
                },
                {
                    "sent": "Initially we didn't have this this parameter and then we actually notice that it makes a difference, so no density.",
                    "label": 0
                },
                {
                    "sent": "It's a measure of how fast the notes are sung, and you'll see in the next slide that we measure actual actual temple as well, so no density and actual tempo are complementing each other and.",
                    "label": 0
                },
                {
                    "sent": "There there are away too.",
                    "label": 0
                },
                {
                    "sent": "Away took to quantify a way to help classifying.",
                    "label": 0
                },
                {
                    "sent": "And grouping the ideas in terms of.",
                    "label": 0
                },
                {
                    "sent": "Whether they have the same style or the same feel.",
                    "label": 0
                },
                {
                    "sent": "The other.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Type of information that we're extracting from the scores, the context information.",
                    "label": 0
                },
                {
                    "sent": "So practically what we extract is the relative.",
                    "label": 0
                },
                {
                    "sent": "Pitch of the neighboring nodes.",
                    "label": 0
                },
                {
                    "sent": "The the length of the neighboring intervals and to add structure.",
                    "label": 0
                },
                {
                    "sent": "To our performance data we we apply the narmour's implication realization, theory of cognition and and perception.",
                    "label": 0
                },
                {
                    "sent": "So I I'm not sure I don't think I have to go into that again 'cause.",
                    "label": 0
                },
                {
                    "sent": "But I finally explained what it is about.",
                    "label": 0
                },
                {
                    "sent": "This is just.",
                    "label": 0
                },
                {
                    "sent": "An example of some of the patterns in armor theory.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Top.",
                    "label": 0
                },
                {
                    "sent": "Um information about musical events.",
                    "label": 0
                },
                {
                    "sent": "Information about context of musical events.",
                    "label": 0
                },
                {
                    "sent": "From the performance we get the note onset and duration.",
                    "label": 1
                },
                {
                    "sent": "These are the things that we're trying to predict, so these are the things that we're learning, so these are sort of like the input parameters and these are the things that we're trying to predict.",
                    "label": 1
                },
                {
                    "sent": "And we also need based on the score.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the performance we need.",
                    "label": 0
                },
                {
                    "sent": "The actual temple of the pieces.",
                    "label": 0
                },
                {
                    "sent": "So some of the pieces are annotated in the score with the temple, but some of them are not, and even the ones that are annotated are practically useless.",
                    "label": 0
                },
                {
                    "sent": "You have to look at.",
                    "label": 0
                },
                {
                    "sent": "How fast, so like what's the duration of the of the performance and then compute the actual temple based on that.",
                    "label": 0
                },
                {
                    "sent": "And actually, for pretty much all the pieces that we computed, the differences in tempo is from 50% to even like 100%, usually faster then it's annotation in the score.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Let's go back to.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our diagram.",
                    "label": 0
                },
                {
                    "sent": "So I told you what the high level descriptors are that we're extracting, and now I'm going to tell you how we extract them shortly, how we extract them, and how we use them.",
                    "label": 0
                },
                {
                    "sent": "Once we have them.",
                    "label": 0
                },
                {
                    "sent": "So we start from.",
                    "label": 0
                },
                {
                    "sent": "Life recordings, life, commercial recordings and we actually we.",
                    "label": 0
                },
                {
                    "sent": "We start from, well, files.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "We extract the high level descriptors in.",
                    "label": 0
                },
                {
                    "sent": "In different ways.",
                    "label": 0
                },
                {
                    "sent": "So the annotation in the score is done manually, so you get the pitch and the duration of the notes from the score.",
                    "label": 0
                },
                {
                    "sent": "That's done manually for getting the onset and note onset and duration of the actual performance.",
                    "label": 1
                },
                {
                    "sent": "We applied sound analysis techniques based on spectral models.",
                    "label": 1
                },
                {
                    "sent": "Um, metric meter metric strength is automatically computed based on.",
                    "label": 0
                },
                {
                    "sent": "The note length.",
                    "label": 0
                },
                {
                    "sent": "And obviously the score where the note starts in the bar.",
                    "label": 0
                },
                {
                    "sent": "No density is computed manually for the whole melody, so.",
                    "label": 0
                },
                {
                    "sent": "You look how many notes you have per bar, and you compute the node density.",
                    "label": 0
                },
                {
                    "sent": "Normal structure is generated.",
                    "label": 0
                },
                {
                    "sent": "For each node, you compute what you figure out which normal structure that notice part of, and that's done automatically based on analyzing the score and the actual tempo is computed manually based on the score and the duration of the melody.",
                    "label": 0
                },
                {
                    "sent": "So once you extracted the high level descriptors.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We use Wicca.",
                    "label": 0
                },
                {
                    "sent": "To generate the single specific models and to validate them.",
                    "label": 0
                },
                {
                    "sent": "So we tried several different learning algorithms.",
                    "label": 0
                },
                {
                    "sent": "And we decided to choose model trees.",
                    "label": 1
                },
                {
                    "sent": "I'm not going to go into any detail, but just in case, model trees in.",
                    "label": 0
                },
                {
                    "sent": "In classification using model trees, you basically generate a decision.",
                    "label": 0
                },
                {
                    "sent": "You have a regression problem.",
                    "label": 1
                },
                {
                    "sent": "You generate the decision list.",
                    "label": 0
                },
                {
                    "sent": "You build a tree.",
                    "label": 0
                },
                {
                    "sent": "You pick the best rule, the best leaf, and you make it into a rule and you repeat this process and you generate a set of rules that are going to practically give you a predict.",
                    "label": 0
                },
                {
                    "sent": "Whatever you're predicting, and in our case timing information, know duration, so you're going to get rules that are predicting the length, the duration of the notes.",
                    "label": 0
                },
                {
                    "sent": "Based on patterns of high level descriptors.",
                    "label": 1
                },
                {
                    "sent": "And then you have the test set, so you have the training set on which you generate the models and then you have the test set which is separate from the training set and for the test set.",
                    "label": 0
                },
                {
                    "sent": "You you you.",
                    "label": 0
                },
                {
                    "sent": "Validate the model on the test set and you generate expressive performances.",
                    "label": 0
                },
                {
                    "sent": "And I'm going to give you numbers about the correlation between the predicted and the actual values of the note durations.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here's our data set.",
                    "label": 0
                },
                {
                    "sent": "Somebody was saying, I think Darrell that you had.",
                    "label": 0
                },
                {
                    "sent": "For little data, that's very little data, this is something else, so we have very little data and very very little data, and I'm going to explain why.",
                    "label": 0
                },
                {
                    "sent": "And as I said, this is preliminary, so we're adding more data to it.",
                    "label": 0
                },
                {
                    "sent": "So what we have right now, we have six tenor Arias from operas by Verdi that add up to 415 notes.",
                    "label": 1
                },
                {
                    "sent": "And the criteria based on which we picked these ideas are the following.",
                    "label": 0
                },
                {
                    "sent": "First of all, they obviously have to be operatic and tenor ideas.",
                    "label": 0
                },
                {
                    "sent": "Second, they have to be a couple a, which is actually pretty hard.",
                    "label": 0
                },
                {
                    "sent": "It's there are not very many.",
                    "label": 0
                },
                {
                    "sent": "A couple of pieces.",
                    "label": 0
                },
                {
                    "sent": "In the opera and it's it's very hard to separate voice from orchestra, so that's been a problem and we're working on it, but.",
                    "label": 0
                },
                {
                    "sent": "It's slow progress.",
                    "label": 0
                },
                {
                    "sent": "The third criteria that we have is that we want to.",
                    "label": 0
                },
                {
                    "sent": "Generate single specific models from sets of ideas that have the same that share the same composition style.",
                    "label": 0
                },
                {
                    "sent": "Why is this important?",
                    "label": 0
                },
                {
                    "sent": "We were trying to learn patterns right?",
                    "label": 0
                },
                {
                    "sent": "So for the same sets for the same values for the inputs, we want to be able, hopefully to learn the same outputs in order to reinforce that pattern right?",
                    "label": 0
                },
                {
                    "sent": "And in that sense, what we need is we need to.",
                    "label": 0
                },
                {
                    "sent": "To put together compositions by by authors world by, by composers that use the same expressive means to embody the musical message.",
                    "label": 0
                },
                {
                    "sent": "Because if for the same context they have a different output because the style, the style is different, they want to reach.",
                    "label": 0
                },
                {
                    "sent": "A different effects then you're not going to find a pattern.",
                    "label": 0
                },
                {
                    "sent": "So you want to find.",
                    "label": 0
                },
                {
                    "sent": "You want to only group consist of pieces with consistent composition style so.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Practically, the six ideas are two ideas from from Traviata.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "One from Ballin Mascara, one from Lisa Miller one from Pattaya, Delany and or you want from Rigoletto.",
                    "label": 0
                },
                {
                    "sent": "So maybe except for Rigoletto all of them share the composition style of where this middle years so they pretty much have the same composition style.",
                    "label": 1
                },
                {
                    "sent": "I'm not an expert in composition style but so I can't there.",
                    "label": 0
                },
                {
                    "sent": "There are a few things I can tell you.",
                    "label": 0
                },
                {
                    "sent": "About how we got it all might be different, but.",
                    "label": 0
                },
                {
                    "sent": "For now on take my word, so these are.",
                    "label": 0
                },
                {
                    "sent": "These are pretty similar.",
                    "label": 0
                },
                {
                    "sent": "The five of them, the one that is from Rigoletto, is slightly different composition style.",
                    "label": 0
                },
                {
                    "sent": "The 4th criteria is we also want to have consistent interpretations though.",
                    "label": 0
                },
                {
                    "sent": "So what do we want to do?",
                    "label": 0
                },
                {
                    "sent": "Well, we want to learn singer specific models, so you're going to say, well, OK, so it's only one singer, so of course the singing style is going to be consistent 'cause it's the same singer all throughout, but that's not necessarily the same.",
                    "label": 0
                },
                {
                    "sent": "Is not necessarily true because.",
                    "label": 0
                },
                {
                    "sent": "Singers voices change overtime and also their interpretation style changes overtime so because of voice changes or or interpretation style changes, they might actually in the same context, they might choose to do things slightly differently.",
                    "label": 0
                },
                {
                    "sent": "And then you're not going to have a pattern that reinforces itself.",
                    "label": 0
                },
                {
                    "sent": "So in order to.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We can't say minimize, but.",
                    "label": 0
                },
                {
                    "sent": "Make that more.",
                    "label": 0
                },
                {
                    "sent": "Make it more possible to extract these patterns.",
                    "label": 0
                },
                {
                    "sent": "We focused on recordings by Joseph Karas from the Middle Middle 70s to the beginning of the 80s.",
                    "label": 0
                },
                {
                    "sent": "That's the last criteria for which we chose.",
                    "label": 0
                },
                {
                    "sent": "This ideas is that they are alive.",
                    "label": 0
                },
                {
                    "sent": "I'm not saying so.",
                    "label": 0
                },
                {
                    "sent": "Life means one, what means.",
                    "label": 0
                },
                {
                    "sent": "They don't have any post processing.",
                    "label": 0
                },
                {
                    "sent": "It's not possible to tell the singer what to sing or how to sing, or what expressive effects to look for when he's singing.",
                    "label": 0
                },
                {
                    "sent": "And I'm not saying that studio recordings are not interesting.",
                    "label": 0
                },
                {
                    "sent": "They're actually very interesting, and I think it would be very interesting to see whether the patterns differ in the case that you were looking at studio recordings of famous artists and live recordings, but for this particular piece of work, we're looking at live recordings.",
                    "label": 0
                },
                {
                    "sent": "OK, so given our data.",
                    "label": 0
                },
                {
                    "sent": "How much?",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Rap.",
                    "label": 0
                },
                {
                    "sent": "OK, given given our data, we we run our experiment.",
                    "label": 0
                },
                {
                    "sent": "So what's our goal to accurately predict an alteration as a function of the of the values of the high level descriptors?",
                    "label": 1
                },
                {
                    "sent": "This is I'm going to go pretty quick, so this is the list of ideas.",
                    "label": 0
                },
                {
                    "sent": "This is the first.",
                    "label": 0
                },
                {
                    "sent": "These are the six ideas that I was telling you about with the with the corresponding correlation coefficient.",
                    "label": 0
                },
                {
                    "sent": "So the correlation coefficient is what is the degree to which.",
                    "label": 0
                },
                {
                    "sent": "This the following two values.",
                    "label": 0
                },
                {
                    "sent": "Correlate with each other the actual notes, the no duration.",
                    "label": 0
                },
                {
                    "sent": "For every note in the test set as performed by that artist by Karas and the predicted no duration for the same notes.",
                    "label": 0
                },
                {
                    "sent": "As predicted by the model, the singer specific model that we built, so the test set and the and the training set.",
                    "label": 0
                },
                {
                    "sent": "If you look at only the first line, so this is for this idea.",
                    "label": 0
                },
                {
                    "sent": "What did I do here?",
                    "label": 0
                },
                {
                    "sent": "How did I get this coefficient I split?",
                    "label": 0
                },
                {
                    "sent": "Um, the this idea in.",
                    "label": 0
                },
                {
                    "sent": "8020 so 80% of the area I used it for training 20 for testing and you go like that for all the ideas separately.",
                    "label": 0
                },
                {
                    "sent": "So you get these numbers right up until here.",
                    "label": 0
                },
                {
                    "sent": "These are pretty good.",
                    "label": 0
                },
                {
                    "sent": "These are not that great, but they are significant and these are just terrible, right?",
                    "label": 0
                },
                {
                    "sent": "So there's no correlation.",
                    "label": 0
                },
                {
                    "sent": "The reason I suspect we don't have enough data to be sure, but I suspect that because the pieces are relatively complex, but they're not very long, you don't have a lot of consistency.",
                    "label": 0
                },
                {
                    "sent": "So in the same.",
                    "label": 0
                },
                {
                    "sent": "You don't have enough parameters to distinguish between 2 cases, where apparently you have the same input parameters but a different out so.",
                    "label": 0
                },
                {
                    "sent": "You're not able to distinguish between these, so this is a problem right?",
                    "label": 0
                },
                {
                    "sent": "So that's where we go to the second step of the experiment.",
                    "label": 0
                },
                {
                    "sent": "Anyway, so these are the results for each of the areas separately, and then we put all the areas together that have the same time signature and we obtain this coefficient correlation coefficient right so?",
                    "label": 0
                },
                {
                    "sent": "It's important to only put ideas together that have the same time signature, because because of the way you associate metric strength with notes within a bar.",
                    "label": 0
                },
                {
                    "sent": "So we get this number.",
                    "label": 0
                },
                {
                    "sent": "It doesn't look great.",
                    "label": 1
                },
                {
                    "sent": "The good news is that actually if you look at the areas that are grouped here, they have really different tempos, actual tempos, and they have very different density.",
                    "label": 0
                },
                {
                    "sent": "So I was actually, well, pleasantly surprised that we even get over.",
                    "label": 0
                },
                {
                    "sent": ".5 going from temples of 110 all the way to 54 and no density of I don't know 3.47 to 4.71, so they're pretty pretty.",
                    "label": 0
                },
                {
                    "sent": "The other thing that it's important is.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, you have this correlation coefficient.",
                    "label": 0
                },
                {
                    "sent": "But if you actually look at the graphs of the predicted no duration and the actual perform, do they correlate well?",
                    "label": 0
                },
                {
                    "sent": "Is it uniformly distributed the correlation?",
                    "label": 0
                },
                {
                    "sent": "And this is one of the ideas.",
                    "label": 0
                },
                {
                    "sent": "As I said before, So what is said before I think what is above 1, so these are not duration relative to the prescribed no duration in the score.",
                    "label": 0
                },
                {
                    "sent": "So what's above one is lengthened was below, one is shortened.",
                    "label": 0
                },
                {
                    "sent": "And you can see that you have certain points where.",
                    "label": 0
                },
                {
                    "sent": "You're not, it's really, really close, but the shape of the of the graph is kind of the same.",
                    "label": 0
                },
                {
                    "sent": "I'm only showing 20%.",
                    "label": 0
                },
                {
                    "sent": "Of the 20% of the testing test set for this particular idea here, OK, so we build this.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This model that only has.",
                    "label": 0
                },
                {
                    "sent": "Why 56?",
                    "label": 0
                },
                {
                    "sent": "But I'm actually pretty happy with it because of the diversity in actual tempozan no density.",
                    "label": 0
                },
                {
                    "sent": "But now the real experiment is when you take this model and it tested on data that.",
                    "label": 0
                },
                {
                    "sent": "That was not seen before, right?",
                    "label": 0
                },
                {
                    "sent": "So these are the correlation coefficients for.",
                    "label": 0
                },
                {
                    "sent": "Doing tests at a valuation of each of the areas separately against the model obtained from putting 80% of the data.",
                    "label": 1
                },
                {
                    "sent": "Together to build the model right so.",
                    "label": 0
                },
                {
                    "sent": "These two areas that used to have point 29.2 so they're completely irrelevant.",
                    "label": 0
                },
                {
                    "sent": "There was no correlation.",
                    "label": 0
                },
                {
                    "sent": "Now they jumped up to 61.8.",
                    "label": 0
                },
                {
                    "sent": "So what it means is that once you put the data together from the other ideas as well, you started observing patterns that were not obvious when you only looked at one audience separation in isolation, excuse me.",
                    "label": 0
                },
                {
                    "sent": "This jumped really high too, but it's understandable because it's not a very long idea.",
                    "label": 1
                },
                {
                    "sent": "These two.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is the only one that went down and it went down from 74 to 62.",
                    "label": 0
                },
                {
                    "sent": "What I think happens, but we don't have conclusive evidence 'cause we don't have that much data.",
                    "label": 0
                },
                {
                    "sent": "This is the idea from Rigoletto.",
                    "label": 0
                },
                {
                    "sent": "And I actually think that.",
                    "label": 0
                },
                {
                    "sent": "That you notice here the difference in style that you group things that are not exactly the same style and because you put the data from these guys, which is not the same style, exactly the same style.",
                    "label": 0
                },
                {
                    "sent": "With this idea, the correlation coefficient goes down while it was higher when you only look consistently at that that idea itself.",
                    "label": 0
                },
                {
                    "sent": "But good news is that.",
                    "label": 0
                },
                {
                    "sent": "You got pretty decent I think, and actually pretty good here.",
                    "label": 0
                },
                {
                    "sent": "Correlation coefficients and putting together the all the ideas the data from all the ideas.",
                    "label": 0
                },
                {
                    "sent": "You really strengthen the model and this is for.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This other idea.",
                    "label": 0
                },
                {
                    "sent": "This is how it looks like.",
                    "label": 0
                },
                {
                    "sent": "The correlation coefficient for this one is actually really high, but the shape like here and here for example.",
                    "label": 0
                },
                {
                    "sent": "I'm not following exactly the prediction and the and the actual performance don't follow each other very closely, but the general the general shape follow that the two shapes follow each other and actually quite surprisingly the last.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "The last note was predicted very accurate, accurately, OK, I'm going to finish and .5 minutes.",
                    "label": 0
                },
                {
                    "sent": "This is.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um, we're adding more ideas.",
                    "label": 0
                },
                {
                    "sent": "As I said, it's a slow process because they're actually not a lot of acapella ideas and we either have to get them from somewhere.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure where from since we can't record a tenor singing a couple on the studio, or we haven't been able to.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "We are adding more acoustic features because, well, fine, we got.",
                    "label": 1
                },
                {
                    "sent": "Pretty good correlation coefficients, but we have even if we add more areas, our final goal is to generate expressive performances.",
                    "label": 0
                },
                {
                    "sent": "You can generate expresses performances only with timing, so we're adding more things.",
                    "label": 0
                },
                {
                    "sent": "Currently, we're in the process of adding an energy model to the timing model and in the future we're going to add.",
                    "label": 0
                },
                {
                    "sent": "Well, timber exaggeration, which is the extra duration that you get around the pitch accented towards pitch range, action, shape and things about articulation, articulation, precision, things like that.",
                    "label": 0
                },
                {
                    "sent": "And we're also in the process of OK, so these are outs.",
                    "label": 0
                },
                {
                    "sent": "These are things that we want to predict in order to generate expressive performances, and these are things that input parameters to be able to classify more accurately.",
                    "label": 0
                },
                {
                    "sent": "So we're in the process of adding.",
                    "label": 1
                },
                {
                    "sent": "Syllable information we had actually pretty promising results.",
                    "label": 0
                },
                {
                    "sent": "Adding information about whether syllables are stressed or unstressed.",
                    "label": 0
                },
                {
                    "sent": "We got some pretty nice rules.",
                    "label": 0
                },
                {
                    "sent": "Um, that were only obtained because we added this information.",
                    "label": 0
                },
                {
                    "sent": "It's before everything was was clumped into one one plus and the.",
                    "label": 0
                },
                {
                    "sent": "All the rules were confusing each other, and in the future we want to add more things about international phrasing.",
                    "label": 0
                },
                {
                    "sent": "Given that a lot of these features from of international phrasing are the ones that actually make it possible to specify what.",
                    "label": 0
                },
                {
                    "sent": "Emotional.",
                    "label": 0
                },
                {
                    "sent": "What specific emotional state?",
                    "label": 0
                },
                {
                    "sent": "The singer is trying to too.",
                    "label": 0
                },
                {
                    "sent": "Reproduce and well.",
                    "label": 0
                },
                {
                    "sent": "I hope you have.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Questions, thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Two quick questions.",
                    "label": 0
                },
                {
                    "sent": "I have a question now.",
                    "label": 0
                },
                {
                    "sent": "Earlier you mentioned something about.",
                    "label": 0
                },
                {
                    "sent": "Recognition and generation being orthogonal?",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Why can't good identification model be used somehow reversed to generate well, right?",
                    "label": 0
                },
                {
                    "sent": "It seems excellent recognition model.",
                    "label": 0
                },
                {
                    "sent": "You would also automatically have a good general if you have the bus recognition model, yes, but what I'm saying is that there might be things based on which it's clear that it's Domingo, not carreras, right?",
                    "label": 0
                },
                {
                    "sent": "But if I'm trying to reproduce the way he's singing like his timber might, for example, his timber is completely different, right?",
                    "label": 0
                },
                {
                    "sent": "If I'm reproducing if my classifier, for example looks only at timber.",
                    "label": 0
                },
                {
                    "sent": "How can I generate something that sounds like a melody sung by him if the only information I have is intronaut is timber, I don't know whether I mean, he obviously does a lot of no duration transformations, and I'm sure that he's doing a lot of other stuff, but I wouldn't be able to know that if the only thing I'm looking at.",
                    "label": 0
                },
                {
                    "sent": "I'm just giving an example is timber information, so sure if I have a recognizer, a single recognizer that looks at.",
                    "label": 0
                },
                {
                    "sent": "A lot of features.",
                    "label": 0
                },
                {
                    "sent": "Then I'm probably going to be able to have a.",
                    "label": 0
                },
                {
                    "sent": "A good generator, but I'm sorry but distinguishing exactly what what difference between two singers like what it could be.",
                    "label": 0
                },
                {
                    "sent": "Even one thing.",
                    "label": 0
                },
                {
                    "sent": "The silliest thing.",
                    "label": 0
                },
                {
                    "sent": "One thing that they do different that is very clearly not this but is this it passes the threshold.",
                    "label": 0
                },
                {
                    "sent": "But that might be completely non representative.",
                    "label": 0
                },
                {
                    "sent": "When I'm trying to reproduce a song in his style.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure whether and it's actually the other way around.",
                    "label": 0
                },
                {
                    "sent": "2:00 if it's if it's a good.",
                    "label": 0
                },
                {
                    "sent": "If it's a good generator, I might just miss the thing that.",
                    "label": 0
                },
                {
                    "sent": "Differentiates them.",
                    "label": 0
                },
                {
                    "sent": "I'm just I just had one further question.",
                    "label": 0
                },
                {
                    "sent": "Yeah, how is no density of property of a single note?",
                    "label": 0
                },
                {
                    "sent": "No, it's not.",
                    "label": 0
                },
                {
                    "sent": "It's not, it's not OK.",
                    "label": 0
                },
                {
                    "sent": "So what is it exactly is no density?",
                    "label": 0
                },
                {
                    "sent": "Then it's how fast not notes or something.",
                    "label": 0
                },
                {
                    "sent": "So I practically look at how many notes they are.",
                    "label": 0
                },
                {
                    "sent": "Berbar on average, yeah.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "My question.",
                    "label": 0
                },
                {
                    "sent": "There's more things that you extract from the lyrics or right?",
                    "label": 0
                },
                {
                    "sent": "Oh yeah, yeah, that's actually so.",
                    "label": 0
                },
                {
                    "sent": "So there are two things that were.",
                    "label": 0
                },
                {
                    "sent": "Adding or planning on adding so one of them is the.",
                    "label": 0
                },
                {
                    "sent": "Well, the syllable information, like whether a syllable is closed or open, or stress or unstress, but this don't tell you anything about the meaning of the lyrics, right?",
                    "label": 0
                },
                {
                    "sent": "There is a whole different ballpark, and it would be very useful to combine them.",
                    "label": 0
                },
                {
                    "sent": "We're not doing that right now, and I'm not sure when we got some nice things like.",
                    "label": 0
                },
                {
                    "sent": "It's it's interesting.",
                    "label": 0
                },
                {
                    "sent": "It combines this work combines actually pretty well with things that you can.",
                    "label": 0
                },
                {
                    "sent": "You can figure out about how artists recite a poem right?",
                    "label": 0
                },
                {
                    "sent": "So there are certain there are certain things about reciting a poem expressively that.",
                    "label": 0
                },
                {
                    "sent": "Might and we did the little barrel experiments that might apply here.",
                    "label": 0
                },
                {
                    "sent": "So for example, if you stress a note that is in a weak position metrical position, but you actually stress it a lot, that gives you a kind of a.",
                    "label": 0
                },
                {
                    "sent": "Forward movement, so you're not fulfilling their expectation, you're delaying the status, the satisfying the expectation until you hit the stress.",
                    "label": 0
                },
                {
                    "sent": "The next stress point, which is also in a strong magical position, so that gives you.",
                    "label": 0
                },
                {
                    "sent": "So if you notice from the score and from the performance that you have this pattern that shows up that is not represented in the score as such because you're supposed to have, you're supposed to be in a week metrical position, but you're actually stressing it.",
                    "label": 0
                },
                {
                    "sent": "The syllable is stressed, so you added information about this level and you got you got a completely different feel from if you do not have this extra information.",
                    "label": 0
                },
                {
                    "sent": "So we're looking at that, but we're not.",
                    "label": 0
                },
                {
                    "sent": "There yeah.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}