{
    "id": "xcfiru4ndk5tdgdpfxt57ijpe7vvfdl3",
    "title": "Institutional Transition, Leadership, and Succession: Perspectives from Founders",
    "info": {
        "author": [
            "Virginijus Kundrotas, Baltic Management Development Association"
        ],
        "published": "Oct. 24, 2008",
        "recorded": "September 2008",
        "category": [
            "Top->Business->Leadership"
        ]
    },
    "url": "http://videolectures.net/ceeman08_kundrotas_itlspf/",
    "segmentation": [
        [
            "So speaking about SM University of Management Economics, just you know first."
        ],
        [
            "Very quick few facts about what we are and how we are.",
            "We've been established in 1999 as a school so it's a very young institution, but we've been established based on the experience of executive training center is been functioning for five years, so if the market we've been a bit longer than the middle school, and we've been the first, the first private University in, you know countries or that of course brought a lot of how the challenges and issues in order to develop understanding in the market about who we are and what private education is about in general.",
            "So today we have close to 1800 students.",
            "We have campuses in Unison corners.",
            "We have all types of programs.",
            "We have full fledged Business School.",
            "We have a PhD graduate and undergraduate education and also a lot of executive education.",
            "So and we are having a lot of professors coming, visiting professors, coming across the globe.",
            "Unfortunately our core faculty is still have a passion, so that's another challenge.",
            "But we got then of course we have a lot of exchange programs with different institutions.",
            "So, but then we've been establishing assembly in 1999, where the night where they need in the market was definitely well."
        ],
        [
            "Because you know the market was asking for the high quality training the businesses been asking quite alright.",
            "Well, to training their community in general.",
            "Been asking for the high quality degree programs and also the academicians been ready also to do something more.",
            "What they could do afford to do in the public institutions.",
            "That's why we've been coming, you know, and we will just."
        ],
        [
            "In place and in time.",
            "But of course a lot of challenges get spindale.",
            "So first of all, as I said, we've been starting from the Executive Training Center and to move from Executive Training Center to the full fledged Business School creates a lot of challenges.",
            "First of all, different cultures, different understanding of the things you know, then and then we've been being just, you know, consultants and providing executive education.",
            "We shared exactly the same values, more or less.",
            "You know, all consultants and administrative stuff, but then we enlarged.",
            "What we need to do, we need to take people from other public universities and then you know we got different cultures, different attitudes and different approaches also to their customers, to our students.",
            "So that was quite a big challenge to handle that too.",
            "To boil that water called culture, organizational culture and make that you know what people would see issues in the same way.",
            "So of course we had a challenge to create new and innovative programs.",
            "And I will tell you in a second how we've been doing that.",
            "We needed to recruit the best people, of course, and it was not very easier.",
            "Not only, but you know, we've been as a startup.",
            "We needed, you know, finances to include the best people, but also we did not have where to recruit those people.",
            "We still at that stage being another local so we could not rely on the international community.",
            "So first of all we need to store the local one.",
            "We had to take most people with the right attitudes and who would be able to handle legal to handle mutations in the same way as we've been thinking and what we've been trying to.",
            "Reach all the time, so that was a challenge.",
            "And also of course to create and keep joint value system inside of organization.",
            "As has been mentioned to know by many of you.",
            "And I would tell in a second how we've been doing that also."
        ],
        [
            "To build the modern physical infrastructure.",
            "So first of all, you know we've been the private institution.",
            "Now traditions for private education in the country, and nobody believed in the private belief in the publication.",
            "So you need it also to show and propose something something different.",
            "You know in order to do that.",
            "And in order to.",
            "Of course, you know to grow, we needed to.",
            "Market share, and that's what we've been doing in an average about 20% each year, so we needed to build the networks and partnerships and establish.",
            "Is that awareness and recognition also we needed to change some loss."
        ],
        [
            "Nope, I education that we did in the country and also of course you assure financial background because nobody was giving us the money.",
            "So we've been established by Norwegian School of Management, which actually provided the long term loan which we repaid finally.",
            "So actually we've been living completely under tuition fees.",
            "We earn what we from our programs from our services.",
            "So that was good.",
            "That helped us to grow their muscles, but that was done.",
            "So we developed different type of Federated."
        ],
        [
            "Grams undergraduate programs.",
            "We tried to be billing well within an English and then added completely English programs.",
            "So we also created."
        ],
        [
            "Completely English program because we understood what within the market started small.",
            "So we came into the larger market so."
        ],
        [
            "Master of Science program was completely in English and also executive education we've been developing from the previous basis, not per previous experiences and also added the degree program.",
            "Some kind of emba type of the program together with."
        ],
        [
            "Gently with allegiance block management, providing double degree so that work quite well.",
            "And of course we needed to as many schools of our region we needed to develop the research.",
            "So we tried with.",
            "Our research would be really relevant.",
            "So we developed our PhD studies and we've been very much proud.",
            "But about PhD status has been announced.",
            "Not the best in the country couple of years ago.",
            "So and together Emerald, we've been launching the boat in Journal of Management and so we tried to do a lot of.",
            "Things in order to survive.",
            "First of all, of course we."
        ],
        [
            "In setting up a vision and mission as necessary, as we discussed previously and we did not change that mission and vision until the last year.",
            "So last year we corrected a little bit.",
            "We added one phrase in our mission, we said professionally and socially responsible social responsible development or parents measure competence.",
            "So we thought what you know, it should be everywhere.",
            "As we also been among the first Seaman members have been joining there.",
            "Prime initiative and we think it's very important.",
            "So as you say."
        ],
        [
            "Value system so one of the things that we've been really trying to do to develop the value system jointly.",
            "We gathered together all staff of our University about four years ago and we created the value system.",
            "So then values which actually up towards the next activity five we generated together in order to understand that.",
            "And you know, we put innovation, openness, quality.",
            "Professional is lifelong learning etc etc.",
            "So which helped us for awhile?"
        ],
        [
            "Do to be to develop a good organizational structure.",
            "The growth of the students was actually quite."
        ],
        [
            "Rabbits and is still growing, so we have the campuses.",
            "New Campus is important."
        ],
        [
            "Venus new facilities.",
            "Nice facilities in in all parts of the city, so seems very nice.",
            "We have hosted recognition we've been talking about that so we got equal accreditation from semen."
        ],
        [
            "In this universal selection of 1000, business schools within among 300 the best schools we got this for problems we have.",
            "This European Credit Transfer label and etc etc so but.",
            "You know we've been growing."
        ],
        [
            "So quickly and you know, this group created a lot of challenges.",
            "So organization has been expanding."
        ],
        [
            "And you people been coming, so even those would be created both values, so they already.",
            "You know, being the minority of them.",
            "So the new people who actually been coming, they did not know what it is about and actually it was not very easy to do things in the same way as we've been usually doing that.",
            "And in order to keep the best people we needed to pay much more than we've been able to do that so.",
            "And we've been competing not to fire schools between competing for business because we've been taking our administrative people, coordinators and administrators.",
            "We've been very good.",
            "We develop them, educated them, and they've been living.",
            "They've been handed out by tomorrow, so that was one of the challenges that we have there also, you know.",
            "Yeah, they said culture organization was drawing.",
            "Management was becoming more complex and diversified.",
            "You know we had.",
            "You know, different schools we had different programs, we met different managers.",
            "They did not have enough competence.",
            "So we needed time to develop their competence at the same time we needed to grow further and we needed to develop new product programs to a new minor etc etc.",
            "So it was you know that wraps.",
            "But doctoral thesis has been describing previously also you know?",
            "And we needed this competence development through all organization so the process is also became becoming becoming more and more complicated and at the same time we tried to keep that United.",
            "You know, we had the undergraduate graduate Executive School which in reality conserving completely different customers, but at the same time we want it.",
            "But it could be the same as it could be the same between management University.",
            "So in order to find the common understanding and the common goals, it was rather complicated.",
            "That was a lot of.",
            "Challenges that we face.",
            "And of course, you know, informational communication with becoming very difficult because then you have so different units.",
            "Very easy.",
            "You know what information is not reaching to the right time to the right people.",
            "And then you know the rumors are coming and you know coming and people interpreting things.",
            "But we've been saying a sentence ever so that was a lot of the issue.",
            "So of course you know control and."
        ],
        [
            "The activities he has becoming also much more complicated than you been growing up, so actually then you know to be fast.",
            "It's big advantage, as we say in short in short distance, but of course too little long race.",
            "You need that to be, you know, more sustainable.",
            "And of course for that we need their competence and actually for that.",
            "You feel you know, but it is necessary to do and for other successor.",
            "Yeah I did not mention one thing.",
            "So by facing these things you know I've been at the pioneering stage.",
            "I stab Lish the universe they've been running that and developed from that executive center at that certain stage.",
            "When you have, you know these programs develop.",
            "You got a nice buildings.",
            "We have their students growing up, etc.",
            "So, well, it looks like you know you achieve a lot and you know you could continue to do that because as we saw a lot of challenges still be coming.",
            "But you know it was not fire already anymore, so it was not so interesting 'cause there."
        ],
        [
            "The challenges that we've been facing.",
            "We needed to make a more clear structure.",
            "We needed to set up the more clear process is to control those processes, to delegate, etc.",
            "And I felt you know, I started a lot of businesses, but they felt that this is not exactly what my heart is fishy.",
            "So then you know, I decided one year ago, but I am stepping out and we agreed with our Board of Directors know, but they're releasing him, but they asked me to stay for one more year and they will fight for success and for the successor.",
            "So we had.",
            "We found that half an year ago, so happy New Year was the transition period, which was most complicated.",
            "For me.",
            "I should say, because you know you are still in charge.",
            "You still running things, but you know what you know you cannot make long term plans and long-term strategies which would be remained or kept.",
            "So in reality you are just monitoring, trying to know to take over.",
            "You know your successor etc etc and that's.",
            "Personally it is not very not very easy feeling, but actually for him at the moment and he's pretty.",
            "But he is not here.",
            "He would be able to talk about himself.",
            "It's quite a challenge because it would need to.",
            "Probably as we've been discussing to slow down things to slow down to set up structures, to to put, you know, to develop the further, develop their search, continue to do experimental, and we experienced based teaching, performance based competence development.",
            "Well, to set up different structures to standardize processes, we are involved now in the input into huge investment into the new AP."
        ],
        [
            "Management in the system development which would help you know to control these costs etc.",
            "So a lot of things taking place now come from your site and you should take yet.",
            "And of course still keep monitoring.",
            "Monitoring the value system because what they realized myself the values actually the most important thing in order to to keep the organization together.",
            "And it's a challenge how to do that then organizations nearly becoming today.",
            "So that was very briefly my short introduction.",
            "And if in fact they would like to get the floor to pick it up today."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So speaking about SM University of Management Economics, just you know first.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Very quick few facts about what we are and how we are.",
                    "label": 0
                },
                {
                    "sent": "We've been established in 1999 as a school so it's a very young institution, but we've been established based on the experience of executive training center is been functioning for five years, so if the market we've been a bit longer than the middle school, and we've been the first, the first private University in, you know countries or that of course brought a lot of how the challenges and issues in order to develop understanding in the market about who we are and what private education is about in general.",
                    "label": 0
                },
                {
                    "sent": "So today we have close to 1800 students.",
                    "label": 1
                },
                {
                    "sent": "We have campuses in Unison corners.",
                    "label": 0
                },
                {
                    "sent": "We have all types of programs.",
                    "label": 0
                },
                {
                    "sent": "We have full fledged Business School.",
                    "label": 1
                },
                {
                    "sent": "We have a PhD graduate and undergraduate education and also a lot of executive education.",
                    "label": 1
                },
                {
                    "sent": "So and we are having a lot of professors coming, visiting professors, coming across the globe.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately our core faculty is still have a passion, so that's another challenge.",
                    "label": 0
                },
                {
                    "sent": "But we got then of course we have a lot of exchange programs with different institutions.",
                    "label": 0
                },
                {
                    "sent": "So, but then we've been establishing assembly in 1999, where the night where they need in the market was definitely well.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Because you know the market was asking for the high quality training the businesses been asking quite alright.",
                    "label": 0
                },
                {
                    "sent": "Well, to training their community in general.",
                    "label": 0
                },
                {
                    "sent": "Been asking for the high quality degree programs and also the academicians been ready also to do something more.",
                    "label": 0
                },
                {
                    "sent": "What they could do afford to do in the public institutions.",
                    "label": 0
                },
                {
                    "sent": "That's why we've been coming, you know, and we will just.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In place and in time.",
                    "label": 0
                },
                {
                    "sent": "But of course a lot of challenges get spindale.",
                    "label": 0
                },
                {
                    "sent": "So first of all, as I said, we've been starting from the Executive Training Center and to move from Executive Training Center to the full fledged Business School creates a lot of challenges.",
                    "label": 1
                },
                {
                    "sent": "First of all, different cultures, different understanding of the things you know, then and then we've been being just, you know, consultants and providing executive education.",
                    "label": 0
                },
                {
                    "sent": "We shared exactly the same values, more or less.",
                    "label": 0
                },
                {
                    "sent": "You know, all consultants and administrative stuff, but then we enlarged.",
                    "label": 0
                },
                {
                    "sent": "What we need to do, we need to take people from other public universities and then you know we got different cultures, different attitudes and different approaches also to their customers, to our students.",
                    "label": 0
                },
                {
                    "sent": "So that was quite a big challenge to handle that too.",
                    "label": 0
                },
                {
                    "sent": "To boil that water called culture, organizational culture and make that you know what people would see issues in the same way.",
                    "label": 0
                },
                {
                    "sent": "So of course we had a challenge to create new and innovative programs.",
                    "label": 0
                },
                {
                    "sent": "And I will tell you in a second how we've been doing that.",
                    "label": 0
                },
                {
                    "sent": "We needed to recruit the best people, of course, and it was not very easier.",
                    "label": 0
                },
                {
                    "sent": "Not only, but you know, we've been as a startup.",
                    "label": 0
                },
                {
                    "sent": "We needed, you know, finances to include the best people, but also we did not have where to recruit those people.",
                    "label": 0
                },
                {
                    "sent": "We still at that stage being another local so we could not rely on the international community.",
                    "label": 0
                },
                {
                    "sent": "So first of all we need to store the local one.",
                    "label": 0
                },
                {
                    "sent": "We had to take most people with the right attitudes and who would be able to handle legal to handle mutations in the same way as we've been thinking and what we've been trying to.",
                    "label": 0
                },
                {
                    "sent": "Reach all the time, so that was a challenge.",
                    "label": 0
                },
                {
                    "sent": "And also of course to create and keep joint value system inside of organization.",
                    "label": 0
                },
                {
                    "sent": "As has been mentioned to know by many of you.",
                    "label": 0
                },
                {
                    "sent": "And I would tell in a second how we've been doing that also.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To build the modern physical infrastructure.",
                    "label": 1
                },
                {
                    "sent": "So first of all, you know we've been the private institution.",
                    "label": 0
                },
                {
                    "sent": "Now traditions for private education in the country, and nobody believed in the private belief in the publication.",
                    "label": 0
                },
                {
                    "sent": "So you need it also to show and propose something something different.",
                    "label": 0
                },
                {
                    "sent": "You know in order to do that.",
                    "label": 0
                },
                {
                    "sent": "And in order to.",
                    "label": 0
                },
                {
                    "sent": "Of course, you know to grow, we needed to.",
                    "label": 1
                },
                {
                    "sent": "Market share, and that's what we've been doing in an average about 20% each year, so we needed to build the networks and partnerships and establish.",
                    "label": 1
                },
                {
                    "sent": "Is that awareness and recognition also we needed to change some loss.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Nope, I education that we did in the country and also of course you assure financial background because nobody was giving us the money.",
                    "label": 1
                },
                {
                    "sent": "So we've been established by Norwegian School of Management, which actually provided the long term loan which we repaid finally.",
                    "label": 0
                },
                {
                    "sent": "So actually we've been living completely under tuition fees.",
                    "label": 0
                },
                {
                    "sent": "We earn what we from our programs from our services.",
                    "label": 0
                },
                {
                    "sent": "So that was good.",
                    "label": 0
                },
                {
                    "sent": "That helped us to grow their muscles, but that was done.",
                    "label": 0
                },
                {
                    "sent": "So we developed different type of Federated.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Grams undergraduate programs.",
                    "label": 0
                },
                {
                    "sent": "We tried to be billing well within an English and then added completely English programs.",
                    "label": 0
                },
                {
                    "sent": "So we also created.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Completely English program because we understood what within the market started small.",
                    "label": 0
                },
                {
                    "sent": "So we came into the larger market so.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Master of Science program was completely in English and also executive education we've been developing from the previous basis, not per previous experiences and also added the degree program.",
                    "label": 0
                },
                {
                    "sent": "Some kind of emba type of the program together with.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Gently with allegiance block management, providing double degree so that work quite well.",
                    "label": 0
                },
                {
                    "sent": "And of course we needed to as many schools of our region we needed to develop the research.",
                    "label": 0
                },
                {
                    "sent": "So we tried with.",
                    "label": 0
                },
                {
                    "sent": "Our research would be really relevant.",
                    "label": 0
                },
                {
                    "sent": "So we developed our PhD studies and we've been very much proud.",
                    "label": 0
                },
                {
                    "sent": "But about PhD status has been announced.",
                    "label": 0
                },
                {
                    "sent": "Not the best in the country couple of years ago.",
                    "label": 0
                },
                {
                    "sent": "So and together Emerald, we've been launching the boat in Journal of Management and so we tried to do a lot of.",
                    "label": 1
                },
                {
                    "sent": "Things in order to survive.",
                    "label": 0
                },
                {
                    "sent": "First of all, of course we.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In setting up a vision and mission as necessary, as we discussed previously and we did not change that mission and vision until the last year.",
                    "label": 0
                },
                {
                    "sent": "So last year we corrected a little bit.",
                    "label": 0
                },
                {
                    "sent": "We added one phrase in our mission, we said professionally and socially responsible social responsible development or parents measure competence.",
                    "label": 1
                },
                {
                    "sent": "So we thought what you know, it should be everywhere.",
                    "label": 1
                },
                {
                    "sent": "As we also been among the first Seaman members have been joining there.",
                    "label": 0
                },
                {
                    "sent": "Prime initiative and we think it's very important.",
                    "label": 0
                },
                {
                    "sent": "So as you say.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Value system so one of the things that we've been really trying to do to develop the value system jointly.",
                    "label": 0
                },
                {
                    "sent": "We gathered together all staff of our University about four years ago and we created the value system.",
                    "label": 0
                },
                {
                    "sent": "So then values which actually up towards the next activity five we generated together in order to understand that.",
                    "label": 0
                },
                {
                    "sent": "And you know, we put innovation, openness, quality.",
                    "label": 0
                },
                {
                    "sent": "Professional is lifelong learning etc etc.",
                    "label": 0
                },
                {
                    "sent": "So which helped us for awhile?",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Do to be to develop a good organizational structure.",
                    "label": 0
                },
                {
                    "sent": "The growth of the students was actually quite.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Rabbits and is still growing, so we have the campuses.",
                    "label": 0
                },
                {
                    "sent": "New Campus is important.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Venus new facilities.",
                    "label": 0
                },
                {
                    "sent": "Nice facilities in in all parts of the city, so seems very nice.",
                    "label": 0
                },
                {
                    "sent": "We have hosted recognition we've been talking about that so we got equal accreditation from semen.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In this universal selection of 1000, business schools within among 300 the best schools we got this for problems we have.",
                    "label": 1
                },
                {
                    "sent": "This European Credit Transfer label and etc etc so but.",
                    "label": 0
                },
                {
                    "sent": "You know we've been growing.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So quickly and you know, this group created a lot of challenges.",
                    "label": 0
                },
                {
                    "sent": "So organization has been expanding.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And you people been coming, so even those would be created both values, so they already.",
                    "label": 0
                },
                {
                    "sent": "You know, being the minority of them.",
                    "label": 0
                },
                {
                    "sent": "So the new people who actually been coming, they did not know what it is about and actually it was not very easy to do things in the same way as we've been usually doing that.",
                    "label": 0
                },
                {
                    "sent": "And in order to keep the best people we needed to pay much more than we've been able to do that so.",
                    "label": 0
                },
                {
                    "sent": "And we've been competing not to fire schools between competing for business because we've been taking our administrative people, coordinators and administrators.",
                    "label": 0
                },
                {
                    "sent": "We've been very good.",
                    "label": 0
                },
                {
                    "sent": "We develop them, educated them, and they've been living.",
                    "label": 0
                },
                {
                    "sent": "They've been handed out by tomorrow, so that was one of the challenges that we have there also, you know.",
                    "label": 0
                },
                {
                    "sent": "Yeah, they said culture organization was drawing.",
                    "label": 0
                },
                {
                    "sent": "Management was becoming more complex and diversified.",
                    "label": 1
                },
                {
                    "sent": "You know we had.",
                    "label": 0
                },
                {
                    "sent": "You know, different schools we had different programs, we met different managers.",
                    "label": 0
                },
                {
                    "sent": "They did not have enough competence.",
                    "label": 0
                },
                {
                    "sent": "So we needed time to develop their competence at the same time we needed to grow further and we needed to develop new product programs to a new minor etc etc.",
                    "label": 0
                },
                {
                    "sent": "So it was you know that wraps.",
                    "label": 0
                },
                {
                    "sent": "But doctoral thesis has been describing previously also you know?",
                    "label": 1
                },
                {
                    "sent": "And we needed this competence development through all organization so the process is also became becoming becoming more and more complicated and at the same time we tried to keep that United.",
                    "label": 0
                },
                {
                    "sent": "You know, we had the undergraduate graduate Executive School which in reality conserving completely different customers, but at the same time we want it.",
                    "label": 0
                },
                {
                    "sent": "But it could be the same as it could be the same between management University.",
                    "label": 0
                },
                {
                    "sent": "So in order to find the common understanding and the common goals, it was rather complicated.",
                    "label": 0
                },
                {
                    "sent": "That was a lot of.",
                    "label": 0
                },
                {
                    "sent": "Challenges that we face.",
                    "label": 0
                },
                {
                    "sent": "And of course, you know, informational communication with becoming very difficult because then you have so different units.",
                    "label": 0
                },
                {
                    "sent": "Very easy.",
                    "label": 0
                },
                {
                    "sent": "You know what information is not reaching to the right time to the right people.",
                    "label": 0
                },
                {
                    "sent": "And then you know the rumors are coming and you know coming and people interpreting things.",
                    "label": 1
                },
                {
                    "sent": "But we've been saying a sentence ever so that was a lot of the issue.",
                    "label": 0
                },
                {
                    "sent": "So of course you know control and.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The activities he has becoming also much more complicated than you been growing up, so actually then you know to be fast.",
                    "label": 0
                },
                {
                    "sent": "It's big advantage, as we say in short in short distance, but of course too little long race.",
                    "label": 1
                },
                {
                    "sent": "You need that to be, you know, more sustainable.",
                    "label": 0
                },
                {
                    "sent": "And of course for that we need their competence and actually for that.",
                    "label": 0
                },
                {
                    "sent": "You feel you know, but it is necessary to do and for other successor.",
                    "label": 0
                },
                {
                    "sent": "Yeah I did not mention one thing.",
                    "label": 0
                },
                {
                    "sent": "So by facing these things you know I've been at the pioneering stage.",
                    "label": 0
                },
                {
                    "sent": "I stab Lish the universe they've been running that and developed from that executive center at that certain stage.",
                    "label": 0
                },
                {
                    "sent": "When you have, you know these programs develop.",
                    "label": 0
                },
                {
                    "sent": "You got a nice buildings.",
                    "label": 0
                },
                {
                    "sent": "We have their students growing up, etc.",
                    "label": 0
                },
                {
                    "sent": "So, well, it looks like you know you achieve a lot and you know you could continue to do that because as we saw a lot of challenges still be coming.",
                    "label": 0
                },
                {
                    "sent": "But you know it was not fire already anymore, so it was not so interesting 'cause there.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The challenges that we've been facing.",
                    "label": 0
                },
                {
                    "sent": "We needed to make a more clear structure.",
                    "label": 0
                },
                {
                    "sent": "We needed to set up the more clear process is to control those processes, to delegate, etc.",
                    "label": 0
                },
                {
                    "sent": "And I felt you know, I started a lot of businesses, but they felt that this is not exactly what my heart is fishy.",
                    "label": 1
                },
                {
                    "sent": "So then you know, I decided one year ago, but I am stepping out and we agreed with our Board of Directors know, but they're releasing him, but they asked me to stay for one more year and they will fight for success and for the successor.",
                    "label": 0
                },
                {
                    "sent": "So we had.",
                    "label": 0
                },
                {
                    "sent": "We found that half an year ago, so happy New Year was the transition period, which was most complicated.",
                    "label": 0
                },
                {
                    "sent": "For me.",
                    "label": 0
                },
                {
                    "sent": "I should say, because you know you are still in charge.",
                    "label": 0
                },
                {
                    "sent": "You still running things, but you know what you know you cannot make long term plans and long-term strategies which would be remained or kept.",
                    "label": 0
                },
                {
                    "sent": "So in reality you are just monitoring, trying to know to take over.",
                    "label": 0
                },
                {
                    "sent": "You know your successor etc etc and that's.",
                    "label": 0
                },
                {
                    "sent": "Personally it is not very not very easy feeling, but actually for him at the moment and he's pretty.",
                    "label": 0
                },
                {
                    "sent": "But he is not here.",
                    "label": 0
                },
                {
                    "sent": "He would be able to talk about himself.",
                    "label": 0
                },
                {
                    "sent": "It's quite a challenge because it would need to.",
                    "label": 0
                },
                {
                    "sent": "Probably as we've been discussing to slow down things to slow down to set up structures, to to put, you know, to develop the further, develop their search, continue to do experimental, and we experienced based teaching, performance based competence development.",
                    "label": 1
                },
                {
                    "sent": "Well, to set up different structures to standardize processes, we are involved now in the input into huge investment into the new AP.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Management in the system development which would help you know to control these costs etc.",
                    "label": 0
                },
                {
                    "sent": "So a lot of things taking place now come from your site and you should take yet.",
                    "label": 0
                },
                {
                    "sent": "And of course still keep monitoring.",
                    "label": 1
                },
                {
                    "sent": "Monitoring the value system because what they realized myself the values actually the most important thing in order to to keep the organization together.",
                    "label": 0
                },
                {
                    "sent": "And it's a challenge how to do that then organizations nearly becoming today.",
                    "label": 0
                },
                {
                    "sent": "So that was very briefly my short introduction.",
                    "label": 0
                },
                {
                    "sent": "And if in fact they would like to get the floor to pick it up today.",
                    "label": 0
                }
            ]
        }
    }
}