{
    "id": "xlmljtjl6foy76xkwefxrn7kbashiv4r",
    "title": "Modeling Relational Events via Latent Classes",
    "info": {
        "author": [
            "Christopher DuBois, Department of Statistics, University of California, Irvine"
        ],
        "published": "Oct. 1, 2010",
        "recorded": "July 2010",
        "category": [
            "Top->Computer Science->Pattern Recognition"
        ]
    },
    "url": "http://videolectures.net/kdd2010_dubois_mrel/",
    "segmentation": [
        [
            "So power.",
            "On modeling relational events.",
            "Dear latent classes will be presented by Christopher Viewpoint.",
            "So my name is Chris Dubois.",
            "An.",
            "I'll be presenting some work I did with my advisor, Pork Smith, at UC Irvine on modeling relational events via latent classes."
        ],
        [
            "So oftentimes, social network data comes in the form of a sequence of relational events.",
            "One Canonical example is communication data, where we have a sequence of timestamped events each having a specific sender recipient, and perhaps an action type that might indicate whether the communication was an email phone call, and it's a message or two people on a networking sites are sharing a news article, so."
        ],
        [
            "Here we see edges or events arrive one at a time.",
            "Individual 15 contact."
        ],
        [
            "1114 count contacting."
        ],
        [
            "11 An over some time span we can aggregate those events an model.",
            "The activity is a social network and where edges might have some volume weight that represents the volume of communication between those two individuals."
        ],
        [
            "So here's a real data set of 200,000 email messages among roughly 3000 individuals email accounts at a European University, and we could similarly aggregate the activity over those 82 days and visualize the network of communication among all these individuals.",
            "Or, equivalently, we could look at the adjacency matrix, where here we have the sender on the Y axis, the recipient on the X axis, and the volume of communication between those two people.",
            "Is represented by the size of the dot, so today we'll be talking about.",
            "The creative models that can help you make predictions from."
        ],
        [
            "Data, so to formalize this little bit, suppose we've observed T events, each with a particular sender, receiver, and action type, and we want to be able to predict the communication volume for a particular combination of those with the sender S, recipient R and action Type A at some future finite time interval.",
            "So in most cases it will be quite easy to predict the volume of any event occurring over that time interval.",
            "The tricky part comes how do we becomes when you want to estimate the frequency of a single unique event relative to all the other possible events, and what this boils down to is that we need good estimates of the probability of sender S particular sender sending to a particular recipient with particular action type A and the probability that that's the next event."
        ],
        [
            "So what are some naive ways about of going about this so we could try and estimate these probabilities using essentially the frequency with which they occur in the past?",
            "So what happens when you try to do that?",
            "Well, if we have an individuals and a action types we have on the order of N ^2 * A cells to estimate because that pretty much amounts to a multinomial that we're trying to estimate.",
            "What happens with this setup when we have far fewer events than even N squared?",
            "That pretty much amounts to the cold start problem.",
            "You have no chance of coming up with good estimates for all those possible cells.",
            "Furthermore, we also oftentimes see in these settings that.",
            "Few individuals have a lot of activity, a ton of individuals have very little activity, and in this case this naive approach will also fail pretty dramatically.",
            "So what this calls for is some intelligent way of trying to.",
            "Share information among individuals or events that are similar in some sense, and this idea is by no means new in the field."
        ],
        [
            "Social network analysis.",
            "One example is block models.",
            "Here the block model consists of two things.",
            "A partition of the individuals and some model for the GroupWise.",
            "Interactions between those partitions.",
            "So as a quick example here, here's a partition of these individuals and the GroupWise model would might say that there's a high probability of a within group interaction and a low probability of groups interacting with the Red Group.",
            "Some recent extensions, the last five 10 years have taken a wait and variable approach where the latent variables indicate the latent group assignment for each of the individuals.",
            "An some extensions that include the mixed membership stochastic block model, the infinite relational model, and a few others."
        ],
        [
            "So to give you a little bit of intuition for this, say we've observed this data where each dot is an email from the sender on the Y axis to the recipient on the X axis, and I've jittered the dots a little bit to give you a sense of the relative volume between of communication between these."
        ],
        [
            "Individuals where you might not see right away is that by rearranging the rows and columns in a particular way, we can obtain this same.",
            "This plot of this same data, but this is quite a bit more informative in that we can see that there's this group of individuals on the left that all communicate with this group of individuals.",
            "At roughly the same rate.",
            "So having observed data like this, we would hope to have a MoD."
        ],
        [
            "So whose predictive distribution looks like this, where the shade of each square represents the relative probability of that interaction occurring.",
            "So in this situation."
        ],
        [
            "A block model might do something like this, where we have a partition of the senders or particular partition of the recipients, and we're able to model the GroupWise interactions with a single probability.",
            "However, in this setting, intuitively we see there might be a more."
        ],
        [
            "Parsimonious explanation and that there seems to be 4 latent classes.",
            "Events where events within each Lane class occur with similar probability, so this intuition is going to guide the approach we take."
        ],
        [
            "Returning to the three dimensional example setting, we first assume that the attributes of each event, the sender, the recipient, and action type are conditionally independent given some latent Class C."
        ],
        [
            "So recall that a categorical random variable is just a single throw a die.",
            "So now go analogously in the generative model we propose for each Lane of event, we first choose the events latent class using the vector Pi, which says the which the probabilities of each phase of the die.",
            "And then we choose the sender of the event using the vector Theta C which describes the relative probability of each center given that the latent classes C. And similarly we choose the recipient R in action Type A."
        ],
        [
            "For those of you who would rather see a likelihood, this is a standard mixture model where for each of the T events we're integrating over the possible waiting classes C, and we're considering these three attributes to be conditionally independent, so this conditional independence assumption is likely not valid in many contexts, but will show that the assumption can be quite useful."
        ],
        [
            "So now that we've proposed the model, we would like to make inferences about our parameters after observing some data.",
            "We can appeal to standard data augmentation techniques where we introduce alliin variable that indicates the latent class to which a particular event is assigned, and from there we can come up with EM algorithms in a straightforward manner.",
            "If we choose to be basean, however, we can introduce Dursley priors without make driving the posterior distribution very straightforward, and after doing that we can integrate out a large number of the parameters of the model and this results in very.",
            "A very efficient MCMC algorithm."
        ],
        [
            "To go through this little bit more, what this will do is will we will initiate initialize all the events to some random weight in class and then we will use this algorithm to sequentially choose the sequentially sample.",
            "The latent event for each event.",
            "Sorry, the latent class for each event conditioned on the assignments to all the other events.",
            "So this equation really just amounts to keeping track of a few counts.",
            "And computing the probability of sampling each of the classes.",
            "So MC here is simply the number of observations that have been assigned to Class C. And you see, S&V&W are the number of events of a particular class with that attribute S. The main takeaway here is that the the inner loop of the sampling of the inference algorithm is very simple and straightforward, and it at each iteration this algorithm is linear in the number of events T, which as we'll see, is."
        ],
        [
            "Helpful.",
            "So applying this to real data will start with a data set of international political events.",
            "Automatically code coded from Reuters news articles.",
            "For visualization purposes, we considered only a subset that was from US to foreign interactions, so this is 40,000 events with 81 US entities and 2700 foreign entities, and the action types here include countries criticizing each other, presidents, hosting meetings, military occupation, and so on."
        ],
        [
            "So after running the algorithm with 50 latent classes, we can go back and examine which individuals were most likely given each latent class.",
            "So here I've shown two of them on the bottom, the typical senders for that class where the US military US government agents, typical recipients were Iraqi government agents, Iraqi military, and typical action types were military raids, military clashes and so on."
        ],
        [
            "So one might interpret that as a latent class regarding the Iraqi war, and if you go and plot the number of events per week assigned to that Lane class on the top, I've I've shown that for that Lane class, it indeed peaks around the time of the start of the Iraq war."
        ],
        [
            "Similarly for the for the top one, the typical centers were US government agents, US athletes, typical receipt, Scipion included Greece and action types included sports contests.",
            "So you might interpret that as being regarding the."
        ],
        [
            "Athens Olympics and on the bottom I've plotted the number of events per week assigned to that late in class, and it did indeed peaks around the time of the 2004 Olympics.",
            "So already the algorithms given.",
            "This provides provided some use in exploratory data."
        ],
        [
            "Analysis.",
            "But here I returned to the email example where the adjacency matrix on the left and on the right I've colored each of the latent.",
            "Each of the events by the late in class to which it was assigned.",
            "After running the algorithm with 10 classes and I've sorted the senders according to the latent class.",
            "There were most assigned to and the same with the recipients and hear the algorithms been able to pull out some of the block diagonal structure we might expect in a communication network where there are groups of centers that.",
            "Each have a typical set of recipients."
        ],
        [
            "Where our goals was to have a model that would help produce good predictions.",
            "So here will I'll talk about some experiments we did for valuing the predictive accuracy.",
            "First, we split the data sets into training center test set, and we evaluated the log probability of test events after under our model using parameters estimated from the training set.",
            "So with this metric, large values imply that observed events are given high probability under the model.",
            "Which is what we would hope for."
        ],
        [
            "So here's one experiment on the email data set.",
            "I've had the metric on the left side and I've held out 100,000 emails and I varied the size of the training set from 100 to 100,000 along the bottom.",
            "I've included the predictive accuracy you would get if you predicted all possible events with equal probability and the stupidest thing you could do.",
            "So that's the absolute baseline, and here the action type indicates the size of the email disguised, discretized into 10 bins.",
            "The next model is the baseline I told you about the multinomial model and what you and eventually with infinite data.",
            "This model is unbiased and should do just fine.",
            "But as you can see here, it takes quite a bit of data to perform well.",
            "I've included results from running algorithm with three, 20 and 50 latent classes, and the thing to notice is that with less data we are even with three Lane classes able to outperform that baseline.",
            "That essentially predicts with the frequency that occurred in the past.",
            "Also of note is, as you include more Lane classes, you do better, but with diminishing returns."
        ],
        [
            "What are the advantages of going with probabilistic models?",
            "Is that you with very small changes to your algorithms can handle the presence of missingness in your data.",
            "So this experiment highlights that fact.",
            "I the top line is a repeat of the previous experiment with 10 leading classes.",
            "The bottom line includes a small twist where for every observation after the first 100 we have removed any mention of the recipient.",
            "What's nice here is that even with this large amount of missingness, we are able to gain in performance.",
            "As we observe more data."
        ],
        [
            "So the form of the model is quite simple.",
            "It's straightforward and more than anything, it's suggestive in a number of ways.",
            "First off, the the data we considered here is was three dimensional senders.",
            "Recipients in action types, but straightforward to think about edges that have more than 3 dimensions.",
            "Also, a number of one of the main criticism criticisms against models like this is that you have to choose the number of latent classes ahead of time are priority.",
            "We've experimented with using display process instead.",
            "That allows for a flexible number of classes, and we've gone encouraging results there.",
            "Also, what's one of the major things that's missing?",
            "Is any sort of time dependence from one event to the next, so there are several ways of extending this model to handle that.",
            "One way is to include a hidden Markov model for at the latent class level, so that the latent classes transition according to some Markov transition matrix that you would estimate.",
            "So that's one way to handle time dependence on others to follow in the footsteps of Mccallum's topics, overtime model and replace one of the categorical random variables with a beta random variable, and we've seen encouraging results here as well that way so that you can get a sense of the each classes distribution overtime."
        ],
        [
            "So just a quick review.",
            "Some of the advantages of this sort of approach.",
            "The main one is that it's probabilistic in nature, and this makes queries about future data and missing data very natural.",
            "Also, I showed that.",
            "The estimates from this model allow for very interpretable exploratory data analysis.",
            "Also, this this model is quite scalable and it's at the moment rare for statistical network models to be able to handle 10,000 or more individuals.",
            "The main reason it's able to do that is it avoids any of the N squared types of complexity that.",
            "Makes the mixed membership stochastic block model and other latent space approaches.",
            "Less than desirable when you have an of a million or more.",
            "Some of the experiments show that the model is robust in the presence of missing data and sparse data, and one of the reasons disabled able to do this is that it shares statistical statistical strength over similar individuals and events."
        ],
        [
            "So hopefully I left plenty of time for questions.",
            "Thank you for your attention.",
            "Time for some questions.",
            "Maybe I misunderstood.",
            "Do you allow the connected block structure to change overtime?",
            "No, so you basically assume the same block structure across all the events like.",
            "Yes, OK, I see.",
            "Thank you.",
            "I'd like to add that some of the extensions I talked about.",
            "Would allow for that sort of dependence and.",
            "This is a nice starting point for those future directions.",
            "Yeah, so it seems to scale well in the case of of three dimensions.",
            "What happens if you have more dimensions so it's algorithm each iteration of the algorithm is linear in the number of events and the number of latent classes, so it should extend just the same.",
            "If you have more dimensions for edge.",
            "The problem there though, is that you need to.",
            "Have data to your if you don't have data about how those different dimensions vary, then you're going to have a hard time coming up with estimates for class that.",
            "Or are meaningful?",
            "Here again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So power.",
                    "label": 0
                },
                {
                    "sent": "On modeling relational events.",
                    "label": 0
                },
                {
                    "sent": "Dear latent classes will be presented by Christopher Viewpoint.",
                    "label": 0
                },
                {
                    "sent": "So my name is Chris Dubois.",
                    "label": 0
                },
                {
                    "sent": "An.",
                    "label": 0
                },
                {
                    "sent": "I'll be presenting some work I did with my advisor, Pork Smith, at UC Irvine on modeling relational events via latent classes.",
                    "label": 1
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So oftentimes, social network data comes in the form of a sequence of relational events.",
                    "label": 0
                },
                {
                    "sent": "One Canonical example is communication data, where we have a sequence of timestamped events each having a specific sender recipient, and perhaps an action type that might indicate whether the communication was an email phone call, and it's a message or two people on a networking sites are sharing a news article, so.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here we see edges or events arrive one at a time.",
                    "label": 0
                },
                {
                    "sent": "Individual 15 contact.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "1114 count contacting.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "11 An over some time span we can aggregate those events an model.",
                    "label": 0
                },
                {
                    "sent": "The activity is a social network and where edges might have some volume weight that represents the volume of communication between those two individuals.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here's a real data set of 200,000 email messages among roughly 3000 individuals email accounts at a European University, and we could similarly aggregate the activity over those 82 days and visualize the network of communication among all these individuals.",
                    "label": 0
                },
                {
                    "sent": "Or, equivalently, we could look at the adjacency matrix, where here we have the sender on the Y axis, the recipient on the X axis, and the volume of communication between those two people.",
                    "label": 0
                },
                {
                    "sent": "Is represented by the size of the dot, so today we'll be talking about.",
                    "label": 0
                },
                {
                    "sent": "The creative models that can help you make predictions from.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Data, so to formalize this little bit, suppose we've observed T events, each with a particular sender, receiver, and action type, and we want to be able to predict the communication volume for a particular combination of those with the sender S, recipient R and action Type A at some future finite time interval.",
                    "label": 1
                },
                {
                    "sent": "So in most cases it will be quite easy to predict the volume of any event occurring over that time interval.",
                    "label": 0
                },
                {
                    "sent": "The tricky part comes how do we becomes when you want to estimate the frequency of a single unique event relative to all the other possible events, and what this boils down to is that we need good estimates of the probability of sender S particular sender sending to a particular recipient with particular action type A and the probability that that's the next event.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what are some naive ways about of going about this so we could try and estimate these probabilities using essentially the frequency with which they occur in the past?",
                    "label": 0
                },
                {
                    "sent": "So what happens when you try to do that?",
                    "label": 0
                },
                {
                    "sent": "Well, if we have an individuals and a action types we have on the order of N ^2 * A cells to estimate because that pretty much amounts to a multinomial that we're trying to estimate.",
                    "label": 1
                },
                {
                    "sent": "What happens with this setup when we have far fewer events than even N squared?",
                    "label": 0
                },
                {
                    "sent": "That pretty much amounts to the cold start problem.",
                    "label": 0
                },
                {
                    "sent": "You have no chance of coming up with good estimates for all those possible cells.",
                    "label": 0
                },
                {
                    "sent": "Furthermore, we also oftentimes see in these settings that.",
                    "label": 0
                },
                {
                    "sent": "Few individuals have a lot of activity, a ton of individuals have very little activity, and in this case this naive approach will also fail pretty dramatically.",
                    "label": 0
                },
                {
                    "sent": "So what this calls for is some intelligent way of trying to.",
                    "label": 0
                },
                {
                    "sent": "Share information among individuals or events that are similar in some sense, and this idea is by no means new in the field.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Social network analysis.",
                    "label": 0
                },
                {
                    "sent": "One example is block models.",
                    "label": 0
                },
                {
                    "sent": "Here the block model consists of two things.",
                    "label": 0
                },
                {
                    "sent": "A partition of the individuals and some model for the GroupWise.",
                    "label": 0
                },
                {
                    "sent": "Interactions between those partitions.",
                    "label": 0
                },
                {
                    "sent": "So as a quick example here, here's a partition of these individuals and the GroupWise model would might say that there's a high probability of a within group interaction and a low probability of groups interacting with the Red Group.",
                    "label": 0
                },
                {
                    "sent": "Some recent extensions, the last five 10 years have taken a wait and variable approach where the latent variables indicate the latent group assignment for each of the individuals.",
                    "label": 0
                },
                {
                    "sent": "An some extensions that include the mixed membership stochastic block model, the infinite relational model, and a few others.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to give you a little bit of intuition for this, say we've observed this data where each dot is an email from the sender on the Y axis to the recipient on the X axis, and I've jittered the dots a little bit to give you a sense of the relative volume between of communication between these.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Individuals where you might not see right away is that by rearranging the rows and columns in a particular way, we can obtain this same.",
                    "label": 0
                },
                {
                    "sent": "This plot of this same data, but this is quite a bit more informative in that we can see that there's this group of individuals on the left that all communicate with this group of individuals.",
                    "label": 0
                },
                {
                    "sent": "At roughly the same rate.",
                    "label": 0
                },
                {
                    "sent": "So having observed data like this, we would hope to have a MoD.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So whose predictive distribution looks like this, where the shade of each square represents the relative probability of that interaction occurring.",
                    "label": 0
                },
                {
                    "sent": "So in this situation.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A block model might do something like this, where we have a partition of the senders or particular partition of the recipients, and we're able to model the GroupWise interactions with a single probability.",
                    "label": 0
                },
                {
                    "sent": "However, in this setting, intuitively we see there might be a more.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Parsimonious explanation and that there seems to be 4 latent classes.",
                    "label": 0
                },
                {
                    "sent": "Events where events within each Lane class occur with similar probability, so this intuition is going to guide the approach we take.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Returning to the three dimensional example setting, we first assume that the attributes of each event, the sender, the recipient, and action type are conditionally independent given some latent Class C.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So recall that a categorical random variable is just a single throw a die.",
                    "label": 0
                },
                {
                    "sent": "So now go analogously in the generative model we propose for each Lane of event, we first choose the events latent class using the vector Pi, which says the which the probabilities of each phase of the die.",
                    "label": 1
                },
                {
                    "sent": "And then we choose the sender of the event using the vector Theta C which describes the relative probability of each center given that the latent classes C. And similarly we choose the recipient R in action Type A.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For those of you who would rather see a likelihood, this is a standard mixture model where for each of the T events we're integrating over the possible waiting classes C, and we're considering these three attributes to be conditionally independent, so this conditional independence assumption is likely not valid in many contexts, but will show that the assumption can be quite useful.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now that we've proposed the model, we would like to make inferences about our parameters after observing some data.",
                    "label": 0
                },
                {
                    "sent": "We can appeal to standard data augmentation techniques where we introduce alliin variable that indicates the latent class to which a particular event is assigned, and from there we can come up with EM algorithms in a straightforward manner.",
                    "label": 1
                },
                {
                    "sent": "If we choose to be basean, however, we can introduce Dursley priors without make driving the posterior distribution very straightforward, and after doing that we can integrate out a large number of the parameters of the model and this results in very.",
                    "label": 0
                },
                {
                    "sent": "A very efficient MCMC algorithm.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To go through this little bit more, what this will do is will we will initiate initialize all the events to some random weight in class and then we will use this algorithm to sequentially choose the sequentially sample.",
                    "label": 0
                },
                {
                    "sent": "The latent event for each event.",
                    "label": 0
                },
                {
                    "sent": "Sorry, the latent class for each event conditioned on the assignments to all the other events.",
                    "label": 0
                },
                {
                    "sent": "So this equation really just amounts to keeping track of a few counts.",
                    "label": 0
                },
                {
                    "sent": "And computing the probability of sampling each of the classes.",
                    "label": 0
                },
                {
                    "sent": "So MC here is simply the number of observations that have been assigned to Class C. And you see, S&V&W are the number of events of a particular class with that attribute S. The main takeaway here is that the the inner loop of the sampling of the inference algorithm is very simple and straightforward, and it at each iteration this algorithm is linear in the number of events T, which as we'll see, is.",
                    "label": 1
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Helpful.",
                    "label": 0
                },
                {
                    "sent": "So applying this to real data will start with a data set of international political events.",
                    "label": 1
                },
                {
                    "sent": "Automatically code coded from Reuters news articles.",
                    "label": 1
                },
                {
                    "sent": "For visualization purposes, we considered only a subset that was from US to foreign interactions, so this is 40,000 events with 81 US entities and 2700 foreign entities, and the action types here include countries criticizing each other, presidents, hosting meetings, military occupation, and so on.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So after running the algorithm with 50 latent classes, we can go back and examine which individuals were most likely given each latent class.",
                    "label": 0
                },
                {
                    "sent": "So here I've shown two of them on the bottom, the typical senders for that class where the US military US government agents, typical recipients were Iraqi government agents, Iraqi military, and typical action types were military raids, military clashes and so on.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So one might interpret that as a latent class regarding the Iraqi war, and if you go and plot the number of events per week assigned to that Lane class on the top, I've I've shown that for that Lane class, it indeed peaks around the time of the start of the Iraq war.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Similarly for the for the top one, the typical centers were US government agents, US athletes, typical receipt, Scipion included Greece and action types included sports contests.",
                    "label": 0
                },
                {
                    "sent": "So you might interpret that as being regarding the.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Athens Olympics and on the bottom I've plotted the number of events per week assigned to that late in class, and it did indeed peaks around the time of the 2004 Olympics.",
                    "label": 0
                },
                {
                    "sent": "So already the algorithms given.",
                    "label": 0
                },
                {
                    "sent": "This provides provided some use in exploratory data.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Analysis.",
                    "label": 0
                },
                {
                    "sent": "But here I returned to the email example where the adjacency matrix on the left and on the right I've colored each of the latent.",
                    "label": 0
                },
                {
                    "sent": "Each of the events by the late in class to which it was assigned.",
                    "label": 0
                },
                {
                    "sent": "After running the algorithm with 10 classes and I've sorted the senders according to the latent class.",
                    "label": 0
                },
                {
                    "sent": "There were most assigned to and the same with the recipients and hear the algorithms been able to pull out some of the block diagonal structure we might expect in a communication network where there are groups of centers that.",
                    "label": 0
                },
                {
                    "sent": "Each have a typical set of recipients.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Where our goals was to have a model that would help produce good predictions.",
                    "label": 0
                },
                {
                    "sent": "So here will I'll talk about some experiments we did for valuing the predictive accuracy.",
                    "label": 0
                },
                {
                    "sent": "First, we split the data sets into training center test set, and we evaluated the log probability of test events after under our model using parameters estimated from the training set.",
                    "label": 1
                },
                {
                    "sent": "So with this metric, large values imply that observed events are given high probability under the model.",
                    "label": 1
                },
                {
                    "sent": "Which is what we would hope for.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here's one experiment on the email data set.",
                    "label": 0
                },
                {
                    "sent": "I've had the metric on the left side and I've held out 100,000 emails and I varied the size of the training set from 100 to 100,000 along the bottom.",
                    "label": 1
                },
                {
                    "sent": "I've included the predictive accuracy you would get if you predicted all possible events with equal probability and the stupidest thing you could do.",
                    "label": 0
                },
                {
                    "sent": "So that's the absolute baseline, and here the action type indicates the size of the email disguised, discretized into 10 bins.",
                    "label": 0
                },
                {
                    "sent": "The next model is the baseline I told you about the multinomial model and what you and eventually with infinite data.",
                    "label": 0
                },
                {
                    "sent": "This model is unbiased and should do just fine.",
                    "label": 0
                },
                {
                    "sent": "But as you can see here, it takes quite a bit of data to perform well.",
                    "label": 1
                },
                {
                    "sent": "I've included results from running algorithm with three, 20 and 50 latent classes, and the thing to notice is that with less data we are even with three Lane classes able to outperform that baseline.",
                    "label": 0
                },
                {
                    "sent": "That essentially predicts with the frequency that occurred in the past.",
                    "label": 0
                },
                {
                    "sent": "Also of note is, as you include more Lane classes, you do better, but with diminishing returns.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What are the advantages of going with probabilistic models?",
                    "label": 0
                },
                {
                    "sent": "Is that you with very small changes to your algorithms can handle the presence of missingness in your data.",
                    "label": 0
                },
                {
                    "sent": "So this experiment highlights that fact.",
                    "label": 0
                },
                {
                    "sent": "I the top line is a repeat of the previous experiment with 10 leading classes.",
                    "label": 0
                },
                {
                    "sent": "The bottom line includes a small twist where for every observation after the first 100 we have removed any mention of the recipient.",
                    "label": 0
                },
                {
                    "sent": "What's nice here is that even with this large amount of missingness, we are able to gain in performance.",
                    "label": 0
                },
                {
                    "sent": "As we observe more data.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the form of the model is quite simple.",
                    "label": 0
                },
                {
                    "sent": "It's straightforward and more than anything, it's suggestive in a number of ways.",
                    "label": 0
                },
                {
                    "sent": "First off, the the data we considered here is was three dimensional senders.",
                    "label": 0
                },
                {
                    "sent": "Recipients in action types, but straightforward to think about edges that have more than 3 dimensions.",
                    "label": 1
                },
                {
                    "sent": "Also, a number of one of the main criticism criticisms against models like this is that you have to choose the number of latent classes ahead of time are priority.",
                    "label": 0
                },
                {
                    "sent": "We've experimented with using display process instead.",
                    "label": 0
                },
                {
                    "sent": "That allows for a flexible number of classes, and we've gone encouraging results there.",
                    "label": 1
                },
                {
                    "sent": "Also, what's one of the major things that's missing?",
                    "label": 1
                },
                {
                    "sent": "Is any sort of time dependence from one event to the next, so there are several ways of extending this model to handle that.",
                    "label": 0
                },
                {
                    "sent": "One way is to include a hidden Markov model for at the latent class level, so that the latent classes transition according to some Markov transition matrix that you would estimate.",
                    "label": 0
                },
                {
                    "sent": "So that's one way to handle time dependence on others to follow in the footsteps of Mccallum's topics, overtime model and replace one of the categorical random variables with a beta random variable, and we've seen encouraging results here as well that way so that you can get a sense of the each classes distribution overtime.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So just a quick review.",
                    "label": 0
                },
                {
                    "sent": "Some of the advantages of this sort of approach.",
                    "label": 0
                },
                {
                    "sent": "The main one is that it's probabilistic in nature, and this makes queries about future data and missing data very natural.",
                    "label": 0
                },
                {
                    "sent": "Also, I showed that.",
                    "label": 0
                },
                {
                    "sent": "The estimates from this model allow for very interpretable exploratory data analysis.",
                    "label": 1
                },
                {
                    "sent": "Also, this this model is quite scalable and it's at the moment rare for statistical network models to be able to handle 10,000 or more individuals.",
                    "label": 0
                },
                {
                    "sent": "The main reason it's able to do that is it avoids any of the N squared types of complexity that.",
                    "label": 0
                },
                {
                    "sent": "Makes the mixed membership stochastic block model and other latent space approaches.",
                    "label": 0
                },
                {
                    "sent": "Less than desirable when you have an of a million or more.",
                    "label": 0
                },
                {
                    "sent": "Some of the experiments show that the model is robust in the presence of missing data and sparse data, and one of the reasons disabled able to do this is that it shares statistical statistical strength over similar individuals and events.",
                    "label": 1
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So hopefully I left plenty of time for questions.",
                    "label": 0
                },
                {
                    "sent": "Thank you for your attention.",
                    "label": 0
                },
                {
                    "sent": "Time for some questions.",
                    "label": 0
                },
                {
                    "sent": "Maybe I misunderstood.",
                    "label": 0
                },
                {
                    "sent": "Do you allow the connected block structure to change overtime?",
                    "label": 0
                },
                {
                    "sent": "No, so you basically assume the same block structure across all the events like.",
                    "label": 0
                },
                {
                    "sent": "Yes, OK, I see.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "I'd like to add that some of the extensions I talked about.",
                    "label": 0
                },
                {
                    "sent": "Would allow for that sort of dependence and.",
                    "label": 0
                },
                {
                    "sent": "This is a nice starting point for those future directions.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so it seems to scale well in the case of of three dimensions.",
                    "label": 0
                },
                {
                    "sent": "What happens if you have more dimensions so it's algorithm each iteration of the algorithm is linear in the number of events and the number of latent classes, so it should extend just the same.",
                    "label": 0
                },
                {
                    "sent": "If you have more dimensions for edge.",
                    "label": 0
                },
                {
                    "sent": "The problem there though, is that you need to.",
                    "label": 0
                },
                {
                    "sent": "Have data to your if you don't have data about how those different dimensions vary, then you're going to have a hard time coming up with estimates for class that.",
                    "label": 0
                },
                {
                    "sent": "Or are meaningful?",
                    "label": 0
                },
                {
                    "sent": "Here again.",
                    "label": 0
                }
            ]
        }
    }
}