{
    "id": "xnitlw4jhzjfoajvbatrhkawgxgnfpmh",
    "title": "Plan-Based Semantic Enrichment of Event Streams",
    "info": {
        "author": [
            "Kia Teymourian, Department of Computer Science, Freie Universität Berlin"
        ],
        "published": "July 30, 2014",
        "recorded": "May 2014",
        "category": [
            "Top->Computer Science->Semantic Web",
            "Top->Computer Science->Big Data"
        ]
    },
    "url": "http://videolectures.net/eswc2014_teymourian_event_streams/",
    "segmentation": [
        [
            "My name is Kia Teymourian.",
            "I'm from free University Berlin.",
            "And working group corporate semantic web.",
            "Am the title of our work is plant based, semantic enrichment of event stream?"
        ],
        [
            "Anne.",
            "Before I start with the detail, I have to tell about the these things.",
            "What is the knowledge based complex event processing or what we understand under the term knowledge based complex event processing and what you mean exactly with the event stream enrichment and the planning of the event stream enrichment."
        ],
        [
            "Their motivation of our work is that we have today in different systems, huge amount of event streams and we may have the background knowledge that are somehow related to this event that are come to this system as a stream.",
            "And we want to know many things as abstracts, concepts and try to try to query this whole knowledge with the higher level queries.",
            "So that we can improve the expressivity and agility and flexibility of our system so that we can better understand the business processes that are event driven and being able to improve these systems.",
            "OK, what now?"
        ],
        [
            "I mean with the concept of event we event stream.",
            "We mean a simple stream of event instances that are simply name value data that comes to the system as a event stream and like a stock market event that we have symbols price and volumes and nothing goes.",
            "This is somehow structured data but definitely not an RDF St. And we do not map this to the RDS."
        ],
        [
            "Let's look at an example.",
            "Consider the same event stream that we have from stock market.",
            "Maybe someone is interested to write a query which is abstract on this event stream and wants to select companies who have who are in the Europe and.",
            "And put use products from metal and have more than 10,000 employees and are at the moment in reconstruction phase and their prize increased in the last five minutes and as you can see using this query and the event stream we cannot answer the question.",
            "We need the background knowledge to be able to answer this query.",
            "That's why we need the knowledge base that include all of this and by reasoning on this knowledge base.",
            "We are able to.",
            "To answer the query and what we need is somehow linked events from this stream to the background knowledge to be able to make a Fusion between both these data sources."
        ],
        [
            "Let's have a look on the abstract architecture that we have for this problem.",
            "We have a main event stream that comes to the system and we have our main memory event processing engine that are normally a CP engine or called event processing Agent and we have a huge amount of background knowledge stored in external knowledge base and on top of that we have a description logic reason our can reason on that.",
            "And answer our queries.",
            "And from time to time we may have some updates on the knowledge base which makes the problem much more complicated.",
            "So that we cannot simply catch the result of the query in the main memory.",
            "And use it for the event processing if you."
        ],
        [
            "Consider such cases.",
            "We need to see which kind of queries are possible if you consider our stock market events with the price and value, we have some background knowledge in the stored in the background knowledge database.",
            "And we want to extract the events based on the relations that they have in the background knowledge.",
            "It means we simply link this to some companies, some resources and what we want to know is, is there any sequence of companies any sequence of stock markets of companies that produce that the company produced something, or the other company another company has demands on that and all of that is financed by some other companies.",
            "And our approach is not about the prediction of that, but about the detection of events.",
            "Based on this background knowledge.",
            "Anne."
        ],
        [
            "If we want to write this query down, we need to destroy the graph, which might be these three parts and combine them with the event algebra operators that simply defines in the in the research area of the event processing.",
            "And we have some.",
            "Links between the events with resources in the background knowledge.",
            "And they are simply basic triple patterns coming out from the definition of sparkle, and then then the formal semantic of the operators are defined based on the event detections.",
            "OK, now."
        ],
        [
            "How can I come today meaning of what we mean exactly with the semantic enrichment, and it's about how we process this data.",
            "And our approach is to enrich the stream with some values and pro."
        ],
        [
            "Is that it means that we have at the beginning or rows event stream and we want to send some queries to the knowledge base and generate new events or what you called fat events from the row event.",
            "It means that we have a attribute value like this example and we want to add new values to that event.",
            "And for example, extracted all of the products all after locations after company and everything else that we could extract from the external knowledge base and put into the event stream.",
            "And then at the end we have event processing agents that process this data."
        ],
        [
            "Anne.",
            "The simple form of that is that we have a very simple star shaped query.",
            "It means that we have a stock.",
            "If you have an event and we want to extract the attributes of these events from the external knowledge base, nothing else.",
            "And."
        ],
        [
            "The second one is that we have really the sequence and the operators between them and have this part of that.",
            "In our case, we consider that we know the path of these connections.",
            "We do not consider the case that are any connections or write queries for any connecting resources in the background knowledge.",
            "We consider that the predicates are known and we can write down the queries like this."
        ],
        [
            "OK. Let's have a look after processing costs that we have, which kind of costs it will produce if we do this.",
            "The first one is the cost of event acquisition.",
            "It means getting their row event from the event or the user, even generators and the second one is the cost of.",
            "Getting the background knowledge from the external knowledge base that we don't know much about that.",
            "One of them can is the cost of the materialization.",
            "All of the joints and everything else.",
            "What is done on the on the database.",
            "The other one is the reasoning cost, which is highly complex and we cannot measure from the outside of the system.",
            "And the other one is how many results we get from the from the external knowledge base and reach to the event.",
            "The last one is how which costs that we have for the detection of events and it depends how many operators we have on that.",
            "How are rules for the event detection and it depends on the harmony rules.",
            "And what we use here is more or less the results transmitted from the car from the external knowledge base because it's the simplest cost that we can measure.",
            "Anne yeah.",
            "Anne."
        ],
        [
            "And now coming to the concept of the planning, the event is enrichment.",
            "And talk about how we meet, how we want to plan this enrichment process and detection process because we have first one enrichment process and one detection process after each other the 1st."
        ],
        [
            "The concept is to do all of this in a single step.",
            "Get all of the events from the background knowledge and enrich that and do the detection on top of that.",
            "And the problem with that concept is that we may have large amount of unnecessary enrichment.",
            "If you are looking for the location for the products and we are looking for a specific one we enrich, we get huge amounts of data and event is not detected at the end and we drop that.",
            "What you thought it could be to build up some steps and filter the event string in several steps.",
            "It."
        ],
        [
            "An other people are right like Acterra at all.",
            "Anschutz Mueller investigated the problem of planning the event in Richmond event processing across distributed nodes.",
            "They considered.",
            "How should we get the events from the generator point to the event processing nodes?",
            "And we extend this concept for the problem of how should we get them?",
            "External knowledge base to the event processing.",
            "What we are doing is to extract different graphs from the user query and use this for the extraction of the knowledge base from the external knowledge base and put that to the event stream.",
            "If you have three part of the knowledge like P1, NK, TCB two and three and we have this event stream only by enrichment of partial knowledge that is required, we may filter out some part of the events.",
            "And so save the cost of the full enrichment at the final node.",
            "And that's the.",
            "And the problem is how to find the the right sequence of this enrichment, which attributes we should do first and which ones we should do or less?",
            "Anne."
        ],
        [
            "First of all, how we extract the subgraphs from the user graph if we consider the user graph is something like this and we simply traverse the graph from the note that we get to the background knowledge and travels down to the leaf and generate a sequence of triples and use this for the for the planning.",
            "For the extraction of the data from the background knowledge and the enrichment of noise.",
            "From that graph we can extract this nine different.",
            "Anne.",
            "Yeah, triple pattern sets and we use this for the.",
            "For the enrichment.",
            "The."
        ],
        [
            "Planning as we have talked is depends on several parameters.",
            "One of them is home and events we have in the user query.",
            "How many attributes have each of this or how many subsets of.",
            "Subgraphs we extracted from for that event and how many processing steps we want to do.",
            "As you can imagine, the search space is very large and the and the search space is somehow exponential to do, and we have to do a lot of trailers, error and our approach is to find a good estimation for the starting point for the start of search and then from that point we do some some search to look if we can.",
            "Optimized the plans or not, we use these two factors.",
            "One of them is filter functionality estimation of the stock graph and the for the whole graph which depends on the predicates that is used in this sub graph.",
            "And with the predicate I mean the predicate of the triple pattern and for each predicate we might.",
            "We are able to define an estimated estimated her matching probability factor, which depends on how many triples of that kind we have on the triple store stored and defines how likely is that to be matched.",
            "And then our algorithm starts from this estimated plan and try and do some trades and check their performance after system check the cost and get back and say this is a good plan for this.",
            "OK."
        ],
        [
            "I come now to the evaluation part."
        ],
        [
            "And the first experiments that we did is to compile the what it compared to single step processing with multi step processing?",
            "What are the differences?",
            "Which one might be better for this approach and then and then find different plans and look on our algorithm what it can produce.",
            "We set up two hosts, one of them is.",
            "For the enrichment after after events, which is a which has a virtual installed and a mirror of the cadia and one out, there is for the event detection.",
            "And the event stream that we use is simply the randomly generated stock market event from the standard and poor 500 index.",
            "And we simply pick up one of these 500 stock market and put them in the event St.",
            "The reason that we randomly generated the event stream is that we want to do.",
            "The pressure test on the on the system.",
            "Yeah."
        ],
        [
            "We use these seven different predicates to generate our queries for the star shape form and further different form of the queries combined with sequence and other operators."
        ],
        [
            "The performance test shows that the single steps performance is very bad comparing to the two step and multistep processing.",
            "The twist step is that we choose only one of the attributes and put the other attributes in the second processing step, and multistep means that we have seven different steps in each of that."
        ],
        [
            "And if you look on the costs that we can save lots of costs if you do the two step processing or multi step processing.",
            "And the OR operation because of the nature of the OR operator makes its own always 50% of the of the cost reduction, because if one of them is matched, all of the query does not require to be matched.",
            "The problem with the."
        ],
        [
            "Our approach is the whole latency that it caused when it goes through the different steps.",
            "And if you look on the single step latency and the latency here, it means that we home how many times it takes 2 for one event to go through the whole system and come out from the system if it is detected.",
            "And for the multi stuff we see that this is not very large because it needs to be go through all of the steps.",
            "Anne."
        ],
        [
            "For the planning, we used the query and the same predicate.",
            "Our query is the combination of this part of this predicate with the and operator.",
            "And we set up four steps.",
            "To look, which plans might be better and we have we have this four plans and the plan two with the star is the plans that we start with estimated the start of that.",
            "And if we look."
        ],
        [
            "On the evaluation, the Red one is the worst.",
            "Plan everything on the bottom side is the whole cost that we generate.",
            "If we do go for this plan.",
            "And the green one, which is our plans and two of our plans is the best optimized plan and we can see which difference it makes if we go for a bad or for a good plan to do enrichment.",
            "OK."
        ],
        [
            "And come to the conclusion that the multi step event processing can help to save the enrichment costs and the multi step event processing should be planned in advance before we go for the for the processing of that and having some Horace ticks about background knowledge helps that we have a good start for the searching for the optimal plan.",
            "Our future work is to look if we can use approaches from distributed databases to join Intermediate Lee.",
            "The event stream in the background noise coming from the external knowledge basis and investigate which effects has the event.",
            "Stream entropy on the planning.",
            "And because our event stream is randomly generated totally randomly, and if we have a event stream which is specific entropy, it might differ the plans.",
            "Thanks."
        ],
        [
            "Very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "My name is Kia Teymourian.",
                    "label": 1
                },
                {
                    "sent": "I'm from free University Berlin.",
                    "label": 0
                },
                {
                    "sent": "And working group corporate semantic web.",
                    "label": 1
                },
                {
                    "sent": "Am the title of our work is plant based, semantic enrichment of event stream?",
                    "label": 1
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Before I start with the detail, I have to tell about the these things.",
                    "label": 0
                },
                {
                    "sent": "What is the knowledge based complex event processing or what we understand under the term knowledge based complex event processing and what you mean exactly with the event stream enrichment and the planning of the event stream enrichment.",
                    "label": 1
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Their motivation of our work is that we have today in different systems, huge amount of event streams and we may have the background knowledge that are somehow related to this event that are come to this system as a stream.",
                    "label": 0
                },
                {
                    "sent": "And we want to know many things as abstracts, concepts and try to try to query this whole knowledge with the higher level queries.",
                    "label": 0
                },
                {
                    "sent": "So that we can improve the expressivity and agility and flexibility of our system so that we can better understand the business processes that are event driven and being able to improve these systems.",
                    "label": 1
                },
                {
                    "sent": "OK, what now?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I mean with the concept of event we event stream.",
                    "label": 0
                },
                {
                    "sent": "We mean a simple stream of event instances that are simply name value data that comes to the system as a event stream and like a stock market event that we have symbols price and volumes and nothing goes.",
                    "label": 1
                },
                {
                    "sent": "This is somehow structured data but definitely not an RDF St. And we do not map this to the RDS.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's look at an example.",
                    "label": 0
                },
                {
                    "sent": "Consider the same event stream that we have from stock market.",
                    "label": 0
                },
                {
                    "sent": "Maybe someone is interested to write a query which is abstract on this event stream and wants to select companies who have who are in the Europe and.",
                    "label": 0
                },
                {
                    "sent": "And put use products from metal and have more than 10,000 employees and are at the moment in reconstruction phase and their prize increased in the last five minutes and as you can see using this query and the event stream we cannot answer the question.",
                    "label": 1
                },
                {
                    "sent": "We need the background knowledge to be able to answer this query.",
                    "label": 0
                },
                {
                    "sent": "That's why we need the knowledge base that include all of this and by reasoning on this knowledge base.",
                    "label": 0
                },
                {
                    "sent": "We are able to.",
                    "label": 0
                },
                {
                    "sent": "To answer the query and what we need is somehow linked events from this stream to the background knowledge to be able to make a Fusion between both these data sources.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's have a look on the abstract architecture that we have for this problem.",
                    "label": 0
                },
                {
                    "sent": "We have a main event stream that comes to the system and we have our main memory event processing engine that are normally a CP engine or called event processing Agent and we have a huge amount of background knowledge stored in external knowledge base and on top of that we have a description logic reason our can reason on that.",
                    "label": 1
                },
                {
                    "sent": "And answer our queries.",
                    "label": 1
                },
                {
                    "sent": "And from time to time we may have some updates on the knowledge base which makes the problem much more complicated.",
                    "label": 0
                },
                {
                    "sent": "So that we cannot simply catch the result of the query in the main memory.",
                    "label": 0
                },
                {
                    "sent": "And use it for the event processing if you.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Consider such cases.",
                    "label": 0
                },
                {
                    "sent": "We need to see which kind of queries are possible if you consider our stock market events with the price and value, we have some background knowledge in the stored in the background knowledge database.",
                    "label": 0
                },
                {
                    "sent": "And we want to extract the events based on the relations that they have in the background knowledge.",
                    "label": 0
                },
                {
                    "sent": "It means we simply link this to some companies, some resources and what we want to know is, is there any sequence of companies any sequence of stock markets of companies that produce that the company produced something, or the other company another company has demands on that and all of that is financed by some other companies.",
                    "label": 0
                },
                {
                    "sent": "And our approach is not about the prediction of that, but about the detection of events.",
                    "label": 0
                },
                {
                    "sent": "Based on this background knowledge.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If we want to write this query down, we need to destroy the graph, which might be these three parts and combine them with the event algebra operators that simply defines in the in the research area of the event processing.",
                    "label": 0
                },
                {
                    "sent": "And we have some.",
                    "label": 0
                },
                {
                    "sent": "Links between the events with resources in the background knowledge.",
                    "label": 0
                },
                {
                    "sent": "And they are simply basic triple patterns coming out from the definition of sparkle, and then then the formal semantic of the operators are defined based on the event detections.",
                    "label": 0
                },
                {
                    "sent": "OK, now.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How can I come today meaning of what we mean exactly with the semantic enrichment, and it's about how we process this data.",
                    "label": 0
                },
                {
                    "sent": "And our approach is to enrich the stream with some values and pro.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is that it means that we have at the beginning or rows event stream and we want to send some queries to the knowledge base and generate new events or what you called fat events from the row event.",
                    "label": 0
                },
                {
                    "sent": "It means that we have a attribute value like this example and we want to add new values to that event.",
                    "label": 0
                },
                {
                    "sent": "And for example, extracted all of the products all after locations after company and everything else that we could extract from the external knowledge base and put into the event stream.",
                    "label": 1
                },
                {
                    "sent": "And then at the end we have event processing agents that process this data.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "The simple form of that is that we have a very simple star shaped query.",
                    "label": 0
                },
                {
                    "sent": "It means that we have a stock.",
                    "label": 0
                },
                {
                    "sent": "If you have an event and we want to extract the attributes of these events from the external knowledge base, nothing else.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The second one is that we have really the sequence and the operators between them and have this part of that.",
                    "label": 0
                },
                {
                    "sent": "In our case, we consider that we know the path of these connections.",
                    "label": 0
                },
                {
                    "sent": "We do not consider the case that are any connections or write queries for any connecting resources in the background knowledge.",
                    "label": 0
                },
                {
                    "sent": "We consider that the predicates are known and we can write down the queries like this.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK. Let's have a look after processing costs that we have, which kind of costs it will produce if we do this.",
                    "label": 0
                },
                {
                    "sent": "The first one is the cost of event acquisition.",
                    "label": 1
                },
                {
                    "sent": "It means getting their row event from the event or the user, even generators and the second one is the cost of.",
                    "label": 0
                },
                {
                    "sent": "Getting the background knowledge from the external knowledge base that we don't know much about that.",
                    "label": 1
                },
                {
                    "sent": "One of them can is the cost of the materialization.",
                    "label": 0
                },
                {
                    "sent": "All of the joints and everything else.",
                    "label": 0
                },
                {
                    "sent": "What is done on the on the database.",
                    "label": 0
                },
                {
                    "sent": "The other one is the reasoning cost, which is highly complex and we cannot measure from the outside of the system.",
                    "label": 0
                },
                {
                    "sent": "And the other one is how many results we get from the from the external knowledge base and reach to the event.",
                    "label": 1
                },
                {
                    "sent": "The last one is how which costs that we have for the detection of events and it depends how many operators we have on that.",
                    "label": 0
                },
                {
                    "sent": "How are rules for the event detection and it depends on the harmony rules.",
                    "label": 0
                },
                {
                    "sent": "And what we use here is more or less the results transmitted from the car from the external knowledge base because it's the simplest cost that we can measure.",
                    "label": 0
                },
                {
                    "sent": "Anne yeah.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And now coming to the concept of the planning, the event is enrichment.",
                    "label": 0
                },
                {
                    "sent": "And talk about how we meet, how we want to plan this enrichment process and detection process because we have first one enrichment process and one detection process after each other the 1st.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The concept is to do all of this in a single step.",
                    "label": 1
                },
                {
                    "sent": "Get all of the events from the background knowledge and enrich that and do the detection on top of that.",
                    "label": 1
                },
                {
                    "sent": "And the problem with that concept is that we may have large amount of unnecessary enrichment.",
                    "label": 0
                },
                {
                    "sent": "If you are looking for the location for the products and we are looking for a specific one we enrich, we get huge amounts of data and event is not detected at the end and we drop that.",
                    "label": 0
                },
                {
                    "sent": "What you thought it could be to build up some steps and filter the event string in several steps.",
                    "label": 0
                },
                {
                    "sent": "It.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "An other people are right like Acterra at all.",
                    "label": 0
                },
                {
                    "sent": "Anschutz Mueller investigated the problem of planning the event in Richmond event processing across distributed nodes.",
                    "label": 1
                },
                {
                    "sent": "They considered.",
                    "label": 0
                },
                {
                    "sent": "How should we get the events from the generator point to the event processing nodes?",
                    "label": 0
                },
                {
                    "sent": "And we extend this concept for the problem of how should we get them?",
                    "label": 0
                },
                {
                    "sent": "External knowledge base to the event processing.",
                    "label": 0
                },
                {
                    "sent": "What we are doing is to extract different graphs from the user query and use this for the extraction of the knowledge base from the external knowledge base and put that to the event stream.",
                    "label": 0
                },
                {
                    "sent": "If you have three part of the knowledge like P1, NK, TCB two and three and we have this event stream only by enrichment of partial knowledge that is required, we may filter out some part of the events.",
                    "label": 1
                },
                {
                    "sent": "And so save the cost of the full enrichment at the final node.",
                    "label": 1
                },
                {
                    "sent": "And that's the.",
                    "label": 0
                },
                {
                    "sent": "And the problem is how to find the the right sequence of this enrichment, which attributes we should do first and which ones we should do or less?",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First of all, how we extract the subgraphs from the user graph if we consider the user graph is something like this and we simply traverse the graph from the note that we get to the background knowledge and travels down to the leaf and generate a sequence of triples and use this for the for the planning.",
                    "label": 1
                },
                {
                    "sent": "For the extraction of the data from the background knowledge and the enrichment of noise.",
                    "label": 0
                },
                {
                    "sent": "From that graph we can extract this nine different.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Yeah, triple pattern sets and we use this for the.",
                    "label": 0
                },
                {
                    "sent": "For the enrichment.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Planning as we have talked is depends on several parameters.",
                    "label": 0
                },
                {
                    "sent": "One of them is home and events we have in the user query.",
                    "label": 0
                },
                {
                    "sent": "How many attributes have each of this or how many subsets of.",
                    "label": 0
                },
                {
                    "sent": "Subgraphs we extracted from for that event and how many processing steps we want to do.",
                    "label": 0
                },
                {
                    "sent": "As you can imagine, the search space is very large and the and the search space is somehow exponential to do, and we have to do a lot of trailers, error and our approach is to find a good estimation for the starting point for the start of search and then from that point we do some some search to look if we can.",
                    "label": 0
                },
                {
                    "sent": "Optimized the plans or not, we use these two factors.",
                    "label": 0
                },
                {
                    "sent": "One of them is filter functionality estimation of the stock graph and the for the whole graph which depends on the predicates that is used in this sub graph.",
                    "label": 1
                },
                {
                    "sent": "And with the predicate I mean the predicate of the triple pattern and for each predicate we might.",
                    "label": 0
                },
                {
                    "sent": "We are able to define an estimated estimated her matching probability factor, which depends on how many triples of that kind we have on the triple store stored and defines how likely is that to be matched.",
                    "label": 0
                },
                {
                    "sent": "And then our algorithm starts from this estimated plan and try and do some trades and check their performance after system check the cost and get back and say this is a good plan for this.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I come now to the evaluation part.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the first experiments that we did is to compile the what it compared to single step processing with multi step processing?",
                    "label": 1
                },
                {
                    "sent": "What are the differences?",
                    "label": 0
                },
                {
                    "sent": "Which one might be better for this approach and then and then find different plans and look on our algorithm what it can produce.",
                    "label": 1
                },
                {
                    "sent": "We set up two hosts, one of them is.",
                    "label": 0
                },
                {
                    "sent": "For the enrichment after after events, which is a which has a virtual installed and a mirror of the cadia and one out, there is for the event detection.",
                    "label": 1
                },
                {
                    "sent": "And the event stream that we use is simply the randomly generated stock market event from the standard and poor 500 index.",
                    "label": 1
                },
                {
                    "sent": "And we simply pick up one of these 500 stock market and put them in the event St.",
                    "label": 0
                },
                {
                    "sent": "The reason that we randomly generated the event stream is that we want to do.",
                    "label": 0
                },
                {
                    "sent": "The pressure test on the on the system.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We use these seven different predicates to generate our queries for the star shape form and further different form of the queries combined with sequence and other operators.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The performance test shows that the single steps performance is very bad comparing to the two step and multistep processing.",
                    "label": 0
                },
                {
                    "sent": "The twist step is that we choose only one of the attributes and put the other attributes in the second processing step, and multistep means that we have seven different steps in each of that.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And if you look on the costs that we can save lots of costs if you do the two step processing or multi step processing.",
                    "label": 0
                },
                {
                    "sent": "And the OR operation because of the nature of the OR operator makes its own always 50% of the of the cost reduction, because if one of them is matched, all of the query does not require to be matched.",
                    "label": 0
                },
                {
                    "sent": "The problem with the.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our approach is the whole latency that it caused when it goes through the different steps.",
                    "label": 0
                },
                {
                    "sent": "And if you look on the single step latency and the latency here, it means that we home how many times it takes 2 for one event to go through the whole system and come out from the system if it is detected.",
                    "label": 0
                },
                {
                    "sent": "And for the multi stuff we see that this is not very large because it needs to be go through all of the steps.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For the planning, we used the query and the same predicate.",
                    "label": 0
                },
                {
                    "sent": "Our query is the combination of this part of this predicate with the and operator.",
                    "label": 0
                },
                {
                    "sent": "And we set up four steps.",
                    "label": 0
                },
                {
                    "sent": "To look, which plans might be better and we have we have this four plans and the plan two with the star is the plans that we start with estimated the start of that.",
                    "label": 0
                },
                {
                    "sent": "And if we look.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On the evaluation, the Red one is the worst.",
                    "label": 0
                },
                {
                    "sent": "Plan everything on the bottom side is the whole cost that we generate.",
                    "label": 0
                },
                {
                    "sent": "If we do go for this plan.",
                    "label": 0
                },
                {
                    "sent": "And the green one, which is our plans and two of our plans is the best optimized plan and we can see which difference it makes if we go for a bad or for a good plan to do enrichment.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And come to the conclusion that the multi step event processing can help to save the enrichment costs and the multi step event processing should be planned in advance before we go for the for the processing of that and having some Horace ticks about background knowledge helps that we have a good start for the searching for the optimal plan.",
                    "label": 1
                },
                {
                    "sent": "Our future work is to look if we can use approaches from distributed databases to join Intermediate Lee.",
                    "label": 0
                },
                {
                    "sent": "The event stream in the background noise coming from the external knowledge basis and investigate which effects has the event.",
                    "label": 1
                },
                {
                    "sent": "Stream entropy on the planning.",
                    "label": 0
                },
                {
                    "sent": "And because our event stream is randomly generated totally randomly, and if we have a event stream which is specific entropy, it might differ the plans.",
                    "label": 0
                },
                {
                    "sent": "Thanks.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Very much.",
                    "label": 0
                }
            ]
        }
    }
}