{
    "id": "xnqjmvnkojs5oto2h5rxpxccf6mpukzw",
    "title": "Solving Optimization Problems in Industry: An Arms Race",
    "info": {
        "author": [
            "Thomas Bäck, Leiden Insitute of Advanced Computer Science, Leiden University"
        ],
        "published": "Oct. 27, 2014",
        "recorded": "September 2014",
        "category": [
            "Top->Computer Science->Artificial Intelligence",
            "Top->Computer Science->Robotics"
        ]
    },
    "url": "http://videolectures.net/ppsn2014_baeck_arms_race/",
    "segmentation": [
        [
            "Thank you very much, winter.",
            "Thank you very much for everybody here because someone obviously had the idea to invite me for this presentation.",
            "I feel very honored by that and it's really pleasure to give this presentation today.",
            "It has kind of a catchy title, an arms race.",
            "I will try to explain why that's the case.",
            "By first of all, they're going back in time.",
            "Becausde Winter has started that already, and I think it's a good idea to look back a little bit."
        ],
        [
            "Cause the question that we are dealing with today is what if you have very little numbers or function evaluations?",
            "Very few trials.",
            "When you look at all the papers that we write today, we like to run our evolutionary computation algorithms for.",
            "Say.",
            "100 times in function evaluations, which is kind of one of the standard tests in the field.",
            "But you know many real world problems seem to be of different characteristics, and actually it's not a new idea to have very few trials.",
            "It's a very old idea because it has been done in the late 60s.",
            "I need to show this.",
            "There's no way out.",
            "It has been done in the late 60s and hot spots with actually has done an experiment which was kind of dangerous back then, but he was well protected so he did build experiments.",
            "And he did execute experiments, and they were executed in a steaming plant, and it was probably hot and dirty and so on.",
            "But the bottom line idea was indeed to evolve a technical design and to optimize the technical design.",
            "Namely, there's not another design down here, and after only only 255 experiments, this thing evolved into an improved design, which is like 1/3.",
            "Better than the original design.",
            "I'm telling you this story becausw it's really important.",
            "It means that evolutionary computation.",
            "The way we know it today even works if you have very little numbers of trials or objective function evaluations.",
            "If you can get in 1/3 improvement with 255 experiment out of which only 50 where roughly 50 where an improvement, then that's pointing into the direction that we can probably use.",
            "This kind of algorithm.",
            "Help us optimize even if we have very little trials, that's the."
        ],
        [
            "Point I'm trying to make today becausw.",
            "In fact, there are many problems like this around in the real world, and this is just an example.",
            "It's courtesy of BMW Mr. Timmerman, which shows you the kinds of experiments which are being executed today.",
            "You don't want to build 255 cars and crush them, that's not what they do, but they simulate the car crash, meaning lots of things are being done on powerful computers nowadays where still a single simulation could take.",
            "For example, a day of computational effort.",
            "Which is pretty common in this industry, so again, they've got this question.",
            "What do we do if we have very time consuming, expensive, long lasting, objective function evaluations?",
            "And the next question is, can we use evolutionary computation to deal with problems like that?",
            "How I got feeling might tell us no becausw.",
            "We're used to running them for 10,000 function evaluations on the toy problems that we're working with in our academic evaluations."
        ],
        [
            "OK, let's look into this.",
            "What they actually do is of course they have a computational model of the car.",
            "The computational model typically is parameterized and a very easy and straightforward way to parameterized.",
            "It is to say, OK, I'm looking at metal thickness is so I have various different parts of the car, and I can decide for different steel qualities of those different parts of the car.",
            "And of course it's all finite element modeling that they use and then mechanical simulations to simulate the crash case.",
            "And the bottom line question is.",
            "Is there a way to reduce the weight of the car while keeping it safe, stable and fulfill all of the other conditions that you want the car to fulfill?",
            "Typically we are quickly now an domain where we have cut like 100 to 150 parameters that we need to modify.",
            "And more importantly, we have lots of nonlinear constraints.",
            "Imagine you have such a crash case like the famous European and kept races, for example.",
            "What they do is they simulators, height, impact.",
            "You are the driver of a car.",
            "You've got the B pillar right next to you.",
            "And of course there's an intrusion becausw the car hits you over there with like 50 kilometres an hour or something like that and the intrusion of this B pillar should not exceed, for example 10 centimeters, because if it does then your head is in the way and that would not be good.",
            "So that's the kind of conditions that they impose.",
            "Which means you can only calculate and evaluate your constraints after you've been running the simulation, so it's an output constraint of the simulator.",
            "As a matter of fact, an evolution strategy was able to beat all of the existing algorithms in that field and just show a drastic improvement or further reduction of the weight of the car.",
            "For those of you who are experts in this application domain.",
            "This is actually a toy problem with 130,000 elements in the finite element model that is tiny.",
            "That is something that they do when they want quick simulation, but they're not really interested in the results becausw they are not corresponding with reality too much, it's just an indication becomes more."
        ],
        [
            "Interesting.",
            "This was back in 1999.",
            "It becomes more interesting when you go to a million elements order of magnitude.",
            "Now these models are at about 8 million elements and this already indicates to us the next big problem.",
            "If you give these guys more computational F, more computational power, they will not be faster.",
            "They will just increase the resolution of what they're doing.",
            "The Fidelity of their models, which means they're interested in understanding better what is going on.",
            "Be more sure about the result of the simulation.",
            "It would still take a day, so give them more computational power.",
            "It would still take a day.",
            "That's the bottom line.",
            "For this problem, which has multiple impact cases, so you have a real impact.",
            "A side impact.",
            "Maybe dynamics of the car and so on.",
            "So you run the simulation on multiple CPUs because we are running multiple simulations at the same time.",
            "For this problem we had about 136 parameters, 47 constraints, and the condition was get it done after 12 days of computation time, which meant you can do 180 function evaluations.",
            "OK, so.",
            "Get suspect to the nozzle because we're in a similar domain here.",
            "Lots of parameters, very little function valuations."
        ],
        [
            "The result was again a pretty massive improvement.",
            "Of further mass, I can't give you the exact details here, but the bottom line is.",
            "It is not only optimizing better, but it's also much faster than the previous way they ran the process and time is really, really essential in this particular industry because they're always looking after reducing the time it takes to develop new car models.",
            "The Professor Dudeck is now professor at Technical University of Munich.",
            "He was with BMW back then.",
            "He published all those results because we conducted those experiments with him and you see that there are journals like for example, structural and multidisciplinary optimization which we do not regularly read.",
            "They're just not in our attention focus, but they are definitely interesting 'cause they talk a lot about practical application problems.",
            "OK, so."
        ],
        [
            "Moreover, evolutionary computation isn't always standard, and I'm making a point here be cause I really want to show you that commercial tools in these industries contain evolutionary computation software all the time.",
            "I mean, it's just out there, everybody is using it.",
            "And just to give."
        ],
        [
            "An example, I've anonymized the company.",
            "This is a so called Pido System process integration and design optimization system.",
            "One of the many which are out there in the field, all of them.",
            "All of them have evolutionary computation in it.",
            "This is an example where you see a workflow and workflow means we're combining, for example, post processing, CFD model integration simulation, pre processing and data analysis and all of those techniques."
        ],
        [
            "And you can Simply put together such graphs and then you define a workflow in this example.",
            "Definition of input variables.",
            "Actions to calculate outputs and definition of output variables or measures that you are interested.",
            "If we look closely.",
            "We find."
        ],
        [
            "And that you get dropdown menus.",
            "And since you can't read them."
        ],
        [
            "Just.",
            "Loan them up a little bit for you, which gives you a sequential quadratic programming, generalized reduced gradient methods, differential evolution, self adaptive evolution in sounds interesting.",
            "Sounds like something that we might know, simulated annealing, CMAS.",
            "Of course efficient global optimizer or what's that?",
            "That must be something really interesting if it's efficient and the other ones are not Clearview Global optimizer, that seems to be a branch brands, brands and so on.",
            "So and the list is not complete.",
            "So it's all down.",
            "Multicriteria optimization."
        ],
        [
            "Is there so you get purito fronts and all this kind of stuff?",
            "So next big thing, can we do a perrito front if we have only 180 function over here?",
            "Since that's probably a question to people like Michael Emmerich.",
            "And so I'm not going to answer this question.",
            "So.",
            "What are the issue?"
        ],
        [
            "If you look at this, it seems like perfect.",
            "It's all there.",
            "We don't need to do any work anymore because evolutionary computation is a standard technique in the industry.",
            "First of all, yeah, which algorithm do you use?",
            "I mean, the next problem is obvious.",
            "Now we've got all the algorithms in there, but what do you do?",
            "Here's my crash problem.",
            "Which algorithm am I supposed to use?",
            "So typically those companies believe it or not.",
            "Do not really have optimization experts.",
            "I'm sorry to say this, but this professor, Dudek, he was the one guy who really understood optimization and he left.",
            "I mean for other reasons, but not because he understood optimization.",
            "Um?",
            "So what they say is I don't know.",
            "Give me a wizard.",
            "Here's my problem.",
            "I want to know which algorithm to use because I've got 15 and I really don't know what to do, so that's what they want.",
            "And then the other question is of course I've got 15 algorithms.",
            "Why should I need yet another one?",
            "And why should I even pay for it?",
            "Doesn't make sense to me.",
            "And there are also misleading conclusions.",
            "The worst one I came across was the following.",
            "You optimizer sucks becausw.",
            "I tried it on a 3 dimensional test problem and it lost after 10,000 function evaluations against.",
            "Pick any other optimizer differential evolution, whatever.",
            "OK. How do you explain?",
            "When you are an optimization expert.",
            "What the engineers have to do.",
            "It's a really tricky business.",
            "Big cause.",
            "Your 140 dimensional crash problem where you have only 180 or 200 function evaluations might require different optimization algorithm.",
            "Not that one, but people draw conclusions based on their initial trial and they do the initial trial with the test problem that comes with the software and then they draw a conclusion and debts.",
            "What they zoom in on?",
            "That's what they do in the future.",
            "It's very hard then to say, but for this particular problem you should be picking another optimizing."
        ],
        [
            "OK, So what they want is.",
            "They want to solve high dimensional problems at the end of the day they have very few function evaluations, many nonlinear output constraints.",
            "24 hours or more per single function evaluation, and ideally, and that's again the big contradiction totally integrated in the workflow.",
            "Click a button.",
            "Don't worry about it anymore.",
            "Becaused they see this as a means to do what they're supposed to do, meaning make the cars safe for the crash.",
            "Build cars, but not optimized.",
            "So it's just a means to an end, and the problem that they want to solve this make a new car."
        ],
        [
            "So let's look at the available algorithms just to make our life a little bit harder.",
            "I called it the zoo and I'm only only only only talking about evolutionary strategies.",
            "There is a million other choices that you have out there.",
            "But if we look at evolution."
        ],
        [
            "Strategies I was confused.",
            "I must say 'cause I had the feeling I lost overview so I tried to get an overview again and this overview is still incomplete 'cause there were so many variants nowadays that it's really hard to read, understand and keep up with all of them.",
            "And that's of course because we are a really mature field now and there are so many activities going on, it's really hard to read all this stuff.",
            "I tried to understand at least the development between 96 and 2012 in terms of.",
            "What you could call contemporary evolutionary strategies somehow?",
            "Starting with the CMAS and some experts here in the room, might say this is simplifying, but I try to explain it in a way that is maybe giving you an update as well and an overview."
        ],
        [
            "The Cmas looks at.",
            "Completely randomization, it has a rank 1 update for the Evolution Path rank new update for the mutation steps and weighted recombination or great ideas which help us tremendously.",
            "But then you can enhance this by saying."
        ],
        [
            "Let's add local restarts and look at stagnation criteria, which is a very good idea.",
            "So when the search is stagnated we just want to restart the thing."
        ],
        [
            "Or increase the population size when we do the restarts.",
            "Or"
        ],
        [
            "Think about how to tune the external parameter settings.",
            "For example with design of experiment methods and even learn what good parameter settings are for certain configurations.",
            "And."
        ],
        [
            "We could go on by saying, which is also a very good idea.",
            "The Lambda minus mu versed individuals also give us information to learn from so we can incorporate them or we."
        ],
        [
            "And say.",
            "We can reduce the computational effort by saving the icon eigendecomposition, which we need introducing 1/5 success at 1/5 rule for the global step size and turn back to 1 + 1 like agrumes, one parent, one offspring.",
            "Which might be a good idea to look at, because we've seen already that 1 + 1 can be an extremely powerful strategy still."
        ],
        [
            "We can then combine these two, get the 1 + 1 Active CMAS.",
            "The yeah introduce negative updates when we are worse than the case predecessor, because now you know 1 + 1 strategy we have to look at various generations backwards because there's only one parent, obviously."
        ],
        [
            "We can include self adaptation of the Global Sigma and reduce the number of exogenous parameters, which is also a good idea because then we don't have so much effort in trying to tune parameters."
        ],
        [
            "We can introduce mirroring mutation steps so to say we do a mutation in this direction might be a good idea to include the opposite individual as well in the offspring population."
        ],
        [
            "We can extend this again by adding pairwise selection and re sample length variation, which is just an extended version of that idea."
        ],
        [
            "We can try to learn a quadratic Taylor approximation using these square and switch between these square and CMA is be cause these squares pretty expensive."
        ],
        [
            "We can look at the natural gradient for covariance matrix learning.",
            "We"
        ],
        [
            "You can.",
            "At the exact calculation of the Fisher Information Matrix, which is all big or into the power of 6 and then we."
        ],
        [
            "And try to do that more efficient by turning back too big or two of end to the power of 3.",
            "Finally we."
        ],
        [
            "Can say.",
            "We look at only the diagonal matrix, so that gives us all of N, but it's a bad strategy because it can't really learn the covariances.",
            "It's not a bad strategy, but it's not working as efficiently as some of the other areas."
        ],
        [
            "We can look into combining mirrored sampling with orthogonal sampling.",
            "I'll talk about that for a few seconds just to give you an idea how that works."
        ],
        [
            "We can look at local quadratic metal models."
        ],
        [
            "And look at new or extended local quadratic metal models."
        ],
        [
            "And we can exploit pouch partial separability with meta models and end end.",
            "This is incomplete, just gives you some kind of idea what's going on in the field, which one to pick for the crash optimization problem.",
            "You probably don't know.",
            "I also don't know to be honest, but will look a little bit into that and try to understand.",
            "Better how they play."
        ],
        [
            "Swan just an idea about this mirrored orthogonal sampling becausw everybody, including us, is trying to extend these algorithms, so I just want to give you an idea what this is about."
        ],
        [
            "You can easily see that sampling can be inefficient.",
            "Becausw if by chance all the offspring vectors are generated in this direction, there's no improvement in this particular generation, even for a simple convex problem.",
            "So it's pretty straightforward to say."
        ],
        [
            "Let's introduce mirroring, where actually 4 for a given offspring individual.",
            "We also look at the mirror image, so we just reduce the total amount of randomness by saying only half of the offspring are actually random.",
            "The other half of the offspring are the opposite direction.",
            "You can also say it might be better to do this orthogonal, so just make sure that they all have perpendicular to each other and then combining those two you get this mirrored orthogonal sampling."
        ],
        [
            "And.",
            "The implementation is actually using a gram Schmidt decomposition, which is pretty straightforward and standard now in these algorithms and then you see the mirroring down here, where five of the offspring are generated in the positive and the other half in the opposite direction.",
            "So you somehow see all of this reflected by this brief pseudocode algorithm, which I'm giving you here."
        ],
        [
            "And then of course you look at the sphere model.",
            "That's the best understood function.",
            "So it's very well understood in terms of optimal convergence velocity.",
            "You can look at the behavior of your algorithm compared to CMAS, but also compared to all the optimal settings in the 1 + 1 ES 1 + 1 years with optimal step size is optimal.",
            "Step size control in general, and you get Cmas.",
            "The mirroring CMA, S&D orthogonal mirroring CMAS, which of course then improves becausw.",
            "It's a more designed again for improving on the sphere model, so this is a result which is to be expected."
        ],
        [
            "If we look at the famous bebop benchmark black box optimization benchmark, then you've got wonderful means of evaluating the performance of your new algorithms.",
            "So it's really straightforward to apply it there and to evaluate performance in terms of those standardized plots.",
            "Where you essentially see the cumulative probability density function of your results, so you can compare given the precision 10 to the power of plus one to 10 to the minus eight of your final solution approximation.",
            "You can see that for example, the mirrored orthogonal sampling the solid curves.",
            "Outperforming the mirrored sampling.",
            "Dashed curves for all final decisions.",
            "But if you look at the comparison of all algorithms, then there's a nice section down here which is interesting.",
            "Algorithms becausw.",
            "They achieve performance very early on with very little function evaluations, so we're not moving into that direction.",
            "Very mean.",
            "This mirrored orthogonal sampling.",
            "And there are other algorithms which are obviously better when you have very little function evaluations then.",
            "Evolutionary strategies.",
            "This is for 5D.",
            "This is for 20 dimensional and of course we expect it to go down because 20 dimensional problems are more complicated than 5 dimensional problems."
        ],
        [
            "OK, back to the underlying question.",
            "We have very little numbers of function evaluations."
        ],
        [
            "What can we do?",
            "So which strategy performs best?",
            "Can it be improved further?",
            "I'm only looking at evolutionary strategies now."
        ],
        [
            "The way to do those tests is to say, OK, we compare on the bebop test function set, and we split it up into the four classes separable, Union model, nonseparable Union model and then the multi model non separable inseparable functions.",
            "And we compared not only the new methods, but also the good old methods like 1 + 1 years like the randomized versions D, R12 and three, which were kind of the predecessors of the CMAS and also the new, Lambda is according to share food.",
            "So the first version of the multi membered evolution strategy.",
            "Both plots are a bit tricky to read, especially when you're far away, but it's actually the number of wins that these algorithms achieve when you compare them with each other.",
            "Voted against the dimension for those function sets, so this is talking not just about one function, but about all functions which are in the separable unit model domain.",
            "And then you see that indeed some of the 1 + 1 is.",
            "Algorithms are able to slightly outperform the CMA years just cause they are pretty efficient in terms of the number of functioning regulations.",
            "But of course."
        ],
        [
            "This picture might be changing when we're looking at the multi model functions, and indeed it does because in this case the active CMA is in the CMA?",
            "S are the clear winners.",
            "So again your problem is.",
            "Which one do I pick?",
            "Because I don't know beforehand what kind of function type I have in front of me.",
            "Likely we would be saying it's a multimodal, objective function, because otherwise probably the problem would not be hard enough.",
            "I will show you some opposite in a few seconds.",
            "OK, this is 25 N this is 25 and 50 N function evaluations.",
            "If N is 100.",
            "50 is still pretty big compared to the numbers that I mentioned earlier, so we're still talking about too many function evaluations, so it makes sense."
        ],
        [
            "To say.",
            "What if it is just 100 or just 1000, independently of NI?",
            "Don't care.",
            "I don't scale by any, I just have this budget.",
            "That's it."
        ],
        [
            "So we did run one to 10 in function evaluations, looked at FCE so."
        ],
        [
            "Just look at fixed cost error.",
            "So in principle we are saying we cut it off and we are interested in the behavior of the algorithms at a certain number function evaluation."
        ],
        [
            "Then you get.",
            "I just give you 2 functions for the sphere, for example the plot like this, where again the active 1 + 1 CMA is extremely fast, followed by the other 1 + 1 years variance, surprisingly.",
            "The good old 1 + 1 ES is in this domain, so it can compete with these sadeski CMAS for example.",
            "Interestingly, we also find one of the predecessors of the Cmas down here, the DDR2 strategy, which is also not too far away and performance of those other algorithms.",
            "So that's an interesting insight.",
            "If we look at 200 function evaluations, the picture is still about the same.",
            "For."
        ],
        [
            "Or a arbitrarily picked the multimodal function?",
            "Just picking one here.",
            "It's again very similar 1 + 1 years is up here.",
            "The best strategy, the active 1 + 1 Cmas then true desky and 1 + 1 and the Dr Tool strategy is also it's a bit behind, but it's still one of the better good old strategies in a way.",
            "OK, what does it tell us?"
        ],
        [
            "We compare all of this.",
            "So for all functions, so this is not integrated across all functions, because we want to get your general picture, you see the clear winner down here, and this is then followed by depends on little bit the number of functional relations.",
            "The 1 + 1 E S&P 1 + 1 Cholesky and the Dr Tool.",
            "So there are a few strategies which are incomparable.",
            "OK, what do we learn?",
            "So many results.",
            "We could think about employing a 1 + 1 strategy 1 + 1 active Cmas seems to be.",
            "A pretty good choice.",
            "But we could also say."
        ],
        [
            "Life is not considered one aspect yet at all, which is.",
            "These guys might be able to run their simulations in parallel, so now the picture is changing again because of 1 + 1.",
            "Strategy is probably not what we want and guess what they are running it in parallel but not to an arbitrary level of parallelism.",
            "So while they have compute clusters with hundreds and thousands of CPU's, the strange thing is that their bottleneck is the number of available simulator licenses.",
            "And that is exactly exactly the kind of way that these people.",
            "Calculate the available resources.",
            "How much time do I have?",
            "When do I want an answer in two weeks from now?",
            "OK, how many licenses do I have?",
            "10 OK, so I can afford two weeks.",
            "That's 14, that's one.",
            "That's 14 function evaluations.",
            "I've 10 available licenses so I can do a level of parallelism of 10.",
            "I can do 140 function evaluations, and that's the way they do backwards calculation.",
            "And then they say, OK, this is what I can afford.",
            "I can get those 10 licenses.",
            "Might have to negotiate with my clan with my colleagues.",
            "But I can get 10, so let's run it 440 function evaluations.",
            "Which algorithm can I use?",
            "Model 1 + 1 algorithm becausw.",
            "I can't do these 140 after each other.",
            "I need to parallelize and all algorithms like the DL2 for example come into the play again.",
            "They are interesting 1, Lambda strategy.",
            "DR2 like is very interesting now.",
            "Becausw groups all of a sudden I'm not here anymore because this is function evaluations.",
            "I can have a factor of 10.",
            "Because I'm parallelizing, I have to look at generations, then the pictures changing."
        ],
        [
            "So all these considerations need to be made.",
            "There's a guy at GM and I asked him whether I could use some of these slides.",
            "So I made my life easy.",
            "I'm using somebody elses slides.",
            "Danejones we were in contact already in 2005, 2006 and so on and he actually came up with a problem in large scale multi disciplinary mass optimization in the auto industry."
        ],
        [
            "I just explain a little bit what this is about becausw those who have listened carefully might say.",
            "Why are using evolutionary computation at all?",
            "It's a linear problem.",
            "Yep, right, the mass of the car is a linear function of the metal thicknesses of the various different steel components.",
            "That's what you see here in a very simplified example.",
            "We've got this Mount here, and of course it's bending, and there were two different bending modes.",
            "As you can see.",
            "It's bending when you have a crash and it's absorbing energy.",
            "While the weight is a linear function of the metal, thickness is energy.",
            "Absorption is not at all.",
            "And that's the point here.",
            "Energy absorption is not at all.",
            "Therefore it's a highly nonlinear problem in terms of the amount of energy that's absorbed, which means in terms of the constraints.",
            "That's where the problem is not in the objective function."
        ],
        [
            "So he defined a test problem and the test problem is really a benchmark problem which you can download which you can execute 'cause he took crash.",
            "And he moved it into a substitute function and said this is a reflective substitute function which really reflects what's going on at crash.",
            "It has got 124 variables, 68 inequality constraints.",
            "The constraints are normalized.",
            "It's based on clicking response surfaces and in the real problem you can optimistically compute about 60 points a day, so it's really of that order of magnitude that I've been talking about.",
            "So he says I want after 1800 function evaluations.",
            "I want good solutions and good solutions are at about that.",
            "That would be really good, but good solutions are at about 200.",
            "28230 in quality.",
            "Um?"
        ],
        [
            "Of course the presentation will be available so you have access to a benchmark problem now, which is a real world benchmark problem."
        ],
        [
            "So what is good performance objective smaller than two 28 and truly impressive would be something twice as fast or same speed, but more accurate.",
            "OK, so here's somebody from industry saying this is what I need.",
            "That was by the way six years ago.",
            "So it's really not relevant to him anymore.",
            "I asked him, but he's still interested in whether evolutionary computation can beat the best available optimizers."
        ],
        [
            "What are the best available optimizers?",
            "Good old power.",
            "Strategy in this case meaning is simplex strategy with linear approximation of the constraints.",
            "So somebody is using linear meta models here.",
            "Ordinea response surface models to model the constraints.",
            "And a simplex like strategy to optimize."
        ],
        [
            "And there's a paper about this.",
            "Direct search optimization method that models the objective and constraint functions by linear interpolation and again advances in optimization and numerical analysis may be another interesting.",
            "Book to take a look."
        ],
        [
            "So used in evolutionary strategy which happened to be good.",
            "I mentioned it in evolutionary strategy provided by new tech.",
            "The company I worked for for awhile and it looked pretty promising in terms of the number of evaluations.",
            "But it was stopped at that point 'cause he didn't have the software.",
            "We did it remotely and some other things happen, so we couldn't really continue.",
            "But he says the longer run made for my May find a better solution."
        ],
        [
            "About Kobyla powerds algorithm.",
            "Wow, that looks really impressive, and indeed.",
            "It generates lots of infeasible solutions.",
            "Yellow means about five constraint violations Max and then in the end tunes in on a feasible solution of quality 228.",
            "That's good.",
            "That's the standard in this application."
        ],
        [
            "And so we said, OK, let's repeat this run because we have the test function and also we repeated the run and it looks promising.",
            "That's roughly what you see here in the beginning after about 40 generations."
        ],
        [
            "Wow, so we thought OK could be going on like that but it doesn't.",
            "So.",
            "Whoops, too bad.",
            "So this is your initial disappointment that you get when you deal with this problem and really try to.",
            "Try to circle."
        ],
        [
            "Then we invested lots of work and got down at some point to 2:45 and then later on to 231.",
            "Now you could say this is really tuning your algorithm to a particular problem.",
            "Yes it is, but it's a problem class.",
            "Everybody in that industry has got this kind of problem."
        ],
        [
            "And then finally we are now in a research project with colleagues here from.",
            "Cologne actually Gomez bar, I should say, and it's really a pleasure to have these kind of opportunities in Germany because the there's a program that supports collaborations between SMB, small companies and universities.",
            "And in this situation I'm in the modern the company perspective, so it's very easy to get grants for this kind of work.",
            "I guess nobody really understood the grant proposal that we submitted there.",
            "Thank you very much, again, both coming for writing this with me, but the bottom line is we wanted to do model assistant optimization for nonlinear constraint production.",
            "Process, which is exactly the problem I'm talking about here, but in a country kind of different language and got the grant and will not work."
        ],
        [
            "On it and we actually came across the corpora algorithm, which is another interesting.",
            "Concept which I want to explain very briefly.",
            "We all know that we are interested in replacing.",
            "Expensive objective functions by so-called surrogate or response surface or approximation models.",
            "So we would like to learn as much as possible from function evaluations to predict.",
            "Future function evaluations.",
            "Even if we are not precise.",
            "Is having a good guess is a good strategy and Koba is actually looking at this and says.",
            "We generate an initial population, evaluate these points on the real function because we need initial information obviously about the objective function.",
            "And then we train radial basis functions, surrogate models for objective function and constraints functions.",
            "So we're trying to learn a meta model or response surface model for both the objective function and or constraints.",
            "And then we optimize on this surrogate function so we do not use the real function, but we run our optimization on the response surface.",
            "And get a new point which is the result of the optimization run.",
            "That can be done quickly because we have fast function evaluations.",
            "Now we add this to the population.",
            "We repeat building the response surface.",
            "This for objective and for the constraints.",
            "And we continue the process.",
            "Now optimize."
        ],
        [
            "Patient is here and this could be any optimize, of course, including evolutionary strategies or anything else.",
            "So now we are replacing the real problem by surrogate model.",
            "Again, engineering optimization, a Journal that we would not regularly read, but which is certainly interesting to take a look at."
        ],
        [
            "So we worked on this.",
            "We introduced for example, an improved initialization scheme.",
            "Actually, you see here different function.",
            "You see how improved initialization can help to in general improve the quality of the results."
        ],
        [
            "And then vote count came up with a really great idea on repairing infeasible solutions.",
            "By saying, OK, I can probably derive a direction towards feasibility and using this direction towards feasibility actually helps to repair cause you have many constraint violations and all of a sudden you get into the interesting domain of really below 230, not quite reaching the APTA."
        ],
        [
            "On and with some additional effort.",
            "We are at 228.5 infeasible.",
            "This is an arms race.",
            "Yes, yeah, 'cause there's a difficult problem.",
            "We're trying to optimize the optimizers we optimize them for this problem.",
            "We believe we have something really efficient now when it comes to nonlinear constraints and few very few function evaluations.",
            "And that's the kind of stuff which is really interesting for industry from our perspective so."
        ],
        [
            "That's what we do.",
            "We do other things as well, and actually Bachman asked me to make clear why my presentation doesn't seem to have to do anything with my paper, simply 'cause we wanted to write a paper that talks about a real world problem specifically, and my presentation is a bit more generic.",
            "As you can see.",
            "So I will talk about my paper now.",
            "I still have time right, which is about Power Distribution network configuration."
        ],
        [
            "That's a completely different problem, but it's also interesting because again, evolutionary strategies as I will point out very quickly, are a powerful solver for this kind of problem.",
            "We have components of an electrical grid generation, transmission, and then finally the distribution part.",
            "We are looking at the Power Distribution network reconfiguration problem, so you have switches.",
            "And switches, transistors, Transformers and stuff like that.",
            "And this has to be switched the right way to do the power supply."
        ],
        [
            "And here you see typical problem.",
            "Where the black solid lines are normally closed switches and the red dashed lines are normally open switches which you could close.",
            "But of course there are certain constraints for your network.",
            "One of them is that you shouldn't generate cycles in the network, 'cause then get short circuits shortcuts.",
            "And you should not have isolated nodes, obviously because you want to supply everybody with power."
        ],
        [
            "There are again benchmark problems like everywhere, and these are the IEEE benchmark problems.",
            "You can pick a binary encoding.",
            "Actually look at every connection as a connection that you can break or have, but then you get pretty big encodings, and it's not a very smart way of encoding your network.",
            "Because you easily get for the reference system 2 to the power of 118 possibilities.",
            "But obviously UGA is a straightforward approach to this problem because we get the binary encoding actually.",
            "You can also do integer encoding by simply saying.",
            "I have four possibilities here, 5 possibilities there, sorry five.",
            "Therefore there in three there, which gives me 4 * 5 * 3 possibility to break circuits because I need to break them.",
            "Otherwise I have.",
            "Shortcuts.",
            "And for the big system now my search space is only one.",
            ".44 * 10 to the power of 18 so has reduced in size that gives me maybe a better representation using this approach.",
            "Now Aga is not straightforwardly applicable anymore.",
            "An evolutionary strategy doesn't seem to be applicable either, but those who remember back the early days or also what we are doing nowadays.",
            "Know that at some point there was an attempt to apply evolutionary strategies to integer representations and also adapt the idea of self adaptation to integer representations.",
            "And this was actually when, if I may say, this Gunther who did the.",
            "Groundbreaking work in this area by showing how this can be done."
        ],
        [
            "So we did this.",
            "And."
        ],
        [
            "No."
        ],
        [
            "Came up with an application of the integer evolution strategy which actually save adept step sizes of the corresponding geometric distribution.",
            "Rather than normal distribution and applied this to the integer representation for this problem."
        ],
        [
            "I should say a few words about the objective function.",
            "Normally people look at this problem as just optimizing power loss.",
            "So minimizing the total power loss of the network, which would be sufficient subject to of course minimum and maximum bounds on the voltages and on the currents which are flowing.",
            "But you could also say it's actually a multicriteria optimization problem, because you would also like to minimize the voltage deviation, and this is actually a completely new perspective.",
            "On this problem, because it hasn't really been handled as a multi objective optimization problem yet, so we did both at the same time."
        ],
        [
            "We used a self adaptive integer evolution strategy to solve the problem.",
            "We looked at the recombination strategy because this was an unanswered question as well."
        ],
        [
            "And we looked at results as a function of the recombination operator for the object variables and the step sizes and you see a combination here, which is the optimal solution which is known for this problem of 869 in terms of power loss."
        ],
        [
            "Um?",
            "You see it between the initial topology.",
            "And the best apology quite some differences in terms of switches which are open and closed in the meantime.",
            "So see for example that now this switch is closed.",
            "In the best apology, so this set of solutions for this set of nodes now is connected to this set of nodes.",
            "And then there's another connection over here and over here, and so on South there are drastic changes now in these solutions."
        ],
        [
            "And then of course, in the Multiobjective case.",
            "It was straightforward for us to compare.",
            "In this case the SMS IBO algorithm which is looking at these metrics based selection to the classical nsda 2 algorithm for both using a single.",
            "Multiple step sizes in the integer evolution strategy, and you see that and ispirato front has been found in both cases, and there's not such a big difference to be in SGA 2, but the key point is that there is also a need point.",
            "Roughly, if you look at it from a distance, so at some point really.",
            "When?",
            "Power loss it goes down.",
            "You get all of a sudden voltage deviation which goes up.",
            "This is a very small range though only so voltage deviation is really restricted to a very very narrow range.",
            "Whether it really matters for the practical application still needs to be decided, but at least the second objective has been incorporated, and that's the first time that this has been done.",
            "But for US, it's pretty natural to look at those problems as.",
            "More likely multi objective optimization problems.",
            "Then single objective problems."
        ],
        [
            "So I might be a bit too early, but I would like to thank quite a number of people, especially those working in the natural computing group at lyrics Michael Emmerich Undredal it's Walter provide check and one my PhD students who are actually working hard on all of this.",
            "I have one slide which I only show if there are PhD students in the room.",
            "So raise your hand OK, more than one more than zero, that's good.",
            "Becaused I was a PhD student in 1990 and I had been given this opportunity because I was asking the then hopefully to be my PhD supervisor, whether he would have a position for me and he said not really.",
            "But you always can apply at the doctor for some skin Minecraft if you want to, and if you are successful then I wouldn't care.",
            "Having you as my PhD student.",
            "So I tried.",
            "I was successful, which is unbelievable if I think about that back then and.",
            "Became a PhD student of Hunter paper and.",
            "It was actually a wonderful time that I had there.",
            "But I want to tell you a very short anecdote about that time, which is really important to me.",
            "The first thing I was supposed to do when I became a PhD student was to do my research of course, but also to organize a conference or help organizing a conference because I didn't know how to do that.",
            "But I trusted of course that my PhD supervisor would know how to do it and his wife.",
            "They did.",
            "It was really interesting.",
            "Guess what we organized PPS in 1990s or the first of these conferences in Dortmund?",
            "And one of the things I really.",
            "Integrated, and that's my advice to PhD students is that the 1/5 successful also holds for science.",
            "So if 80% of what you are doing seems to be a dead end or not successful or whatever, don't give up.",
            "You're probably working at the right speed of evolution or optimization and therefore and just don't never lose faith and get to the point where you finish your work.",
            "You will.",
            "I also met then at a conference at that P is in conference, another guy who was going to give the keynote presentation tomorrow.",
            "And I also made mistakes as a PhD student, and I remember that I went to ICJ in 91 and probably gave a presentation and horrible English.",
            "And I talked to God's item about rotation Angels.",
            "But that's not really what I meant ghosty.",
            "I meant rotation angles.",
            "So even if your English is horrible sometimes, don't worry about it.",
            "You always have a chance to improve it, and that's the other message.",
            "I wanted to give you.",
            "So it was a lot of fun without this opportunity that I was giving back then I would not be standing here today as a professor at Leiden University and would not be able to give this keynote, so I'm terribly grateful for that opportunity.",
            "Questions, thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thank you very much, winter.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much for everybody here because someone obviously had the idea to invite me for this presentation.",
                    "label": 0
                },
                {
                    "sent": "I feel very honored by that and it's really pleasure to give this presentation today.",
                    "label": 0
                },
                {
                    "sent": "It has kind of a catchy title, an arms race.",
                    "label": 1
                },
                {
                    "sent": "I will try to explain why that's the case.",
                    "label": 0
                },
                {
                    "sent": "By first of all, they're going back in time.",
                    "label": 0
                },
                {
                    "sent": "Becausde Winter has started that already, and I think it's a good idea to look back a little bit.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Cause the question that we are dealing with today is what if you have very little numbers or function evaluations?",
                    "label": 1
                },
                {
                    "sent": "Very few trials.",
                    "label": 0
                },
                {
                    "sent": "When you look at all the papers that we write today, we like to run our evolutionary computation algorithms for.",
                    "label": 0
                },
                {
                    "sent": "Say.",
                    "label": 0
                },
                {
                    "sent": "100 times in function evaluations, which is kind of one of the standard tests in the field.",
                    "label": 1
                },
                {
                    "sent": "But you know many real world problems seem to be of different characteristics, and actually it's not a new idea to have very few trials.",
                    "label": 0
                },
                {
                    "sent": "It's a very old idea because it has been done in the late 60s.",
                    "label": 0
                },
                {
                    "sent": "I need to show this.",
                    "label": 0
                },
                {
                    "sent": "There's no way out.",
                    "label": 0
                },
                {
                    "sent": "It has been done in the late 60s and hot spots with actually has done an experiment which was kind of dangerous back then, but he was well protected so he did build experiments.",
                    "label": 0
                },
                {
                    "sent": "And he did execute experiments, and they were executed in a steaming plant, and it was probably hot and dirty and so on.",
                    "label": 0
                },
                {
                    "sent": "But the bottom line idea was indeed to evolve a technical design and to optimize the technical design.",
                    "label": 0
                },
                {
                    "sent": "Namely, there's not another design down here, and after only only 255 experiments, this thing evolved into an improved design, which is like 1/3.",
                    "label": 0
                },
                {
                    "sent": "Better than the original design.",
                    "label": 0
                },
                {
                    "sent": "I'm telling you this story becausw it's really important.",
                    "label": 0
                },
                {
                    "sent": "It means that evolutionary computation.",
                    "label": 0
                },
                {
                    "sent": "The way we know it today even works if you have very little numbers of trials or objective function evaluations.",
                    "label": 0
                },
                {
                    "sent": "If you can get in 1/3 improvement with 255 experiment out of which only 50 where roughly 50 where an improvement, then that's pointing into the direction that we can probably use.",
                    "label": 0
                },
                {
                    "sent": "This kind of algorithm.",
                    "label": 0
                },
                {
                    "sent": "Help us optimize even if we have very little trials, that's the.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Point I'm trying to make today becausw.",
                    "label": 0
                },
                {
                    "sent": "In fact, there are many problems like this around in the real world, and this is just an example.",
                    "label": 0
                },
                {
                    "sent": "It's courtesy of BMW Mr. Timmerman, which shows you the kinds of experiments which are being executed today.",
                    "label": 0
                },
                {
                    "sent": "You don't want to build 255 cars and crush them, that's not what they do, but they simulate the car crash, meaning lots of things are being done on powerful computers nowadays where still a single simulation could take.",
                    "label": 0
                },
                {
                    "sent": "For example, a day of computational effort.",
                    "label": 0
                },
                {
                    "sent": "Which is pretty common in this industry, so again, they've got this question.",
                    "label": 0
                },
                {
                    "sent": "What do we do if we have very time consuming, expensive, long lasting, objective function evaluations?",
                    "label": 0
                },
                {
                    "sent": "And the next question is, can we use evolutionary computation to deal with problems like that?",
                    "label": 0
                },
                {
                    "sent": "How I got feeling might tell us no becausw.",
                    "label": 0
                },
                {
                    "sent": "We're used to running them for 10,000 function evaluations on the toy problems that we're working with in our academic evaluations.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, let's look into this.",
                    "label": 0
                },
                {
                    "sent": "What they actually do is of course they have a computational model of the car.",
                    "label": 0
                },
                {
                    "sent": "The computational model typically is parameterized and a very easy and straightforward way to parameterized.",
                    "label": 0
                },
                {
                    "sent": "It is to say, OK, I'm looking at metal thickness is so I have various different parts of the car, and I can decide for different steel qualities of those different parts of the car.",
                    "label": 0
                },
                {
                    "sent": "And of course it's all finite element modeling that they use and then mechanical simulations to simulate the crash case.",
                    "label": 0
                },
                {
                    "sent": "And the bottom line question is.",
                    "label": 0
                },
                {
                    "sent": "Is there a way to reduce the weight of the car while keeping it safe, stable and fulfill all of the other conditions that you want the car to fulfill?",
                    "label": 0
                },
                {
                    "sent": "Typically we are quickly now an domain where we have cut like 100 to 150 parameters that we need to modify.",
                    "label": 0
                },
                {
                    "sent": "And more importantly, we have lots of nonlinear constraints.",
                    "label": 0
                },
                {
                    "sent": "Imagine you have such a crash case like the famous European and kept races, for example.",
                    "label": 0
                },
                {
                    "sent": "What they do is they simulators, height, impact.",
                    "label": 0
                },
                {
                    "sent": "You are the driver of a car.",
                    "label": 0
                },
                {
                    "sent": "You've got the B pillar right next to you.",
                    "label": 0
                },
                {
                    "sent": "And of course there's an intrusion becausw the car hits you over there with like 50 kilometres an hour or something like that and the intrusion of this B pillar should not exceed, for example 10 centimeters, because if it does then your head is in the way and that would not be good.",
                    "label": 0
                },
                {
                    "sent": "So that's the kind of conditions that they impose.",
                    "label": 0
                },
                {
                    "sent": "Which means you can only calculate and evaluate your constraints after you've been running the simulation, so it's an output constraint of the simulator.",
                    "label": 0
                },
                {
                    "sent": "As a matter of fact, an evolution strategy was able to beat all of the existing algorithms in that field and just show a drastic improvement or further reduction of the weight of the car.",
                    "label": 0
                },
                {
                    "sent": "For those of you who are experts in this application domain.",
                    "label": 0
                },
                {
                    "sent": "This is actually a toy problem with 130,000 elements in the finite element model that is tiny.",
                    "label": 1
                },
                {
                    "sent": "That is something that they do when they want quick simulation, but they're not really interested in the results becausw they are not corresponding with reality too much, it's just an indication becomes more.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Interesting.",
                    "label": 0
                },
                {
                    "sent": "This was back in 1999.",
                    "label": 0
                },
                {
                    "sent": "It becomes more interesting when you go to a million elements order of magnitude.",
                    "label": 0
                },
                {
                    "sent": "Now these models are at about 8 million elements and this already indicates to us the next big problem.",
                    "label": 0
                },
                {
                    "sent": "If you give these guys more computational F, more computational power, they will not be faster.",
                    "label": 0
                },
                {
                    "sent": "They will just increase the resolution of what they're doing.",
                    "label": 0
                },
                {
                    "sent": "The Fidelity of their models, which means they're interested in understanding better what is going on.",
                    "label": 0
                },
                {
                    "sent": "Be more sure about the result of the simulation.",
                    "label": 0
                },
                {
                    "sent": "It would still take a day, so give them more computational power.",
                    "label": 0
                },
                {
                    "sent": "It would still take a day.",
                    "label": 0
                },
                {
                    "sent": "That's the bottom line.",
                    "label": 0
                },
                {
                    "sent": "For this problem, which has multiple impact cases, so you have a real impact.",
                    "label": 0
                },
                {
                    "sent": "A side impact.",
                    "label": 0
                },
                {
                    "sent": "Maybe dynamics of the car and so on.",
                    "label": 0
                },
                {
                    "sent": "So you run the simulation on multiple CPUs because we are running multiple simulations at the same time.",
                    "label": 0
                },
                {
                    "sent": "For this problem we had about 136 parameters, 47 constraints, and the condition was get it done after 12 days of computation time, which meant you can do 180 function evaluations.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "Get suspect to the nozzle because we're in a similar domain here.",
                    "label": 0
                },
                {
                    "sent": "Lots of parameters, very little function valuations.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The result was again a pretty massive improvement.",
                    "label": 0
                },
                {
                    "sent": "Of further mass, I can't give you the exact details here, but the bottom line is.",
                    "label": 0
                },
                {
                    "sent": "It is not only optimizing better, but it's also much faster than the previous way they ran the process and time is really, really essential in this particular industry because they're always looking after reducing the time it takes to develop new car models.",
                    "label": 0
                },
                {
                    "sent": "The Professor Dudeck is now professor at Technical University of Munich.",
                    "label": 0
                },
                {
                    "sent": "He was with BMW back then.",
                    "label": 0
                },
                {
                    "sent": "He published all those results because we conducted those experiments with him and you see that there are journals like for example, structural and multidisciplinary optimization which we do not regularly read.",
                    "label": 1
                },
                {
                    "sent": "They're just not in our attention focus, but they are definitely interesting 'cause they talk a lot about practical application problems.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Moreover, evolutionary computation isn't always standard, and I'm making a point here be cause I really want to show you that commercial tools in these industries contain evolutionary computation software all the time.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's just out there, everybody is using it.",
                    "label": 0
                },
                {
                    "sent": "And just to give.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "An example, I've anonymized the company.",
                    "label": 0
                },
                {
                    "sent": "This is a so called Pido System process integration and design optimization system.",
                    "label": 0
                },
                {
                    "sent": "One of the many which are out there in the field, all of them.",
                    "label": 0
                },
                {
                    "sent": "All of them have evolutionary computation in it.",
                    "label": 0
                },
                {
                    "sent": "This is an example where you see a workflow and workflow means we're combining, for example, post processing, CFD model integration simulation, pre processing and data analysis and all of those techniques.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And you can Simply put together such graphs and then you define a workflow in this example.",
                    "label": 0
                },
                {
                    "sent": "Definition of input variables.",
                    "label": 0
                },
                {
                    "sent": "Actions to calculate outputs and definition of output variables or measures that you are interested.",
                    "label": 0
                },
                {
                    "sent": "If we look closely.",
                    "label": 0
                },
                {
                    "sent": "We find.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And that you get dropdown menus.",
                    "label": 0
                },
                {
                    "sent": "And since you can't read them.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just.",
                    "label": 0
                },
                {
                    "sent": "Loan them up a little bit for you, which gives you a sequential quadratic programming, generalized reduced gradient methods, differential evolution, self adaptive evolution in sounds interesting.",
                    "label": 1
                },
                {
                    "sent": "Sounds like something that we might know, simulated annealing, CMAS.",
                    "label": 0
                },
                {
                    "sent": "Of course efficient global optimizer or what's that?",
                    "label": 1
                },
                {
                    "sent": "That must be something really interesting if it's efficient and the other ones are not Clearview Global optimizer, that seems to be a branch brands, brands and so on.",
                    "label": 0
                },
                {
                    "sent": "So and the list is not complete.",
                    "label": 0
                },
                {
                    "sent": "So it's all down.",
                    "label": 0
                },
                {
                    "sent": "Multicriteria optimization.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is there so you get purito fronts and all this kind of stuff?",
                    "label": 0
                },
                {
                    "sent": "So next big thing, can we do a perrito front if we have only 180 function over here?",
                    "label": 0
                },
                {
                    "sent": "Since that's probably a question to people like Michael Emmerich.",
                    "label": 0
                },
                {
                    "sent": "And so I'm not going to answer this question.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "What are the issue?",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If you look at this, it seems like perfect.",
                    "label": 0
                },
                {
                    "sent": "It's all there.",
                    "label": 0
                },
                {
                    "sent": "We don't need to do any work anymore because evolutionary computation is a standard technique in the industry.",
                    "label": 0
                },
                {
                    "sent": "First of all, yeah, which algorithm do you use?",
                    "label": 0
                },
                {
                    "sent": "I mean, the next problem is obvious.",
                    "label": 0
                },
                {
                    "sent": "Now we've got all the algorithms in there, but what do you do?",
                    "label": 0
                },
                {
                    "sent": "Here's my crash problem.",
                    "label": 0
                },
                {
                    "sent": "Which algorithm am I supposed to use?",
                    "label": 0
                },
                {
                    "sent": "So typically those companies believe it or not.",
                    "label": 0
                },
                {
                    "sent": "Do not really have optimization experts.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry to say this, but this professor, Dudek, he was the one guy who really understood optimization and he left.",
                    "label": 0
                },
                {
                    "sent": "I mean for other reasons, but not because he understood optimization.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So what they say is I don't know.",
                    "label": 0
                },
                {
                    "sent": "Give me a wizard.",
                    "label": 0
                },
                {
                    "sent": "Here's my problem.",
                    "label": 0
                },
                {
                    "sent": "I want to know which algorithm to use because I've got 15 and I really don't know what to do, so that's what they want.",
                    "label": 0
                },
                {
                    "sent": "And then the other question is of course I've got 15 algorithms.",
                    "label": 0
                },
                {
                    "sent": "Why should I need yet another one?",
                    "label": 1
                },
                {
                    "sent": "And why should I even pay for it?",
                    "label": 0
                },
                {
                    "sent": "Doesn't make sense to me.",
                    "label": 0
                },
                {
                    "sent": "And there are also misleading conclusions.",
                    "label": 0
                },
                {
                    "sent": "The worst one I came across was the following.",
                    "label": 0
                },
                {
                    "sent": "You optimizer sucks becausw.",
                    "label": 0
                },
                {
                    "sent": "I tried it on a 3 dimensional test problem and it lost after 10,000 function evaluations against.",
                    "label": 0
                },
                {
                    "sent": "Pick any other optimizer differential evolution, whatever.",
                    "label": 0
                },
                {
                    "sent": "OK. How do you explain?",
                    "label": 0
                },
                {
                    "sent": "When you are an optimization expert.",
                    "label": 0
                },
                {
                    "sent": "What the engineers have to do.",
                    "label": 0
                },
                {
                    "sent": "It's a really tricky business.",
                    "label": 0
                },
                {
                    "sent": "Big cause.",
                    "label": 0
                },
                {
                    "sent": "Your 140 dimensional crash problem where you have only 180 or 200 function evaluations might require different optimization algorithm.",
                    "label": 0
                },
                {
                    "sent": "Not that one, but people draw conclusions based on their initial trial and they do the initial trial with the test problem that comes with the software and then they draw a conclusion and debts.",
                    "label": 0
                },
                {
                    "sent": "What they zoom in on?",
                    "label": 0
                },
                {
                    "sent": "That's what they do in the future.",
                    "label": 0
                },
                {
                    "sent": "It's very hard then to say, but for this particular problem you should be picking another optimizing.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, So what they want is.",
                    "label": 1
                },
                {
                    "sent": "They want to solve high dimensional problems at the end of the day they have very few function evaluations, many nonlinear output constraints.",
                    "label": 1
                },
                {
                    "sent": "24 hours or more per single function evaluation, and ideally, and that's again the big contradiction totally integrated in the workflow.",
                    "label": 0
                },
                {
                    "sent": "Click a button.",
                    "label": 0
                },
                {
                    "sent": "Don't worry about it anymore.",
                    "label": 0
                },
                {
                    "sent": "Becaused they see this as a means to do what they're supposed to do, meaning make the cars safe for the crash.",
                    "label": 0
                },
                {
                    "sent": "Build cars, but not optimized.",
                    "label": 0
                },
                {
                    "sent": "So it's just a means to an end, and the problem that they want to solve this make a new car.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let's look at the available algorithms just to make our life a little bit harder.",
                    "label": 1
                },
                {
                    "sent": "I called it the zoo and I'm only only only only talking about evolutionary strategies.",
                    "label": 1
                },
                {
                    "sent": "There is a million other choices that you have out there.",
                    "label": 0
                },
                {
                    "sent": "But if we look at evolution.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Strategies I was confused.",
                    "label": 0
                },
                {
                    "sent": "I must say 'cause I had the feeling I lost overview so I tried to get an overview again and this overview is still incomplete 'cause there were so many variants nowadays that it's really hard to read, understand and keep up with all of them.",
                    "label": 0
                },
                {
                    "sent": "And that's of course because we are a really mature field now and there are so many activities going on, it's really hard to read all this stuff.",
                    "label": 0
                },
                {
                    "sent": "I tried to understand at least the development between 96 and 2012 in terms of.",
                    "label": 0
                },
                {
                    "sent": "What you could call contemporary evolutionary strategies somehow?",
                    "label": 0
                },
                {
                    "sent": "Starting with the CMAS and some experts here in the room, might say this is simplifying, but I try to explain it in a way that is maybe giving you an update as well and an overview.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The Cmas looks at.",
                    "label": 0
                },
                {
                    "sent": "Completely randomization, it has a rank 1 update for the Evolution Path rank new update for the mutation steps and weighted recombination or great ideas which help us tremendously.",
                    "label": 1
                },
                {
                    "sent": "But then you can enhance this by saying.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let's add local restarts and look at stagnation criteria, which is a very good idea.",
                    "label": 0
                },
                {
                    "sent": "So when the search is stagnated we just want to restart the thing.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or increase the population size when we do the restarts.",
                    "label": 0
                },
                {
                    "sent": "Or",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Think about how to tune the external parameter settings.",
                    "label": 1
                },
                {
                    "sent": "For example with design of experiment methods and even learn what good parameter settings are for certain configurations.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We could go on by saying, which is also a very good idea.",
                    "label": 0
                },
                {
                    "sent": "The Lambda minus mu versed individuals also give us information to learn from so we can incorporate them or we.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And say.",
                    "label": 0
                },
                {
                    "sent": "We can reduce the computational effort by saving the icon eigendecomposition, which we need introducing 1/5 success at 1/5 rule for the global step size and turn back to 1 + 1 like agrumes, one parent, one offspring.",
                    "label": 0
                },
                {
                    "sent": "Which might be a good idea to look at, because we've seen already that 1 + 1 can be an extremely powerful strategy still.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We can then combine these two, get the 1 + 1 Active CMAS.",
                    "label": 0
                },
                {
                    "sent": "The yeah introduce negative updates when we are worse than the case predecessor, because now you know 1 + 1 strategy we have to look at various generations backwards because there's only one parent, obviously.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We can include self adaptation of the Global Sigma and reduce the number of exogenous parameters, which is also a good idea because then we don't have so much effort in trying to tune parameters.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We can introduce mirroring mutation steps so to say we do a mutation in this direction might be a good idea to include the opposite individual as well in the offspring population.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We can extend this again by adding pairwise selection and re sample length variation, which is just an extended version of that idea.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We can try to learn a quadratic Taylor approximation using these square and switch between these square and CMA is be cause these squares pretty expensive.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We can look at the natural gradient for covariance matrix learning.",
                    "label": 0
                },
                {
                    "sent": "We",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can.",
                    "label": 0
                },
                {
                    "sent": "At the exact calculation of the Fisher Information Matrix, which is all big or into the power of 6 and then we.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And try to do that more efficient by turning back too big or two of end to the power of 3.",
                    "label": 0
                },
                {
                    "sent": "Finally we.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Can say.",
                    "label": 0
                },
                {
                    "sent": "We look at only the diagonal matrix, so that gives us all of N, but it's a bad strategy because it can't really learn the covariances.",
                    "label": 0
                },
                {
                    "sent": "It's not a bad strategy, but it's not working as efficiently as some of the other areas.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We can look into combining mirrored sampling with orthogonal sampling.",
                    "label": 0
                },
                {
                    "sent": "I'll talk about that for a few seconds just to give you an idea how that works.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We can look at local quadratic metal models.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And look at new or extended local quadratic metal models.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we can exploit pouch partial separability with meta models and end end.",
                    "label": 0
                },
                {
                    "sent": "This is incomplete, just gives you some kind of idea what's going on in the field, which one to pick for the crash optimization problem.",
                    "label": 0
                },
                {
                    "sent": "You probably don't know.",
                    "label": 0
                },
                {
                    "sent": "I also don't know to be honest, but will look a little bit into that and try to understand.",
                    "label": 0
                },
                {
                    "sent": "Better how they play.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Swan just an idea about this mirrored orthogonal sampling becausw everybody, including us, is trying to extend these algorithms, so I just want to give you an idea what this is about.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You can easily see that sampling can be inefficient.",
                    "label": 1
                },
                {
                    "sent": "Becausw if by chance all the offspring vectors are generated in this direction, there's no improvement in this particular generation, even for a simple convex problem.",
                    "label": 0
                },
                {
                    "sent": "So it's pretty straightforward to say.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's introduce mirroring, where actually 4 for a given offspring individual.",
                    "label": 0
                },
                {
                    "sent": "We also look at the mirror image, so we just reduce the total amount of randomness by saying only half of the offspring are actually random.",
                    "label": 0
                },
                {
                    "sent": "The other half of the offspring are the opposite direction.",
                    "label": 1
                },
                {
                    "sent": "You can also say it might be better to do this orthogonal, so just make sure that they all have perpendicular to each other and then combining those two you get this mirrored orthogonal sampling.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "The implementation is actually using a gram Schmidt decomposition, which is pretty straightforward and standard now in these algorithms and then you see the mirroring down here, where five of the offspring are generated in the positive and the other half in the opposite direction.",
                    "label": 0
                },
                {
                    "sent": "So you somehow see all of this reflected by this brief pseudocode algorithm, which I'm giving you here.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then of course you look at the sphere model.",
                    "label": 0
                },
                {
                    "sent": "That's the best understood function.",
                    "label": 0
                },
                {
                    "sent": "So it's very well understood in terms of optimal convergence velocity.",
                    "label": 0
                },
                {
                    "sent": "You can look at the behavior of your algorithm compared to CMAS, but also compared to all the optimal settings in the 1 + 1 ES 1 + 1 years with optimal step size is optimal.",
                    "label": 0
                },
                {
                    "sent": "Step size control in general, and you get Cmas.",
                    "label": 0
                },
                {
                    "sent": "The mirroring CMA, S&D orthogonal mirroring CMAS, which of course then improves becausw.",
                    "label": 0
                },
                {
                    "sent": "It's a more designed again for improving on the sphere model, so this is a result which is to be expected.",
                    "label": 1
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If we look at the famous bebop benchmark black box optimization benchmark, then you've got wonderful means of evaluating the performance of your new algorithms.",
                    "label": 0
                },
                {
                    "sent": "So it's really straightforward to apply it there and to evaluate performance in terms of those standardized plots.",
                    "label": 0
                },
                {
                    "sent": "Where you essentially see the cumulative probability density function of your results, so you can compare given the precision 10 to the power of plus one to 10 to the minus eight of your final solution approximation.",
                    "label": 0
                },
                {
                    "sent": "You can see that for example, the mirrored orthogonal sampling the solid curves.",
                    "label": 1
                },
                {
                    "sent": "Outperforming the mirrored sampling.",
                    "label": 1
                },
                {
                    "sent": "Dashed curves for all final decisions.",
                    "label": 0
                },
                {
                    "sent": "But if you look at the comparison of all algorithms, then there's a nice section down here which is interesting.",
                    "label": 0
                },
                {
                    "sent": "Algorithms becausw.",
                    "label": 0
                },
                {
                    "sent": "They achieve performance very early on with very little function evaluations, so we're not moving into that direction.",
                    "label": 0
                },
                {
                    "sent": "Very mean.",
                    "label": 0
                },
                {
                    "sent": "This mirrored orthogonal sampling.",
                    "label": 0
                },
                {
                    "sent": "And there are other algorithms which are obviously better when you have very little function evaluations then.",
                    "label": 0
                },
                {
                    "sent": "Evolutionary strategies.",
                    "label": 0
                },
                {
                    "sent": "This is for 5D.",
                    "label": 0
                },
                {
                    "sent": "This is for 20 dimensional and of course we expect it to go down because 20 dimensional problems are more complicated than 5 dimensional problems.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, back to the underlying question.",
                    "label": 0
                },
                {
                    "sent": "We have very little numbers of function evaluations.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What can we do?",
                    "label": 0
                },
                {
                    "sent": "So which strategy performs best?",
                    "label": 1
                },
                {
                    "sent": "Can it be improved further?",
                    "label": 0
                },
                {
                    "sent": "I'm only looking at evolutionary strategies now.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The way to do those tests is to say, OK, we compare on the bebop test function set, and we split it up into the four classes separable, Union model, nonseparable Union model and then the multi model non separable inseparable functions.",
                    "label": 0
                },
                {
                    "sent": "And we compared not only the new methods, but also the good old methods like 1 + 1 years like the randomized versions D, R12 and three, which were kind of the predecessors of the CMAS and also the new, Lambda is according to share food.",
                    "label": 0
                },
                {
                    "sent": "So the first version of the multi membered evolution strategy.",
                    "label": 0
                },
                {
                    "sent": "Both plots are a bit tricky to read, especially when you're far away, but it's actually the number of wins that these algorithms achieve when you compare them with each other.",
                    "label": 0
                },
                {
                    "sent": "Voted against the dimension for those function sets, so this is talking not just about one function, but about all functions which are in the separable unit model domain.",
                    "label": 0
                },
                {
                    "sent": "And then you see that indeed some of the 1 + 1 is.",
                    "label": 0
                },
                {
                    "sent": "Algorithms are able to slightly outperform the CMA years just cause they are pretty efficient in terms of the number of functioning regulations.",
                    "label": 0
                },
                {
                    "sent": "But of course.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This picture might be changing when we're looking at the multi model functions, and indeed it does because in this case the active CMA is in the CMA?",
                    "label": 0
                },
                {
                    "sent": "S are the clear winners.",
                    "label": 1
                },
                {
                    "sent": "So again your problem is.",
                    "label": 0
                },
                {
                    "sent": "Which one do I pick?",
                    "label": 0
                },
                {
                    "sent": "Because I don't know beforehand what kind of function type I have in front of me.",
                    "label": 0
                },
                {
                    "sent": "Likely we would be saying it's a multimodal, objective function, because otherwise probably the problem would not be hard enough.",
                    "label": 0
                },
                {
                    "sent": "I will show you some opposite in a few seconds.",
                    "label": 1
                },
                {
                    "sent": "OK, this is 25 N this is 25 and 50 N function evaluations.",
                    "label": 0
                },
                {
                    "sent": "If N is 100.",
                    "label": 0
                },
                {
                    "sent": "50 is still pretty big compared to the numbers that I mentioned earlier, so we're still talking about too many function evaluations, so it makes sense.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To say.",
                    "label": 0
                },
                {
                    "sent": "What if it is just 100 or just 1000, independently of NI?",
                    "label": 1
                },
                {
                    "sent": "Don't care.",
                    "label": 0
                },
                {
                    "sent": "I don't scale by any, I just have this budget.",
                    "label": 0
                },
                {
                    "sent": "That's it.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we did run one to 10 in function evaluations, looked at FCE so.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just look at fixed cost error.",
                    "label": 0
                },
                {
                    "sent": "So in principle we are saying we cut it off and we are interested in the behavior of the algorithms at a certain number function evaluation.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then you get.",
                    "label": 0
                },
                {
                    "sent": "I just give you 2 functions for the sphere, for example the plot like this, where again the active 1 + 1 CMA is extremely fast, followed by the other 1 + 1 years variance, surprisingly.",
                    "label": 0
                },
                {
                    "sent": "The good old 1 + 1 ES is in this domain, so it can compete with these sadeski CMAS for example.",
                    "label": 0
                },
                {
                    "sent": "Interestingly, we also find one of the predecessors of the Cmas down here, the DDR2 strategy, which is also not too far away and performance of those other algorithms.",
                    "label": 0
                },
                {
                    "sent": "So that's an interesting insight.",
                    "label": 0
                },
                {
                    "sent": "If we look at 200 function evaluations, the picture is still about the same.",
                    "label": 0
                },
                {
                    "sent": "For.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or a arbitrarily picked the multimodal function?",
                    "label": 0
                },
                {
                    "sent": "Just picking one here.",
                    "label": 0
                },
                {
                    "sent": "It's again very similar 1 + 1 years is up here.",
                    "label": 0
                },
                {
                    "sent": "The best strategy, the active 1 + 1 Cmas then true desky and 1 + 1 and the Dr Tool strategy is also it's a bit behind, but it's still one of the better good old strategies in a way.",
                    "label": 0
                },
                {
                    "sent": "OK, what does it tell us?",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We compare all of this.",
                    "label": 0
                },
                {
                    "sent": "So for all functions, so this is not integrated across all functions, because we want to get your general picture, you see the clear winner down here, and this is then followed by depends on little bit the number of functional relations.",
                    "label": 0
                },
                {
                    "sent": "The 1 + 1 E S&P 1 + 1 Cholesky and the Dr Tool.",
                    "label": 0
                },
                {
                    "sent": "So there are a few strategies which are incomparable.",
                    "label": 0
                },
                {
                    "sent": "OK, what do we learn?",
                    "label": 0
                },
                {
                    "sent": "So many results.",
                    "label": 0
                },
                {
                    "sent": "We could think about employing a 1 + 1 strategy 1 + 1 active Cmas seems to be.",
                    "label": 0
                },
                {
                    "sent": "A pretty good choice.",
                    "label": 0
                },
                {
                    "sent": "But we could also say.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Life is not considered one aspect yet at all, which is.",
                    "label": 0
                },
                {
                    "sent": "These guys might be able to run their simulations in parallel, so now the picture is changing again because of 1 + 1.",
                    "label": 0
                },
                {
                    "sent": "Strategy is probably not what we want and guess what they are running it in parallel but not to an arbitrary level of parallelism.",
                    "label": 0
                },
                {
                    "sent": "So while they have compute clusters with hundreds and thousands of CPU's, the strange thing is that their bottleneck is the number of available simulator licenses.",
                    "label": 0
                },
                {
                    "sent": "And that is exactly exactly the kind of way that these people.",
                    "label": 0
                },
                {
                    "sent": "Calculate the available resources.",
                    "label": 0
                },
                {
                    "sent": "How much time do I have?",
                    "label": 0
                },
                {
                    "sent": "When do I want an answer in two weeks from now?",
                    "label": 0
                },
                {
                    "sent": "OK, how many licenses do I have?",
                    "label": 0
                },
                {
                    "sent": "10 OK, so I can afford two weeks.",
                    "label": 0
                },
                {
                    "sent": "That's 14, that's one.",
                    "label": 0
                },
                {
                    "sent": "That's 14 function evaluations.",
                    "label": 0
                },
                {
                    "sent": "I've 10 available licenses so I can do a level of parallelism of 10.",
                    "label": 0
                },
                {
                    "sent": "I can do 140 function evaluations, and that's the way they do backwards calculation.",
                    "label": 0
                },
                {
                    "sent": "And then they say, OK, this is what I can afford.",
                    "label": 0
                },
                {
                    "sent": "I can get those 10 licenses.",
                    "label": 0
                },
                {
                    "sent": "Might have to negotiate with my clan with my colleagues.",
                    "label": 0
                },
                {
                    "sent": "But I can get 10, so let's run it 440 function evaluations.",
                    "label": 0
                },
                {
                    "sent": "Which algorithm can I use?",
                    "label": 0
                },
                {
                    "sent": "Model 1 + 1 algorithm becausw.",
                    "label": 0
                },
                {
                    "sent": "I can't do these 140 after each other.",
                    "label": 0
                },
                {
                    "sent": "I need to parallelize and all algorithms like the DL2 for example come into the play again.",
                    "label": 0
                },
                {
                    "sent": "They are interesting 1, Lambda strategy.",
                    "label": 0
                },
                {
                    "sent": "DR2 like is very interesting now.",
                    "label": 0
                },
                {
                    "sent": "Becausw groups all of a sudden I'm not here anymore because this is function evaluations.",
                    "label": 0
                },
                {
                    "sent": "I can have a factor of 10.",
                    "label": 0
                },
                {
                    "sent": "Because I'm parallelizing, I have to look at generations, then the pictures changing.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So all these considerations need to be made.",
                    "label": 0
                },
                {
                    "sent": "There's a guy at GM and I asked him whether I could use some of these slides.",
                    "label": 0
                },
                {
                    "sent": "So I made my life easy.",
                    "label": 0
                },
                {
                    "sent": "I'm using somebody elses slides.",
                    "label": 0
                },
                {
                    "sent": "Danejones we were in contact already in 2005, 2006 and so on and he actually came up with a problem in large scale multi disciplinary mass optimization in the auto industry.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I just explain a little bit what this is about becausw those who have listened carefully might say.",
                    "label": 0
                },
                {
                    "sent": "Why are using evolutionary computation at all?",
                    "label": 0
                },
                {
                    "sent": "It's a linear problem.",
                    "label": 0
                },
                {
                    "sent": "Yep, right, the mass of the car is a linear function of the metal thicknesses of the various different steel components.",
                    "label": 0
                },
                {
                    "sent": "That's what you see here in a very simplified example.",
                    "label": 0
                },
                {
                    "sent": "We've got this Mount here, and of course it's bending, and there were two different bending modes.",
                    "label": 0
                },
                {
                    "sent": "As you can see.",
                    "label": 0
                },
                {
                    "sent": "It's bending when you have a crash and it's absorbing energy.",
                    "label": 0
                },
                {
                    "sent": "While the weight is a linear function of the metal, thickness is energy.",
                    "label": 0
                },
                {
                    "sent": "Absorption is not at all.",
                    "label": 0
                },
                {
                    "sent": "And that's the point here.",
                    "label": 0
                },
                {
                    "sent": "Energy absorption is not at all.",
                    "label": 0
                },
                {
                    "sent": "Therefore it's a highly nonlinear problem in terms of the amount of energy that's absorbed, which means in terms of the constraints.",
                    "label": 0
                },
                {
                    "sent": "That's where the problem is not in the objective function.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So he defined a test problem and the test problem is really a benchmark problem which you can download which you can execute 'cause he took crash.",
                    "label": 1
                },
                {
                    "sent": "And he moved it into a substitute function and said this is a reflective substitute function which really reflects what's going on at crash.",
                    "label": 0
                },
                {
                    "sent": "It has got 124 variables, 68 inequality constraints.",
                    "label": 0
                },
                {
                    "sent": "The constraints are normalized.",
                    "label": 0
                },
                {
                    "sent": "It's based on clicking response surfaces and in the real problem you can optimistically compute about 60 points a day, so it's really of that order of magnitude that I've been talking about.",
                    "label": 0
                },
                {
                    "sent": "So he says I want after 1800 function evaluations.",
                    "label": 0
                },
                {
                    "sent": "I want good solutions and good solutions are at about that.",
                    "label": 0
                },
                {
                    "sent": "That would be really good, but good solutions are at about 200.",
                    "label": 0
                },
                {
                    "sent": "28230 in quality.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of course the presentation will be available so you have access to a benchmark problem now, which is a real world benchmark problem.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what is good performance objective smaller than two 28 and truly impressive would be something twice as fast or same speed, but more accurate.",
                    "label": 0
                },
                {
                    "sent": "OK, so here's somebody from industry saying this is what I need.",
                    "label": 0
                },
                {
                    "sent": "That was by the way six years ago.",
                    "label": 0
                },
                {
                    "sent": "So it's really not relevant to him anymore.",
                    "label": 0
                },
                {
                    "sent": "I asked him, but he's still interested in whether evolutionary computation can beat the best available optimizers.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What are the best available optimizers?",
                    "label": 0
                },
                {
                    "sent": "Good old power.",
                    "label": 0
                },
                {
                    "sent": "Strategy in this case meaning is simplex strategy with linear approximation of the constraints.",
                    "label": 0
                },
                {
                    "sent": "So somebody is using linear meta models here.",
                    "label": 0
                },
                {
                    "sent": "Ordinea response surface models to model the constraints.",
                    "label": 0
                },
                {
                    "sent": "And a simplex like strategy to optimize.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And there's a paper about this.",
                    "label": 0
                },
                {
                    "sent": "Direct search optimization method that models the objective and constraint functions by linear interpolation and again advances in optimization and numerical analysis may be another interesting.",
                    "label": 1
                },
                {
                    "sent": "Book to take a look.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So used in evolutionary strategy which happened to be good.",
                    "label": 0
                },
                {
                    "sent": "I mentioned it in evolutionary strategy provided by new tech.",
                    "label": 0
                },
                {
                    "sent": "The company I worked for for awhile and it looked pretty promising in terms of the number of evaluations.",
                    "label": 0
                },
                {
                    "sent": "But it was stopped at that point 'cause he didn't have the software.",
                    "label": 0
                },
                {
                    "sent": "We did it remotely and some other things happen, so we couldn't really continue.",
                    "label": 0
                },
                {
                    "sent": "But he says the longer run made for my May find a better solution.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "About Kobyla powerds algorithm.",
                    "label": 0
                },
                {
                    "sent": "Wow, that looks really impressive, and indeed.",
                    "label": 0
                },
                {
                    "sent": "It generates lots of infeasible solutions.",
                    "label": 0
                },
                {
                    "sent": "Yellow means about five constraint violations Max and then in the end tunes in on a feasible solution of quality 228.",
                    "label": 0
                },
                {
                    "sent": "That's good.",
                    "label": 0
                },
                {
                    "sent": "That's the standard in this application.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so we said, OK, let's repeat this run because we have the test function and also we repeated the run and it looks promising.",
                    "label": 0
                },
                {
                    "sent": "That's roughly what you see here in the beginning after about 40 generations.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Wow, so we thought OK could be going on like that but it doesn't.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Whoops, too bad.",
                    "label": 0
                },
                {
                    "sent": "So this is your initial disappointment that you get when you deal with this problem and really try to.",
                    "label": 0
                },
                {
                    "sent": "Try to circle.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then we invested lots of work and got down at some point to 2:45 and then later on to 231.",
                    "label": 1
                },
                {
                    "sent": "Now you could say this is really tuning your algorithm to a particular problem.",
                    "label": 0
                },
                {
                    "sent": "Yes it is, but it's a problem class.",
                    "label": 0
                },
                {
                    "sent": "Everybody in that industry has got this kind of problem.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then finally we are now in a research project with colleagues here from.",
                    "label": 1
                },
                {
                    "sent": "Cologne actually Gomez bar, I should say, and it's really a pleasure to have these kind of opportunities in Germany because the there's a program that supports collaborations between SMB, small companies and universities.",
                    "label": 0
                },
                {
                    "sent": "And in this situation I'm in the modern the company perspective, so it's very easy to get grants for this kind of work.",
                    "label": 0
                },
                {
                    "sent": "I guess nobody really understood the grant proposal that we submitted there.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much, again, both coming for writing this with me, but the bottom line is we wanted to do model assistant optimization for nonlinear constraint production.",
                    "label": 1
                },
                {
                    "sent": "Process, which is exactly the problem I'm talking about here, but in a country kind of different language and got the grant and will not work.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On it and we actually came across the corpora algorithm, which is another interesting.",
                    "label": 0
                },
                {
                    "sent": "Concept which I want to explain very briefly.",
                    "label": 0
                },
                {
                    "sent": "We all know that we are interested in replacing.",
                    "label": 0
                },
                {
                    "sent": "Expensive objective functions by so-called surrogate or response surface or approximation models.",
                    "label": 0
                },
                {
                    "sent": "So we would like to learn as much as possible from function evaluations to predict.",
                    "label": 0
                },
                {
                    "sent": "Future function evaluations.",
                    "label": 0
                },
                {
                    "sent": "Even if we are not precise.",
                    "label": 0
                },
                {
                    "sent": "Is having a good guess is a good strategy and Koba is actually looking at this and says.",
                    "label": 0
                },
                {
                    "sent": "We generate an initial population, evaluate these points on the real function because we need initial information obviously about the objective function.",
                    "label": 0
                },
                {
                    "sent": "And then we train radial basis functions, surrogate models for objective function and constraints functions.",
                    "label": 1
                },
                {
                    "sent": "So we're trying to learn a meta model or response surface model for both the objective function and or constraints.",
                    "label": 0
                },
                {
                    "sent": "And then we optimize on this surrogate function so we do not use the real function, but we run our optimization on the response surface.",
                    "label": 0
                },
                {
                    "sent": "And get a new point which is the result of the optimization run.",
                    "label": 0
                },
                {
                    "sent": "That can be done quickly because we have fast function evaluations.",
                    "label": 0
                },
                {
                    "sent": "Now we add this to the population.",
                    "label": 0
                },
                {
                    "sent": "We repeat building the response surface.",
                    "label": 0
                },
                {
                    "sent": "This for objective and for the constraints.",
                    "label": 0
                },
                {
                    "sent": "And we continue the process.",
                    "label": 0
                },
                {
                    "sent": "Now optimize.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Patient is here and this could be any optimize, of course, including evolutionary strategies or anything else.",
                    "label": 0
                },
                {
                    "sent": "So now we are replacing the real problem by surrogate model.",
                    "label": 0
                },
                {
                    "sent": "Again, engineering optimization, a Journal that we would not regularly read, but which is certainly interesting to take a look at.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we worked on this.",
                    "label": 0
                },
                {
                    "sent": "We introduced for example, an improved initialization scheme.",
                    "label": 1
                },
                {
                    "sent": "Actually, you see here different function.",
                    "label": 0
                },
                {
                    "sent": "You see how improved initialization can help to in general improve the quality of the results.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then vote count came up with a really great idea on repairing infeasible solutions.",
                    "label": 0
                },
                {
                    "sent": "By saying, OK, I can probably derive a direction towards feasibility and using this direction towards feasibility actually helps to repair cause you have many constraint violations and all of a sudden you get into the interesting domain of really below 230, not quite reaching the APTA.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On and with some additional effort.",
                    "label": 1
                },
                {
                    "sent": "We are at 228.5 infeasible.",
                    "label": 0
                },
                {
                    "sent": "This is an arms race.",
                    "label": 0
                },
                {
                    "sent": "Yes, yeah, 'cause there's a difficult problem.",
                    "label": 0
                },
                {
                    "sent": "We're trying to optimize the optimizers we optimize them for this problem.",
                    "label": 0
                },
                {
                    "sent": "We believe we have something really efficient now when it comes to nonlinear constraints and few very few function evaluations.",
                    "label": 0
                },
                {
                    "sent": "And that's the kind of stuff which is really interesting for industry from our perspective so.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That's what we do.",
                    "label": 0
                },
                {
                    "sent": "We do other things as well, and actually Bachman asked me to make clear why my presentation doesn't seem to have to do anything with my paper, simply 'cause we wanted to write a paper that talks about a real world problem specifically, and my presentation is a bit more generic.",
                    "label": 0
                },
                {
                    "sent": "As you can see.",
                    "label": 0
                },
                {
                    "sent": "So I will talk about my paper now.",
                    "label": 0
                },
                {
                    "sent": "I still have time right, which is about Power Distribution network configuration.",
                    "label": 1
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That's a completely different problem, but it's also interesting because again, evolutionary strategies as I will point out very quickly, are a powerful solver for this kind of problem.",
                    "label": 0
                },
                {
                    "sent": "We have components of an electrical grid generation, transmission, and then finally the distribution part.",
                    "label": 1
                },
                {
                    "sent": "We are looking at the Power Distribution network reconfiguration problem, so you have switches.",
                    "label": 0
                },
                {
                    "sent": "And switches, transistors, Transformers and stuff like that.",
                    "label": 0
                },
                {
                    "sent": "And this has to be switched the right way to do the power supply.",
                    "label": 0
                }
            ]
        },
        "clip_72": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And here you see typical problem.",
                    "label": 0
                },
                {
                    "sent": "Where the black solid lines are normally closed switches and the red dashed lines are normally open switches which you could close.",
                    "label": 1
                },
                {
                    "sent": "But of course there are certain constraints for your network.",
                    "label": 0
                },
                {
                    "sent": "One of them is that you shouldn't generate cycles in the network, 'cause then get short circuits shortcuts.",
                    "label": 0
                },
                {
                    "sent": "And you should not have isolated nodes, obviously because you want to supply everybody with power.",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There are again benchmark problems like everywhere, and these are the IEEE benchmark problems.",
                    "label": 0
                },
                {
                    "sent": "You can pick a binary encoding.",
                    "label": 1
                },
                {
                    "sent": "Actually look at every connection as a connection that you can break or have, but then you get pretty big encodings, and it's not a very smart way of encoding your network.",
                    "label": 0
                },
                {
                    "sent": "Because you easily get for the reference system 2 to the power of 118 possibilities.",
                    "label": 0
                },
                {
                    "sent": "But obviously UGA is a straightforward approach to this problem because we get the binary encoding actually.",
                    "label": 0
                },
                {
                    "sent": "You can also do integer encoding by simply saying.",
                    "label": 0
                },
                {
                    "sent": "I have four possibilities here, 5 possibilities there, sorry five.",
                    "label": 0
                },
                {
                    "sent": "Therefore there in three there, which gives me 4 * 5 * 3 possibility to break circuits because I need to break them.",
                    "label": 1
                },
                {
                    "sent": "Otherwise I have.",
                    "label": 1
                },
                {
                    "sent": "Shortcuts.",
                    "label": 0
                },
                {
                    "sent": "And for the big system now my search space is only one.",
                    "label": 0
                },
                {
                    "sent": ".44 * 10 to the power of 18 so has reduced in size that gives me maybe a better representation using this approach.",
                    "label": 0
                },
                {
                    "sent": "Now Aga is not straightforwardly applicable anymore.",
                    "label": 0
                },
                {
                    "sent": "An evolutionary strategy doesn't seem to be applicable either, but those who remember back the early days or also what we are doing nowadays.",
                    "label": 0
                },
                {
                    "sent": "Know that at some point there was an attempt to apply evolutionary strategies to integer representations and also adapt the idea of self adaptation to integer representations.",
                    "label": 0
                },
                {
                    "sent": "And this was actually when, if I may say, this Gunther who did the.",
                    "label": 0
                },
                {
                    "sent": "Groundbreaking work in this area by showing how this can be done.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we did this.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_75": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No.",
                    "label": 0
                }
            ]
        },
        "clip_76": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Came up with an application of the integer evolution strategy which actually save adept step sizes of the corresponding geometric distribution.",
                    "label": 0
                },
                {
                    "sent": "Rather than normal distribution and applied this to the integer representation for this problem.",
                    "label": 0
                }
            ]
        },
        "clip_77": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I should say a few words about the objective function.",
                    "label": 1
                },
                {
                    "sent": "Normally people look at this problem as just optimizing power loss.",
                    "label": 1
                },
                {
                    "sent": "So minimizing the total power loss of the network, which would be sufficient subject to of course minimum and maximum bounds on the voltages and on the currents which are flowing.",
                    "label": 1
                },
                {
                    "sent": "But you could also say it's actually a multicriteria optimization problem, because you would also like to minimize the voltage deviation, and this is actually a completely new perspective.",
                    "label": 0
                },
                {
                    "sent": "On this problem, because it hasn't really been handled as a multi objective optimization problem yet, so we did both at the same time.",
                    "label": 0
                }
            ]
        },
        "clip_78": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We used a self adaptive integer evolution strategy to solve the problem.",
                    "label": 0
                },
                {
                    "sent": "We looked at the recombination strategy because this was an unanswered question as well.",
                    "label": 0
                }
            ]
        },
        "clip_79": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we looked at results as a function of the recombination operator for the object variables and the step sizes and you see a combination here, which is the optimal solution which is known for this problem of 869 in terms of power loss.",
                    "label": 0
                }
            ]
        },
        "clip_80": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "You see it between the initial topology.",
                    "label": 0
                },
                {
                    "sent": "And the best apology quite some differences in terms of switches which are open and closed in the meantime.",
                    "label": 0
                },
                {
                    "sent": "So see for example that now this switch is closed.",
                    "label": 0
                },
                {
                    "sent": "In the best apology, so this set of solutions for this set of nodes now is connected to this set of nodes.",
                    "label": 0
                },
                {
                    "sent": "And then there's another connection over here and over here, and so on South there are drastic changes now in these solutions.",
                    "label": 0
                }
            ]
        },
        "clip_81": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then of course, in the Multiobjective case.",
                    "label": 0
                },
                {
                    "sent": "It was straightforward for us to compare.",
                    "label": 0
                },
                {
                    "sent": "In this case the SMS IBO algorithm which is looking at these metrics based selection to the classical nsda 2 algorithm for both using a single.",
                    "label": 0
                },
                {
                    "sent": "Multiple step sizes in the integer evolution strategy, and you see that and ispirato front has been found in both cases, and there's not such a big difference to be in SGA 2, but the key point is that there is also a need point.",
                    "label": 0
                },
                {
                    "sent": "Roughly, if you look at it from a distance, so at some point really.",
                    "label": 0
                },
                {
                    "sent": "When?",
                    "label": 0
                },
                {
                    "sent": "Power loss it goes down.",
                    "label": 0
                },
                {
                    "sent": "You get all of a sudden voltage deviation which goes up.",
                    "label": 0
                },
                {
                    "sent": "This is a very small range though only so voltage deviation is really restricted to a very very narrow range.",
                    "label": 0
                },
                {
                    "sent": "Whether it really matters for the practical application still needs to be decided, but at least the second objective has been incorporated, and that's the first time that this has been done.",
                    "label": 0
                },
                {
                    "sent": "But for US, it's pretty natural to look at those problems as.",
                    "label": 0
                },
                {
                    "sent": "More likely multi objective optimization problems.",
                    "label": 0
                },
                {
                    "sent": "Then single objective problems.",
                    "label": 0
                }
            ]
        },
        "clip_82": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I might be a bit too early, but I would like to thank quite a number of people, especially those working in the natural computing group at lyrics Michael Emmerich Undredal it's Walter provide check and one my PhD students who are actually working hard on all of this.",
                    "label": 0
                },
                {
                    "sent": "I have one slide which I only show if there are PhD students in the room.",
                    "label": 0
                },
                {
                    "sent": "So raise your hand OK, more than one more than zero, that's good.",
                    "label": 0
                },
                {
                    "sent": "Becaused I was a PhD student in 1990 and I had been given this opportunity because I was asking the then hopefully to be my PhD supervisor, whether he would have a position for me and he said not really.",
                    "label": 0
                },
                {
                    "sent": "But you always can apply at the doctor for some skin Minecraft if you want to, and if you are successful then I wouldn't care.",
                    "label": 0
                },
                {
                    "sent": "Having you as my PhD student.",
                    "label": 0
                },
                {
                    "sent": "So I tried.",
                    "label": 0
                },
                {
                    "sent": "I was successful, which is unbelievable if I think about that back then and.",
                    "label": 0
                },
                {
                    "sent": "Became a PhD student of Hunter paper and.",
                    "label": 0
                },
                {
                    "sent": "It was actually a wonderful time that I had there.",
                    "label": 0
                },
                {
                    "sent": "But I want to tell you a very short anecdote about that time, which is really important to me.",
                    "label": 0
                },
                {
                    "sent": "The first thing I was supposed to do when I became a PhD student was to do my research of course, but also to organize a conference or help organizing a conference because I didn't know how to do that.",
                    "label": 0
                },
                {
                    "sent": "But I trusted of course that my PhD supervisor would know how to do it and his wife.",
                    "label": 0
                },
                {
                    "sent": "They did.",
                    "label": 0
                },
                {
                    "sent": "It was really interesting.",
                    "label": 0
                },
                {
                    "sent": "Guess what we organized PPS in 1990s or the first of these conferences in Dortmund?",
                    "label": 0
                },
                {
                    "sent": "And one of the things I really.",
                    "label": 0
                },
                {
                    "sent": "Integrated, and that's my advice to PhD students is that the 1/5 successful also holds for science.",
                    "label": 0
                },
                {
                    "sent": "So if 80% of what you are doing seems to be a dead end or not successful or whatever, don't give up.",
                    "label": 0
                },
                {
                    "sent": "You're probably working at the right speed of evolution or optimization and therefore and just don't never lose faith and get to the point where you finish your work.",
                    "label": 0
                },
                {
                    "sent": "You will.",
                    "label": 0
                },
                {
                    "sent": "I also met then at a conference at that P is in conference, another guy who was going to give the keynote presentation tomorrow.",
                    "label": 0
                },
                {
                    "sent": "And I also made mistakes as a PhD student, and I remember that I went to ICJ in 91 and probably gave a presentation and horrible English.",
                    "label": 0
                },
                {
                    "sent": "And I talked to God's item about rotation Angels.",
                    "label": 0
                },
                {
                    "sent": "But that's not really what I meant ghosty.",
                    "label": 0
                },
                {
                    "sent": "I meant rotation angles.",
                    "label": 0
                },
                {
                    "sent": "So even if your English is horrible sometimes, don't worry about it.",
                    "label": 0
                },
                {
                    "sent": "You always have a chance to improve it, and that's the other message.",
                    "label": 0
                },
                {
                    "sent": "I wanted to give you.",
                    "label": 0
                },
                {
                    "sent": "So it was a lot of fun without this opportunity that I was giving back then I would not be standing here today as a professor at Leiden University and would not be able to give this keynote, so I'm terribly grateful for that opportunity.",
                    "label": 0
                },
                {
                    "sent": "Questions, thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}