{
    "id": "xsc52hksc3hznvbeeelb6ehrmfp63eo7",
    "title": "An Energy-Efficient Mobile Recommender System",
    "info": {
        "author": [
            "Yong Ge, Rutgers, The State University of New Jersey"
        ],
        "published": "Oct. 1, 2010",
        "recorded": "July 2010",
        "category": [
            "Top->Computer Science->Data Mining"
        ]
    },
    "url": "http://videolectures.net/kdd2010_ge_aee/",
    "segmentation": [
        [
            "I'm in a PhD student from Rutgers University.",
            "My topic is our energy efficient mobile recommend system.",
            "This is a joint work with Professor Shin and professor Totally who is sitting there."
        ],
        [
            "This is outline for my talk.",
            "First, let's take a look."
        ],
        [
            "Introduction Nowadays we already collect a large amount of location trace from the mobile devices such as GPS and Wi-Fi.",
            "Armed with this, such large scale location trends, we try, people try to discover useful knowledge from the location, tries to provide guidance for the for the real time decision making.",
            "In this study, we study the location trace collect from the GPS from the taxi driver.",
            "Our goal is try to discover some energy efficient transportation patterns which can be used as a guidance in for the taxi driver.",
            "To reduce their energy, that efficiency of the energy consumption.",
            "So specifically in this paper we provide mobile recommend energy, energy efficient mobile recommend system which has ability to recommend the sequence or pick up points for the taxi driver or a sequence of parking position."
        ],
        [
            "So our goal is trying to develop a mobile recommend system.",
            "What's the difference between the mobile recommend system and the traditional recommend system?",
            "As we know the tradition recommend system such as a movie recommendation.",
            "The system usually is evaluated based on the prediction performance such as mean squared error or mean squared error.",
            "Under the essential goal for this traditional recommend system is trying to predict the unknown renting with the knowing explicit on implicit rankings.",
            "But for our mobile recommend system, we try to develop the system based on the business success metrics.",
            "This business success metrics contains the.",
            "The travel distance.",
            "Four before next text before next class.",
            "More for the taxi driver or the possibility for the taxi driver to pick up a customer.",
            "Also, the mobile recommend system is naturally location based recommendation becausw we are dealing with a large scale location trends."
        ],
        [
            "Next time I will going to introduce the mobile sequence recommendation."
        ],
        [
            "Here is the problem formulation.",
            "So we are giving a set of a potential pickup point which is denoted.",
            "See also we can find the probability set which is associated with which is associated with the pick up Point C and probability said is known as P also from the pickup points that we can generate.",
            "Director Sequence said, which is dinozaurs error.",
            "Also we know the current position for the taxi driver.",
            "Our goal is try to recommend.",
            "Optimal German Rd for the taxi driver.",
            "So in this study we try to minimize the potential as a potential travel distance which is denoted as PD.",
            "And we will discuss this function in the following for the details."
        ],
        [
            "So here is how you example for the to illustrate the MSR problem.",
            "Here we have 4 pickup points which did not see one C2 and C3C four.",
            "Also we know the current position for the taxi driver, which is Dino's appeal cab.",
            "So we try to recommend the Journey Rd for this text driver.",
            "The first choice we can, we can try to recommend the taxi driver.",
            "Go to see one because it's a closed one.",
            "From the pill cab.",
            "However, if we suggest the taxi driver go to see one, he still have a probability he cannot pick a customer to see one becausw.",
            "Then in that case he have to try to the.",
            "Travel to the safe.",
            "All is much.",
            "It cost much more.",
            "On the other hand, if we.",
            "Suggest the taxi driver go to C4C3 and C2.",
            "He may have a good opportunity to exploit to exploit a sequence of pick up you want.",
            "So the the so we need to develop some evaluate function to evaluate each possible drama route or each possible directed sequence which is which is contained the pick up point.",
            "So in this paper we provide a PD function to evaluate each candidate Rd."
        ],
        [
            "So from the problem formulation and the illustration example, we can find to make challenges.",
            "The first one is how to mine the reliable pickup point from the large scale location trace.",
            "The second challenge, and is a key challenge for this study, is how to search the optimal Johnny Rd efficiently.",
            "Actually, with the carefully study, we can find the computation complexity for the original MSR problem is on factory.",
            "Here.",
            "The is the number of pick up point.",
            "So.",
            "We can see.",
            "From the practical, from the practical perspective, the the original MSR problem is computationally prohibitive.",
            "Because the computation complexity will increase tremendously tremendously as the earnings increase."
        ],
        [
            "So from the practical perspective, we.",
            "Provide eyemask problem with the constraint.",
            "Specially when you try to put a constraint on the length of the German Rd.",
            "Which is denoted as error.",
            "I means we only try to suggest the German Rd with the length of L. For this problem with constraint we can find the computation complexity is until the power L."
        ],
        [
            "Next we will introduce how to generate the recommended point as a."
        ],
        [
            "As I just mentioned, this is the first challenge for this problem.",
            "In this study, we.",
            "1st, to find the high performance drivers these drivers should include sufficient driving hours.",
            "Also should have high occupancy rate.",
            "The occupancy rate is the percentage of driving time with customers for each taxi driver.",
            "Then we try to cluster a nearest pickup point into one, pick up clusters becausw, sometimes 2 pickup point, maybe cause corresponding to one location, such as one restaurant.",
            "So we need to cluster the nearest pickup point into one clusters such one, this one clusters corresponding to the.",
            "Location with the semantic information such as restaurant or airport.",
            "Also we need to calculate the probability.",
            "Our pick up you ain't happening at each pick up clusters.",
            "In this matter we in this paper we use the ratio of the pick up event.",
            "To estimate the probability."
        ],
        [
            "Next up Irish introduced the LCP algorithm and Schiro algorithm, which is developed in this paper."
        ],
        [
            "1st that are.",
            "We introduce the potential travel distance.",
            "Here is an example.",
            "Suppose we suggest a taxi driver.",
            "Following this driving route.",
            "This text driver may pick up.",
            "Customer at C1.",
            "With the travel distance D1, also the taxi driver may pick up a text, pick up a customer at C2 with the travel distance D1 plus D2 and so on so forth.",
            "Here PC one is the probability of pickup event happening on at this pick up clusters.",
            "So we can see.",
            "The travel distance for the taxi driver follow a discrete distribution.",
            "This distribution can be represented by these two vector.",
            "The first vector is a distance vector and the second one is a probability vector.",
            "Represent the probability of pick up event.",
            "Then we define our PD function as a dot product of these two vectors.",
            "As we can see with this PD function, we can evaluate each possible pick up each possible German route.",
            "So if we use the brute force method, we can just evaluate each.",
            "We just calculate PD function for each possible candidate.",
            "Then we can just search the optimal one with the with the minimum value of the PD function.",
            "However, the computation caused is very is huge."
        ],
        [
            "So.",
            "As we can see, the two vectors are distance vector and the probability vector actually can be totally represented by this one vector with Dino's DP.",
            "In this one vector we represent the distance information and the probability information.",
            "Then we transfer the PD function into this formula."
        ],
        [
            "So.",
            "We find an important property for this PD function.",
            "Support for this, for example, for this German Rd.",
            "We can find the one the deep as a deep vector which is denoted.",
            "Here.",
            "The.",
            "As that each attribute of this vector increase the value of the PD function will increase.",
            "Therefore, we call this property as monotone property for this ability function.",
            "In the following, actually we will develop our algorithm based on these properties."
        ],
        [
            "Solo domination.",
            "If if if we have two driving roads, which is denoted as RL and I'll ti doe.",
            "If the associate vector DP&DP ti doe if the vector DP dominate the vector depicted, oh, we will share the driving Rd.",
            "I'll dominate the German roteiro title.",
            "So by this definition we can know if candidate A is dominated by a candidate road B, so it cannot be optimal optimal roads."
        ],
        [
            "Also, we further propose our constraint subdominant C. Here is the example.",
            "We have two sub Rd which is C1 to C3 and C4.",
            "Another one is C2 to C3 and C4.",
            "So if the associate vector.",
            "DP sub dominate the associated vector deep sub title.",
            "We will say the sub Rd are subdominant.",
            "The Subs are subtitle."
        ],
        [
            "So.",
            "Here is the OCP algorithm.",
            "It's very simple because we have the road dominance and the subdominant see, so we can know if we specify the length of general at three if the sub Rd are sub.",
            "Dominate the sub sub rodear subtitle.",
            "We can.",
            "Definitely knows a candidate.",
            "Pure capital C2C3 and C4 will dominate the candidate pool capital C2C3 and C4 so.",
            "So basically we will enumerate all subgroup with length of error and pruning dominant some constraints.",
            "A brood with less L. Before we knowing the position of cab driver so this pruning can be done offline before we know.",
            "Before we do the online recommendation, so this is a ones effort to pruning the search space."
        ],
        [
            "Also we developer another algorithm is Cairo algorithm.",
            "First, we defined our schiro if a if us a recommended rose is the Sky cannot be dominant by any candidate that we will say this.",
            "Johnny Rd is Skyline Rose.",
            "With this definition, we can find a joint principle of the Sky roll and the PD function that is optimal driving rule must be a Sky rose.",
            "Becausw the.",
            "The.",
            "Because the function is monotone and the Sky roll must, the optimal by must be a schedule.",
            "So with this principle we can find the optimal driving rules in two steps.",
            "The first steps we will.",
            "Search we will find the Sky rose.",
            "Then we just we will just search the optimal rules from the set of the schedules."
        ],
        [
            "So.",
            "With this understanding, we can just use the traditional Sky skyline computing algorithm to search to find the Sky roads.",
            "However, the traditional skyline computed computer algorithm is very.",
            "Time consuming and it only cost a large memory because we need to enumerate all possible candidate and we need to find associate vector for each candidate.",
            "Then we can compute the Sky rules with the traditional scanner algorithm.",
            "So.",
            "In this paper we trying to because the traditional algorithm is first actually also the two steps first enumerate all possible candidates, then compute the Sky rules for our schedule algorithm.",
            "We try when we enumerate the possible candidate root and and get the social vector.",
            "We will simultaneously do some pruning to pruning some candidates at the early stage.",
            "Base our.",
            "Property.",
            "So so basically we are pruning some candidate, including the dominant sample Rd at an early stage.",
            "So the social space will be significantly reduced since a lot of candidates contend dominant subroute are discussed at an early stage.",
            "Also, for this algorithm, we actually.",
            "It's a gradual effort to continue pruning such space."
        ],
        [
            "Here is an example.",
            "So when we enumerate all possible candidate roots.",
            "Suppose that we find these two sub rolls R1R2.",
            "Also, we find our one dominant are true, then we can't.",
            "No, all candidates like the this one will dominate the candidate.",
            "Hidden at all.",
            "All candidate like this will dominate all candidate it like this so we can do.",
            "We can pruning this candidate at an early stage.",
            "So this is a basic idea for this Cairo algorithm."
        ],
        [
            "Next I will show some experimental result."
        ],
        [
            "Here is the experimental setting up.",
            "First, we.",
            "Evaluate our algorithm with the real world data.",
            "This data is collected from the over 500 taxi driver in 30 days.",
            "Uh, this location traces in the San Francisco.",
            "Also we exams are scalability of algorithms with the synthetic data."
        ],
        [
            "This is our first, this is our.",
            "Optimal Rd we find with the real data.",
            "With the different lengths of Johnny Rhodes.",
            "Actually, we find some optimal roads with our two algorithm for different lengths of German roads."
        ],
        [
            "Here is our.",
            "Searching time we try to compare, compare the our algorithm with the traditional or brute force method.",
            "As we can see, our CP leads to the best result.",
            "Other on both real data set and synthetic debt.",
            "A synthetic data set."
        ],
        [
            "As we can see the actually the LCP, the."
        ],
        [
            "The reduce our searching time for RCP algorithm is just just caused by the pruning effect.",
            "As we can see the LCP algorithm."
        ],
        [
            "Pruning the search space.",
            "Significantly also, the Sky roll algorithm.",
            "Can the pruning the search space more significantly.",
            "This is all we also."
        ],
        [
            "Locali compared the Skyline computing computing algorithm.",
            "As we can see our algorithm Sky roll can outperform the traditional skyline computing algorithms such as D&C and be in error.",
            "This test, this is test on the boat synthetic data.",
            "Real data with different lengths of John Rd and different number of pickup points."
        ],
        [
            "Also, this is a special case.",
            "Here we try to search multiple optimal John Rd with notable evaluate function.",
            "Actually we use totally filed different evaluate evaluate function including the PD function.",
            "All these functions are monitored.",
            "So we can, as we can see in this case the Sky Rule algorithm leads to leads to the best result, much better than the LCP algorithm and brute force algorithm."
        ],
        [
            "OK."
        ],
        [
            "Finally, we conclude our talk.",
            "So in this study we we develop our energy efficient mobile recommend system.",
            "For which has the ability to recommend a sequence or pick up point for the taxi driver.",
            "In this paper, we respectfully define the PD function to evaluate each possible candidate Rd.",
            "Best under the property of this function we developed to algorithm, LCP and Sky rose.",
            "That's all, thank you for that."
        ],
        [
            "My contention."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm in a PhD student from Rutgers University.",
                    "label": 0
                },
                {
                    "sent": "My topic is our energy efficient mobile recommend system.",
                    "label": 0
                },
                {
                    "sent": "This is a joint work with Professor Shin and professor Totally who is sitting there.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is outline for my talk.",
                    "label": 0
                },
                {
                    "sent": "First, let's take a look.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Introduction Nowadays we already collect a large amount of location trace from the mobile devices such as GPS and Wi-Fi.",
                    "label": 0
                },
                {
                    "sent": "Armed with this, such large scale location trends, we try, people try to discover useful knowledge from the location, tries to provide guidance for the for the real time decision making.",
                    "label": 0
                },
                {
                    "sent": "In this study, we study the location trace collect from the GPS from the taxi driver.",
                    "label": 0
                },
                {
                    "sent": "Our goal is try to discover some energy efficient transportation patterns which can be used as a guidance in for the taxi driver.",
                    "label": 0
                },
                {
                    "sent": "To reduce their energy, that efficiency of the energy consumption.",
                    "label": 0
                },
                {
                    "sent": "So specifically in this paper we provide mobile recommend energy, energy efficient mobile recommend system which has ability to recommend the sequence or pick up points for the taxi driver or a sequence of parking position.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So our goal is trying to develop a mobile recommend system.",
                    "label": 0
                },
                {
                    "sent": "What's the difference between the mobile recommend system and the traditional recommend system?",
                    "label": 0
                },
                {
                    "sent": "As we know the tradition recommend system such as a movie recommendation.",
                    "label": 0
                },
                {
                    "sent": "The system usually is evaluated based on the prediction performance such as mean squared error or mean squared error.",
                    "label": 0
                },
                {
                    "sent": "Under the essential goal for this traditional recommend system is trying to predict the unknown renting with the knowing explicit on implicit rankings.",
                    "label": 0
                },
                {
                    "sent": "But for our mobile recommend system, we try to develop the system based on the business success metrics.",
                    "label": 0
                },
                {
                    "sent": "This business success metrics contains the.",
                    "label": 1
                },
                {
                    "sent": "The travel distance.",
                    "label": 0
                },
                {
                    "sent": "Four before next text before next class.",
                    "label": 0
                },
                {
                    "sent": "More for the taxi driver or the possibility for the taxi driver to pick up a customer.",
                    "label": 0
                },
                {
                    "sent": "Also, the mobile recommend system is naturally location based recommendation becausw we are dealing with a large scale location trends.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Next time I will going to introduce the mobile sequence recommendation.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here is the problem formulation.",
                    "label": 0
                },
                {
                    "sent": "So we are giving a set of a potential pickup point which is denoted.",
                    "label": 0
                },
                {
                    "sent": "See also we can find the probability set which is associated with which is associated with the pick up Point C and probability said is known as P also from the pickup points that we can generate.",
                    "label": 0
                },
                {
                    "sent": "Director Sequence said, which is dinozaurs error.",
                    "label": 0
                },
                {
                    "sent": "Also we know the current position for the taxi driver.",
                    "label": 0
                },
                {
                    "sent": "Our goal is try to recommend.",
                    "label": 0
                },
                {
                    "sent": "Optimal German Rd for the taxi driver.",
                    "label": 0
                },
                {
                    "sent": "So in this study we try to minimize the potential as a potential travel distance which is denoted as PD.",
                    "label": 1
                },
                {
                    "sent": "And we will discuss this function in the following for the details.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here is how you example for the to illustrate the MSR problem.",
                    "label": 0
                },
                {
                    "sent": "Here we have 4 pickup points which did not see one C2 and C3C four.",
                    "label": 0
                },
                {
                    "sent": "Also we know the current position for the taxi driver, which is Dino's appeal cab.",
                    "label": 0
                },
                {
                    "sent": "So we try to recommend the Journey Rd for this text driver.",
                    "label": 0
                },
                {
                    "sent": "The first choice we can, we can try to recommend the taxi driver.",
                    "label": 0
                },
                {
                    "sent": "Go to see one because it's a closed one.",
                    "label": 0
                },
                {
                    "sent": "From the pill cab.",
                    "label": 0
                },
                {
                    "sent": "However, if we suggest the taxi driver go to see one, he still have a probability he cannot pick a customer to see one becausw.",
                    "label": 0
                },
                {
                    "sent": "Then in that case he have to try to the.",
                    "label": 0
                },
                {
                    "sent": "Travel to the safe.",
                    "label": 0
                },
                {
                    "sent": "All is much.",
                    "label": 0
                },
                {
                    "sent": "It cost much more.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, if we.",
                    "label": 0
                },
                {
                    "sent": "Suggest the taxi driver go to C4C3 and C2.",
                    "label": 0
                },
                {
                    "sent": "He may have a good opportunity to exploit to exploit a sequence of pick up you want.",
                    "label": 0
                },
                {
                    "sent": "So the the so we need to develop some evaluate function to evaluate each possible drama route or each possible directed sequence which is which is contained the pick up point.",
                    "label": 0
                },
                {
                    "sent": "So in this paper we provide a PD function to evaluate each candidate Rd.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So from the problem formulation and the illustration example, we can find to make challenges.",
                    "label": 0
                },
                {
                    "sent": "The first one is how to mine the reliable pickup point from the large scale location trace.",
                    "label": 1
                },
                {
                    "sent": "The second challenge, and is a key challenge for this study, is how to search the optimal Johnny Rd efficiently.",
                    "label": 1
                },
                {
                    "sent": "Actually, with the carefully study, we can find the computation complexity for the original MSR problem is on factory.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "The is the number of pick up point.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We can see.",
                    "label": 0
                },
                {
                    "sent": "From the practical, from the practical perspective, the the original MSR problem is computationally prohibitive.",
                    "label": 0
                },
                {
                    "sent": "Because the computation complexity will increase tremendously tremendously as the earnings increase.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So from the practical perspective, we.",
                    "label": 0
                },
                {
                    "sent": "Provide eyemask problem with the constraint.",
                    "label": 0
                },
                {
                    "sent": "Specially when you try to put a constraint on the length of the German Rd.",
                    "label": 0
                },
                {
                    "sent": "Which is denoted as error.",
                    "label": 0
                },
                {
                    "sent": "I means we only try to suggest the German Rd with the length of L. For this problem with constraint we can find the computation complexity is until the power L.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Next we will introduce how to generate the recommended point as a.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As I just mentioned, this is the first challenge for this problem.",
                    "label": 0
                },
                {
                    "sent": "In this study, we.",
                    "label": 0
                },
                {
                    "sent": "1st, to find the high performance drivers these drivers should include sufficient driving hours.",
                    "label": 1
                },
                {
                    "sent": "Also should have high occupancy rate.",
                    "label": 1
                },
                {
                    "sent": "The occupancy rate is the percentage of driving time with customers for each taxi driver.",
                    "label": 0
                },
                {
                    "sent": "Then we try to cluster a nearest pickup point into one, pick up clusters becausw, sometimes 2 pickup point, maybe cause corresponding to one location, such as one restaurant.",
                    "label": 0
                },
                {
                    "sent": "So we need to cluster the nearest pickup point into one clusters such one, this one clusters corresponding to the.",
                    "label": 0
                },
                {
                    "sent": "Location with the semantic information such as restaurant or airport.",
                    "label": 0
                },
                {
                    "sent": "Also we need to calculate the probability.",
                    "label": 1
                },
                {
                    "sent": "Our pick up you ain't happening at each pick up clusters.",
                    "label": 0
                },
                {
                    "sent": "In this matter we in this paper we use the ratio of the pick up event.",
                    "label": 0
                },
                {
                    "sent": "To estimate the probability.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Next up Irish introduced the LCP algorithm and Schiro algorithm, which is developed in this paper.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "1st that are.",
                    "label": 0
                },
                {
                    "sent": "We introduce the potential travel distance.",
                    "label": 0
                },
                {
                    "sent": "Here is an example.",
                    "label": 0
                },
                {
                    "sent": "Suppose we suggest a taxi driver.",
                    "label": 0
                },
                {
                    "sent": "Following this driving route.",
                    "label": 0
                },
                {
                    "sent": "This text driver may pick up.",
                    "label": 0
                },
                {
                    "sent": "Customer at C1.",
                    "label": 0
                },
                {
                    "sent": "With the travel distance D1, also the taxi driver may pick up a text, pick up a customer at C2 with the travel distance D1 plus D2 and so on so forth.",
                    "label": 0
                },
                {
                    "sent": "Here PC one is the probability of pickup event happening on at this pick up clusters.",
                    "label": 1
                },
                {
                    "sent": "So we can see.",
                    "label": 0
                },
                {
                    "sent": "The travel distance for the taxi driver follow a discrete distribution.",
                    "label": 0
                },
                {
                    "sent": "This distribution can be represented by these two vector.",
                    "label": 0
                },
                {
                    "sent": "The first vector is a distance vector and the second one is a probability vector.",
                    "label": 0
                },
                {
                    "sent": "Represent the probability of pick up event.",
                    "label": 0
                },
                {
                    "sent": "Then we define our PD function as a dot product of these two vectors.",
                    "label": 0
                },
                {
                    "sent": "As we can see with this PD function, we can evaluate each possible pick up each possible German route.",
                    "label": 0
                },
                {
                    "sent": "So if we use the brute force method, we can just evaluate each.",
                    "label": 0
                },
                {
                    "sent": "We just calculate PD function for each possible candidate.",
                    "label": 0
                },
                {
                    "sent": "Then we can just search the optimal one with the with the minimum value of the PD function.",
                    "label": 0
                },
                {
                    "sent": "However, the computation caused is very is huge.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "As we can see, the two vectors are distance vector and the probability vector actually can be totally represented by this one vector with Dino's DP.",
                    "label": 0
                },
                {
                    "sent": "In this one vector we represent the distance information and the probability information.",
                    "label": 0
                },
                {
                    "sent": "Then we transfer the PD function into this formula.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We find an important property for this PD function.",
                    "label": 0
                },
                {
                    "sent": "Support for this, for example, for this German Rd.",
                    "label": 0
                },
                {
                    "sent": "We can find the one the deep as a deep vector which is denoted.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "As that each attribute of this vector increase the value of the PD function will increase.",
                    "label": 0
                },
                {
                    "sent": "Therefore, we call this property as monotone property for this ability function.",
                    "label": 0
                },
                {
                    "sent": "In the following, actually we will develop our algorithm based on these properties.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Solo domination.",
                    "label": 0
                },
                {
                    "sent": "If if if we have two driving roads, which is denoted as RL and I'll ti doe.",
                    "label": 0
                },
                {
                    "sent": "If the associate vector DP&DP ti doe if the vector DP dominate the vector depicted, oh, we will share the driving Rd.",
                    "label": 0
                },
                {
                    "sent": "I'll dominate the German roteiro title.",
                    "label": 0
                },
                {
                    "sent": "So by this definition we can know if candidate A is dominated by a candidate road B, so it cannot be optimal optimal roads.",
                    "label": 1
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also, we further propose our constraint subdominant C. Here is the example.",
                    "label": 0
                },
                {
                    "sent": "We have two sub Rd which is C1 to C3 and C4.",
                    "label": 0
                },
                {
                    "sent": "Another one is C2 to C3 and C4.",
                    "label": 0
                },
                {
                    "sent": "So if the associate vector.",
                    "label": 0
                },
                {
                    "sent": "DP sub dominate the associated vector deep sub title.",
                    "label": 0
                },
                {
                    "sent": "We will say the sub Rd are subdominant.",
                    "label": 0
                },
                {
                    "sent": "The Subs are subtitle.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Here is the OCP algorithm.",
                    "label": 0
                },
                {
                    "sent": "It's very simple because we have the road dominance and the subdominant see, so we can know if we specify the length of general at three if the sub Rd are sub.",
                    "label": 0
                },
                {
                    "sent": "Dominate the sub sub rodear subtitle.",
                    "label": 0
                },
                {
                    "sent": "We can.",
                    "label": 0
                },
                {
                    "sent": "Definitely knows a candidate.",
                    "label": 0
                },
                {
                    "sent": "Pure capital C2C3 and C4 will dominate the candidate pool capital C2C3 and C4 so.",
                    "label": 0
                },
                {
                    "sent": "So basically we will enumerate all subgroup with length of error and pruning dominant some constraints.",
                    "label": 1
                },
                {
                    "sent": "A brood with less L. Before we knowing the position of cab driver so this pruning can be done offline before we know.",
                    "label": 1
                },
                {
                    "sent": "Before we do the online recommendation, so this is a ones effort to pruning the search space.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Also we developer another algorithm is Cairo algorithm.",
                    "label": 0
                },
                {
                    "sent": "First, we defined our schiro if a if us a recommended rose is the Sky cannot be dominant by any candidate that we will say this.",
                    "label": 0
                },
                {
                    "sent": "Johnny Rd is Skyline Rose.",
                    "label": 0
                },
                {
                    "sent": "With this definition, we can find a joint principle of the Sky roll and the PD function that is optimal driving rule must be a Sky rose.",
                    "label": 0
                },
                {
                    "sent": "Becausw the.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "Because the function is monotone and the Sky roll must, the optimal by must be a schedule.",
                    "label": 0
                },
                {
                    "sent": "So with this principle we can find the optimal driving rules in two steps.",
                    "label": 1
                },
                {
                    "sent": "The first steps we will.",
                    "label": 0
                },
                {
                    "sent": "Search we will find the Sky rose.",
                    "label": 0
                },
                {
                    "sent": "Then we just we will just search the optimal rules from the set of the schedules.",
                    "label": 1
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "With this understanding, we can just use the traditional Sky skyline computing algorithm to search to find the Sky roads.",
                    "label": 0
                },
                {
                    "sent": "However, the traditional skyline computed computer algorithm is very.",
                    "label": 1
                },
                {
                    "sent": "Time consuming and it only cost a large memory because we need to enumerate all possible candidate and we need to find associate vector for each candidate.",
                    "label": 0
                },
                {
                    "sent": "Then we can compute the Sky rules with the traditional scanner algorithm.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "In this paper we trying to because the traditional algorithm is first actually also the two steps first enumerate all possible candidates, then compute the Sky rules for our schedule algorithm.",
                    "label": 0
                },
                {
                    "sent": "We try when we enumerate the possible candidate root and and get the social vector.",
                    "label": 0
                },
                {
                    "sent": "We will simultaneously do some pruning to pruning some candidates at the early stage.",
                    "label": 1
                },
                {
                    "sent": "Base our.",
                    "label": 0
                },
                {
                    "sent": "Property.",
                    "label": 0
                },
                {
                    "sent": "So so basically we are pruning some candidate, including the dominant sample Rd at an early stage.",
                    "label": 0
                },
                {
                    "sent": "So the social space will be significantly reduced since a lot of candidates contend dominant subroute are discussed at an early stage.",
                    "label": 1
                },
                {
                    "sent": "Also, for this algorithm, we actually.",
                    "label": 1
                },
                {
                    "sent": "It's a gradual effort to continue pruning such space.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here is an example.",
                    "label": 0
                },
                {
                    "sent": "So when we enumerate all possible candidate roots.",
                    "label": 1
                },
                {
                    "sent": "Suppose that we find these two sub rolls R1R2.",
                    "label": 0
                },
                {
                    "sent": "Also, we find our one dominant are true, then we can't.",
                    "label": 0
                },
                {
                    "sent": "No, all candidates like the this one will dominate the candidate.",
                    "label": 0
                },
                {
                    "sent": "Hidden at all.",
                    "label": 1
                },
                {
                    "sent": "All candidate like this will dominate all candidate it like this so we can do.",
                    "label": 0
                },
                {
                    "sent": "We can pruning this candidate at an early stage.",
                    "label": 0
                },
                {
                    "sent": "So this is a basic idea for this Cairo algorithm.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Next I will show some experimental result.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here is the experimental setting up.",
                    "label": 0
                },
                {
                    "sent": "First, we.",
                    "label": 0
                },
                {
                    "sent": "Evaluate our algorithm with the real world data.",
                    "label": 0
                },
                {
                    "sent": "This data is collected from the over 500 taxi driver in 30 days.",
                    "label": 1
                },
                {
                    "sent": "Uh, this location traces in the San Francisco.",
                    "label": 0
                },
                {
                    "sent": "Also we exams are scalability of algorithms with the synthetic data.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is our first, this is our.",
                    "label": 0
                },
                {
                    "sent": "Optimal Rd we find with the real data.",
                    "label": 0
                },
                {
                    "sent": "With the different lengths of Johnny Rhodes.",
                    "label": 0
                },
                {
                    "sent": "Actually, we find some optimal roads with our two algorithm for different lengths of German roads.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here is our.",
                    "label": 0
                },
                {
                    "sent": "Searching time we try to compare, compare the our algorithm with the traditional or brute force method.",
                    "label": 0
                },
                {
                    "sent": "As we can see, our CP leads to the best result.",
                    "label": 0
                },
                {
                    "sent": "Other on both real data set and synthetic debt.",
                    "label": 0
                },
                {
                    "sent": "A synthetic data set.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As we can see the actually the LCP, the.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The reduce our searching time for RCP algorithm is just just caused by the pruning effect.",
                    "label": 0
                },
                {
                    "sent": "As we can see the LCP algorithm.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Pruning the search space.",
                    "label": 0
                },
                {
                    "sent": "Significantly also, the Sky roll algorithm.",
                    "label": 0
                },
                {
                    "sent": "Can the pruning the search space more significantly.",
                    "label": 0
                },
                {
                    "sent": "This is all we also.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Locali compared the Skyline computing computing algorithm.",
                    "label": 0
                },
                {
                    "sent": "As we can see our algorithm Sky roll can outperform the traditional skyline computing algorithms such as D&C and be in error.",
                    "label": 0
                },
                {
                    "sent": "This test, this is test on the boat synthetic data.",
                    "label": 0
                },
                {
                    "sent": "Real data with different lengths of John Rd and different number of pickup points.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Also, this is a special case.",
                    "label": 0
                },
                {
                    "sent": "Here we try to search multiple optimal John Rd with notable evaluate function.",
                    "label": 1
                },
                {
                    "sent": "Actually we use totally filed different evaluate evaluate function including the PD function.",
                    "label": 0
                },
                {
                    "sent": "All these functions are monitored.",
                    "label": 0
                },
                {
                    "sent": "So we can, as we can see in this case the Sky Rule algorithm leads to leads to the best result, much better than the LCP algorithm and brute force algorithm.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Finally, we conclude our talk.",
                    "label": 0
                },
                {
                    "sent": "So in this study we we develop our energy efficient mobile recommend system.",
                    "label": 0
                },
                {
                    "sent": "For which has the ability to recommend a sequence or pick up point for the taxi driver.",
                    "label": 0
                },
                {
                    "sent": "In this paper, we respectfully define the PD function to evaluate each possible candidate Rd.",
                    "label": 0
                },
                {
                    "sent": "Best under the property of this function we developed to algorithm, LCP and Sky rose.",
                    "label": 0
                },
                {
                    "sent": "That's all, thank you for that.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "My contention.",
                    "label": 0
                }
            ]
        }
    }
}