{
    "id": "y2yfivcrtdy6zpiqbpz7pbbqevzcu4ev",
    "title": "Enhancing the Analysis of Large Multimedia Applications Execution Traces with FrameMiner",
    "info": {
        "author": [
            "Christiane Kamdem Kengne, Laboratoire LIG"
        ],
        "published": "Jan. 16, 2013",
        "recorded": "December 2012",
        "category": [
            "Top->Computer Science->Data Mining->Applications"
        ]
    },
    "url": "http://videolectures.net/ptdm2012_kamdem_kengne_frameminer/",
    "segmentation": [
        [
            "And today I want to present our paper title, enhancing the analysis of large multimedia applications, execution traces, reframe minor.",
            "It was a collaboration between Joseph University in France and Osaka University in Japan.",
            "So in the title we see many words as analysis, multimedia applications, execution traces."
        ],
        [
            "So it's necessary before everything to introduce the context.",
            "So I think that most of you here has at least one tablet or one smartphone, or the both.",
            "I don't know.",
            "In short, and embedded system, and here we will focus on multiprocessor system on ship which use on a platform that contains several processing elements with specific functionality's and."
        ],
        [
            "One of the most application use in embedded system is the multimedia application and in particular audio, video decoding and so develop efficient and robust application for this kind of system using empty socket set challenging is issue."
        ],
        [
            "And.",
            "The powerful tool frequently used to debug embedded system is."
        ],
        [
            "Analysis of execution trust that are collected of event generated by a system or an application in order to to give a postmortem analysis."
        ],
        [
            "But the challenge is the size of this execution traces.",
            "Because Imagemagick multimedia application can generate a huge amount of traces.",
            "For instance, the decoding tool Paralympic can can generate a trace file of more than seven GPG for less than five minutes, or video decoding.",
            "So analyzes such file can be very annoying for the programmer, as we can see with this unhappy thing programmer.",
            "So the real question is that which techniques could be used to analyze execution traces?"
        ],
        [
            "So in our talk we follow this item."
        ],
        [
            "And in the state of the art is the state of the art.",
            "Visualization is used as technique to analyze execution traces.",
            "But the huge image."
        ],
        [
            "And.",
            "The huge amount of stress brings another complexity in the analysis due to the overload of information to represent.",
            "Here is a screenshot of visualization tool project which is developed by Stein and Wishes actually maintained and we can see that it's not very easy to manage and to analyze with this screen."
        ],
        [
            "And so an idea is to reduce the size of execution traces."
        ],
        [
            "And always in the state of the Art, Shannon Jigger deal proposed sample technique to reduce the size."
        ],
        [
            "Of the traces, but the problem is that the.",
            "Reduced race obtain is not always representative of the entire trace."
        ],
        [
            "And the general consensus in the stress analysis community is too unfair size work to work and obstruction of the execution traces."
        ],
        [
            "That's why we propose to abstract a series of low level events into blocks that can be meaningful to the programmer, and after that to abstract the address into a sequence of blocks."
        ],
        [
            "Of course it would be interesting if the block can be different step of the video decoding process as the initial is."
        ],
        [
            "And of a frame or a sequence of interruption."
        ],
        [
            "Or something else.",
            "So with this kind of block, the debugging could be more easier for the programmer.",
            "Of course this blocks can be given by an expert or can be automatically discovered, so we."
        ],
        [
            "Took to have a block, the blocks automatically automatically discussed by mining frequent step of the video."
        ],
        [
            "Decoding process, so with this kind of decoding which is with frames and the frame is identified by two events start and even here for this example the start even is the Get frame event and event is the field job."
        ],
        [
            "Event and we can obtain 2 frames and the sequence of lowlevel events are blocked."
        ],
        [
            "So our problem, the problem here is then to rewrite each frame into a short description with a small set of blocks."
        ],
        [
            "So we will give in this section definitions necessary to model our problem, not that the formal definitions are found in the paper.",
            "So here we illustrate them by example so.",
            "Let's a given set of blocks be one until before and set of frames."
        ],
        [
            "A blocks occurs in a frames if there is X2 timestamp into which this block appears.",
            "So in this example, B2 occurs in the frame, the 2nd frame the."
        ],
        [
            "First definition is the local coverage and we define us local coverage.",
            "A sequence of non overlap blocks that appear in a frame and we define this local coverage because our granularity granular which level is a frames and in this example L2 represent a local coverage for the 2nd frame."
        ],
        [
            "And at each frames we associate a local coverage and the set obtained is then a coverage here.",
            "The set C is coverage for our set of frames using the given set of blocks, and then we could compute a covering degree.",
            "Which represent the percentage of events that cooperate with the coverage."
        ],
        [
            "The third definition is the coverage rank because we've another coverage, we can compute another covering degree and the coverage rank is the biggest value of coping degree among all possible coping degree, and we it's wet here.",
            "2 example with a set of Block X S1.",
            "This is 2 example of coverage that we can obtain and the coverage run computed here."
        ],
        [
            "And finally, a block of size K which have the biggest coverage.",
            "Rank is then among all the all the all the set of size K is then called AKA Golden set.",
            "And here is an example of triggered and sent with."
        ],
        [
            "Our example.",
            "So.",
            "Or if this definition, we can see that our problem is not far from the set cover problem we keep in mind that we want to find a Golden set of blocks that provide the best coverage and.",
            "Here we have a function to optimize and this function is a submodular function, so we assimilate our problem to a submodular function maximization problem which is NP hard problem and studied in particular for resource allocation and for this problem is proof that the lower bound.",
            "Funds compute by uh by artistic is not less than 63% so."
        ],
        [
            "In short.",
            "For us, the initial set of blocks.",
            "Will be obtained by applying a sequence mining algorithm."
        ],
        [
            "And the submodular function function for us is the function of coverage coverage rank defined previously."
        ],
        [
            "In this schema we will describe.",
            "We will describe very quickly the frame miner process because the technical details are in the paper, so starting from a Rd race and the two event start event, we apply a proposing step, a preprocessing step to obtain our set of frames and after that we apply a sequence mining algorithm to obtain our set of candidate blocks and we will mine into this set of considered blocks the Golden pattern.",
            "And maybe we will be happy as this Hunter."
        ],
        [
            "And, um.",
            "We did a preliminary experimentation to assess the interest of our Golden blocks and we did this experimentation with a real trace of embedded MP4 video decoding application and we use also an exhaustive approach to compare."
        ],
        [
            "So the first evaluation that we made is a comparative assessment.",
            "Because we see before that the lower bound of this of this problem is not less than 63% and the experimentation shows that our result we are realize 90% of the optimal solution with an execution throughout the magnitude."
        ],
        [
            "And obviously is necessary to do a subjective assessment cause the target of our work is a programmer, so we subject a list of frequent pattern to expect determination without reveal which one are Golden or not, and he had to classify this initial pattern into three categories.",
            "And it's very interesting to see that.",
            "Uh.",
            "A round of 70% of the initial list of pattern found an uninteresting by the by the expert against 40% of the list of garden patterns."
        ],
        [
            "And we also did an evaluation of the reduction rate and becausw.",
            "Before our rewriting, the programmer has to deal with more than 2000 of lowlevel events and after the after the writing he can see around of at least five hundreds of elements and it represents 70% of prediction."
        ],
        [
            "In the information, so the programmer can now focus on blocks instead of individual events, so we can see with this schema we have two written frames and in the first written frames a perturbation occurs before the block B2 and in the second frames another perturbation occur.",
            "After the block B2, but we can see with these two different frames that the writing is.",
            "Almost the same.",
            "These two written frame contained the same Golden blocks and this kind of observation is not very easy to to have before the rewriting."
        ],
        [
            "So to conclude, in our paper we give an original approach to abstract on execution traces, and we ask that this approach give a great simplification of trust exploration and we provide also an efficient greedy algorithm that can automatically find interesting blocks.",
            "And with this with the rewriting we can have a significant reduction of the execution trust volume.",
            "And."
        ],
        [
            "Course we want to go further and now we are thinking about.",
            "Give an automatic labeling of this of the block.",
            "Obtain to have more semantic.",
            "And another thing, another thing is that we want to apply our tool in multicore traces becausw.",
            "With our experimentation, we use a single code trace and the third the third element is that we want to go beyond our optimization.",
            "Our function coverage rank without taking into account more metrics as timestamp or other.",
            "Is so."
        ],
        [
            "Thank you.",
            "And your remark and the question will be helpful to improve this server."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And today I want to present our paper title, enhancing the analysis of large multimedia applications, execution traces, reframe minor.",
                    "label": 1
                },
                {
                    "sent": "It was a collaboration between Joseph University in France and Osaka University in Japan.",
                    "label": 0
                },
                {
                    "sent": "So in the title we see many words as analysis, multimedia applications, execution traces.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So it's necessary before everything to introduce the context.",
                    "label": 0
                },
                {
                    "sent": "So I think that most of you here has at least one tablet or one smartphone, or the both.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "In short, and embedded system, and here we will focus on multiprocessor system on ship which use on a platform that contains several processing elements with specific functionality's and.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One of the most application use in embedded system is the multimedia application and in particular audio, video decoding and so develop efficient and robust application for this kind of system using empty socket set challenging is issue.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "The powerful tool frequently used to debug embedded system is.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Analysis of execution trust that are collected of event generated by a system or an application in order to to give a postmortem analysis.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But the challenge is the size of this execution traces.",
                    "label": 0
                },
                {
                    "sent": "Because Imagemagick multimedia application can generate a huge amount of traces.",
                    "label": 1
                },
                {
                    "sent": "For instance, the decoding tool Paralympic can can generate a trace file of more than seven GPG for less than five minutes, or video decoding.",
                    "label": 0
                },
                {
                    "sent": "So analyzes such file can be very annoying for the programmer, as we can see with this unhappy thing programmer.",
                    "label": 0
                },
                {
                    "sent": "So the real question is that which techniques could be used to analyze execution traces?",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in our talk we follow this item.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And in the state of the art is the state of the art.",
                    "label": 1
                },
                {
                    "sent": "Visualization is used as technique to analyze execution traces.",
                    "label": 0
                },
                {
                    "sent": "But the huge image.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "The huge amount of stress brings another complexity in the analysis due to the overload of information to represent.",
                    "label": 0
                },
                {
                    "sent": "Here is a screenshot of visualization tool project which is developed by Stein and Wishes actually maintained and we can see that it's not very easy to manage and to analyze with this screen.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so an idea is to reduce the size of execution traces.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And always in the state of the Art, Shannon Jigger deal proposed sample technique to reduce the size.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of the traces, but the problem is that the.",
                    "label": 0
                },
                {
                    "sent": "Reduced race obtain is not always representative of the entire trace.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the general consensus in the stress analysis community is too unfair size work to work and obstruction of the execution traces.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's why we propose to abstract a series of low level events into blocks that can be meaningful to the programmer, and after that to abstract the address into a sequence of blocks.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of course it would be interesting if the block can be different step of the video decoding process as the initial is.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And of a frame or a sequence of interruption.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or something else.",
                    "label": 0
                },
                {
                    "sent": "So with this kind of block, the debugging could be more easier for the programmer.",
                    "label": 0
                },
                {
                    "sent": "Of course this blocks can be given by an expert or can be automatically discovered, so we.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Took to have a block, the blocks automatically automatically discussed by mining frequent step of the video.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Decoding process, so with this kind of decoding which is with frames and the frame is identified by two events start and even here for this example the start even is the Get frame event and event is the field job.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Event and we can obtain 2 frames and the sequence of lowlevel events are blocked.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So our problem, the problem here is then to rewrite each frame into a short description with a small set of blocks.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we will give in this section definitions necessary to model our problem, not that the formal definitions are found in the paper.",
                    "label": 0
                },
                {
                    "sent": "So here we illustrate them by example so.",
                    "label": 0
                },
                {
                    "sent": "Let's a given set of blocks be one until before and set of frames.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A blocks occurs in a frames if there is X2 timestamp into which this block appears.",
                    "label": 0
                },
                {
                    "sent": "So in this example, B2 occurs in the frame, the 2nd frame the.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "First definition is the local coverage and we define us local coverage.",
                    "label": 0
                },
                {
                    "sent": "A sequence of non overlap blocks that appear in a frame and we define this local coverage because our granularity granular which level is a frames and in this example L2 represent a local coverage for the 2nd frame.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And at each frames we associate a local coverage and the set obtained is then a coverage here.",
                    "label": 1
                },
                {
                    "sent": "The set C is coverage for our set of frames using the given set of blocks, and then we could compute a covering degree.",
                    "label": 0
                },
                {
                    "sent": "Which represent the percentage of events that cooperate with the coverage.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The third definition is the coverage rank because we've another coverage, we can compute another covering degree and the coverage rank is the biggest value of coping degree among all possible coping degree, and we it's wet here.",
                    "label": 0
                },
                {
                    "sent": "2 example with a set of Block X S1.",
                    "label": 0
                },
                {
                    "sent": "This is 2 example of coverage that we can obtain and the coverage run computed here.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And finally, a block of size K which have the biggest coverage.",
                    "label": 0
                },
                {
                    "sent": "Rank is then among all the all the all the set of size K is then called AKA Golden set.",
                    "label": 0
                },
                {
                    "sent": "And here is an example of triggered and sent with.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our example.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Or if this definition, we can see that our problem is not far from the set cover problem we keep in mind that we want to find a Golden set of blocks that provide the best coverage and.",
                    "label": 1
                },
                {
                    "sent": "Here we have a function to optimize and this function is a submodular function, so we assimilate our problem to a submodular function maximization problem which is NP hard problem and studied in particular for resource allocation and for this problem is proof that the lower bound.",
                    "label": 1
                },
                {
                    "sent": "Funds compute by uh by artistic is not less than 63% so.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In short.",
                    "label": 0
                },
                {
                    "sent": "For us, the initial set of blocks.",
                    "label": 1
                },
                {
                    "sent": "Will be obtained by applying a sequence mining algorithm.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the submodular function function for us is the function of coverage coverage rank defined previously.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this schema we will describe.",
                    "label": 0
                },
                {
                    "sent": "We will describe very quickly the frame miner process because the technical details are in the paper, so starting from a Rd race and the two event start event, we apply a proposing step, a preprocessing step to obtain our set of frames and after that we apply a sequence mining algorithm to obtain our set of candidate blocks and we will mine into this set of considered blocks the Golden pattern.",
                    "label": 0
                },
                {
                    "sent": "And maybe we will be happy as this Hunter.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And, um.",
                    "label": 0
                },
                {
                    "sent": "We did a preliminary experimentation to assess the interest of our Golden blocks and we did this experimentation with a real trace of embedded MP4 video decoding application and we use also an exhaustive approach to compare.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the first evaluation that we made is a comparative assessment.",
                    "label": 0
                },
                {
                    "sent": "Because we see before that the lower bound of this of this problem is not less than 63% and the experimentation shows that our result we are realize 90% of the optimal solution with an execution throughout the magnitude.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And obviously is necessary to do a subjective assessment cause the target of our work is a programmer, so we subject a list of frequent pattern to expect determination without reveal which one are Golden or not, and he had to classify this initial pattern into three categories.",
                    "label": 0
                },
                {
                    "sent": "And it's very interesting to see that.",
                    "label": 1
                },
                {
                    "sent": "Uh.",
                    "label": 0
                },
                {
                    "sent": "A round of 70% of the initial list of pattern found an uninteresting by the by the expert against 40% of the list of garden patterns.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we also did an evaluation of the reduction rate and becausw.",
                    "label": 0
                },
                {
                    "sent": "Before our rewriting, the programmer has to deal with more than 2000 of lowlevel events and after the after the writing he can see around of at least five hundreds of elements and it represents 70% of prediction.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In the information, so the programmer can now focus on blocks instead of individual events, so we can see with this schema we have two written frames and in the first written frames a perturbation occurs before the block B2 and in the second frames another perturbation occur.",
                    "label": 1
                },
                {
                    "sent": "After the block B2, but we can see with these two different frames that the writing is.",
                    "label": 0
                },
                {
                    "sent": "Almost the same.",
                    "label": 0
                },
                {
                    "sent": "These two written frame contained the same Golden blocks and this kind of observation is not very easy to to have before the rewriting.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to conclude, in our paper we give an original approach to abstract on execution traces, and we ask that this approach give a great simplification of trust exploration and we provide also an efficient greedy algorithm that can automatically find interesting blocks.",
                    "label": 1
                },
                {
                    "sent": "And with this with the rewriting we can have a significant reduction of the execution trust volume.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Course we want to go further and now we are thinking about.",
                    "label": 0
                },
                {
                    "sent": "Give an automatic labeling of this of the block.",
                    "label": 0
                },
                {
                    "sent": "Obtain to have more semantic.",
                    "label": 0
                },
                {
                    "sent": "And another thing, another thing is that we want to apply our tool in multicore traces becausw.",
                    "label": 1
                },
                {
                    "sent": "With our experimentation, we use a single code trace and the third the third element is that we want to go beyond our optimization.",
                    "label": 0
                },
                {
                    "sent": "Our function coverage rank without taking into account more metrics as timestamp or other.",
                    "label": 1
                },
                {
                    "sent": "Is so.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "And your remark and the question will be helpful to improve this server.",
                    "label": 0
                }
            ]
        }
    }
}