{
    "id": "y45dab2frzrjm3twfbpd5pgrv6vgareh",
    "title": "Opening",
    "info": {
        "author": [
            "Achim Rettinger, Institute of Applied Informatics and Formal Description Methods (AIFB), Karlsruhe Institute of Technology (KIT)"
        ],
        "published": "July 15, 2014",
        "recorded": "November 2013",
        "category": [
            "Top->Computer Science->Knowledge Extraction"
        ]
    },
    "url": "http://videolectures.net/xlimekickoff2013_rettinger_opening/",
    "segmentation": [
        [
            "Welcome to the first exam meeting the kickoff.",
            "Finally, I'm pretty excited that it's finally happening.",
            "I mean, it took a long time to get to this point.",
            "Now where it's?",
            "Actually starting maybe first some comments.",
            "We have one guy from video lectures here in the background.",
            "He will be recording the speakers.",
            "We have to sign forms so that he's allowed to record us.",
            "We will probably put this online but password protected so that it's.",
            "Just primarily for internal project use.",
            "If you want to see this again and someone isn't here and maybe a person joins this project later, he can see what's happened at the kickoff and see this.",
            "So don't worry about like telling any company secrets or something like that should be, should be OK. Second comment.",
            "This presentation and hopefully all of the other presentations are on the drop box folder so you don't need to take notes and record everything by hand.",
            "Can just take the presentation and at some additional nodes.",
            "If you have some.",
            "And of course, please ask questions right away so if you have some comments or questions, please ask right away.",
            "This is not meant to be like front presentation with some questions in the end."
        ],
        [
            "OK so I will do the typical project kickoff presentation.",
            "I'll talk a little bit about how this project actually came into being, what the partners are, what our vision is, what we want to do in the first year, and what we want to do in this meeting.",
            "So for the next 2 days."
        ],
        [
            "About the."
        ],
        [
            "Project it started more than a year ago.",
            "It was sometime, I think, September at.",
            "Project meeting of the excellent project.",
            "Also hearing cards were so remember Marco from Chase.",
            "I will join tonight and who they were sitting at the in the city center here in cards who are and discussing that X like is missing a lot of media content that we are actually not covering and this would make a nice project and so this was maybe the initial idea and at the same time also Philip from Ikhanda.",
            "He approached me is also former PhD.",
            "Our group and he asked that they are.",
            "He said that they have problems explaining the fluctuations in their online shops and he asked if I would know something.",
            "How to explain this.",
            "So those were the two things that happened at that time and then somehow this story began to evolve.",
            "So we were looking for partners that could help us with the expertise that we didn't have so.",
            "Vehicle Answer 2 joined for the data that they have.",
            "University of Trento also trying because we are not experts in multimedia and video and so on.",
            "And finally, also it's awkward trying because we just know that they are really good in integrating this stuff, and they also know how to.",
            "I mean, they're also researchers so they know how to deal with us."
        ],
        [
            "Then in January this year, the proposal was finally submitted.",
            "After five days of nonstop working a few people.",
            "People here from Katie in this room were involved in this.",
            "Then in March we got the first rumors that we got a good ranking and in April we got their acceptance finally and so as far as I know we were ranked fourth out of 74 proposals and seven got funded in the end.",
            "So this is already a pretty good success.",
            "I'm yeah, and then the summer came where we had to do the negotiations with the European Commission an which started very well.",
            "It was all nice.",
            "No problems.",
            "We had one revision of the description of work that was no problem.",
            "We did this in two days so so and then there was one month or even more.",
            "Nothing no, no further requests for any changes to the description of work and then both of us.",
            "Went to vacation and one week before the deadline.",
            "We got like this huge list of requests so then they were like yeah 1010 days of really intense work on the description of works from a campsite in France and stuff like this.",
            "This was it was really tough and in the end we had over 12 iterations of the description of work, so that wasn't that nice.",
            "And actually the project Officer at this point.",
            "So feel like she she pushed us to do those 11 iterations and two days after the deadline where she finally said OK everything is fine.",
            "We got a new project Officer.",
            "So now we have some I always forget finish Siler.",
            "Something we don't know her yet.",
            "We haven't seen her.",
            "OK.",
            "So and finally, of course, the cat legal Department is always a big problem, so This is why the consortium agreement.",
            "Took that long so yeah so, but now everything should be almost signed.",
            "We have all of the signatures so yeah, so it took over a year and thanks for everybody for believing in this and I'm really happy that we finally can really start working on this."
        ],
        [
            "OK."
        ],
        [
            "Now coming to the partners.",
            "So this is maybe the most interesting one from for a lot of people that know the proposal and the description of work.",
            "This is new, so X is not an official partner, but I asked.",
            "So when we then work that hard on the description of work, we realized maybe we're really missing expertise in speech to text technology.",
            "And then I got through some context to Texas and they told.",
            "They told me and they were so kind to say they're offering the technology to the project so that we can use their technology and.",
            "We are very grateful about that and very excited to hear about what what we can do with that and the rest is the partners that are also in the proposal.",
            "So first of all, of course khits, so all the cat people are sitting here in front and Rudy.",
            "Of course, I always forget you.",
            "So he's the professor here.",
            "Yes, then we have the second academic partners trace I from you.",
            "Brianna from Slovenia.",
            "Maybe raise your hand.",
            "Player yes and the video lectures.",
            "People are also from Viviana.",
            "3rd Third partner University of Trento.",
            "Those two guys over there.",
            "So yeah, so for us we pretty know each other.",
            "Those two we had a lot of projects together, but University of Trento is actually new to this so.",
            "OK, yeah, who doesn't?",
            "OK so yeah great.",
            "Yeah, then it is so cool.",
            "From Madrid, here and here.",
            "Also, it's a we know them from other projects and then maybe those three small and medium enterprises so I know.",
            "So two already had been in the European project in this to TV, but all of them are pretty new to this business I guess so.",
            "Yeah, so we have set two with beer.",
            "Then we could research here.",
            "And ikhanda, Phillip.",
            "So I you will hear a lot about what they're actually doing, so I don't think I have to go into the details."
        ],
        [
            "This is basically the same.",
            "The same illustration, just more detailed, and this is actually something that I really like about the project, cause the roles are very clear and.",
            "Simply defined so we have 3 research partners and three data and use case partners.",
            "And so yeah, the clear, the role of every partner should be pretty clear.",
            "Here we are trying to develop the methodology's and the services and the use case.",
            "Partners are then at the same time providing the data but also evaluating our technologies.",
            "So this is.",
            "What I really like, I also chose the partners by actually that they are small enterprises becausw I'm not so much a big fan of having big companies in research projects because often.",
            "They're just there for their name and they don't help a lot so.",
            "Yeah, I think this is a very very good setup that we have."
        ],
        [
            "Now."
        ],
        [
            "How about the what we actually want to do in this project, so the original motivation was OK for a lot of people.",
            "This is nothing new, but we have some people who haven't heard about the project yet.",
            "So the idea was and this is like the abstract research idea.",
            "That knowledge in the European Union is very fragmented, so we have a very much different media market compared for example to the US.",
            "So we have a lot more different languages and we.",
            "We also have a lot more different local contexts.",
            "Smaller producers of information that are very specific to a specific region.",
            "And this is very hard to analyze with automatic tools because of those two reasons.",
            "I mean it's very distributed.",
            "It's not very well linked, and it's also.",
            "Fragmented over those languages."
        ],
        [
            "So we define those three dimensions of media content.",
            "Of course they are.",
            "The modalities could be visual audit if textual information and of course this is also an obvious dimension.",
            "Is the different languages.",
            "And this X dimension is.",
            "Something I'm always asked about so is this.",
            "Does this really make sense?",
            "But if you consider it from a from like the textual information, it's very much different if it's proper.",
            "News text from a news agency or for example, a tweet, because all of your text, natural language processing, or text mining tools, they tend to fail as soon as you try to analyze a tweet.",
            "So This is why we also split this dimension.",
            "Yeah, I don't know if this is a good term for it professionally produced, but I couldn't come up with a better one so."
        ],
        [
            "OK.",
            "So what we want to do in the end is of course like the old.",
            "Yeah, problem of extracting knowledge from different sources in the sense that it's usable by a computer, and this should be done cross, lingual and cross media.",
            "And we also, since we have this data streams, we also want to provide near real time monitoring of the content in this media as it diffuses across the different media and across languages.",
            "So we want to monitor this.",
            "Actually.",
            "I like just a couple of days ago we released the first press release, the Cat Press Office and they they.",
            "I wrote them a text.",
            "They said fine and then like two days later another person called me and said oh this is we cannot print this big cause there's always written so it's in German.",
            "But monitoring and due to the NSA scandal and this doesn't sound good.",
            "We cannot print this right at the moment so we replaced in this press release.",
            "We replaced everything with search.",
            "So we can search across the different modalities, and so this seems to be better for them so, but.",
            "Even if I told them we are actually not really looking at personalized information, individual information.",
            "This is not.",
            "This project is more about content, it's not about.",
            "So much about individual use or personalized advertisements or something like this.",
            "So I think this is a."
        ],
        [
            "We're pretty safe on this side, actually.",
            "Yeah so.",
            "This is one of the very.",
            "High level.",
            "Ideas that was also in the in the proposal.",
            "So this is the shoot somehow illustrate the pipeline.",
            "The Exline pipeline was a different work.",
            "Packages with package one to work Package 4.",
            "The ideas that we have information from those different modalities and then we have different tools that can all annotate elements in this.",
            "In this multimedia items, I don't know the best word for that.",
            "With one knowledge based in this case, it's like linked open data DB pedia.",
            "But it's just an example.",
            "So the goal is like to transfer speech, first text and then link elements in text to this knowledge base and the same.",
            "Happens for.",
            "Images and video and then.",
            "Once we link this, the goal is to extract something like events structured representation of what's the content in this media items?"
        ],
        [
            "OK, now I'm going a little bit more into detail, but this pipeline processing pipeline is about.",
            "So we have this screen.",
            "The lower layer that deals with text, so we are here dealing with a typical natural language processing problem, and this is actually what we're doing in one project that's now running for 1 1/2 years.",
            "That's called X like and as you can see from the name it's very closely related to the project to Exline cause, so this is the part that we do in X, like and now an ex line.",
            "We extend this.",
            "To the other two modalities, that's the plan."
        ],
        [
            "Yeah, so this is what we.",
            "Need to need to do on top of what we have from X like so this is the orange arrows.",
            "This is basically extracting.",
            "Text from visual input, but also annotating this maybe with sentiment or.",
            "Similar."
        ],
        [
            "Techniques.",
            "And then we have this middle layer of so the downward facing errors are basically speech to text.",
            "So we want to extract the text from from the from audio and also annotate the audio stream with additional.",
            "Information."
        ],
        [
            "OK, if you put all of this together we get another final step.",
            "So here we have basically all of the annotations that are candidates that need to disambiguate it, and this we want to.",
            "Do in one step where we can say we improve the disambiguation step by really considering all of the different modalities from video to text and so on.",
            "So."
        ],
        [
            "OK, now we put work packages on top of this.",
            "And those are now the work packages that we have in the project.",
            "Anne.",
            "Here's also shown who's the work package leader in the different in the different work packages.",
            "Of course there are additional work packages does work package six and seven for integration and use cases.",
            "That's led by Isoko.",
            "And then we have work Package 8 for dissemination.",
            "It's also by University of Trento and Work Package 9.",
            "It's Katie that's management, so all of the partners got about two packages that they have to lead except the.",
            "SMS the use case."
        ],
        [
            "Brightness.",
            "Yeah, this is.",
            "This illustration is about the use cases mostly.",
            "So here we have this pipeline just as a black box.",
            "And here's the data that we are planning to process, so we have.",
            "All of the SM ES, as I said in the beginning, are providing data in different forms and different from different sources and different languages and so on.",
            "And then we run this through the pipeline and now.",
            "It's also something that I really like about the project.",
            "We have three different use cases for of course, for every use case partner we have fun use case, but the nice thing is that they can be stacked on top of each other, so we have.",
            "In the beginning we only have this search use case and then the results of the search use case are combined with the monitor use case by Rico and the results again monitored by the explain use case from ikhanda.",
            "So.",
            "We have something that is, in my opinion, quite rare for you project as far as I've seen is that we have actually something that also the use case is built on top of each other.",
            "Often the use case partners don't interact at all.",
            "So here we have this situation that we really basically equal is also evaluating the results of the use case and so on.",
            "Some kind of sanity check on sanity check on top of each other.",
            "And it's yeah, and it's all somehow related to E Commerce, especially frequently condo, so it's not that diverse."
        ],
        [
            "Good then.",
            "Let me briefly talk about what what's has to be done in the 1st."
        ],
        [
            "Here.",
            "So how we want to structure this project is that we basically.",
            "See each year separately, so we start after one year we start all over the whole process over and over again so we always start with the requirements analysis.",
            "Then we do evaluate our techniques.",
            "And in the end, have an evaluation and this usually some prototypes or demonstrators that we can show and test with our use case partners.",
            "And at the end of every year we already have some running systems that can be shown evaluated and so on, and will also be shown then in their review meetings by the European Commission that are always after one year and then in the next year we.",
            "Just check our lessons learned that we want we want we learned in the year before and start the whole process over again.",
            "Hum."
        ],
        [
            "So coming to the.",
            "Research calls it now just for the first year.",
            "So first of all, the important thing is we need to extract text from all content forms.",
            "We need to annotate.",
            "As much content as we can from different modalities with a common knowledge base and maybe this is for the first year, the most important thing is.",
            "What we want to have is some kind of probably statistical method to compare content across media and across languages.",
            "So I will talk about this later."
        ],
        [
            "Concerning the engineering goals.",
            "We need to of course model the metadata how we want to process this data.",
            "In one comment pipeline and then also how we can do.",
            "Proper search that is fast enough on a new real time stream."
        ],
        [
            "Concerning the use cases.",
            "In the first year, there's mostly this are two use case and this will be based on the search functionality and for also for the first year we have this early prototype of the Rico use case, but we won't have a Conda use case in the first year because of this building on top of each other, we couldn't just we will.",
            "Of course we will work on the ikhanda use case, but we won't have the technology to really solve the problems of the counter use case.",
            "Maybe we could start also yeah sure.",
            "Some subset of the information doesn't depend on the use case.",
            "Yeah yeah, but yeah, yeah, we can discuss this, but somehow we need to have this monitoring capability that we can monitor content and how good this works in the first year.",
            "Let's see, but."
        ],
        [
            "OK then some random sidenote.",
            "We will talk about this tomorrow and.",
            "Due to some reasons that we will discuss tomorrow, we have internal deadlines that are different to the ones in the description of work 'cause we have to build technologies on top of each other and they you they wanted us to have all of the deliverables at the same month.",
            "And of course this is like.",
            "This cannot be combined, so.",
            "We will talk about this tomorrow in the management session."
        ],
        [
            "OK, finally the agenda for this meeting, so I'm drilling down to the concrete thing now.",
            "So first of all, the agenda is also on Dropbox, so it might change and might be updated constantly and you can.",
            "See you there."
        ],
        [
            "Up-to-date version there.",
            "So today is the day where the research partners present their previous work and what they plan to do in the first year.",
            "Tomorrow is then about the data and the use cases and also about management dissemination, administrative issues and then the Wednesday is more more of a flexible day where their hands on tutorials and just discussions where we really need to have discussions to get some.",
            "M Yeah initial stuff going."
        ],
        [
            "So.",
            "Coming to the more interesting things in life.",
            "And the dinner today will be at a Japanese restaurant, so it's.",
            "Not sushi, not only sushi.",
            "It's all mixed and total mix of Japanese food.",
            "Also like the more down to Earth, Japanese food and the interesting thing is you can order other iPads or you have get an iPad and you can pick what you want and they bring it here.",
            "Yeah, so you would propose to meet here.",
            "Either meteor at 7:30 or if you want if you have some time and you want to discover the city, you can also come at 8:00 PM directly to the restaurant."
        ],
        [
            "OK tomorrow will be.",
            "Will be burgers and sausages because I thought maybe we should also have some German style food but.",
            "But it's actually very.",
            "Is the sausages are very German?",
            "Yes.",
            "Yeah, but that's actually much more fancy than it sounds.",
            "So in this case it's not.",
            "It's also close to where we are tonight.",
            "Yeah, I'll meet.",
            "Yeah I remember one thing this this is in principle, it's all you can eat, but we have to pay extra extra for everything.",
            "That's not that you don't eat, so if you don't like it it's fine.",
            "But if you order too much and you just can't eat it because you're full, we have to pay for it.",
            "So this is this is like the extra constraint for this chip in this place.",
            "So just take it slowly and just don't like order 100 items right away.",
            "OK, so."
        ],
        [
            "This is about scheduling the next meetings, but since Mark is not here yet, I would move this too, because he's probably the guy that's hardest to get.",
            "Move this to tomorrow morning."
        ],
        [
            "OK, so some last words.",
            "Before we start."
        ],
        [
            "So about how I would as a coordinator would like to have this project is.",
            "I'm not a big fan of reporting and management is on your nose.",
            "So I'm much more interested in research and development.",
            "So I my philosophy is we should start with rather with trust, fairness and common sense before we just go by all of the rules and regulations.",
            "I mean we now have all the rules and regulations in place, but my opinion is just think about what's sensible to do and you don't need to read all of this stuff.",
            "So as long as nothing bad happens and no one complaints, I would just act as you always do and this should be fine.",
            "Don't worry too much about all of this.",
            "Who will send you regulations that are now somewhere written.",
            "So I don't like micromanagement at all and I also like real world data and applications of theoretical concepts or for the for the research partners just presenting some ideas that you have and you have tested this on.",
            "I don't, I don't know some toy word problem that's.",
            "It's not going to help the project a lot."
        ],
        [
            "OK, so.",
            "Now really, the final slide.",
            "The goal of this meeting is mostly get to know each other and learn about new stuff, but other peoples do.",
            "And then a little bit more serious plan the first year and initiate the implementation.",
            "That's for the third year, and so the.",
            "Basic message messages talk to each other as much as you can and discuss and ask questions.",
            "This is the most important thing.",
            "So."
        ],
        [
            "So.",
            "Final, my final word is.",
            "I think we have a promising setup with this project.",
            "We have a lot of pre existing technology that we can build on.",
            "We have good people and let's use this opportunity.",
            "OK thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Welcome to the first exam meeting the kickoff.",
                    "label": 0
                },
                {
                    "sent": "Finally, I'm pretty excited that it's finally happening.",
                    "label": 0
                },
                {
                    "sent": "I mean, it took a long time to get to this point.",
                    "label": 0
                },
                {
                    "sent": "Now where it's?",
                    "label": 0
                },
                {
                    "sent": "Actually starting maybe first some comments.",
                    "label": 0
                },
                {
                    "sent": "We have one guy from video lectures here in the background.",
                    "label": 0
                },
                {
                    "sent": "He will be recording the speakers.",
                    "label": 0
                },
                {
                    "sent": "We have to sign forms so that he's allowed to record us.",
                    "label": 0
                },
                {
                    "sent": "We will probably put this online but password protected so that it's.",
                    "label": 0
                },
                {
                    "sent": "Just primarily for internal project use.",
                    "label": 0
                },
                {
                    "sent": "If you want to see this again and someone isn't here and maybe a person joins this project later, he can see what's happened at the kickoff and see this.",
                    "label": 0
                },
                {
                    "sent": "So don't worry about like telling any company secrets or something like that should be, should be OK. Second comment.",
                    "label": 0
                },
                {
                    "sent": "This presentation and hopefully all of the other presentations are on the drop box folder so you don't need to take notes and record everything by hand.",
                    "label": 0
                },
                {
                    "sent": "Can just take the presentation and at some additional nodes.",
                    "label": 0
                },
                {
                    "sent": "If you have some.",
                    "label": 0
                },
                {
                    "sent": "And of course, please ask questions right away so if you have some comments or questions, please ask right away.",
                    "label": 0
                },
                {
                    "sent": "This is not meant to be like front presentation with some questions in the end.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK so I will do the typical project kickoff presentation.",
                    "label": 0
                },
                {
                    "sent": "I'll talk a little bit about how this project actually came into being, what the partners are, what our vision is, what we want to do in the first year, and what we want to do in this meeting.",
                    "label": 1
                },
                {
                    "sent": "So for the next 2 days.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "About the.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Project it started more than a year ago.",
                    "label": 0
                },
                {
                    "sent": "It was sometime, I think, September at.",
                    "label": 0
                },
                {
                    "sent": "Project meeting of the excellent project.",
                    "label": 0
                },
                {
                    "sent": "Also hearing cards were so remember Marco from Chase.",
                    "label": 0
                },
                {
                    "sent": "I will join tonight and who they were sitting at the in the city center here in cards who are and discussing that X like is missing a lot of media content that we are actually not covering and this would make a nice project and so this was maybe the initial idea and at the same time also Philip from Ikhanda.",
                    "label": 0
                },
                {
                    "sent": "He approached me is also former PhD.",
                    "label": 0
                },
                {
                    "sent": "Our group and he asked that they are.",
                    "label": 0
                },
                {
                    "sent": "He said that they have problems explaining the fluctuations in their online shops and he asked if I would know something.",
                    "label": 1
                },
                {
                    "sent": "How to explain this.",
                    "label": 0
                },
                {
                    "sent": "So those were the two things that happened at that time and then somehow this story began to evolve.",
                    "label": 0
                },
                {
                    "sent": "So we were looking for partners that could help us with the expertise that we didn't have so.",
                    "label": 1
                },
                {
                    "sent": "Vehicle Answer 2 joined for the data that they have.",
                    "label": 1
                },
                {
                    "sent": "University of Trento also trying because we are not experts in multimedia and video and so on.",
                    "label": 0
                },
                {
                    "sent": "And finally, also it's awkward trying because we just know that they are really good in integrating this stuff, and they also know how to.",
                    "label": 0
                },
                {
                    "sent": "I mean, they're also researchers so they know how to deal with us.",
                    "label": 1
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then in January this year, the proposal was finally submitted.",
                    "label": 0
                },
                {
                    "sent": "After five days of nonstop working a few people.",
                    "label": 1
                },
                {
                    "sent": "People here from Katie in this room were involved in this.",
                    "label": 1
                },
                {
                    "sent": "Then in March we got the first rumors that we got a good ranking and in April we got their acceptance finally and so as far as I know we were ranked fourth out of 74 proposals and seven got funded in the end.",
                    "label": 0
                },
                {
                    "sent": "So this is already a pretty good success.",
                    "label": 0
                },
                {
                    "sent": "I'm yeah, and then the summer came where we had to do the negotiations with the European Commission an which started very well.",
                    "label": 0
                },
                {
                    "sent": "It was all nice.",
                    "label": 0
                },
                {
                    "sent": "No problems.",
                    "label": 0
                },
                {
                    "sent": "We had one revision of the description of work that was no problem.",
                    "label": 0
                },
                {
                    "sent": "We did this in two days so so and then there was one month or even more.",
                    "label": 0
                },
                {
                    "sent": "Nothing no, no further requests for any changes to the description of work and then both of us.",
                    "label": 0
                },
                {
                    "sent": "Went to vacation and one week before the deadline.",
                    "label": 0
                },
                {
                    "sent": "We got like this huge list of requests so then they were like yeah 1010 days of really intense work on the description of works from a campsite in France and stuff like this.",
                    "label": 0
                },
                {
                    "sent": "This was it was really tough and in the end we had over 12 iterations of the description of work, so that wasn't that nice.",
                    "label": 1
                },
                {
                    "sent": "And actually the project Officer at this point.",
                    "label": 0
                },
                {
                    "sent": "So feel like she she pushed us to do those 11 iterations and two days after the deadline where she finally said OK everything is fine.",
                    "label": 0
                },
                {
                    "sent": "We got a new project Officer.",
                    "label": 0
                },
                {
                    "sent": "So now we have some I always forget finish Siler.",
                    "label": 0
                },
                {
                    "sent": "Something we don't know her yet.",
                    "label": 0
                },
                {
                    "sent": "We haven't seen her.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So and finally, of course, the cat legal Department is always a big problem, so This is why the consortium agreement.",
                    "label": 0
                },
                {
                    "sent": "Took that long so yeah so, but now everything should be almost signed.",
                    "label": 0
                },
                {
                    "sent": "We have all of the signatures so yeah, so it took over a year and thanks for everybody for believing in this and I'm really happy that we finally can really start working on this.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now coming to the partners.",
                    "label": 0
                },
                {
                    "sent": "So this is maybe the most interesting one from for a lot of people that know the proposal and the description of work.",
                    "label": 0
                },
                {
                    "sent": "This is new, so X is not an official partner, but I asked.",
                    "label": 0
                },
                {
                    "sent": "So when we then work that hard on the description of work, we realized maybe we're really missing expertise in speech to text technology.",
                    "label": 0
                },
                {
                    "sent": "And then I got through some context to Texas and they told.",
                    "label": 0
                },
                {
                    "sent": "They told me and they were so kind to say they're offering the technology to the project so that we can use their technology and.",
                    "label": 0
                },
                {
                    "sent": "We are very grateful about that and very excited to hear about what what we can do with that and the rest is the partners that are also in the proposal.",
                    "label": 0
                },
                {
                    "sent": "So first of all, of course khits, so all the cat people are sitting here in front and Rudy.",
                    "label": 0
                },
                {
                    "sent": "Of course, I always forget you.",
                    "label": 0
                },
                {
                    "sent": "So he's the professor here.",
                    "label": 0
                },
                {
                    "sent": "Yes, then we have the second academic partners trace I from you.",
                    "label": 0
                },
                {
                    "sent": "Brianna from Slovenia.",
                    "label": 0
                },
                {
                    "sent": "Maybe raise your hand.",
                    "label": 0
                },
                {
                    "sent": "Player yes and the video lectures.",
                    "label": 0
                },
                {
                    "sent": "People are also from Viviana.",
                    "label": 0
                },
                {
                    "sent": "3rd Third partner University of Trento.",
                    "label": 0
                },
                {
                    "sent": "Those two guys over there.",
                    "label": 0
                },
                {
                    "sent": "So yeah, so for us we pretty know each other.",
                    "label": 0
                },
                {
                    "sent": "Those two we had a lot of projects together, but University of Trento is actually new to this so.",
                    "label": 0
                },
                {
                    "sent": "OK, yeah, who doesn't?",
                    "label": 0
                },
                {
                    "sent": "OK so yeah great.",
                    "label": 0
                },
                {
                    "sent": "Yeah, then it is so cool.",
                    "label": 0
                },
                {
                    "sent": "From Madrid, here and here.",
                    "label": 0
                },
                {
                    "sent": "Also, it's a we know them from other projects and then maybe those three small and medium enterprises so I know.",
                    "label": 0
                },
                {
                    "sent": "So two already had been in the European project in this to TV, but all of them are pretty new to this business I guess so.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so we have set two with beer.",
                    "label": 0
                },
                {
                    "sent": "Then we could research here.",
                    "label": 0
                },
                {
                    "sent": "And ikhanda, Phillip.",
                    "label": 0
                },
                {
                    "sent": "So I you will hear a lot about what they're actually doing, so I don't think I have to go into the details.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is basically the same.",
                    "label": 0
                },
                {
                    "sent": "The same illustration, just more detailed, and this is actually something that I really like about the project, cause the roles are very clear and.",
                    "label": 0
                },
                {
                    "sent": "Simply defined so we have 3 research partners and three data and use case partners.",
                    "label": 0
                },
                {
                    "sent": "And so yeah, the clear, the role of every partner should be pretty clear.",
                    "label": 0
                },
                {
                    "sent": "Here we are trying to develop the methodology's and the services and the use case.",
                    "label": 0
                },
                {
                    "sent": "Partners are then at the same time providing the data but also evaluating our technologies.",
                    "label": 0
                },
                {
                    "sent": "So this is.",
                    "label": 0
                },
                {
                    "sent": "What I really like, I also chose the partners by actually that they are small enterprises becausw I'm not so much a big fan of having big companies in research projects because often.",
                    "label": 0
                },
                {
                    "sent": "They're just there for their name and they don't help a lot so.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I think this is a very very good setup that we have.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "How about the what we actually want to do in this project, so the original motivation was OK for a lot of people.",
                    "label": 0
                },
                {
                    "sent": "This is nothing new, but we have some people who haven't heard about the project yet.",
                    "label": 0
                },
                {
                    "sent": "So the idea was and this is like the abstract research idea.",
                    "label": 0
                },
                {
                    "sent": "That knowledge in the European Union is very fragmented, so we have a very much different media market compared for example to the US.",
                    "label": 1
                },
                {
                    "sent": "So we have a lot more different languages and we.",
                    "label": 1
                },
                {
                    "sent": "We also have a lot more different local contexts.",
                    "label": 0
                },
                {
                    "sent": "Smaller producers of information that are very specific to a specific region.",
                    "label": 0
                },
                {
                    "sent": "And this is very hard to analyze with automatic tools because of those two reasons.",
                    "label": 0
                },
                {
                    "sent": "I mean it's very distributed.",
                    "label": 0
                },
                {
                    "sent": "It's not very well linked, and it's also.",
                    "label": 0
                },
                {
                    "sent": "Fragmented over those languages.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we define those three dimensions of media content.",
                    "label": 1
                },
                {
                    "sent": "Of course they are.",
                    "label": 0
                },
                {
                    "sent": "The modalities could be visual audit if textual information and of course this is also an obvious dimension.",
                    "label": 0
                },
                {
                    "sent": "Is the different languages.",
                    "label": 0
                },
                {
                    "sent": "And this X dimension is.",
                    "label": 0
                },
                {
                    "sent": "Something I'm always asked about so is this.",
                    "label": 0
                },
                {
                    "sent": "Does this really make sense?",
                    "label": 0
                },
                {
                    "sent": "But if you consider it from a from like the textual information, it's very much different if it's proper.",
                    "label": 0
                },
                {
                    "sent": "News text from a news agency or for example, a tweet, because all of your text, natural language processing, or text mining tools, they tend to fail as soon as you try to analyze a tweet.",
                    "label": 0
                },
                {
                    "sent": "So This is why we also split this dimension.",
                    "label": 1
                },
                {
                    "sent": "Yeah, I don't know if this is a good term for it professionally produced, but I couldn't come up with a better one so.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So what we want to do in the end is of course like the old.",
                    "label": 0
                },
                {
                    "sent": "Yeah, problem of extracting knowledge from different sources in the sense that it's usable by a computer, and this should be done cross, lingual and cross media.",
                    "label": 1
                },
                {
                    "sent": "And we also, since we have this data streams, we also want to provide near real time monitoring of the content in this media as it diffuses across the different media and across languages.",
                    "label": 1
                },
                {
                    "sent": "So we want to monitor this.",
                    "label": 0
                },
                {
                    "sent": "Actually.",
                    "label": 0
                },
                {
                    "sent": "I like just a couple of days ago we released the first press release, the Cat Press Office and they they.",
                    "label": 0
                },
                {
                    "sent": "I wrote them a text.",
                    "label": 0
                },
                {
                    "sent": "They said fine and then like two days later another person called me and said oh this is we cannot print this big cause there's always written so it's in German.",
                    "label": 0
                },
                {
                    "sent": "But monitoring and due to the NSA scandal and this doesn't sound good.",
                    "label": 0
                },
                {
                    "sent": "We cannot print this right at the moment so we replaced in this press release.",
                    "label": 0
                },
                {
                    "sent": "We replaced everything with search.",
                    "label": 0
                },
                {
                    "sent": "So we can search across the different modalities, and so this seems to be better for them so, but.",
                    "label": 0
                },
                {
                    "sent": "Even if I told them we are actually not really looking at personalized information, individual information.",
                    "label": 0
                },
                {
                    "sent": "This is not.",
                    "label": 0
                },
                {
                    "sent": "This project is more about content, it's not about.",
                    "label": 0
                },
                {
                    "sent": "So much about individual use or personalized advertisements or something like this.",
                    "label": 0
                },
                {
                    "sent": "So I think this is a.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We're pretty safe on this side, actually.",
                    "label": 0
                },
                {
                    "sent": "Yeah so.",
                    "label": 0
                },
                {
                    "sent": "This is one of the very.",
                    "label": 0
                },
                {
                    "sent": "High level.",
                    "label": 0
                },
                {
                    "sent": "Ideas that was also in the in the proposal.",
                    "label": 0
                },
                {
                    "sent": "So this is the shoot somehow illustrate the pipeline.",
                    "label": 0
                },
                {
                    "sent": "The Exline pipeline was a different work.",
                    "label": 0
                },
                {
                    "sent": "Packages with package one to work Package 4.",
                    "label": 0
                },
                {
                    "sent": "The ideas that we have information from those different modalities and then we have different tools that can all annotate elements in this.",
                    "label": 0
                },
                {
                    "sent": "In this multimedia items, I don't know the best word for that.",
                    "label": 0
                },
                {
                    "sent": "With one knowledge based in this case, it's like linked open data DB pedia.",
                    "label": 0
                },
                {
                    "sent": "But it's just an example.",
                    "label": 0
                },
                {
                    "sent": "So the goal is like to transfer speech, first text and then link elements in text to this knowledge base and the same.",
                    "label": 0
                },
                {
                    "sent": "Happens for.",
                    "label": 0
                },
                {
                    "sent": "Images and video and then.",
                    "label": 0
                },
                {
                    "sent": "Once we link this, the goal is to extract something like events structured representation of what's the content in this media items?",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, now I'm going a little bit more into detail, but this pipeline processing pipeline is about.",
                    "label": 0
                },
                {
                    "sent": "So we have this screen.",
                    "label": 0
                },
                {
                    "sent": "The lower layer that deals with text, so we are here dealing with a typical natural language processing problem, and this is actually what we're doing in one project that's now running for 1 1/2 years.",
                    "label": 0
                },
                {
                    "sent": "That's called X like and as you can see from the name it's very closely related to the project to Exline cause, so this is the part that we do in X, like and now an ex line.",
                    "label": 0
                },
                {
                    "sent": "We extend this.",
                    "label": 0
                },
                {
                    "sent": "To the other two modalities, that's the plan.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, so this is what we.",
                    "label": 0
                },
                {
                    "sent": "Need to need to do on top of what we have from X like so this is the orange arrows.",
                    "label": 0
                },
                {
                    "sent": "This is basically extracting.",
                    "label": 0
                },
                {
                    "sent": "Text from visual input, but also annotating this maybe with sentiment or.",
                    "label": 0
                },
                {
                    "sent": "Similar.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Techniques.",
                    "label": 0
                },
                {
                    "sent": "And then we have this middle layer of so the downward facing errors are basically speech to text.",
                    "label": 0
                },
                {
                    "sent": "So we want to extract the text from from the from audio and also annotate the audio stream with additional.",
                    "label": 0
                },
                {
                    "sent": "Information.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, if you put all of this together we get another final step.",
                    "label": 0
                },
                {
                    "sent": "So here we have basically all of the annotations that are candidates that need to disambiguate it, and this we want to.",
                    "label": 0
                },
                {
                    "sent": "Do in one step where we can say we improve the disambiguation step by really considering all of the different modalities from video to text and so on.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, now we put work packages on top of this.",
                    "label": 0
                },
                {
                    "sent": "And those are now the work packages that we have in the project.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Here's also shown who's the work package leader in the different in the different work packages.",
                    "label": 0
                },
                {
                    "sent": "Of course there are additional work packages does work package six and seven for integration and use cases.",
                    "label": 0
                },
                {
                    "sent": "That's led by Isoko.",
                    "label": 0
                },
                {
                    "sent": "And then we have work Package 8 for dissemination.",
                    "label": 0
                },
                {
                    "sent": "It's also by University of Trento and Work Package 9.",
                    "label": 0
                },
                {
                    "sent": "It's Katie that's management, so all of the partners got about two packages that they have to lead except the.",
                    "label": 0
                },
                {
                    "sent": "SMS the use case.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Brightness.",
                    "label": 0
                },
                {
                    "sent": "Yeah, this is.",
                    "label": 0
                },
                {
                    "sent": "This illustration is about the use cases mostly.",
                    "label": 0
                },
                {
                    "sent": "So here we have this pipeline just as a black box.",
                    "label": 0
                },
                {
                    "sent": "And here's the data that we are planning to process, so we have.",
                    "label": 0
                },
                {
                    "sent": "All of the SM ES, as I said in the beginning, are providing data in different forms and different from different sources and different languages and so on.",
                    "label": 0
                },
                {
                    "sent": "And then we run this through the pipeline and now.",
                    "label": 0
                },
                {
                    "sent": "It's also something that I really like about the project.",
                    "label": 0
                },
                {
                    "sent": "We have three different use cases for of course, for every use case partner we have fun use case, but the nice thing is that they can be stacked on top of each other, so we have.",
                    "label": 0
                },
                {
                    "sent": "In the beginning we only have this search use case and then the results of the search use case are combined with the monitor use case by Rico and the results again monitored by the explain use case from ikhanda.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We have something that is, in my opinion, quite rare for you project as far as I've seen is that we have actually something that also the use case is built on top of each other.",
                    "label": 0
                },
                {
                    "sent": "Often the use case partners don't interact at all.",
                    "label": 0
                },
                {
                    "sent": "So here we have this situation that we really basically equal is also evaluating the results of the use case and so on.",
                    "label": 0
                },
                {
                    "sent": "Some kind of sanity check on sanity check on top of each other.",
                    "label": 0
                },
                {
                    "sent": "And it's yeah, and it's all somehow related to E Commerce, especially frequently condo, so it's not that diverse.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Good then.",
                    "label": 0
                },
                {
                    "sent": "Let me briefly talk about what what's has to be done in the 1st.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "So how we want to structure this project is that we basically.",
                    "label": 0
                },
                {
                    "sent": "See each year separately, so we start after one year we start all over the whole process over and over again so we always start with the requirements analysis.",
                    "label": 0
                },
                {
                    "sent": "Then we do evaluate our techniques.",
                    "label": 0
                },
                {
                    "sent": "And in the end, have an evaluation and this usually some prototypes or demonstrators that we can show and test with our use case partners.",
                    "label": 0
                },
                {
                    "sent": "And at the end of every year we already have some running systems that can be shown evaluated and so on, and will also be shown then in their review meetings by the European Commission that are always after one year and then in the next year we.",
                    "label": 0
                },
                {
                    "sent": "Just check our lessons learned that we want we want we learned in the year before and start the whole process over again.",
                    "label": 0
                },
                {
                    "sent": "Hum.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So coming to the.",
                    "label": 0
                },
                {
                    "sent": "Research calls it now just for the first year.",
                    "label": 0
                },
                {
                    "sent": "So first of all, the important thing is we need to extract text from all content forms.",
                    "label": 1
                },
                {
                    "sent": "We need to annotate.",
                    "label": 1
                },
                {
                    "sent": "As much content as we can from different modalities with a common knowledge base and maybe this is for the first year, the most important thing is.",
                    "label": 0
                },
                {
                    "sent": "What we want to have is some kind of probably statistical method to compare content across media and across languages.",
                    "label": 0
                },
                {
                    "sent": "So I will talk about this later.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Concerning the engineering goals.",
                    "label": 0
                },
                {
                    "sent": "We need to of course model the metadata how we want to process this data.",
                    "label": 0
                },
                {
                    "sent": "In one comment pipeline and then also how we can do.",
                    "label": 0
                },
                {
                    "sent": "Proper search that is fast enough on a new real time stream.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Concerning the use cases.",
                    "label": 0
                },
                {
                    "sent": "In the first year, there's mostly this are two use case and this will be based on the search functionality and for also for the first year we have this early prototype of the Rico use case, but we won't have a Conda use case in the first year because of this building on top of each other, we couldn't just we will.",
                    "label": 0
                },
                {
                    "sent": "Of course we will work on the ikhanda use case, but we won't have the technology to really solve the problems of the counter use case.",
                    "label": 0
                },
                {
                    "sent": "Maybe we could start also yeah sure.",
                    "label": 0
                },
                {
                    "sent": "Some subset of the information doesn't depend on the use case.",
                    "label": 1
                },
                {
                    "sent": "Yeah yeah, but yeah, yeah, we can discuss this, but somehow we need to have this monitoring capability that we can monitor content and how good this works in the first year.",
                    "label": 0
                },
                {
                    "sent": "Let's see, but.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK then some random sidenote.",
                    "label": 0
                },
                {
                    "sent": "We will talk about this tomorrow and.",
                    "label": 0
                },
                {
                    "sent": "Due to some reasons that we will discuss tomorrow, we have internal deadlines that are different to the ones in the description of work 'cause we have to build technologies on top of each other and they you they wanted us to have all of the deliverables at the same month.",
                    "label": 0
                },
                {
                    "sent": "And of course this is like.",
                    "label": 0
                },
                {
                    "sent": "This cannot be combined, so.",
                    "label": 0
                },
                {
                    "sent": "We will talk about this tomorrow in the management session.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, finally the agenda for this meeting, so I'm drilling down to the concrete thing now.",
                    "label": 1
                },
                {
                    "sent": "So first of all, the agenda is also on Dropbox, so it might change and might be updated constantly and you can.",
                    "label": 0
                },
                {
                    "sent": "See you there.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Up-to-date version there.",
                    "label": 0
                },
                {
                    "sent": "So today is the day where the research partners present their previous work and what they plan to do in the first year.",
                    "label": 0
                },
                {
                    "sent": "Tomorrow is then about the data and the use cases and also about management dissemination, administrative issues and then the Wednesday is more more of a flexible day where their hands on tutorials and just discussions where we really need to have discussions to get some.",
                    "label": 1
                },
                {
                    "sent": "M Yeah initial stuff going.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Coming to the more interesting things in life.",
                    "label": 0
                },
                {
                    "sent": "And the dinner today will be at a Japanese restaurant, so it's.",
                    "label": 0
                },
                {
                    "sent": "Not sushi, not only sushi.",
                    "label": 0
                },
                {
                    "sent": "It's all mixed and total mix of Japanese food.",
                    "label": 0
                },
                {
                    "sent": "Also like the more down to Earth, Japanese food and the interesting thing is you can order other iPads or you have get an iPad and you can pick what you want and they bring it here.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so you would propose to meet here.",
                    "label": 0
                },
                {
                    "sent": "Either meteor at 7:30 or if you want if you have some time and you want to discover the city, you can also come at 8:00 PM directly to the restaurant.",
                    "label": 1
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK tomorrow will be.",
                    "label": 0
                },
                {
                    "sent": "Will be burgers and sausages because I thought maybe we should also have some German style food but.",
                    "label": 0
                },
                {
                    "sent": "But it's actually very.",
                    "label": 0
                },
                {
                    "sent": "Is the sausages are very German?",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but that's actually much more fancy than it sounds.",
                    "label": 0
                },
                {
                    "sent": "So in this case it's not.",
                    "label": 0
                },
                {
                    "sent": "It's also close to where we are tonight.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I'll meet.",
                    "label": 0
                },
                {
                    "sent": "Yeah I remember one thing this this is in principle, it's all you can eat, but we have to pay extra extra for everything.",
                    "label": 0
                },
                {
                    "sent": "That's not that you don't eat, so if you don't like it it's fine.",
                    "label": 0
                },
                {
                    "sent": "But if you order too much and you just can't eat it because you're full, we have to pay for it.",
                    "label": 0
                },
                {
                    "sent": "So this is this is like the extra constraint for this chip in this place.",
                    "label": 0
                },
                {
                    "sent": "So just take it slowly and just don't like order 100 items right away.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is about scheduling the next meetings, but since Mark is not here yet, I would move this too, because he's probably the guy that's hardest to get.",
                    "label": 0
                },
                {
                    "sent": "Move this to tomorrow morning.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so some last words.",
                    "label": 0
                },
                {
                    "sent": "Before we start.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So about how I would as a coordinator would like to have this project is.",
                    "label": 0
                },
                {
                    "sent": "I'm not a big fan of reporting and management is on your nose.",
                    "label": 0
                },
                {
                    "sent": "So I'm much more interested in research and development.",
                    "label": 0
                },
                {
                    "sent": "So I my philosophy is we should start with rather with trust, fairness and common sense before we just go by all of the rules and regulations.",
                    "label": 1
                },
                {
                    "sent": "I mean we now have all the rules and regulations in place, but my opinion is just think about what's sensible to do and you don't need to read all of this stuff.",
                    "label": 0
                },
                {
                    "sent": "So as long as nothing bad happens and no one complaints, I would just act as you always do and this should be fine.",
                    "label": 0
                },
                {
                    "sent": "Don't worry too much about all of this.",
                    "label": 0
                },
                {
                    "sent": "Who will send you regulations that are now somewhere written.",
                    "label": 0
                },
                {
                    "sent": "So I don't like micromanagement at all and I also like real world data and applications of theoretical concepts or for the for the research partners just presenting some ideas that you have and you have tested this on.",
                    "label": 0
                },
                {
                    "sent": "I don't, I don't know some toy word problem that's.",
                    "label": 0
                },
                {
                    "sent": "It's not going to help the project a lot.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "Now really, the final slide.",
                    "label": 0
                },
                {
                    "sent": "The goal of this meeting is mostly get to know each other and learn about new stuff, but other peoples do.",
                    "label": 1
                },
                {
                    "sent": "And then a little bit more serious plan the first year and initiate the implementation.",
                    "label": 0
                },
                {
                    "sent": "That's for the third year, and so the.",
                    "label": 0
                },
                {
                    "sent": "Basic message messages talk to each other as much as you can and discuss and ask questions.",
                    "label": 0
                },
                {
                    "sent": "This is the most important thing.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Final, my final word is.",
                    "label": 0
                },
                {
                    "sent": "I think we have a promising setup with this project.",
                    "label": 0
                },
                {
                    "sent": "We have a lot of pre existing technology that we can build on.",
                    "label": 0
                },
                {
                    "sent": "We have good people and let's use this opportunity.",
                    "label": 1
                },
                {
                    "sent": "OK thank you.",
                    "label": 0
                }
            ]
        }
    }
}