{
    "id": "y4zcs4giat4lnsdgzuzbbywfgvhnrlri",
    "title": "P2 Pilot Applications Workplan Review",
    "info": {
        "author": [
            "Tatjana Bolič, Venice International University"
        ],
        "published": "Feb. 20, 2008",
        "recorded": "February 2008",
        "category": [
            "Top->Computer Science->Software and Tools"
        ]
    },
    "url": "http://videolectures.net/ekom08_bolic_ppa/",
    "segmentation": [
        [
            "Now.",
            "We go to the P2 leader.",
            "Which is Venice International University?",
            "And Tonya bullish will give us.",
            "Daniel Tatiana.",
            "It depends.",
            "Will give us a presentation on this project.",
            "Hello, so I'm here to introduce the P2 and I'm trying.",
            "I'm going to try to keep it as short as possible.",
            "And to keep it as annoying as possible, as least annoying as possible.",
            "And so basically what is a P2P2 is just introducing the pilots and testing the technology we come up in."
        ],
        [
            "The real world.",
            "So in the agenda Ghana.",
            "Give you just a couple of words, an introduction.",
            "Then go quickly through objectives and expected results of the work package of each work package and in which we can just see quickly what are the main activities and tasks and then just to summarize, to have common pilots methodology because you will see that eventually, even though many of the tasks have different names, they are essentially the same thing and they are.",
            "In, uh, they are broken down in different time frames because they really depend on on where we apply those pilots on a different needs of a different.",
            "Let's say users of for intelligent cargo and just put there as issues to address.",
            "If anybody can come up with them now and then, we can discuss them on the third day in the in the workshop."
        ],
        [
            "So P2 as you say, start getting to the translation of the technology into the benefits to the end users.",
            "We will focus on obtaining requirements from end users to be used as an input into P1 and after that going through the continuous feedback.",
            "Do the trials to test and assess this new technology and demonstrate through pilots.",
            "What are the benefits for the various end users and try to get out the glitches that are not benefits for the end users?",
            "Our pilots are to be designed by taking into account the requirements of different stakeholders is already mentioned.",
            "We're going to have a very different.",
            "Players that come from different parts of either logistics chains or whoever deals with the cargo, so have producers and distributors, intermodal operators, logistics operators, and public authorities and logistics infrastructure managers.",
            "Of course, since we are all very, they have very different requirements.",
            "Therefore, in the pilots package we have two different work packages that are doing the horizontal activities that are common to all the pilots.",
            "I choose the work package 21, which is consolidation of St results into a shared platform.",
            "So we will all share same platform to do our pilots and then the work package 22 that will provide us with the.",
            "Planning methodology and assessment of the pilots so that we all have the same benchmarks on which we will go for.",
            "Assets are pilots, of course they will probably differ one from another, but at least to have a great part of it that are."
        ],
        [
            "The same.",
            "So again, this is the same thing as you see that we have the horizontal activities and then the actual the actual pilot."
        ],
        [
            "So.",
            "The 21 I decide this.",
            "The objective is to realize a common platform and it will provide integration of approaches, methodologies and components to be reliable, accessible, and effective.",
            "The infrastructure for deployment of services and pilot user applications and it will also provide Technical Support, support an infrastructure maintenance.",
            "Well, we expect out of it to have integrated methodology for intelligent cargo applications.",
            "Combining methods and solutions from coming from the research, and in that we will.",
            "It will incorporate and users applications that are applicable to different pilots.",
            "And that will create the common testbed for all the pilots.",
            "So, as we've seen already, that the structure of the whole auditor is very complex, and we really need to focus on sharing information between all the different, all the projects P1P2 and P3 you can see here that it's a work package 21 will receive three kinds of inputs from P1 approaches and prototypes made available by SD activities from P2 requirements and use cases specifications from pilot scenarios.",
            "And from P3 issues and requirements derived from business models, which I'd.",
            "Say this is also very, very important, because otherwise if we don't get into the business models, we're not going to."
        ],
        [
            "Not anywhere.",
            "So the.",
            "VP 21 This is the timeline and its tasks.",
            "We can go quickly through every."
        ],
        [
            "Three each and every one of them.",
            "So we have integrated platform specifications and my thought methodology."
        ],
        [
            "Then the end user applications that are going to be based on the pilot use cases, which means we need to talk.",
            "We all need to talk to each other.",
            "And share information."
        ],
        [
            "Then we go through the two.",
            "They need to create the integrated platform an implement it, and this is the platform to be used as a common test, but for different pilot cases."
        ],
        [
            "Which I can assure you that also not going to be an easy task."
        ],
        [
            "And then integrated platform maintenance and support too.",
            "Enable the work of course."
        ],
        [
            "This work package has also its milestones, in which month 18 they need to provide your edition methodological framework.",
            "Then at the end of the year 2 basic user applications and integrated platform first release.",
            "At 9:30 advanced user applications and integrated plans from final release and then at the at the end of the project to have integrated platform maintenance feedback.",
            "Let me go to the sex."
        ],
        [
            "Print horizontal."
        ],
        [
            "The package just pilots management and assessment and the objective here is to define and plan the most effective way to assess and validate every teacher results.",
            "Our specific goals there are to accompany the pilot innovation process from early from early business needs assessment to validation of adoption of a religious solutions.",
            "Need to facilitate information exchange among pilot cases and consolidate the pilots feedback to the SD activities.",
            "And identify measurable criteria an instruments for measurements like questionnaires, interviews, observations, etc.",
            "Course each pilot will be focused on specific groups of users and set of IC functions, and with this work package will aim at harmonizing requirements, planning and methodology's among these pilots.",
            "And we expect to have a common framework for pilot testing and management and assessment."
        ],
        [
            "Again, you see the the line of the different work packages and.",
            "Adult of the different tasks in the work package in which we have pilot case definition awareness create."
        ],
        [
            "Ocean and pilot site preparation.",
            "So planning all the activities before endure."
        ],
        [
            "Pilot then there is the finishing of.",
            "Business drivers and assessment criteria."
        ],
        [
            "In which we need to define the overall assessment methodology.",
            "In particular assessment of the performance of the general platform and then assessment of various requirements from pilots.",
            "How to do that?",
            "The requirements for both the assessment of platform and pilots will be broken down into performance criteria, which you see efficiency, flexibility, usability, confidentiality, security, frequency accuracy, and I'm sure some other are going to come up as we get into the work.",
            "And consequently, those performance criteria are going to be broken down into measurable metrics.",
            "And out of those metrics, then will be used to come up with the assessment of user perception and satisfaction in the seasons, etc.",
            "And of course, in this need to be defined, the tools that are needed for data gathering and calculation of results like questionnaires, interviews.",
            "Observation, etc."
        ],
        [
            "Then preparation and validation of field experiments."
        ],
        [
            "Which prepare the pilot cases and collect the information data from."
        ],
        [
            "All of the various experiments, pilot case and all."
        ],
        [
            "This isn't cross pilot analysis."
        ],
        [
            "And the information exchange."
        ],
        [
            "Management is you can see this goes throughout the whole.",
            "Timeline of the."
        ],
        [
            "Project so the milestones here are to consolidate plane plan of pilot experimentation and assessment.",
            "The finishing and approval of the Pilots assessment methodology.",
            "Initial assessment of the pilot's experiments.",
            "Pilots final assessment and validated methodologies and subsystems."
        ],
        [
            "And now we get into the the pilots in which these technologies are going to be.",
            "Use."
        ],
        [
            "Untested, so the first pilot is to production and distribution applications.",
            "In which, as an objective we see to select and develop scenarios in which intelligent cargo solutions and services will be tested and assessed according to the producers and distributors needs.",
            "While taking into account requirements of logistics and transport operators involved.",
            "Here we will the pilot.",
            "Main characteristics are that it's going to focus on buyer supplier relationship.",
            "It's going to be industry specific.",
            "It's going to involve fast moving consumer goods and eyewear.",
            "It's gonna deal with the global scale.",
            "It's going to be focused.",
            "We're going to try to make it focus on single items, and it will involve the integration of different actors and strong involvement of the small medium enterprises.",
            "So main goals are to have the optimizing to optimize logistics planning and management systems.",
            "And optimize logistics and transportation process control.",
            "With the monitoring trace ability.",
            "Retrieval's work in progress.",
            "So of course, expected result is to have tested and validated.",
            "How did each applications within the stakeholder group."
        ],
        [
            "So just to give you a little flavor of what the pilot is going to be in the food industry, specific sector is the fresh fishing products in which fresh fishing is relatively high value.",
            "It's very sensitive because it's perishable.",
            "We need to keep high quality control, has high turnover ratio, various laws are imposing control and information requirements on items on both items and processes.",
            "And there isn't a necessity of better management of disability codes in this case.",
            "We have a global logistics and transportation network fishing in Indian Ocean, bringing it to Europe, transporting the packed and sliced fish within Europe on tracks.",
            "So we have boats, planes, trucks, all the different players.",
            "Items of interest for IC Solutions consumer unit like a single tuna slides or packaging unit or logistics unit in the other pilot which is fashion industry, we are going to have involved a major producers of eyewear.",
            "They have about 75% percent of world market share and also their logistics operators here will also capture all major supply chain relationships between the leaders in those supply chain and the small to medium enterprises that are partners.",
            "Players in the chain and also the shipper and receiver parts again.",
            "Here we have global scenarios and networks and the necessity here is that global competition in this particular logistics.",
            "The environment is seriously put at risk due to a lack of suitable ICT solutions."
        ],
        [
            "So again, here we have these.",
            "The breakdown of task in which we have scenario definition and new challenges.",
            "Requirements assessment see logistics and transport planning, management and control system design and development, then.",
            "Integration and deployment pilot operation and Validation an expected results so we could go through each and every task breakdown, but eventually all the pilot cases in the end when you go for the each task breakdown."
        ],
        [
            "For example like this, what we need to do is at the logistics and transportation planning, management and control system design.",
            "What we need to do in this task is to design an integrated logistics and transportation planning planning management system, which is based on scenarios and requirements we collected from our stakeholders and identify specific user objectives.",
            "Data requirements an.",
            "Integrate these into the year this product with these prototypes."
        ],
        [
            "So more or less, each and every single one of these in all of the pilot cases is the same."
        ],
        [
            "Of course, at the end we need to do the the assessment of the benefits and."
        ],
        [
            "Pected results and the milestones in this particular case is the.",
            "Production and distribution logistics.",
            "Pilots requirement at the end of year one.",
            "At the end of year two to have logistics pilot prototype and at the end of year three to have production and distribution.",
            "Pilot separation.",
            "Feedback and evaluation."
        ],
        [
            "And VP 24 which is intermodal operator management pilot.",
            "Here the objective is to develop a management and operation information system for intermodal operations and demonstrate results.",
            "So such a thing as far as I could understand from reading the work package does not exist, so there's going to be a very interesting thing to do.",
            "The system will enable efficient planning, monitoring and management of intermodal operations and the sub goals are to create to create an intermodal operation management system information collection to support key performance indicators calculation etc to realize pilot prototype system and to have a real case based evaluation of developed solutions.",
            "Of course in this work package there will be in very very close relationship.",
            "With the work packages from Project one, what is are the expected results?",
            "Is operation and validation of the developed system."
        ],
        [
            "The pilot scope to describe a little bit more what it's going to do is.",
            "The intermodal in transportation in Europe is very low complex.",
            "Why can't they are very complex processes with many independent players, railway companies, other operators, and sure, many of you know that when you have railway companies.",
            "The wagons can go over cross the borders the locomotives have to stay.",
            "You need to switch.",
            "It's one railway company, then another, and it's very inert type of system and you have either operators.",
            "Of course there is A to have this type of system 1 needs the continuous access to unreal reliability of real time tracking and tracing information of the transport goods and the features that are to be demonstrated in this work package is vision of future tracking, global real time tracking and tracing, providing relevant status info than technical information in innovation is going to be the management system.",
            "To be.",
            "Done which would be supporting planning and operation of efficient transportation and the Business Innovation would be to create useful interface through which this all these management system and information would be accessed."
        ],
        [
            "Again, you see the the breakdown is very similar.",
            "There is the case scenario definition, then design and development and then design and development of a platform.",
            "Integration and prototype, realization and prototype evaluation and enhancement."
        ],
        [
            "So here the milestones are that the.",
            "Have the scenario and preliminary requirements at the Month 6.",
            "It's months 18 to have the requirements ready at month 24 to have pilot design at month 30 to have pilot demonstration at minus 36 to have feedback and evaluation of intermodal pilot."
        ],
        [
            "Then another."
        ],
        [
            "Work packages logistics operate their pilot.",
            "Its objective is to bring logistics operators into project an, exploit the components and technologies of editor according to the Horizontal VP 22 approach and will need to support real time functions for the logistics operators like moving, tracking, dynamic re planning and also offline functions like accounting and invoicing.",
            "So the key challenges in this work package.",
            "Our integration with existing ICT solutions of users and reengineering of business processes, workflow and data requirements of course.",
            "Again expected results is to have to validate the pilot applications."
        ],
        [
            "So the pilot scope there gonna be quite a number of pilots in this work package, but produces to develop synergies with their existing ICT solutions and platform.",
            "Like monitoring of rail network, Aker ports to integrate integrate IC solutions into the existing ERP system for bulk cargo in which to monitor the bulk cargo, which something like that as I gathered, does not exist much.",
            "Then Omega to enhance monitoring, deliveries to and from Romania by using LD Supply from solutions and also to include integrate that into its ERP system.",
            "You brother advice to continuous GSM tracking and tracing system to be integrated into the auto.",
            "Every teacher platform by means of two pilots.",
            "So mainly all of these pilots are going to focus on scenarios of automated proof of delivery of itemized or unitised cargo, then monitoring bulk cargo, mainly the carport and online monitoring of transportation process and."
        ],
        [
            "Reporting again, you can see that the task, again a very much very much similar to the other ones, which are the requirements, pilot, application design, integration and deployment operation and validation and formalization.",
            "No feedback.",
            "The mile"
        ],
        [
            "Songs are to have scenarios and preliminary requirements at month six at 18, logistics operators pilot requirements at 24 pilot application design at 30 pilots.",
            "Demonstrator systems an at 36 pilots, feedback and evaluation."
        ],
        [
            "Add the."
        ],
        [
            "Best Pilot is the authorities and infrastructure pilots.",
            "Last but not the least.",
            "The objective is to design and implement and assess pilot applications of the auditor for public authorities and logistics infrastructure.",
            "So what is expected from this pilot at the benefits is efficiency of cargo verification and document processing, specially at border crossing operations.",
            "In particular, the assessment of ultimate automated verification of container at the Port of Trieste and the trailers the as that that are at the borders.",
            "And then another benefit is the efficient infrastructure usage and traffic reduction in space in space.",
            "The real time synchronization of terminal access by communication with vehicle drivers.",
            "The key challenges are again the integration with existing ICT solutions.",
            "Tend to try to create minimal impact on users in terms of additional information that they would need and additional effort.",
            "Familiarization with new solutions.",
            "And of course, last, but not the least, security concerns.",
            "Sharing sensitive data with other entities and also making sure that the sharing data is actually the answer to our controls."
        ],
        [
            "So the pilot scope is it's gonna involve Port of Trieste and and as Doug of Caricia, which are the two main nodes of the Friuli Venezia Giulia region logistic system and it's aiming at assessing how the auditor technology can improve the internal and combined operations and the corresponding impact on the overall regional system.",
            "And then maybe we can.",
            "These benefits can be assessed.",
            "Benefits can be translated also to.",
            "To bigger regions, not only small region like this."
        ],
        [
            "So again, you see very similar task breakdown as in the previous."
        ],
        [
            "Pilots"
        ],
        [
            "The milestones here are again scenario, pretty preliminary requirements.",
            "Pilot requirements, final ones.",
            "Pilot applications design pilots, demonstrator system and pilots feedback and evaluation."
        ],
        [
            "So you can see that most of these pilots apart from the work package of the work package 21 and 22.",
            "All have the same type of methodology.",
            "The scenario new challenges then get the what are the requirements.",
            "We need to collect the requirements from end users and these requirements are based on the the industry needs.",
            "So what are the approaches?",
            "What are the key performance in this is?",
            "What are the systems use etc.",
            "So to get that's probably going to deal with a lot of interviewing, a lot of data collecting and then in the end to summarize all that data and give it as an input to to the SD research and also as an input to.",
            "To the P3.",
            "The business project.",
            "Then there is a system design in which we need to deal with main issues, data collection and warehousing solutions or applications, of course, employing you're ready to prototype and maybe we're going to need some customizing to get these applications for all the different stake holders.",
            "Support system then interfaces or interface."
        ],
        [
            "Let me have platform development.",
            "Um?",
            "To see what kind of solutions are applications to be found on the platform for each pilot, so I assume we'd probably want to go for a integrated platform.",
            "Then integration of the religious system into the existing ICT systems of different users, operation, validation and evaluation of these pilots and feedback capacity results feedback tuesti results for let's say future.",
            "Additions after the end of the project and also to the P3.",
            "So collect feedback and getting the potential new features."
        ],
        [
            "Course the key challenges in the whole pilot is integration with existing ICT solutions.",
            "Reengineering of business process and workflow, and possibly introducing minimal impact on users for which there is a strong need for collaboration with P3 needed.",
            "Then data requirements and of course, security concerns, especially in the in the pilots that are dealing with the authorities.",
            "So this is just in short, let's say short.",
            "All of the the overview of the pilots.",
            "More many of you are not going to be able to see in more details tomorrow on what are the requirements.",
            "So I think maybe you got an idea from here.",
            "Want to apologize to the to the work package leaders that they haven't introduced any of them, but I'm sure we'll have a chance to do that later on.",
            "Try to keep this short so we can get to lunch quite quickly.",
            "And with this side the finish.",
            "Are there any questions for Tonya?",
            "Well, just more than a question reminder that something that pilots are also very you useful to for is to create awareness for dissemination purposes.",
            "I know you will come later with the package with the P3, but this is important to keep in mind.",
            "Please keep in mind that pilots are very useful to powerful tool to create awareness between among other stakeholders are for this kind of project where you have all these different stakeholders.",
            "This is very important.",
            "Sure, I mean you notice to when we talked a bit about bridge, they have a very sectorial approach.",
            "We have a more user defined pilot to show that our technology works.",
            "We will in the P3 project that Bernard KOTC is going to present have a little bit more of an externalisation of this information.",
            "Did you want to add anything more to that?",
            "I agree 'cause I've seen.",
            "I worked on some things and if you don't have this part of either business model the finish and the change of work, the training if you don't have that, even the best thing for the best innovation with a lot of money.",
            "Putting just goes down the tubes.",
            "Any other questions?",
            "Thank you Tanya."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "We go to the P2 leader.",
                    "label": 0
                },
                {
                    "sent": "Which is Venice International University?",
                    "label": 1
                },
                {
                    "sent": "And Tonya bullish will give us.",
                    "label": 0
                },
                {
                    "sent": "Daniel Tatiana.",
                    "label": 0
                },
                {
                    "sent": "It depends.",
                    "label": 0
                },
                {
                    "sent": "Will give us a presentation on this project.",
                    "label": 0
                },
                {
                    "sent": "Hello, so I'm here to introduce the P2 and I'm trying.",
                    "label": 0
                },
                {
                    "sent": "I'm going to try to keep it as short as possible.",
                    "label": 0
                },
                {
                    "sent": "And to keep it as annoying as possible, as least annoying as possible.",
                    "label": 0
                },
                {
                    "sent": "And so basically what is a P2P2 is just introducing the pilots and testing the technology we come up in.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The real world.",
                    "label": 0
                },
                {
                    "sent": "So in the agenda Ghana.",
                    "label": 0
                },
                {
                    "sent": "Give you just a couple of words, an introduction.",
                    "label": 0
                },
                {
                    "sent": "Then go quickly through objectives and expected results of the work package of each work package and in which we can just see quickly what are the main activities and tasks and then just to summarize, to have common pilots methodology because you will see that eventually, even though many of the tasks have different names, they are essentially the same thing and they are.",
                    "label": 1
                },
                {
                    "sent": "In, uh, they are broken down in different time frames because they really depend on on where we apply those pilots on a different needs of a different.",
                    "label": 1
                },
                {
                    "sent": "Let's say users of for intelligent cargo and just put there as issues to address.",
                    "label": 0
                },
                {
                    "sent": "If anybody can come up with them now and then, we can discuss them on the third day in the in the workshop.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So P2 as you say, start getting to the translation of the technology into the benefits to the end users.",
                    "label": 1
                },
                {
                    "sent": "We will focus on obtaining requirements from end users to be used as an input into P1 and after that going through the continuous feedback.",
                    "label": 1
                },
                {
                    "sent": "Do the trials to test and assess this new technology and demonstrate through pilots.",
                    "label": 0
                },
                {
                    "sent": "What are the benefits for the various end users and try to get out the glitches that are not benefits for the end users?",
                    "label": 0
                },
                {
                    "sent": "Our pilots are to be designed by taking into account the requirements of different stakeholders is already mentioned.",
                    "label": 1
                },
                {
                    "sent": "We're going to have a very different.",
                    "label": 0
                },
                {
                    "sent": "Players that come from different parts of either logistics chains or whoever deals with the cargo, so have producers and distributors, intermodal operators, logistics operators, and public authorities and logistics infrastructure managers.",
                    "label": 1
                },
                {
                    "sent": "Of course, since we are all very, they have very different requirements.",
                    "label": 0
                },
                {
                    "sent": "Therefore, in the pilots package we have two different work packages that are doing the horizontal activities that are common to all the pilots.",
                    "label": 0
                },
                {
                    "sent": "I choose the work package 21, which is consolidation of St results into a shared platform.",
                    "label": 0
                },
                {
                    "sent": "So we will all share same platform to do our pilots and then the work package 22 that will provide us with the.",
                    "label": 0
                },
                {
                    "sent": "Planning methodology and assessment of the pilots so that we all have the same benchmarks on which we will go for.",
                    "label": 0
                },
                {
                    "sent": "Assets are pilots, of course they will probably differ one from another, but at least to have a great part of it that are.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The same.",
                    "label": 0
                },
                {
                    "sent": "So again, this is the same thing as you see that we have the horizontal activities and then the actual the actual pilot.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The 21 I decide this.",
                    "label": 0
                },
                {
                    "sent": "The objective is to realize a common platform and it will provide integration of approaches, methodologies and components to be reliable, accessible, and effective.",
                    "label": 1
                },
                {
                    "sent": "The infrastructure for deployment of services and pilot user applications and it will also provide Technical Support, support an infrastructure maintenance.",
                    "label": 0
                },
                {
                    "sent": "Well, we expect out of it to have integrated methodology for intelligent cargo applications.",
                    "label": 0
                },
                {
                    "sent": "Combining methods and solutions from coming from the research, and in that we will.",
                    "label": 0
                },
                {
                    "sent": "It will incorporate and users applications that are applicable to different pilots.",
                    "label": 1
                },
                {
                    "sent": "And that will create the common testbed for all the pilots.",
                    "label": 0
                },
                {
                    "sent": "So, as we've seen already, that the structure of the whole auditor is very complex, and we really need to focus on sharing information between all the different, all the projects P1P2 and P3 you can see here that it's a work package 21 will receive three kinds of inputs from P1 approaches and prototypes made available by SD activities from P2 requirements and use cases specifications from pilot scenarios.",
                    "label": 1
                },
                {
                    "sent": "And from P3 issues and requirements derived from business models, which I'd.",
                    "label": 0
                },
                {
                    "sent": "Say this is also very, very important, because otherwise if we don't get into the business models, we're not going to.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Not anywhere.",
                    "label": 0
                },
                {
                    "sent": "So the.",
                    "label": 0
                },
                {
                    "sent": "VP 21 This is the timeline and its tasks.",
                    "label": 0
                },
                {
                    "sent": "We can go quickly through every.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Three each and every one of them.",
                    "label": 0
                },
                {
                    "sent": "So we have integrated platform specifications and my thought methodology.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then the end user applications that are going to be based on the pilot use cases, which means we need to talk.",
                    "label": 0
                },
                {
                    "sent": "We all need to talk to each other.",
                    "label": 0
                },
                {
                    "sent": "And share information.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then we go through the two.",
                    "label": 0
                },
                {
                    "sent": "They need to create the integrated platform an implement it, and this is the platform to be used as a common test, but for different pilot cases.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which I can assure you that also not going to be an easy task.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then integrated platform maintenance and support too.",
                    "label": 0
                },
                {
                    "sent": "Enable the work of course.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This work package has also its milestones, in which month 18 they need to provide your edition methodological framework.",
                    "label": 0
                },
                {
                    "sent": "Then at the end of the year 2 basic user applications and integrated platform first release.",
                    "label": 0
                },
                {
                    "sent": "At 9:30 advanced user applications and integrated plans from final release and then at the at the end of the project to have integrated platform maintenance feedback.",
                    "label": 0
                },
                {
                    "sent": "Let me go to the sex.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Print horizontal.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The package just pilots management and assessment and the objective here is to define and plan the most effective way to assess and validate every teacher results.",
                    "label": 1
                },
                {
                    "sent": "Our specific goals there are to accompany the pilot innovation process from early from early business needs assessment to validation of adoption of a religious solutions.",
                    "label": 1
                },
                {
                    "sent": "Need to facilitate information exchange among pilot cases and consolidate the pilots feedback to the SD activities.",
                    "label": 1
                },
                {
                    "sent": "And identify measurable criteria an instruments for measurements like questionnaires, interviews, observations, etc.",
                    "label": 0
                },
                {
                    "sent": "Course each pilot will be focused on specific groups of users and set of IC functions, and with this work package will aim at harmonizing requirements, planning and methodology's among these pilots.",
                    "label": 1
                },
                {
                    "sent": "And we expect to have a common framework for pilot testing and management and assessment.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Again, you see the the line of the different work packages and.",
                    "label": 0
                },
                {
                    "sent": "Adult of the different tasks in the work package in which we have pilot case definition awareness create.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ocean and pilot site preparation.",
                    "label": 0
                },
                {
                    "sent": "So planning all the activities before endure.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Pilot then there is the finishing of.",
                    "label": 0
                },
                {
                    "sent": "Business drivers and assessment criteria.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In which we need to define the overall assessment methodology.",
                    "label": 1
                },
                {
                    "sent": "In particular assessment of the performance of the general platform and then assessment of various requirements from pilots.",
                    "label": 1
                },
                {
                    "sent": "How to do that?",
                    "label": 1
                },
                {
                    "sent": "The requirements for both the assessment of platform and pilots will be broken down into performance criteria, which you see efficiency, flexibility, usability, confidentiality, security, frequency accuracy, and I'm sure some other are going to come up as we get into the work.",
                    "label": 0
                },
                {
                    "sent": "And consequently, those performance criteria are going to be broken down into measurable metrics.",
                    "label": 1
                },
                {
                    "sent": "And out of those metrics, then will be used to come up with the assessment of user perception and satisfaction in the seasons, etc.",
                    "label": 0
                },
                {
                    "sent": "And of course, in this need to be defined, the tools that are needed for data gathering and calculation of results like questionnaires, interviews.",
                    "label": 0
                },
                {
                    "sent": "Observation, etc.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then preparation and validation of field experiments.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which prepare the pilot cases and collect the information data from.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All of the various experiments, pilot case and all.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This isn't cross pilot analysis.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the information exchange.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Management is you can see this goes throughout the whole.",
                    "label": 0
                },
                {
                    "sent": "Timeline of the.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Project so the milestones here are to consolidate plane plan of pilot experimentation and assessment.",
                    "label": 0
                },
                {
                    "sent": "The finishing and approval of the Pilots assessment methodology.",
                    "label": 0
                },
                {
                    "sent": "Initial assessment of the pilot's experiments.",
                    "label": 0
                },
                {
                    "sent": "Pilots final assessment and validated methodologies and subsystems.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And now we get into the the pilots in which these technologies are going to be.",
                    "label": 0
                },
                {
                    "sent": "Use.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Untested, so the first pilot is to production and distribution applications.",
                    "label": 1
                },
                {
                    "sent": "In which, as an objective we see to select and develop scenarios in which intelligent cargo solutions and services will be tested and assessed according to the producers and distributors needs.",
                    "label": 1
                },
                {
                    "sent": "While taking into account requirements of logistics and transport operators involved.",
                    "label": 0
                },
                {
                    "sent": "Here we will the pilot.",
                    "label": 0
                },
                {
                    "sent": "Main characteristics are that it's going to focus on buyer supplier relationship.",
                    "label": 1
                },
                {
                    "sent": "It's going to be industry specific.",
                    "label": 1
                },
                {
                    "sent": "It's going to involve fast moving consumer goods and eyewear.",
                    "label": 0
                },
                {
                    "sent": "It's gonna deal with the global scale.",
                    "label": 1
                },
                {
                    "sent": "It's going to be focused.",
                    "label": 0
                },
                {
                    "sent": "We're going to try to make it focus on single items, and it will involve the integration of different actors and strong involvement of the small medium enterprises.",
                    "label": 1
                },
                {
                    "sent": "So main goals are to have the optimizing to optimize logistics planning and management systems.",
                    "label": 0
                },
                {
                    "sent": "And optimize logistics and transportation process control.",
                    "label": 0
                },
                {
                    "sent": "With the monitoring trace ability.",
                    "label": 1
                },
                {
                    "sent": "Retrieval's work in progress.",
                    "label": 0
                },
                {
                    "sent": "So of course, expected result is to have tested and validated.",
                    "label": 0
                },
                {
                    "sent": "How did each applications within the stakeholder group.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So just to give you a little flavor of what the pilot is going to be in the food industry, specific sector is the fresh fishing products in which fresh fishing is relatively high value.",
                    "label": 0
                },
                {
                    "sent": "It's very sensitive because it's perishable.",
                    "label": 0
                },
                {
                    "sent": "We need to keep high quality control, has high turnover ratio, various laws are imposing control and information requirements on items on both items and processes.",
                    "label": 1
                },
                {
                    "sent": "And there isn't a necessity of better management of disability codes in this case.",
                    "label": 0
                },
                {
                    "sent": "We have a global logistics and transportation network fishing in Indian Ocean, bringing it to Europe, transporting the packed and sliced fish within Europe on tracks.",
                    "label": 0
                },
                {
                    "sent": "So we have boats, planes, trucks, all the different players.",
                    "label": 1
                },
                {
                    "sent": "Items of interest for IC Solutions consumer unit like a single tuna slides or packaging unit or logistics unit in the other pilot which is fashion industry, we are going to have involved a major producers of eyewear.",
                    "label": 0
                },
                {
                    "sent": "They have about 75% percent of world market share and also their logistics operators here will also capture all major supply chain relationships between the leaders in those supply chain and the small to medium enterprises that are partners.",
                    "label": 0
                },
                {
                    "sent": "Players in the chain and also the shipper and receiver parts again.",
                    "label": 0
                },
                {
                    "sent": "Here we have global scenarios and networks and the necessity here is that global competition in this particular logistics.",
                    "label": 1
                },
                {
                    "sent": "The environment is seriously put at risk due to a lack of suitable ICT solutions.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So again, here we have these.",
                    "label": 0
                },
                {
                    "sent": "The breakdown of task in which we have scenario definition and new challenges.",
                    "label": 1
                },
                {
                    "sent": "Requirements assessment see logistics and transport planning, management and control system design and development, then.",
                    "label": 1
                },
                {
                    "sent": "Integration and deployment pilot operation and Validation an expected results so we could go through each and every task breakdown, but eventually all the pilot cases in the end when you go for the each task breakdown.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For example like this, what we need to do is at the logistics and transportation planning, management and control system design.",
                    "label": 1
                },
                {
                    "sent": "What we need to do in this task is to design an integrated logistics and transportation planning planning management system, which is based on scenarios and requirements we collected from our stakeholders and identify specific user objectives.",
                    "label": 1
                },
                {
                    "sent": "Data requirements an.",
                    "label": 0
                },
                {
                    "sent": "Integrate these into the year this product with these prototypes.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So more or less, each and every single one of these in all of the pilot cases is the same.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of course, at the end we need to do the the assessment of the benefits and.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Pected results and the milestones in this particular case is the.",
                    "label": 0
                },
                {
                    "sent": "Production and distribution logistics.",
                    "label": 0
                },
                {
                    "sent": "Pilots requirement at the end of year one.",
                    "label": 1
                },
                {
                    "sent": "At the end of year two to have logistics pilot prototype and at the end of year three to have production and distribution.",
                    "label": 1
                },
                {
                    "sent": "Pilot separation.",
                    "label": 0
                },
                {
                    "sent": "Feedback and evaluation.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And VP 24 which is intermodal operator management pilot.",
                    "label": 1
                },
                {
                    "sent": "Here the objective is to develop a management and operation information system for intermodal operations and demonstrate results.",
                    "label": 1
                },
                {
                    "sent": "So such a thing as far as I could understand from reading the work package does not exist, so there's going to be a very interesting thing to do.",
                    "label": 0
                },
                {
                    "sent": "The system will enable efficient planning, monitoring and management of intermodal operations and the sub goals are to create to create an intermodal operation management system information collection to support key performance indicators calculation etc to realize pilot prototype system and to have a real case based evaluation of developed solutions.",
                    "label": 1
                },
                {
                    "sent": "Of course in this work package there will be in very very close relationship.",
                    "label": 1
                },
                {
                    "sent": "With the work packages from Project one, what is are the expected results?",
                    "label": 0
                },
                {
                    "sent": "Is operation and validation of the developed system.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The pilot scope to describe a little bit more what it's going to do is.",
                    "label": 0
                },
                {
                    "sent": "The intermodal in transportation in Europe is very low complex.",
                    "label": 1
                },
                {
                    "sent": "Why can't they are very complex processes with many independent players, railway companies, other operators, and sure, many of you know that when you have railway companies.",
                    "label": 1
                },
                {
                    "sent": "The wagons can go over cross the borders the locomotives have to stay.",
                    "label": 0
                },
                {
                    "sent": "You need to switch.",
                    "label": 0
                },
                {
                    "sent": "It's one railway company, then another, and it's very inert type of system and you have either operators.",
                    "label": 0
                },
                {
                    "sent": "Of course there is A to have this type of system 1 needs the continuous access to unreal reliability of real time tracking and tracing information of the transport goods and the features that are to be demonstrated in this work package is vision of future tracking, global real time tracking and tracing, providing relevant status info than technical information in innovation is going to be the management system.",
                    "label": 1
                },
                {
                    "sent": "To be.",
                    "label": 0
                },
                {
                    "sent": "Done which would be supporting planning and operation of efficient transportation and the Business Innovation would be to create useful interface through which this all these management system and information would be accessed.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Again, you see the the breakdown is very similar.",
                    "label": 0
                },
                {
                    "sent": "There is the case scenario definition, then design and development and then design and development of a platform.",
                    "label": 1
                },
                {
                    "sent": "Integration and prototype, realization and prototype evaluation and enhancement.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here the milestones are that the.",
                    "label": 0
                },
                {
                    "sent": "Have the scenario and preliminary requirements at the Month 6.",
                    "label": 0
                },
                {
                    "sent": "It's months 18 to have the requirements ready at month 24 to have pilot design at month 30 to have pilot demonstration at minus 36 to have feedback and evaluation of intermodal pilot.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then another.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Work packages logistics operate their pilot.",
                    "label": 0
                },
                {
                    "sent": "Its objective is to bring logistics operators into project an, exploit the components and technologies of editor according to the Horizontal VP 22 approach and will need to support real time functions for the logistics operators like moving, tracking, dynamic re planning and also offline functions like accounting and invoicing.",
                    "label": 1
                },
                {
                    "sent": "So the key challenges in this work package.",
                    "label": 1
                },
                {
                    "sent": "Our integration with existing ICT solutions of users and reengineering of business processes, workflow and data requirements of course.",
                    "label": 1
                },
                {
                    "sent": "Again expected results is to have to validate the pilot applications.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the pilot scope there gonna be quite a number of pilots in this work package, but produces to develop synergies with their existing ICT solutions and platform.",
                    "label": 1
                },
                {
                    "sent": "Like monitoring of rail network, Aker ports to integrate integrate IC solutions into the existing ERP system for bulk cargo in which to monitor the bulk cargo, which something like that as I gathered, does not exist much.",
                    "label": 1
                },
                {
                    "sent": "Then Omega to enhance monitoring, deliveries to and from Romania by using LD Supply from solutions and also to include integrate that into its ERP system.",
                    "label": 1
                },
                {
                    "sent": "You brother advice to continuous GSM tracking and tracing system to be integrated into the auto.",
                    "label": 1
                },
                {
                    "sent": "Every teacher platform by means of two pilots.",
                    "label": 0
                },
                {
                    "sent": "So mainly all of these pilots are going to focus on scenarios of automated proof of delivery of itemized or unitised cargo, then monitoring bulk cargo, mainly the carport and online monitoring of transportation process and.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Reporting again, you can see that the task, again a very much very much similar to the other ones, which are the requirements, pilot, application design, integration and deployment operation and validation and formalization.",
                    "label": 1
                },
                {
                    "sent": "No feedback.",
                    "label": 0
                },
                {
                    "sent": "The mile",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Songs are to have scenarios and preliminary requirements at month six at 18, logistics operators pilot requirements at 24 pilot application design at 30 pilots.",
                    "label": 0
                },
                {
                    "sent": "Demonstrator systems an at 36 pilots, feedback and evaluation.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Add the.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Best Pilot is the authorities and infrastructure pilots.",
                    "label": 0
                },
                {
                    "sent": "Last but not the least.",
                    "label": 0
                },
                {
                    "sent": "The objective is to design and implement and assess pilot applications of the auditor for public authorities and logistics infrastructure.",
                    "label": 1
                },
                {
                    "sent": "So what is expected from this pilot at the benefits is efficiency of cargo verification and document processing, specially at border crossing operations.",
                    "label": 1
                },
                {
                    "sent": "In particular, the assessment of ultimate automated verification of container at the Port of Trieste and the trailers the as that that are at the borders.",
                    "label": 1
                },
                {
                    "sent": "And then another benefit is the efficient infrastructure usage and traffic reduction in space in space.",
                    "label": 1
                },
                {
                    "sent": "The real time synchronization of terminal access by communication with vehicle drivers.",
                    "label": 0
                },
                {
                    "sent": "The key challenges are again the integration with existing ICT solutions.",
                    "label": 0
                },
                {
                    "sent": "Tend to try to create minimal impact on users in terms of additional information that they would need and additional effort.",
                    "label": 0
                },
                {
                    "sent": "Familiarization with new solutions.",
                    "label": 0
                },
                {
                    "sent": "And of course, last, but not the least, security concerns.",
                    "label": 0
                },
                {
                    "sent": "Sharing sensitive data with other entities and also making sure that the sharing data is actually the answer to our controls.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the pilot scope is it's gonna involve Port of Trieste and and as Doug of Caricia, which are the two main nodes of the Friuli Venezia Giulia region logistic system and it's aiming at assessing how the auditor technology can improve the internal and combined operations and the corresponding impact on the overall regional system.",
                    "label": 1
                },
                {
                    "sent": "And then maybe we can.",
                    "label": 0
                },
                {
                    "sent": "These benefits can be assessed.",
                    "label": 0
                },
                {
                    "sent": "Benefits can be translated also to.",
                    "label": 0
                },
                {
                    "sent": "To bigger regions, not only small region like this.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So again, you see very similar task breakdown as in the previous.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Pilots",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The milestones here are again scenario, pretty preliminary requirements.",
                    "label": 0
                },
                {
                    "sent": "Pilot requirements, final ones.",
                    "label": 0
                },
                {
                    "sent": "Pilot applications design pilots, demonstrator system and pilots feedback and evaluation.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So you can see that most of these pilots apart from the work package of the work package 21 and 22.",
                    "label": 0
                },
                {
                    "sent": "All have the same type of methodology.",
                    "label": 0
                },
                {
                    "sent": "The scenario new challenges then get the what are the requirements.",
                    "label": 1
                },
                {
                    "sent": "We need to collect the requirements from end users and these requirements are based on the the industry needs.",
                    "label": 1
                },
                {
                    "sent": "So what are the approaches?",
                    "label": 0
                },
                {
                    "sent": "What are the key performance in this is?",
                    "label": 0
                },
                {
                    "sent": "What are the systems use etc.",
                    "label": 0
                },
                {
                    "sent": "So to get that's probably going to deal with a lot of interviewing, a lot of data collecting and then in the end to summarize all that data and give it as an input to to the SD research and also as an input to.",
                    "label": 0
                },
                {
                    "sent": "To the P3.",
                    "label": 0
                },
                {
                    "sent": "The business project.",
                    "label": 0
                },
                {
                    "sent": "Then there is a system design in which we need to deal with main issues, data collection and warehousing solutions or applications, of course, employing you're ready to prototype and maybe we're going to need some customizing to get these applications for all the different stake holders.",
                    "label": 1
                },
                {
                    "sent": "Support system then interfaces or interface.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let me have platform development.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "To see what kind of solutions are applications to be found on the platform for each pilot, so I assume we'd probably want to go for a integrated platform.",
                    "label": 1
                },
                {
                    "sent": "Then integration of the religious system into the existing ICT systems of different users, operation, validation and evaluation of these pilots and feedback capacity results feedback tuesti results for let's say future.",
                    "label": 1
                },
                {
                    "sent": "Additions after the end of the project and also to the P3.",
                    "label": 0
                },
                {
                    "sent": "So collect feedback and getting the potential new features.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Course the key challenges in the whole pilot is integration with existing ICT solutions.",
                    "label": 0
                },
                {
                    "sent": "Reengineering of business process and workflow, and possibly introducing minimal impact on users for which there is a strong need for collaboration with P3 needed.",
                    "label": 1
                },
                {
                    "sent": "Then data requirements and of course, security concerns, especially in the in the pilots that are dealing with the authorities.",
                    "label": 0
                },
                {
                    "sent": "So this is just in short, let's say short.",
                    "label": 0
                },
                {
                    "sent": "All of the the overview of the pilots.",
                    "label": 0
                },
                {
                    "sent": "More many of you are not going to be able to see in more details tomorrow on what are the requirements.",
                    "label": 0
                },
                {
                    "sent": "So I think maybe you got an idea from here.",
                    "label": 0
                },
                {
                    "sent": "Want to apologize to the to the work package leaders that they haven't introduced any of them, but I'm sure we'll have a chance to do that later on.",
                    "label": 0
                },
                {
                    "sent": "Try to keep this short so we can get to lunch quite quickly.",
                    "label": 0
                },
                {
                    "sent": "And with this side the finish.",
                    "label": 0
                },
                {
                    "sent": "Are there any questions for Tonya?",
                    "label": 0
                },
                {
                    "sent": "Well, just more than a question reminder that something that pilots are also very you useful to for is to create awareness for dissemination purposes.",
                    "label": 0
                },
                {
                    "sent": "I know you will come later with the package with the P3, but this is important to keep in mind.",
                    "label": 0
                },
                {
                    "sent": "Please keep in mind that pilots are very useful to powerful tool to create awareness between among other stakeholders are for this kind of project where you have all these different stakeholders.",
                    "label": 0
                },
                {
                    "sent": "This is very important.",
                    "label": 0
                },
                {
                    "sent": "Sure, I mean you notice to when we talked a bit about bridge, they have a very sectorial approach.",
                    "label": 0
                },
                {
                    "sent": "We have a more user defined pilot to show that our technology works.",
                    "label": 0
                },
                {
                    "sent": "We will in the P3 project that Bernard KOTC is going to present have a little bit more of an externalisation of this information.",
                    "label": 0
                },
                {
                    "sent": "Did you want to add anything more to that?",
                    "label": 0
                },
                {
                    "sent": "I agree 'cause I've seen.",
                    "label": 0
                },
                {
                    "sent": "I worked on some things and if you don't have this part of either business model the finish and the change of work, the training if you don't have that, even the best thing for the best innovation with a lot of money.",
                    "label": 0
                },
                {
                    "sent": "Putting just goes down the tubes.",
                    "label": 0
                },
                {
                    "sent": "Any other questions?",
                    "label": 0
                },
                {
                    "sent": "Thank you Tanya.",
                    "label": 0
                }
            ]
        }
    }
}