{
    "id": "y5p2t2ociddhnuvhqldmqbvkpfbnzizy",
    "title": "Optimization: Theory and Algorithms",
    "info": {
        "author": [
            "Robert Vanderbei, Department of Operations Research and Financial Engineering, Princeton University"
        ],
        "published": "Jan. 15, 2013",
        "recorded": "April 2012",
        "category": [
            "Top->Computer Science->Optimization Methods"
        ]
    },
    "url": "http://videolectures.net/mlss2012_vanderbei_theory_algorithms/",
    "segmentation": [
        [
            "Today we'll talk about linear programming and tored the end of the course on.",
            "On Monday, we'll move on to convex and more general nonlinear optimization."
        ],
        [
            "OK, so linear programming.",
            "I guess we should start with.",
            "What is it?",
            "So we want to maximize or minimize a linear function.",
            "Subject to constraints, of course, if we were just maximizing a linear function with no constraints, the problem would be rather simple.",
            "Infinity would generally be the answer and or a constant.",
            "So we have constraints and there's different ways one can pose the constraints.",
            "I call it standard form if the constraints are posed exactly like this, that you have some inequality's linear inequalities.",
            "So if this matrix A.",
            "Try to be consistent in my notation later and a will have M rows and N columns.",
            "And so we have X less than or equal to B and by less than or equal to be is an M vector and by less than or equal to?",
            "I mean that each component of the two of the vector on the left is smaller than or equal to the component on the right and also the vector X. I'll take to be non negative.",
            "Now you've may have encountered linear optimization problems already in your work and they may not have been in this form, but it's very easy to convert from one form to another form and and.",
            "I like this form and I call it standard form for reasons that I hope will become very clear.",
            "As these lectures proceed.",
            "So that's the problem.",
            "Many, many applications it's important, of course.",
            "Broadly and in machine learning applications.",
            "So the first thing we want to do is have an algorithm and the first step to the simplex method is to introduce something which I'll call a dictionary.",
            "And so all I'm doing here is I'm introducing a notation for the objective function.",
            "And I'm also introducing Slack variables that represent the how much of this inequality is deviates from being an equality, so W is just B -- A X is the difference between the right hand side and the left hand side, and so because of this inequality W should be greater than or equal to 0?",
            "And I call this a dictionary as because the variables on the right X define the variables on the left and this is of course completely trivial right here, but we're going to modify this dictionary on the next slide an the whole simplex method is based on iteratively modifying how we represent the dictionary.",
            "Associated with this dictionary and each of the subsequent ones that we're going to see is what we call a dictionary solution.",
            "An that's a particular.",
            "Potential solution to the problem, so it's a it's a.",
            "It's a candidate for a solution, but we'll just call it a solution and we'll just we'll distinguish it from the final solution, which will call the optimal solution.",
            "So the dictionary solution you simply get by you get by simply setting the X variables equal to 0 and reading off the WS completely trivial in this case, but it will become more interesting as we iterate things.",
            "Now, when you, so that's a particular solution associated with this way of writing the equations and if.",
            "Oh, and as we do that of course, then W is just equal to B and if B is greater equal to 0, then WS Chronicle zero and this dictionary would be feasible.",
            "It satisfies the constraints of the problem, might not be optimal, but if B is greater than equal to 0, it's feasible.",
            "If B is greater than zero, which makes it feasible and C is less than or equal to 0, then there's no further improvement that you can make, and this dictionary solution would be optimal for the problem, but not very many problems have the property that 00 is the optimal solution.",
            "And so we need to iterate generally.",
            "And."
        ],
        [
            "Let me.",
            "See here OK so.",
            "Here's how the simplex method goes.",
            "There's two things, there's feasibility and optimality, and I'm going to 1st discuss getting a feasible solution.",
            "Sorry, I'm first going to us going from a feasible solution to an optimal solution.",
            "So the primal simplex method refers to exactly that were feasible, and we're working our way toward optimality, and so the B in this picture would be greater nickel to 0, but the C is not all less than or equal to 0, and so I need to address that fact that the objective function can be improved.",
            "So I look at the objective function and say, well, if there's a index J for which the coefficient on that variable XJ is positive, then I could improve things by letting that variable increase.",
            "From the from zero, which is where it is in my dictionary solution.",
            "So I want to let that variable increase from zero and that will call that the entering variable.",
            "Maybe I should say right now the the word entering refers to these variables are over.",
            "Here are called basic variables.",
            "And you're entering the basis and these are called non basic variables.",
            "Of course.",
            "Right now these are just the original variables and there's a slacks, but but eventually they'll be more intertwined so.",
            "So XJ will enter, it will become one of the variables that's not 0.",
            "And we want to preserve this property of having a dictionary.",
            "So if I take one of the variables on the right and put it over on the left, I need to take one of the variables on the left and put it over on the right.",
            "In my system of equations here, just want to rewrite my system of equations with 1X J swapped with one of the WS.",
            "And so, how do we figure out which W has to go?",
            "So we picked this index J and we're increasing that particular variable XJ.",
            "All the other ones are equal to 0, and as we increase it, the column of this matrix associated with index with variable XJ starts to get subtracted off from the vector B.",
            "And vector B was critical to zero, 'cause we're feasible, and eventually one of these components of W will hit zero.",
            "Might happen right away, but but eventually it certainly should happen and.",
            "And so you look at the first index I, whereas you increase that one variable X.",
            "This B -- A times that column of B minus that call.",
            "The A matrix equals zero.",
            "You pick that I and that's our leaving variable.",
            "And now we just do algebraic rearrangement of the equations to put the variable XJ on the left and the variable WI on the right.",
            "And I will show you how to do this.",
            "I mean I'll show some examples in just a few seconds here, but it's trivial algebra.",
            "It's just exactly like Gaussian elimination, where you have.",
            "The entire Gaussian elimination where zeroing out one column in your in your process of inverting a matrix using Gaussian elimination and you'll see what I mean in just a minute.",
            "So we get this rearrangement.",
            "Now the X is in the double user get kind of mixed up and they get more and more mixed up as we do this several times and so in general the notation will be like this that I'll have some nonbasic variables, which I'll denote by X subscript N and that's a mix of the original X variables and the original W variables.",
            "They get all mixed up.",
            "And I have basic variables XB and that's the rest of the variables that are in the XN and the coefficients they get multiplied here will change its orbital tilt up here to indicate that this the numbers here are different 'cause we've done this Gaussian elimination type step, which we call a pivot by the way.",
            "And B&A also get changed, so I put tildes on top of that.",
            "But all the variables are still not negative and this is a completely equivalent way of writing the problem as this and that's the whole point.",
            "We go from this to this just by algebraic rearranging of the equations, but we could undo that rearrangement and go back from this back to that.",
            "So we haven't changed the problem.",
            "We've only represented it in a different way.",
            "We've taken our dictionary and we're defining different variables.",
            "We're taking a different set of variables are given fundamental variables and defining a different set of variables XB.",
            "And then we had a zero there, but as we do these iterations, we get a constant appearing here an that is the current value of the objective function and that will go up and up because we're maximizing.",
            "So we started at zero and they just are, will go higher and higher as we iterate.",
            "So let's see if I'm on the Internet.",
            "I can actually demo this.",
            "But I'm not, but I also have a local version, so skip doing that and I can demo it here.",
            "Let me just make sure it's feasable.",
            "The problem is little tool here doesn't always generate feasible problems.",
            "So there's a feasible problem right there.",
            "And so in this particular problem.",
            "I have two objective coefficients that are positive.",
            "I could pick either one of them as the entering variable, either X2 or X4.",
            "And.",
            "We have to make a decision, so I'll pick X2.",
            "I picked it because it has the larger coefficient, but there's no guaranteed benefit in that, it's just.",
            "Tempting, so I'm tempted and I'll pick X2.",
            "Now as I look down the column here so all these variables are equal to 0 in the dictionary solution associated with this dictionary.",
            "And now I'm thinking about improving that solution.",
            "So I want X2 which is currently equal to 0, wanted to increase and as it increases this one which is currently five starts to go up at a rate of two.",
            "And so this one is going to go up and I don't have to worry about this W 1 = 0 ever.",
            "And similarly with all the other ones that have a negative number inside this little box here and they have the negative outside, they're all going up so W1W 3W5.",
            "I don't worry bout but W2 and W4 going down W2 starting at 9 and going down to the rate of two so I can go 4 1/2 before that hit 0 W 4 is starting a starting at 2 and going down the rate of two so I can only go up to one so when X 2 = 1 here.",
            "W 4 = 0 and that's and that's the first one to hit 0, so W 4 should be my leaving variable.",
            "If X2 is my entering variable.",
            "And I'll do that in just a second, but let's just look over here.",
            "I could have chosen this one, but I'm not going to.",
            "If I did this one, I would have only these two to look at.",
            "So the four an is that a three there?",
            "So we're at 5.",
            "We're going down the rate of four that would hit zero after 1 1/4 after X4 gets up to 1 1/4.",
            "This is a nine.",
            "We're going down around 3:00 so X4 could go up to three before W 2 = 0.",
            "So if I were to pick X4 is by entering variable, then W one would be my leaving variable, so it's either this one or this one.",
            "So I'm going to pick this one.",
            "And now the algebra which.",
            "I think you can all do it.",
            "Let me just describe it without actually doing it.",
            "I want to put X2 on the left so I would just take this equation here and I would write X2 on the left so I bring 2X2 to this side.",
            "Bring W4 to that side, divide through by two that rearrange that equation.",
            "But then I have to eliminate X2 from all these equations up here by doing Gaussian elimination type steps here for example to get rid of X2 in the first in this row here.",
            "I have a + 2 here and have a -- 2 here.",
            "So if I took this row and added W4 to it so W 1 + W four and I just Add all these things it would be 5 + 2 is 7.",
            "Minus 3 + 4 is 1.",
            "This goes to 0 now, which is good.",
            "I wanted to get rid of X2 in this equation, but of course I have a plus W4 when I added it, so I'll subtract that W4 and put that in this slot.",
            "And similarly I go across here and I get I update all these coefficients.",
            "So it's a very simple update of just taking this coefficient might get the sign wrong, but something like this coefficient gets updated by taking this times this.",
            "Divided by that and subtracting.",
            "Something very simple like that.",
            "But anyway, because arithmetic isn't very fun, I made this little Java applet that does it all for me.",
            "So when I click this button it does that arithmetic.",
            "I believe that's the seven, and that's the minus one that I mentioned.",
            "And when I added the W4 I now subtract it over and there's the minus W4 appearing there and I divided by the two and that's why we see the 1/2 anyway.",
            "The Pivot tool does all the arithmetic correctly.",
            "The objective function was zero to start with, and now it's two.",
            "It's going up.",
            "We're trying to maximize and, but we're not optimal yet, because this new dictionary, the.",
            "The solution associated with it is not optimal because X4 has a positive coefficient and if I increase X4 from zero, I can make further improvement in the objective function 0.",
            "That's what I want to do next, so I do the same thing that I just did I look through here I have.",
            "To only look at the ones that are going down.",
            "So there's a -- 3 and minus four, and then these don't have to worry about so 7 going into rate going down the rate of 37 going up or down rate of four.",
            "That's the one that will hit zero first, so W2 is my leading variable.",
            "Effects four is my entering variable and so I just click on this little button here and it does the pivot and I'm done.",
            "And.",
            "And you can always check if you're right.",
            "Oh I, my volume was too low.",
            "There we go.",
            "If so, the buttons at the bottom are just for making assertions, and if you make an incorrect assertion, like if I were to say this was.",
            "Infeasible.",
            "I get Bart Simpson, you know Bart Simpson.",
            "Calling me a loser, OK?",
            "Somebody else is playing, or does it mean?",
            "Alright.",
            "So that is the simplex method."
        ],
        [
            "Now there are some issues that we have to discuss today.",
            "Go yes, there are some issues we have to discuss.",
            "Some problems are unbounded.",
            "The answer is Infinity.",
            "And how does how do you detect that with the simplex method?",
            "Here is a example that illustrates what can go wrong.",
            "So here's a.",
            "This is a dictionary and we could pick either X one to be the entering variable, or X3.",
            "And.",
            "If we pick X.",
            "3.",
            "We could do a pivot here.",
            "There would be no problem.",
            "I'd have look at the two of the three in the four and figure out which would be the leading very well.",
            "I do a pivot fine.",
            "But I'm greedy.",
            "I go with the one with the largest coefficient, so I pick X one to be my entering variable.",
            "And here in this case, being greedy really pays off, 'cause if I look down this column here.",
            "W one is going up at a rate of 5W twos going up at a rate of 0 W. 3 is not changing, W 4 is going up, W 5 is going up.",
            "There is nothing blocking X1 from going all the way to Infinity and so the problem is unbounded.",
            "And that's how the simplex method detects unboundedness.",
            "OK, so that's one thing that can go wrong, and that's why there's that."
        ],
        [
            "The button on the pivot tool thing to check now.",
            "I'm gonna show you.",
            "Three different algorithms for the simplex method over the next couple hours and this I want to show you the first one, so I haven't shown you the complete thing because I showed what I showed you assume that were feasible to start with and I only went from being feasible to being optimal, and that's really only half of what we have to do.",
            "We have to find a feasible solution to start with, and so that's called initialization.",
            "How do we get started with that first feasible solution?",
            "So here's a problem where I have some negative values on the right hand side.",
            "And what do I going to do about that?",
            "And so these three methods that I'm going to show you today are?",
            "Various ways of addressing the initialization problem.",
            "I want to start out with wanting to show you now because it's the simplest, quick and easy to explain.",
            "But as we move along I'll show you ones that I think are better, but this is very simple thing to do.",
            "Modify this problem just temporarily by subtracting a new variable, which I'll call X0 from each of the constraints.",
            "So put a -- X zero on each of these constraints.",
            "And for the moment, for the Phase one problem, change the objective function.",
            "Forget about this because for phase one I don't care what the objective is.",
            "I only want to get something that satisfies these constraints and once I get that, I'll reinstate the objective function and start what will call phase two, which is the algorithm I just showed you the primal simplex method.",
            "So.",
            "We put the X anadon."
        ],
        [
            "And.",
            "And so here it is.",
            "Gottex not in here.",
            "And.",
            "OK, so this is feasible.",
            "Huawei, is it feasible?",
            "I can let X not be a large number.",
            "And X1 and X2 X equals zero and I will satisfy these inequalities, so it's a feasible problem, But that's not a dictionary solution, that's just.",
            "The assertion that there's that there are solutions to this problem.",
            "Um?",
            "So I would like to solve this problem using the simplex method and if I get to the point where the objective function is equal to 0 then then that means that the original problem was feasible because X not was how I changed the original problem and so if I can make the change of the original problem equal to 0 then I've got a feasible solution to the original problem.",
            "So the final dictionary or the final basis.",
            "If you like the basic variables versus the non basic variables, the final basis that you get from this phase one problem can then be used as the initial starting point.",
            "For phase two you just throw away the X0, put the correct objective function back in and continue.",
            "If the optimal objective function to this phase one problem is strictly less than zero, that means we tried to maximize minus X zero, and we in the end didn't get to X equal to zero X 0 equal to zero.",
            "We got to X 0 equal to something positive, so the minus X zero is negative, and that means that there is no solution to the original problem.",
            "That means the original problem is infeasible."
        ],
        [
            "And so.",
            "So here's how that goes.",
            "Um?",
            "So.",
            "We can show a problem with X zero in here.",
            "And I and the applet that I developed for this two phase method, shows both the original objective function and the Phase one objective function right below it.",
            "And we do pivots and for phase one, even though it shows the original objective function, we ignore it and we just look at the Phase one objective function with the X -- X zero we do our pivots with this one and with the right hand side here.",
            "But the first if it's different because this is not feasible even for the phase.",
            "One problem is not feasable 'cause we've got these negative signs here.",
            "So the first pivot in this algorithm is special.",
            "The first pivot is at 0.",
            "Enter and the most negative one will leave.",
            "That's just that, one pivot."
        ],
        [
            "Do that.",
            "When you do that, it automatically gets all of these things to be grateful to 0 and now we have a dictionary solution that's feasible.",
            "And.",
            "For the phase one problem and so now we go.",
            "And we put in.",
            "We use the 2nd row to do the phase one problem and so we pick the four's are entering variables that sex one enters.",
            "We go down here and look at all these things going from 8 going down at rate 4 from 6 going down rate 2 from 18 going down array of seven turns out W 5 is the one that hits zero first so W 5 must be the leading variable.",
            "So we do that pivot."
        ],
        [
            "And there it is.",
            "And then we have.",
            "X2 still has a positive coefficient are fake.",
            "Objective here and, by the way, are fake objective functions value at the at the dictionary solution is minus two or trying to push this up to zero.",
            "So the three on X2 is positive, so it enters.",
            "We look through here 2 going down right 3 three going down rated 2 1/2 seven half blah blah blah X zero is the one that hits zero first when I do all those little ratios.",
            "And so I have X2 enters and X0 leaves."
        ],
        [
            "And I'm done with phase one.",
            "And so the tool here there then zeros out X zero and zeros out this fake row to tell you that you've finished Phase one.",
            "You're done with that.",
            "Now it's time for now.",
            "You've gotta initial feasible solution for the primal simplex method.",
            "And so now we go back to the original objective function, and it's not optimal because of the 11 six.",
            "Here we go down here and figure out which of the variables must leave.",
            "Um?",
            "And which one is it?",
            "I don't remember."
        ],
        [
            "It's we could figure it out easily enough that's going to go up four that can go up.",
            "A5 and a half that can go whatever W 4 is the one that hit zero first.",
            "And so.",
            "We pivot with W4 as the leading variable, W 5 is the entering variable."
        ],
        [
            "And we get to a dictionary that looks like this.",
            "Their objective coefficients are all negative.",
            "The right hand sides are all positive.",
            "This is a completely equivalent representation to the original problem.",
            "But when we represent it this way and read off the problem that read off the values that we get by setting the nonbasic variables equal to 0.",
            "So setting W one and W 4 = 0 and reading off the basic variables, X2 is equal to 6 sevenths.",
            "W2 is equal to 8 seven.",
            "W3 is 25, seven, 7547 and X one is 11 sevenths.",
            "That is the optimal solution to the original problem.",
            "So.",
            "Am I still disconnected?",
            "Yeah, so here we go.",
            "We can practice this thing to we really feel like we get it.",
            "So the first pivot is special.",
            "So for the first pivot, X0 enters and the most negative one leaves, so that's W 5, so I click there.",
            "Now I've got all these ones and twos here I don't know.",
            "Let's pick this two here.",
            "So so X3 will enter.",
            "I only have to look at the four and the two here.",
            "And so the four going on 13.",
            "That's the one that's going to 0.",
            "The first so I click on that one.",
            "Now I have the three and a half and the 1 1/2.",
            "I picked the three and a half because it's larger.",
            "And I look down here.",
            "That's 10 1/4 going at a rate of three quarters, 15 going in rate of five or four or is 3.",
            "This one.",
            "Here is the one that wins.",
            "0X0 must leave.",
            "Annex two must enter, so I click on that.",
            "And there I am done with Phase one and just two pivots.",
            "All these fractions are ugly, so switch to all those decimals are ugly, so switch to fraction mode might be more.",
            "Pretty so I guess we have 200 and seven 14th here, so I'll pick that as my entering variable and I don't know all these.",
            "All these have the sign that I have to look at all these ratios they all have.",
            "They don't have all four teams and most of them 14 and animator so I can ignore the 14.",
            "I can ignore those sevens and the denominators over here, so this is 65 going at a rate of 4197 going at a rate of 11.",
            "104 going rate of 88.",
            "That sounds like the winner to me.",
            "34 are going at a rate of 11.",
            "Nine going at a rate of six.",
            "I think it was X4.",
            "I think it was W Three was the first one.",
            "See if I'm right.",
            "I got it.",
            "If I let me do it wrong for the 2nd, if you pick the wrong one, let's say this one seemed like a close contender.",
            "You get the the little tool here allows me to do the pivot 'cause it's just doing the algebra for me or I should say the arithmetic and it's rearranging things.",
            "But if you pick the wrong one then the one that was supposed to have been picked becomes infeasible, as might others.",
            "If you picked a really wrong one.",
            "So it becomes obvious immediately when you pick the wrong one, and so that was the right one.",
            "And so you can.",
            "You can have fun with this and just go fast.",
            "Oh see I got lucky.",
            "I could go fast starting down here and click that and now that didn't work.",
            "I can click this one that didn't work.",
            "Click this one or that didn't work.",
            "Click that one, whoops.",
            "I didn't work.",
            "And then click that one.",
            "OK.",
            "So that's the simplex method.",
            "Any questions on it?",
            "So there's some more subtleties.",
            "Any ideas what might be?",
            "Subtle here.",
            "What might go wrong?"
        ],
        [
            "Well, that's what I want to talk about next.",
            "What can go wrong?",
            "We're doing this because we want to make progress, but it can happen that we don't make progress here.",
            "Here's an example.",
            "Well, so if the dictionary has a 0.",
            "On one of these, what I call the right hand side values 'cause these are originally the right hand sides.",
            "If one of these values is 0.",
            "Then this is called the Degenerate Dictionary.",
            "Where's the work?",
            "Dictionaries degenerate, I highlighted the wrong thing here.",
            "The dictionary is degenerate.",
            "If one of if one or more of these entries is 0, being degenerate in itself is not a bad thing.",
            "But doing it degenerate pivot is a bad thing, and that's different.",
            "So let's take a look at this for a second.",
            "I have all three of the objective function coefficients are positive.",
            "I could pick any of them as my entering variable.",
            "I am always greedy and choose the largest coefficient.",
            "So if I choose the five here and look down, this is going at a rate of two starting from one.",
            "So X2 could go to 1/2.",
            "This ones going up, so I don't care.",
            "This is going down, so I do care, but it's starting at 0.",
            "See so that's kind of a.",
            "A bad thing I want X2 to increase.",
            "I'm trying to increase my objective function 6 to something larger and nothing changes if I do this pivot with W5 and X2 I can do the pivot.",
            "I can rearrange the equations with X two here and W 5 here, but the objective function won't change.",
            "Now that would be.",
            "That's a degenerate pivot.",
            "Not all pivots are degenerative.",
            "I picked W 1.",
            "For my entering variable look down here I go minus three.",
            "That's so that gives me something there.",
            "I got this minus here is like this one, but this one there's a + here on the W Five row W5 goes up so I don't have to worry about the zero here when there's a what I'm doing.",
            "W one is by entering variable.",
            "So this would be a degenerate dictionary, but if I pick W 1 to enter it will be a non degenerate pivot.",
            "I will actually make progress, whereas if I pick X2 to enter.",
            "I'll do a degenerate pivot.",
            "I'll make no progress.",
            "And making no progress as a boy."
        ],
        [
            "Bad thing.",
            "Mom.",
            "Because it raises the possibility that things can really go wrong.",
            "You could make a pivot and make another pivot, another pivot and come back to where you started.",
            "That would be a bad thing, so that's called cycling.",
            "And of course when we do this by hand on the screen with my little pivot tool, we can remember.",
            "And if we get into trouble we can just do things differently the next time.",
            "But if you program a computer to solve these things automatically, which is what we're really doing, what we're really talking about then.",
            "Your computer is not quite as smart as you, and it might not realize what's going on.",
            "It might just, it's just.",
            "Using some rule for picking the entering variable and for picking the leading variable and an, it may unfortunately get into a cycle, and once it does that, it's an infinite loop and the thing never finishes, and that's a bad thing.",
            "So.",
            "But there's ambiguity in the pivot rules, there's a choice of who I pick to enter.",
            "If there's lots of things that are positive, and there's often even choice of which variable will leave, I didn't.",
            "We didn't have any examples of that yet, but you know, when I do all these little ratios, it could be two or three of them that were a tie on which one will leave and.",
            "And so there is.",
            "You have to talk about rules of how to pick the leading variable when there's ties as to which one hit zero first.",
            "And so the simplex method as I showed it to you is not a well defined algorithm.",
            "We have to specify what these particular rules are.",
            "So we call these pivot rules, and I've been advocating the largest coefficient rule, but we don't have to use that rule.",
            "It's just common thought makes the greatest rate of increase, but it might not make a big jump anyway.",
            "The hope is that if we use some.",
            "Smartly chosen pivot rule, such as the largest coefficient rule.",
            "We can prove that the simplex method will not cycle."
        ],
        [
            "So let's see if we can do that.",
            "Well, it turns out.",
            "That that the largest coefficient rule is not immune to cycling.",
            "And here is the smallest example known in the world I believe.",
            "I could be wrong about that, but I just figured this one out a few weeks ago.",
            "It's hard to find these examples, and this is a minor modification of a well known example, but it's a better one, I think, because the numbers are smaller.",
            "It's been proved 50 years ago or something that you cannot have cycling in a problem with less than two variables and four constraints.",
            "And by the way, I didn't need this extra.",
            "Sorry I said that backwards two constraints and four variables.",
            "I didn't need this last constraint here.",
            "I only put this on because I wanted to have a problem where.",
            "Once we do that, we can at some point make a non degenerate pivot and move away from this area of cycling.",
            "So if I if I hadn't had this as a constraint, then there's nowhere to go.",
            "The objective function has to be 0.",
            "So I threw that on just to make the cycling be taking place at a non optimal point.",
            "You can cycle at an optimal point and just not realize it's optimal because you're cycling among all these degenerate representations of the problem and not ever discovering the one that tells you.",
            "Oh this is by the way, optimal.",
            "So anyway, this is the smallest example and let me."
        ],
        [
            "Show you what the pivot tool does so odisseia with."
        ],
        [
            "Rules are I have to be very specific about it.",
            "The entering variables, the largest coefficient rule, believing variable is what's called the smallest index rule index.",
            "Is the subscript right?",
            "So one is smaller than two is smaller than three, is smaller than 4 zero X one comes before X2B4X34X4 and the WS come after the X is so W one comes after X4 and W2 after W one and so on.",
            "So I pick the smallest index when there's a choice in the leaving variable."
        ],
        [
            "So if we use that rule.",
            "X1 is the entering variable here and.",
            "The smallest index rule tells me to use W one as my leaving variable smaller index and W2.",
            "So I do that pivot and I get to here and so now five is bigger than four, so X2 is my entering variable.",
            "And X one comes before W. Oh, I'm putting the WS first, not the excess first I guess, oh I forgot my ordering here.",
            "So W2, or maybe I typed this wrong.",
            "Anyway, what did I do?",
            "I used X1 and X.",
            "Yes, I did use W2.",
            "Yes, OK, so W. So the WS come before the X is.",
            "I forgot my convention.",
            "So then W2 goes here and now I have X3 and I look here and X one comes before X2.",
            "So it's X1 and X3 swap and here anyway you go through."
        ],
        [
            "An you just follow this rule rigorously and you get to hear where W1 and W2 are back on the left and X one X2X3 and X4 are back on the right.",
            "We're back to the original dictionary.",
            "The columns have been swapped around a little bit, but that doesn't matter, it's the.",
            "It's the same dictionary.",
            "And so we're back to where we started and we've cycled.",
            "So this phenomenon is very rare.",
            "I recently just a month ago wrote a program that generates random 2 by 4 problems that are that are degenerate, so both the right hand sides were zero and I ran this a billion times and did not find a single example that cycle, so it's hard to find."
        ],
        [
            "I did find this example, but I didn't do it randomly.",
            "I took a known example from 40 years ago or something and started with it and just made small changes to it to try to make the numbers better.",
            "So this isn't that different from the."
        ],
        [
            "From the well known example."
        ],
        [
            "OK."
        ],
        [
            "So.",
            "Degeneracy can be a problem because you can cycle.",
            "It's extraordinarily rare, at least on 2 by 4 problems.",
            "I don't know how rare it is on bigger problems.",
            "Probably not so rare on bigger problems.",
            "Better have lots of degeneracy.",
            "So we need a method for addressing this, and the method I want to show you is called the perturbation method.",
            "So here's what we do.",
            "We have a problem here that I'm showing here with just two variables X1 and X2.",
            "And the right hand side is 0, all zeros.",
            "And I, but I'm going to perturb the right hand side by adding epsilon one.",
            "I didn't know how to make an epsilon in Java.",
            "So I'm going to put an epsilon one and add it to the 1st right hand side epsilon two.",
            "I'm going to add to the second right hand side and epsilon three.",
            "I'm going to add to the third right hand side, so I put this little identity matrix, multiplying this epsilon one epsilon.",
            "This is now a new symbolic right hand side.",
            "It's no longer all zeros at zeros perturbed by these epsilons, and these epsilons are not numbers, they're just symbols, and the symbols will have the following properties whenever I.",
            "Whenever I'm doing ratios whenever checking any qualities, the data for the problem with big compared to the epsilon one, which will be huge compared epsilon, two etc.",
            "But all the epsilons will be positive, so we without giving them particular values we think of them this way.",
            "So if I do that and then I use the largest coefficient rules.",
            "So I picked the four to enter and I go down here and I have two choices here for the leaving row of minus one here in the minus one there, but W one can go up to epsilon, 1X2 can go up to epsilon one before W 180.",
            "And X2 can go up to epsilon two before W two hits zero but epsilon 2:00 is way smaller than epsilon one.",
            "So W two hits, zero first.",
            "And.",
            "I.",
            "And so W2 is my leading variable and I do the pivot now have a 14 here an I think I showed it in the next slide."
        ],
        [
            "I have a 14 here now.",
            "I looked down and I have at the minus two and the minus one here this.",
            "This act.",
            "X1 can go up.",
            "At a rate of two has to go up to epsilon, 1 minus epsilon, two epsilon, two is tiny compared epsilon one, so let's just that's basically epsilon one, whereas this one.",
            "Can go up to epsilon 2 plus epsilon three, while it's tiny.",
            "So basically epsilon two.",
            "So Oh yeah, and that's the right one.",
            "This is right too, but that doesn't really matter.",
            "So the fact that there's this one can only go up on 2, and that's way smaller than epsilon.",
            "One tells me that W 3 must be the leaving variable, and so I do the pivot and I've solved my problem.",
            "I didn't do it, so the whole input.",
            "The important point here is at every iteration now.",
            "Even though I'm doing degenerate pivots.",
            "My symbolic objective function is strictly increasing 'cause with the epsilons in there.",
            "I never did a degenerate pivot.",
            "And Furthermore you will never epsilons will.",
            "You'll never get a row with all the epsilons having coefficients of 0.",
            "Because all of our pivot operations are reversible and this is an identity we started with an identity matrix here."
        ],
        [
            "If you think of this little matrix here, this is a full rank matrix.",
            "It's not possible to do a pivots and reduce the rank of this matrix, and so you'll always have some epsilon.",
            "You won't get a roll of zero coefficients in this little three by three matrix.",
            "You'll always have some epsilons.",
            "You'll always be doing non degenerate pivots.",
            "Not the objective function in the right hand side is never 0.",
            "With the epsilons, but they were just symbolic parameters, and so once you're done once you've gotten."
        ],
        [
            "Either solve the problem, or once you've just gotten out of the degenerate situation, you can throw away the epsilons and say I don't care about them.",
            "I've solved my original problem, so the perturbation method is a very simple and useful technique for address."
        ],
        [
            "Sing the problem of cycling.",
            "There are other pivot rules that one can talk about.",
            "There's the smallest index rule, which is to choose the.",
            "A variable with the smallest index.",
            "So for entering variable that has to be, choose the entering, choose the variable with a positive coefficient that has the smallest index rather than the largest coefficient.",
            "And so if you pick both the entering and the leaving variable using the smallest index rule that's known as Bland's rule.",
            "Anne Bland's rule has been proved not to cycle.",
            "You can also select at random.",
            "And that's a good thing, because then the probability that you you may cycle 'cause you just select the things at random, but the next time you'll select things at random again and you make a different selection and you won't cycle.",
            "So random selection is also a good rule for avoiding cycling in practice on a computer.",
            "People have also considered the greatest increase rule actually figure out which of the possible entering variables would give me the biggest increase in my objective function.",
            "But that actually if you think about it, is.",
            "Doing a lot of.",
            "Numerical linear algebra per pivot and the expense per pivot goes up quite a lot, and so that rule is actually not competitive computationally."
        ],
        [
            "OK, just a brief few words about the geometry of degeneracy, so already qualities of course are.",
            "Our hyperplane or half spaces, and we're intersecting these half spaces in N dimensional space and so are feasible.",
            "Set is 2.",
            "Dimensions is a Polygon and higher dimensions.",
            "It's a polytope multifaceted convex object.",
            "And the simplex method is going from from vertex to vertex.",
            "So we started say at 000 and when we increase just one variable at a time, say if I pick X1 as my first entering variable, when I a dictionary corresponds to a vertex basically, and so if I did the first pivot with X one entering, I would pivot to hear if I did the second pivot with say X2 being my entering variable, I would go to this vertex if I pick my next pivot with.",
            "With X3's mentoring variable, I would go to this vertex and so on, but.",
            "And you'll notice each vertex here has this vertex is the intersection of three planes and the knowing which of the three planes?",
            "Determines that vertex also determines which variables are the three basic variables for that problem.",
            "Those are the.",
            "Actually tell which ones, which variables are zero, so it tells me.",
            "It tells me which ones are the non basics.",
            "Anyway, look at this corner up here.",
            "Well, I mean, look at this example.",
            "In this example the corner up here actually has four faces defining it.",
            "There's the three colored ones.",
            "But then there's the back plane, the X 2X3 plane, so there's four faces making this single vertex, but a vertex is defined by just three, and so there's multiple ways of expressing this same geometric point.",
            "I have to pick three of the faces.",
            "Um?",
            "Yeah, I said it wrong a minute ago to determine my basic variables.",
            "Those are the.",
            "R. Anyway, so.",
            "I have a.",
            "Multiple ways of representing this vertex here.",
            "I could say that I could say X2.",
            "Let's see this point here.",
            "It has X 2 = 0 X 1 = 0 it has.",
            "This inequality has a zero slack, so that's the first or second one that's the, that's the second one.",
            "So let's W2 is equal to 0 at this one, and W one is equal to 0 at this One South.",
            "Of those four things I have to pick.",
            "Three of them to be non basic and one of them to be basic and so there's four different ways of doing that in those four different dictionaries that represent that single geometric vertex.",
            "So that's what that's what the degeneracy is.",
            "Geometrically.",
            "It's too many faces coming together at a single vertex."
        ],
        [
            "OK. Now another thing is probably the most important thing is efficiency of these algorithms and the simplex method is a very efficient algorithm, and that's Huawei after 60 years or 70 years, it's still very popular.",
            "So, given a problem of a certain size, how long does it take to solve it?",
            "How many iterations does it take?",
            "It's easy to figure out how much work per iteration, so the main question is how many iterations?",
            "And there's two kinds of answers.",
            "Of course, there's the average performance on typical problems of a certain size, and there's the worst case performance on the hardest problem.",
            "The average case is, of course, mathematically difficult 'cause you have to introduce some probability space and say what's an average problem.",
            "I mean, what's a?",
            "What's a random problem look like and then try to take the average of how many pivots it takes.",
            "Very difficult, but it's easy to do empirical studies and I'll show you one in just a minute.",
            "The worst case analysis is is to say well, let me try to construct a really bad example and make it the worst possible example, and that actually we can do and I will do in a few minutes.",
            "But it turns out that for the for the simplex method, there's a huge huge difference between the worst case and the average case, and so even though this is interesting, it's in practice of limited value."
        ],
        [
            "OK, it's also, I think useful to think about how one should even measure the size of a problem.",
            "I give you a matrix AB&C.",
            "That's the data for the problem.",
            "One could call the size of the problem M&N, but that's two parameters, not one and.",
            "Size should just be one number somehow, so you could.",
            "You could refer to the number of data elements which is.",
            "Roughly M * N, It's actually 1 + 1 * N + 1.",
            "If I throw in the B and the C. Enough to subtract 1 anyway.",
            "But real world problems.",
            "The amatrix is usually extraordinarily sparse.",
            "Zeros all over the place.",
            "So we store these matrices not as just dense, 2 dimensional arrays, but with sparse matrix technology, and it doesn't seem quite fair if I have, say, just a diagonal matrix and end by end matrix, which is just all zeros and just numbers except for numbers on the diagonal.",
            "Seems unfair to call that an end squared.",
            "Sized product matrix of data.",
            "It's just N so it might make more sense.",
            "This represents the size of the problem is the number of non zero data elements.",
            "Or you could even say I have some language which allows me to formulate problems and my favorite language is ample.",
            "For optimization.",
            "And how long is my little model that expresses the problem together with the data that goes with that model?",
            "How?",
            "How big is that?",
            "And that's really the size of the problem.",
            "Anyway, these things it's a little bit tricky as to what you really mean, but people tend to just use the simplest things and stick with them.",
            "And even though it's not really quite right.",
            "Also, measuring time of course, computers get faster all the time and so the time per iteration is changing with technology, but the number of iterations is the fundamental mathematical thing, and so we focus on that."
        ],
        [
            "So here is the famous worst case problem discovered by Klee and Minty, published back in 1972.",
            "It looks like this so it's got all these.",
            "The data is growing exponentially with powers of two and powers of 100.",
            "It's a big mess.",
            "But if we look at just the N = 3 example of it.",
            "Here it is and if we look at this, let's look at the constraints.",
            "The variables are non negative.",
            "The first constraint just says that X1 smaller than one.",
            "So X ones are small number, well is between zero and one effects one is between zero and one, then 4X ones between zero and four, and so roughly speaking, this second constraint is saying that X2, which is already known to be bigger than zero, is less than a roughly 100, not exactly 100.",
            "It depends a little bit on X1, but roughly 196 to 100, and so X one is between zero and one X2 is between 0 and 100 X 3.",
            "By the same kind of logic.",
            "That even though X one X2 appear here, they're kind of smallish numbers, and so roughly speaking, X3 is between 0 and 10,000.",
            "So this looks like a distorted cube actually, and I have a pic."
        ],
        [
            "Revit.",
            "Here looks roughly like this.",
            "It's not exactly, of course, that things have been stretched.",
            "This is from zero to 1 here.",
            "This is from zero to 100 here.",
            "This is from zero to 10,000 here, so it's not a cube in the sense of having the same size in each direction.",
            "But Furthermore, it's not exactly a cube because the Heights are not all the same.",
            "This is 999 thousand 90, two 9590, two 9600.",
            "This is 96, and so on.",
            "But it's almost a cube and.",
            "It takes, oh, I should go back if we do the simplex method with the largest coefficient rule.",
            "What was the largest coefficient?"
        ],
        [
            "Largest coefficient is 4 on X1, so X one wants to enter."
        ],
        [
            "And but when X1 enters, we can only go this short distance to the one here.",
            "And once we've done that, we're sort of in trouble and actually, well, here's what happens.",
            "We go from here to here, to here to here.",
            "Now we go up to here, then we go over here over here.",
            "Over here we visit all.",
            "8.",
            "Vertices taking seven pivots to do it 2 to the N -- 1 pivots an that's true not with an equal to three, but in all cases with the Clementi problem."
        ],
        [
            "I think it's fun and interesting to understand this fully an.",
            "The original Clementi paper is a little bit hard to read, I thought, and so I spent some time thinking about it and it came up with, I think, a good way to to understand the Clementi.",
            "Problem.",
            "And so first of all these numbers, 110,000 are not terribly important.",
            "We really just want a sequence of numbers, B1B2B3 and so on that are much that are increasing very rapidly.",
            "But more importantly, at least for making the problem simple to understand, is not to just have the 1st right hand side BB1 and B2 and B3 and B4 etc.",
            "But have B1 and for the 2nd right inside make it 2 B 1 + B two.",
            "The third one should be 4 B 1 + 2 B 2 + B three, and so forth.",
            "Because B4 is huge compared to B3 and B2 and B1, this is still essentially the same number of B4, but I put these little pieces on here.",
            "This is like the perturbation method that I showed you a few minutes ago.",
            "And that these things don't matter very much, but they make the.",
            "A very simple pattern appear as we do the pivots and that's the key here, so let's see.",
            "Do I have this thing coming up?",
            "So all of this stuff here is just my.",
            "Objective of.",
            "My parameterized we're going to call it modified right hand sides.",
            "The actual variables are here.",
            "You got your geometric progression on the coefficients.",
            "Here you've got zeros on the above the diagonal you got ones on the diagonal.",
            "You got this geometric progression below the diagonal, which by the way skips the number 2, and I've actually never understood why, and I suspect you don't need to do that, but I'm not 100% sure interesting.",
            "Simple maybe.",
            "Minor research question.",
            "Could I have done this with 1248 instead of 1, four, 816?",
            "Not sure, I just stuck with what Klee and Minty did originally, but I did but I did discover that over here 1248 works and that's why I suspect it works over here as well.",
            "OK, so here we're going to the pivots.",
            "8 is the largest coefficients, 08 must enter.",
            "If eight enters, who leaves?",
            "Well, let's see W 1.",
            "Can only go up to one.",
            "'cause all these other only have to be one.",
            "I mean all these other coefficients are zero so we always have zero above the diagonal here and so I have to pick X1.",
            "And so I did that pivot.",
            "And now I see the largest coefficient is 4.",
            "And there's a 0 here.",
            "There's always going to be zeros above the diagonal here, and so I have to pick one of these.",
            "And it turns out that W2 basically is a size B2, and W3 is basically the size B3 'cause we always have zeros above here.",
            "And so B2 is much smaller than B3, is much more than before.",
            "So W2 is going to be the one to pick next.",
            "So X2 goes with W2.",
            "By the way, you can think about it whenever I pick something, the entering variable and the leading variable are in the same position.",
            "So if it's the first one, there is the first one there.",
            "If it's the second one, second one and so forth.",
            "So I'm always clicking on these diagonal buttons actually.",
            "But anyway, I did that second pivot and now this eight pops back in here.",
            "So I have to click on this button again.",
            "And now I've gotten both of those alright, but now there's this two here, so I have to click on this button, but when I click on that button, it brings that eight in the four back.",
            "So you can see that this is kind of bad.",
            "So now I have to click on here.",
            "And then I have to click on here, but that brings the 8 back then I have to click on here.",
            "OK, I'm half done.",
            "Now when I click on here.",
            "Brings all the 8, four and two back not to click on the 8 again, by the way.",
            "We're counting to two to the N in base.",
            "2.",
            "That's exactly what's happening there.",
            "I can write that here.",
            "If I.",
            "Do this in reverse order left.",
            "Put this on the I'm going to put a zero or a one associate whether this is purple or not.",
            "I'm going to put a 01 or this is purple or not.",
            "Whether this is purple or not, and so on.",
            "Zero for purple and one and one for not purple.",
            "So they were all purple originally.",
            "I'm putting the W 1 here in the W 4 here and after the first pivot I made this one good, but these guys were bad after the second pivot.",
            "This one became good but that one went bad again and these were still bad after the next pivot.",
            "I fixed this again.",
            "This was still good and these were bad after the next pivot I fixed this one but then these went bad after the next pivot I refixed the W 1 one and so on.",
            "So you can see clearly that I'm just counting to two to the N in base 2.",
            "There's even more nice properties here.",
            "I don't know if you've noticed anybody notice any other nice properties that I haven't mentioned.",
            "So I do another pivot if.",
            "You have a property in mind, check it.",
            "Our pivot on this one so you see what happens.",
            "I claim that the dictionary is very easy to predict.",
            "Can you predict what the next every element of the dictionary is easy to pick predict?",
            "If I click on this, can you tell me what happens to all of the numbers I already told you that these the Super diagonals the above the dial stays zero all the time, but that's not all that happens a lot more than that.",
            "You see what happens.",
            "Anybody see the pattern?",
            "All the numbers stay the same except for minus science.",
            "The only thing that changes are minus signs, and I think what happens when I click on.",
            "I don't remember off the top of my head exactly what the rule is, but when I click on this.",
            "I think I negate the row.",
            "I negate the column and this gets negated twice and so that stays the same same I think.",
            "In fact, I think I need it.",
            "I forget exactly.",
            "I forget what happens to these, do they?",
            "Those change sign.",
            "Let's just click on this guy.",
            "Yeah, so I forget exactly what the rule is.",
            "I'm.",
            "But it's a very simple rule, so we do it again.",
            "So we pick the X1 here.",
            "And you see that the numbers stay the same, it's just the the minus signs change.",
            "So if we look for example at at this column here, it's 4148.",
            "And it's going to stay 4148.",
            "It's just who has the - changes.",
            "Whoops, now I have to go here.",
            "Now I have to go here.",
            "Now I have to go here.",
            "There's also a very simple rule for exactly how the signs change, I just don't remember it off the top of my head.",
            "So.",
            "So that's it."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Today we'll talk about linear programming and tored the end of the course on.",
                    "label": 0
                },
                {
                    "sent": "On Monday, we'll move on to convex and more general nonlinear optimization.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so linear programming.",
                    "label": 0
                },
                {
                    "sent": "I guess we should start with.",
                    "label": 0
                },
                {
                    "sent": "What is it?",
                    "label": 0
                },
                {
                    "sent": "So we want to maximize or minimize a linear function.",
                    "label": 0
                },
                {
                    "sent": "Subject to constraints, of course, if we were just maximizing a linear function with no constraints, the problem would be rather simple.",
                    "label": 0
                },
                {
                    "sent": "Infinity would generally be the answer and or a constant.",
                    "label": 0
                },
                {
                    "sent": "So we have constraints and there's different ways one can pose the constraints.",
                    "label": 0
                },
                {
                    "sent": "I call it standard form if the constraints are posed exactly like this, that you have some inequality's linear inequalities.",
                    "label": 0
                },
                {
                    "sent": "So if this matrix A.",
                    "label": 0
                },
                {
                    "sent": "Try to be consistent in my notation later and a will have M rows and N columns.",
                    "label": 0
                },
                {
                    "sent": "And so we have X less than or equal to B and by less than or equal to be is an M vector and by less than or equal to?",
                    "label": 0
                },
                {
                    "sent": "I mean that each component of the two of the vector on the left is smaller than or equal to the component on the right and also the vector X. I'll take to be non negative.",
                    "label": 0
                },
                {
                    "sent": "Now you've may have encountered linear optimization problems already in your work and they may not have been in this form, but it's very easy to convert from one form to another form and and.",
                    "label": 0
                },
                {
                    "sent": "I like this form and I call it standard form for reasons that I hope will become very clear.",
                    "label": 0
                },
                {
                    "sent": "As these lectures proceed.",
                    "label": 0
                },
                {
                    "sent": "So that's the problem.",
                    "label": 0
                },
                {
                    "sent": "Many, many applications it's important, of course.",
                    "label": 0
                },
                {
                    "sent": "Broadly and in machine learning applications.",
                    "label": 0
                },
                {
                    "sent": "So the first thing we want to do is have an algorithm and the first step to the simplex method is to introduce something which I'll call a dictionary.",
                    "label": 0
                },
                {
                    "sent": "And so all I'm doing here is I'm introducing a notation for the objective function.",
                    "label": 1
                },
                {
                    "sent": "And I'm also introducing Slack variables that represent the how much of this inequality is deviates from being an equality, so W is just B -- A X is the difference between the right hand side and the left hand side, and so because of this inequality W should be greater than or equal to 0?",
                    "label": 0
                },
                {
                    "sent": "And I call this a dictionary as because the variables on the right X define the variables on the left and this is of course completely trivial right here, but we're going to modify this dictionary on the next slide an the whole simplex method is based on iteratively modifying how we represent the dictionary.",
                    "label": 0
                },
                {
                    "sent": "Associated with this dictionary and each of the subsequent ones that we're going to see is what we call a dictionary solution.",
                    "label": 0
                },
                {
                    "sent": "An that's a particular.",
                    "label": 0
                },
                {
                    "sent": "Potential solution to the problem, so it's a it's a.",
                    "label": 0
                },
                {
                    "sent": "It's a candidate for a solution, but we'll just call it a solution and we'll just we'll distinguish it from the final solution, which will call the optimal solution.",
                    "label": 0
                },
                {
                    "sent": "So the dictionary solution you simply get by you get by simply setting the X variables equal to 0 and reading off the WS completely trivial in this case, but it will become more interesting as we iterate things.",
                    "label": 0
                },
                {
                    "sent": "Now, when you, so that's a particular solution associated with this way of writing the equations and if.",
                    "label": 0
                },
                {
                    "sent": "Oh, and as we do that of course, then W is just equal to B and if B is greater equal to 0, then WS Chronicle zero and this dictionary would be feasible.",
                    "label": 0
                },
                {
                    "sent": "It satisfies the constraints of the problem, might not be optimal, but if B is greater than equal to 0, it's feasible.",
                    "label": 1
                },
                {
                    "sent": "If B is greater than zero, which makes it feasible and C is less than or equal to 0, then there's no further improvement that you can make, and this dictionary solution would be optimal for the problem, but not very many problems have the property that 00 is the optimal solution.",
                    "label": 0
                },
                {
                    "sent": "And so we need to iterate generally.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let me.",
                    "label": 0
                },
                {
                    "sent": "See here OK so.",
                    "label": 0
                },
                {
                    "sent": "Here's how the simplex method goes.",
                    "label": 0
                },
                {
                    "sent": "There's two things, there's feasibility and optimality, and I'm going to 1st discuss getting a feasible solution.",
                    "label": 0
                },
                {
                    "sent": "Sorry, I'm first going to us going from a feasible solution to an optimal solution.",
                    "label": 0
                },
                {
                    "sent": "So the primal simplex method refers to exactly that were feasible, and we're working our way toward optimality, and so the B in this picture would be greater nickel to 0, but the C is not all less than or equal to 0, and so I need to address that fact that the objective function can be improved.",
                    "label": 0
                },
                {
                    "sent": "So I look at the objective function and say, well, if there's a index J for which the coefficient on that variable XJ is positive, then I could improve things by letting that variable increase.",
                    "label": 1
                },
                {
                    "sent": "From the from zero, which is where it is in my dictionary solution.",
                    "label": 0
                },
                {
                    "sent": "So I want to let that variable increase from zero and that will call that the entering variable.",
                    "label": 0
                },
                {
                    "sent": "Maybe I should say right now the the word entering refers to these variables are over.",
                    "label": 0
                },
                {
                    "sent": "Here are called basic variables.",
                    "label": 0
                },
                {
                    "sent": "And you're entering the basis and these are called non basic variables.",
                    "label": 0
                },
                {
                    "sent": "Of course.",
                    "label": 0
                },
                {
                    "sent": "Right now these are just the original variables and there's a slacks, but but eventually they'll be more intertwined so.",
                    "label": 0
                },
                {
                    "sent": "So XJ will enter, it will become one of the variables that's not 0.",
                    "label": 0
                },
                {
                    "sent": "And we want to preserve this property of having a dictionary.",
                    "label": 0
                },
                {
                    "sent": "So if I take one of the variables on the right and put it over on the left, I need to take one of the variables on the left and put it over on the right.",
                    "label": 0
                },
                {
                    "sent": "In my system of equations here, just want to rewrite my system of equations with 1X J swapped with one of the WS.",
                    "label": 0
                },
                {
                    "sent": "And so, how do we figure out which W has to go?",
                    "label": 0
                },
                {
                    "sent": "So we picked this index J and we're increasing that particular variable XJ.",
                    "label": 0
                },
                {
                    "sent": "All the other ones are equal to 0, and as we increase it, the column of this matrix associated with index with variable XJ starts to get subtracted off from the vector B.",
                    "label": 0
                },
                {
                    "sent": "And vector B was critical to zero, 'cause we're feasible, and eventually one of these components of W will hit zero.",
                    "label": 0
                },
                {
                    "sent": "Might happen right away, but but eventually it certainly should happen and.",
                    "label": 0
                },
                {
                    "sent": "And so you look at the first index I, whereas you increase that one variable X.",
                    "label": 0
                },
                {
                    "sent": "This B -- A times that column of B minus that call.",
                    "label": 0
                },
                {
                    "sent": "The A matrix equals zero.",
                    "label": 0
                },
                {
                    "sent": "You pick that I and that's our leaving variable.",
                    "label": 0
                },
                {
                    "sent": "And now we just do algebraic rearrangement of the equations to put the variable XJ on the left and the variable WI on the right.",
                    "label": 0
                },
                {
                    "sent": "And I will show you how to do this.",
                    "label": 0
                },
                {
                    "sent": "I mean I'll show some examples in just a few seconds here, but it's trivial algebra.",
                    "label": 0
                },
                {
                    "sent": "It's just exactly like Gaussian elimination, where you have.",
                    "label": 0
                },
                {
                    "sent": "The entire Gaussian elimination where zeroing out one column in your in your process of inverting a matrix using Gaussian elimination and you'll see what I mean in just a minute.",
                    "label": 0
                },
                {
                    "sent": "So we get this rearrangement.",
                    "label": 0
                },
                {
                    "sent": "Now the X is in the double user get kind of mixed up and they get more and more mixed up as we do this several times and so in general the notation will be like this that I'll have some nonbasic variables, which I'll denote by X subscript N and that's a mix of the original X variables and the original W variables.",
                    "label": 0
                },
                {
                    "sent": "They get all mixed up.",
                    "label": 0
                },
                {
                    "sent": "And I have basic variables XB and that's the rest of the variables that are in the XN and the coefficients they get multiplied here will change its orbital tilt up here to indicate that this the numbers here are different 'cause we've done this Gaussian elimination type step, which we call a pivot by the way.",
                    "label": 0
                },
                {
                    "sent": "And B&A also get changed, so I put tildes on top of that.",
                    "label": 0
                },
                {
                    "sent": "But all the variables are still not negative and this is a completely equivalent way of writing the problem as this and that's the whole point.",
                    "label": 0
                },
                {
                    "sent": "We go from this to this just by algebraic rearranging of the equations, but we could undo that rearrangement and go back from this back to that.",
                    "label": 0
                },
                {
                    "sent": "So we haven't changed the problem.",
                    "label": 0
                },
                {
                    "sent": "We've only represented it in a different way.",
                    "label": 0
                },
                {
                    "sent": "We've taken our dictionary and we're defining different variables.",
                    "label": 0
                },
                {
                    "sent": "We're taking a different set of variables are given fundamental variables and defining a different set of variables XB.",
                    "label": 0
                },
                {
                    "sent": "And then we had a zero there, but as we do these iterations, we get a constant appearing here an that is the current value of the objective function and that will go up and up because we're maximizing.",
                    "label": 0
                },
                {
                    "sent": "So we started at zero and they just are, will go higher and higher as we iterate.",
                    "label": 0
                },
                {
                    "sent": "So let's see if I'm on the Internet.",
                    "label": 0
                },
                {
                    "sent": "I can actually demo this.",
                    "label": 0
                },
                {
                    "sent": "But I'm not, but I also have a local version, so skip doing that and I can demo it here.",
                    "label": 0
                },
                {
                    "sent": "Let me just make sure it's feasable.",
                    "label": 0
                },
                {
                    "sent": "The problem is little tool here doesn't always generate feasible problems.",
                    "label": 0
                },
                {
                    "sent": "So there's a feasible problem right there.",
                    "label": 0
                },
                {
                    "sent": "And so in this particular problem.",
                    "label": 0
                },
                {
                    "sent": "I have two objective coefficients that are positive.",
                    "label": 0
                },
                {
                    "sent": "I could pick either one of them as the entering variable, either X2 or X4.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "We have to make a decision, so I'll pick X2.",
                    "label": 0
                },
                {
                    "sent": "I picked it because it has the larger coefficient, but there's no guaranteed benefit in that, it's just.",
                    "label": 0
                },
                {
                    "sent": "Tempting, so I'm tempted and I'll pick X2.",
                    "label": 0
                },
                {
                    "sent": "Now as I look down the column here so all these variables are equal to 0 in the dictionary solution associated with this dictionary.",
                    "label": 0
                },
                {
                    "sent": "And now I'm thinking about improving that solution.",
                    "label": 0
                },
                {
                    "sent": "So I want X2 which is currently equal to 0, wanted to increase and as it increases this one which is currently five starts to go up at a rate of two.",
                    "label": 0
                },
                {
                    "sent": "And so this one is going to go up and I don't have to worry about this W 1 = 0 ever.",
                    "label": 0
                },
                {
                    "sent": "And similarly with all the other ones that have a negative number inside this little box here and they have the negative outside, they're all going up so W1W 3W5.",
                    "label": 0
                },
                {
                    "sent": "I don't worry bout but W2 and W4 going down W2 starting at 9 and going down to the rate of two so I can go 4 1/2 before that hit 0 W 4 is starting a starting at 2 and going down the rate of two so I can only go up to one so when X 2 = 1 here.",
                    "label": 0
                },
                {
                    "sent": "W 4 = 0 and that's and that's the first one to hit 0, so W 4 should be my leaving variable.",
                    "label": 0
                },
                {
                    "sent": "If X2 is my entering variable.",
                    "label": 0
                },
                {
                    "sent": "And I'll do that in just a second, but let's just look over here.",
                    "label": 0
                },
                {
                    "sent": "I could have chosen this one, but I'm not going to.",
                    "label": 0
                },
                {
                    "sent": "If I did this one, I would have only these two to look at.",
                    "label": 0
                },
                {
                    "sent": "So the four an is that a three there?",
                    "label": 0
                },
                {
                    "sent": "So we're at 5.",
                    "label": 0
                },
                {
                    "sent": "We're going down the rate of four that would hit zero after 1 1/4 after X4 gets up to 1 1/4.",
                    "label": 0
                },
                {
                    "sent": "This is a nine.",
                    "label": 0
                },
                {
                    "sent": "We're going down around 3:00 so X4 could go up to three before W 2 = 0.",
                    "label": 0
                },
                {
                    "sent": "So if I were to pick X4 is by entering variable, then W one would be my leaving variable, so it's either this one or this one.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to pick this one.",
                    "label": 0
                },
                {
                    "sent": "And now the algebra which.",
                    "label": 0
                },
                {
                    "sent": "I think you can all do it.",
                    "label": 0
                },
                {
                    "sent": "Let me just describe it without actually doing it.",
                    "label": 0
                },
                {
                    "sent": "I want to put X2 on the left so I would just take this equation here and I would write X2 on the left so I bring 2X2 to this side.",
                    "label": 0
                },
                {
                    "sent": "Bring W4 to that side, divide through by two that rearrange that equation.",
                    "label": 0
                },
                {
                    "sent": "But then I have to eliminate X2 from all these equations up here by doing Gaussian elimination type steps here for example to get rid of X2 in the first in this row here.",
                    "label": 0
                },
                {
                    "sent": "I have a + 2 here and have a -- 2 here.",
                    "label": 0
                },
                {
                    "sent": "So if I took this row and added W4 to it so W 1 + W four and I just Add all these things it would be 5 + 2 is 7.",
                    "label": 0
                },
                {
                    "sent": "Minus 3 + 4 is 1.",
                    "label": 0
                },
                {
                    "sent": "This goes to 0 now, which is good.",
                    "label": 0
                },
                {
                    "sent": "I wanted to get rid of X2 in this equation, but of course I have a plus W4 when I added it, so I'll subtract that W4 and put that in this slot.",
                    "label": 0
                },
                {
                    "sent": "And similarly I go across here and I get I update all these coefficients.",
                    "label": 0
                },
                {
                    "sent": "So it's a very simple update of just taking this coefficient might get the sign wrong, but something like this coefficient gets updated by taking this times this.",
                    "label": 0
                },
                {
                    "sent": "Divided by that and subtracting.",
                    "label": 0
                },
                {
                    "sent": "Something very simple like that.",
                    "label": 0
                },
                {
                    "sent": "But anyway, because arithmetic isn't very fun, I made this little Java applet that does it all for me.",
                    "label": 0
                },
                {
                    "sent": "So when I click this button it does that arithmetic.",
                    "label": 0
                },
                {
                    "sent": "I believe that's the seven, and that's the minus one that I mentioned.",
                    "label": 0
                },
                {
                    "sent": "And when I added the W4 I now subtract it over and there's the minus W4 appearing there and I divided by the two and that's why we see the 1/2 anyway.",
                    "label": 0
                },
                {
                    "sent": "The Pivot tool does all the arithmetic correctly.",
                    "label": 0
                },
                {
                    "sent": "The objective function was zero to start with, and now it's two.",
                    "label": 0
                },
                {
                    "sent": "It's going up.",
                    "label": 0
                },
                {
                    "sent": "We're trying to maximize and, but we're not optimal yet, because this new dictionary, the.",
                    "label": 0
                },
                {
                    "sent": "The solution associated with it is not optimal because X4 has a positive coefficient and if I increase X4 from zero, I can make further improvement in the objective function 0.",
                    "label": 0
                },
                {
                    "sent": "That's what I want to do next, so I do the same thing that I just did I look through here I have.",
                    "label": 0
                },
                {
                    "sent": "To only look at the ones that are going down.",
                    "label": 0
                },
                {
                    "sent": "So there's a -- 3 and minus four, and then these don't have to worry about so 7 going into rate going down the rate of 37 going up or down rate of four.",
                    "label": 0
                },
                {
                    "sent": "That's the one that will hit zero first, so W2 is my leading variable.",
                    "label": 0
                },
                {
                    "sent": "Effects four is my entering variable and so I just click on this little button here and it does the pivot and I'm done.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "And you can always check if you're right.",
                    "label": 0
                },
                {
                    "sent": "Oh I, my volume was too low.",
                    "label": 0
                },
                {
                    "sent": "There we go.",
                    "label": 0
                },
                {
                    "sent": "If so, the buttons at the bottom are just for making assertions, and if you make an incorrect assertion, like if I were to say this was.",
                    "label": 0
                },
                {
                    "sent": "Infeasible.",
                    "label": 0
                },
                {
                    "sent": "I get Bart Simpson, you know Bart Simpson.",
                    "label": 0
                },
                {
                    "sent": "Calling me a loser, OK?",
                    "label": 0
                },
                {
                    "sent": "Somebody else is playing, or does it mean?",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                },
                {
                    "sent": "So that is the simplex method.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now there are some issues that we have to discuss today.",
                    "label": 0
                },
                {
                    "sent": "Go yes, there are some issues we have to discuss.",
                    "label": 0
                },
                {
                    "sent": "Some problems are unbounded.",
                    "label": 0
                },
                {
                    "sent": "The answer is Infinity.",
                    "label": 0
                },
                {
                    "sent": "And how does how do you detect that with the simplex method?",
                    "label": 1
                },
                {
                    "sent": "Here is a example that illustrates what can go wrong.",
                    "label": 0
                },
                {
                    "sent": "So here's a.",
                    "label": 1
                },
                {
                    "sent": "This is a dictionary and we could pick either X one to be the entering variable, or X3.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "If we pick X.",
                    "label": 0
                },
                {
                    "sent": "3.",
                    "label": 0
                },
                {
                    "sent": "We could do a pivot here.",
                    "label": 0
                },
                {
                    "sent": "There would be no problem.",
                    "label": 0
                },
                {
                    "sent": "I'd have look at the two of the three in the four and figure out which would be the leading very well.",
                    "label": 0
                },
                {
                    "sent": "I do a pivot fine.",
                    "label": 0
                },
                {
                    "sent": "But I'm greedy.",
                    "label": 0
                },
                {
                    "sent": "I go with the one with the largest coefficient, so I pick X one to be my entering variable.",
                    "label": 0
                },
                {
                    "sent": "And here in this case, being greedy really pays off, 'cause if I look down this column here.",
                    "label": 0
                },
                {
                    "sent": "W one is going up at a rate of 5W twos going up at a rate of 0 W. 3 is not changing, W 4 is going up, W 5 is going up.",
                    "label": 0
                },
                {
                    "sent": "There is nothing blocking X1 from going all the way to Infinity and so the problem is unbounded.",
                    "label": 0
                },
                {
                    "sent": "And that's how the simplex method detects unboundedness.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's one thing that can go wrong, and that's why there's that.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The button on the pivot tool thing to check now.",
                    "label": 0
                },
                {
                    "sent": "I'm gonna show you.",
                    "label": 0
                },
                {
                    "sent": "Three different algorithms for the simplex method over the next couple hours and this I want to show you the first one, so I haven't shown you the complete thing because I showed what I showed you assume that were feasible to start with and I only went from being feasible to being optimal, and that's really only half of what we have to do.",
                    "label": 0
                },
                {
                    "sent": "We have to find a feasible solution to start with, and so that's called initialization.",
                    "label": 0
                },
                {
                    "sent": "How do we get started with that first feasible solution?",
                    "label": 0
                },
                {
                    "sent": "So here's a problem where I have some negative values on the right hand side.",
                    "label": 0
                },
                {
                    "sent": "And what do I going to do about that?",
                    "label": 0
                },
                {
                    "sent": "And so these three methods that I'm going to show you today are?",
                    "label": 0
                },
                {
                    "sent": "Various ways of addressing the initialization problem.",
                    "label": 0
                },
                {
                    "sent": "I want to start out with wanting to show you now because it's the simplest, quick and easy to explain.",
                    "label": 0
                },
                {
                    "sent": "But as we move along I'll show you ones that I think are better, but this is very simple thing to do.",
                    "label": 0
                },
                {
                    "sent": "Modify this problem just temporarily by subtracting a new variable, which I'll call X0 from each of the constraints.",
                    "label": 1
                },
                {
                    "sent": "So put a -- X zero on each of these constraints.",
                    "label": 0
                },
                {
                    "sent": "And for the moment, for the Phase one problem, change the objective function.",
                    "label": 0
                },
                {
                    "sent": "Forget about this because for phase one I don't care what the objective is.",
                    "label": 0
                },
                {
                    "sent": "I only want to get something that satisfies these constraints and once I get that, I'll reinstate the objective function and start what will call phase two, which is the algorithm I just showed you the primal simplex method.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We put the X anadon.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "And so here it is.",
                    "label": 0
                },
                {
                    "sent": "Gottex not in here.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is feasible.",
                    "label": 1
                },
                {
                    "sent": "Huawei, is it feasible?",
                    "label": 0
                },
                {
                    "sent": "I can let X not be a large number.",
                    "label": 0
                },
                {
                    "sent": "And X1 and X2 X equals zero and I will satisfy these inequalities, so it's a feasible problem, But that's not a dictionary solution, that's just.",
                    "label": 0
                },
                {
                    "sent": "The assertion that there's that there are solutions to this problem.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So I would like to solve this problem using the simplex method and if I get to the point where the objective function is equal to 0 then then that means that the original problem was feasible because X not was how I changed the original problem and so if I can make the change of the original problem equal to 0 then I've got a feasible solution to the original problem.",
                    "label": 0
                },
                {
                    "sent": "So the final dictionary or the final basis.",
                    "label": 1
                },
                {
                    "sent": "If you like the basic variables versus the non basic variables, the final basis that you get from this phase one problem can then be used as the initial starting point.",
                    "label": 0
                },
                {
                    "sent": "For phase two you just throw away the X0, put the correct objective function back in and continue.",
                    "label": 0
                },
                {
                    "sent": "If the optimal objective function to this phase one problem is strictly less than zero, that means we tried to maximize minus X zero, and we in the end didn't get to X equal to zero X 0 equal to zero.",
                    "label": 0
                },
                {
                    "sent": "We got to X 0 equal to something positive, so the minus X zero is negative, and that means that there is no solution to the original problem.",
                    "label": 0
                },
                {
                    "sent": "That means the original problem is infeasible.",
                    "label": 1
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so.",
                    "label": 0
                },
                {
                    "sent": "So here's how that goes.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We can show a problem with X zero in here.",
                    "label": 0
                },
                {
                    "sent": "And I and the applet that I developed for this two phase method, shows both the original objective function and the Phase one objective function right below it.",
                    "label": 1
                },
                {
                    "sent": "And we do pivots and for phase one, even though it shows the original objective function, we ignore it and we just look at the Phase one objective function with the X -- X zero we do our pivots with this one and with the right hand side here.",
                    "label": 0
                },
                {
                    "sent": "But the first if it's different because this is not feasible even for the phase.",
                    "label": 0
                },
                {
                    "sent": "One problem is not feasable 'cause we've got these negative signs here.",
                    "label": 0
                },
                {
                    "sent": "So the first pivot in this algorithm is special.",
                    "label": 1
                },
                {
                    "sent": "The first pivot is at 0.",
                    "label": 0
                },
                {
                    "sent": "Enter and the most negative one will leave.",
                    "label": 1
                },
                {
                    "sent": "That's just that, one pivot.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Do that.",
                    "label": 0
                },
                {
                    "sent": "When you do that, it automatically gets all of these things to be grateful to 0 and now we have a dictionary solution that's feasible.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "For the phase one problem and so now we go.",
                    "label": 0
                },
                {
                    "sent": "And we put in.",
                    "label": 0
                },
                {
                    "sent": "We use the 2nd row to do the phase one problem and so we pick the four's are entering variables that sex one enters.",
                    "label": 0
                },
                {
                    "sent": "We go down here and look at all these things going from 8 going down at rate 4 from 6 going down rate 2 from 18 going down array of seven turns out W 5 is the one that hits zero first so W 5 must be the leading variable.",
                    "label": 0
                },
                {
                    "sent": "So we do that pivot.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And there it is.",
                    "label": 0
                },
                {
                    "sent": "And then we have.",
                    "label": 0
                },
                {
                    "sent": "X2 still has a positive coefficient are fake.",
                    "label": 0
                },
                {
                    "sent": "Objective here and, by the way, are fake objective functions value at the at the dictionary solution is minus two or trying to push this up to zero.",
                    "label": 0
                },
                {
                    "sent": "So the three on X2 is positive, so it enters.",
                    "label": 0
                },
                {
                    "sent": "We look through here 2 going down right 3 three going down rated 2 1/2 seven half blah blah blah X zero is the one that hits zero first when I do all those little ratios.",
                    "label": 0
                },
                {
                    "sent": "And so I have X2 enters and X0 leaves.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I'm done with phase one.",
                    "label": 0
                },
                {
                    "sent": "And so the tool here there then zeros out X zero and zeros out this fake row to tell you that you've finished Phase one.",
                    "label": 0
                },
                {
                    "sent": "You're done with that.",
                    "label": 0
                },
                {
                    "sent": "Now it's time for now.",
                    "label": 0
                },
                {
                    "sent": "You've gotta initial feasible solution for the primal simplex method.",
                    "label": 0
                },
                {
                    "sent": "And so now we go back to the original objective function, and it's not optimal because of the 11 six.",
                    "label": 0
                },
                {
                    "sent": "Here we go down here and figure out which of the variables must leave.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And which one is it?",
                    "label": 0
                },
                {
                    "sent": "I don't remember.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's we could figure it out easily enough that's going to go up four that can go up.",
                    "label": 0
                },
                {
                    "sent": "A5 and a half that can go whatever W 4 is the one that hit zero first.",
                    "label": 0
                },
                {
                    "sent": "And so.",
                    "label": 0
                },
                {
                    "sent": "We pivot with W4 as the leading variable, W 5 is the entering variable.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we get to a dictionary that looks like this.",
                    "label": 0
                },
                {
                    "sent": "Their objective coefficients are all negative.",
                    "label": 0
                },
                {
                    "sent": "The right hand sides are all positive.",
                    "label": 0
                },
                {
                    "sent": "This is a completely equivalent representation to the original problem.",
                    "label": 0
                },
                {
                    "sent": "But when we represent it this way and read off the problem that read off the values that we get by setting the nonbasic variables equal to 0.",
                    "label": 0
                },
                {
                    "sent": "So setting W one and W 4 = 0 and reading off the basic variables, X2 is equal to 6 sevenths.",
                    "label": 0
                },
                {
                    "sent": "W2 is equal to 8 seven.",
                    "label": 0
                },
                {
                    "sent": "W3 is 25, seven, 7547 and X one is 11 sevenths.",
                    "label": 0
                },
                {
                    "sent": "That is the optimal solution to the original problem.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Am I still disconnected?",
                    "label": 0
                },
                {
                    "sent": "Yeah, so here we go.",
                    "label": 0
                },
                {
                    "sent": "We can practice this thing to we really feel like we get it.",
                    "label": 0
                },
                {
                    "sent": "So the first pivot is special.",
                    "label": 0
                },
                {
                    "sent": "So for the first pivot, X0 enters and the most negative one leaves, so that's W 5, so I click there.",
                    "label": 0
                },
                {
                    "sent": "Now I've got all these ones and twos here I don't know.",
                    "label": 0
                },
                {
                    "sent": "Let's pick this two here.",
                    "label": 0
                },
                {
                    "sent": "So so X3 will enter.",
                    "label": 0
                },
                {
                    "sent": "I only have to look at the four and the two here.",
                    "label": 0
                },
                {
                    "sent": "And so the four going on 13.",
                    "label": 0
                },
                {
                    "sent": "That's the one that's going to 0.",
                    "label": 0
                },
                {
                    "sent": "The first so I click on that one.",
                    "label": 0
                },
                {
                    "sent": "Now I have the three and a half and the 1 1/2.",
                    "label": 0
                },
                {
                    "sent": "I picked the three and a half because it's larger.",
                    "label": 0
                },
                {
                    "sent": "And I look down here.",
                    "label": 0
                },
                {
                    "sent": "That's 10 1/4 going at a rate of three quarters, 15 going in rate of five or four or is 3.",
                    "label": 0
                },
                {
                    "sent": "This one.",
                    "label": 0
                },
                {
                    "sent": "Here is the one that wins.",
                    "label": 0
                },
                {
                    "sent": "0X0 must leave.",
                    "label": 0
                },
                {
                    "sent": "Annex two must enter, so I click on that.",
                    "label": 0
                },
                {
                    "sent": "And there I am done with Phase one and just two pivots.",
                    "label": 0
                },
                {
                    "sent": "All these fractions are ugly, so switch to all those decimals are ugly, so switch to fraction mode might be more.",
                    "label": 0
                },
                {
                    "sent": "Pretty so I guess we have 200 and seven 14th here, so I'll pick that as my entering variable and I don't know all these.",
                    "label": 0
                },
                {
                    "sent": "All these have the sign that I have to look at all these ratios they all have.",
                    "label": 0
                },
                {
                    "sent": "They don't have all four teams and most of them 14 and animator so I can ignore the 14.",
                    "label": 0
                },
                {
                    "sent": "I can ignore those sevens and the denominators over here, so this is 65 going at a rate of 4197 going at a rate of 11.",
                    "label": 0
                },
                {
                    "sent": "104 going rate of 88.",
                    "label": 0
                },
                {
                    "sent": "That sounds like the winner to me.",
                    "label": 0
                },
                {
                    "sent": "34 are going at a rate of 11.",
                    "label": 0
                },
                {
                    "sent": "Nine going at a rate of six.",
                    "label": 0
                },
                {
                    "sent": "I think it was X4.",
                    "label": 0
                },
                {
                    "sent": "I think it was W Three was the first one.",
                    "label": 0
                },
                {
                    "sent": "See if I'm right.",
                    "label": 0
                },
                {
                    "sent": "I got it.",
                    "label": 0
                },
                {
                    "sent": "If I let me do it wrong for the 2nd, if you pick the wrong one, let's say this one seemed like a close contender.",
                    "label": 0
                },
                {
                    "sent": "You get the the little tool here allows me to do the pivot 'cause it's just doing the algebra for me or I should say the arithmetic and it's rearranging things.",
                    "label": 0
                },
                {
                    "sent": "But if you pick the wrong one then the one that was supposed to have been picked becomes infeasible, as might others.",
                    "label": 0
                },
                {
                    "sent": "If you picked a really wrong one.",
                    "label": 0
                },
                {
                    "sent": "So it becomes obvious immediately when you pick the wrong one, and so that was the right one.",
                    "label": 0
                },
                {
                    "sent": "And so you can.",
                    "label": 0
                },
                {
                    "sent": "You can have fun with this and just go fast.",
                    "label": 0
                },
                {
                    "sent": "Oh see I got lucky.",
                    "label": 0
                },
                {
                    "sent": "I could go fast starting down here and click that and now that didn't work.",
                    "label": 0
                },
                {
                    "sent": "I can click this one that didn't work.",
                    "label": 0
                },
                {
                    "sent": "Click this one or that didn't work.",
                    "label": 0
                },
                {
                    "sent": "Click that one, whoops.",
                    "label": 0
                },
                {
                    "sent": "I didn't work.",
                    "label": 0
                },
                {
                    "sent": "And then click that one.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So that's the simplex method.",
                    "label": 1
                },
                {
                    "sent": "Any questions on it?",
                    "label": 0
                },
                {
                    "sent": "So there's some more subtleties.",
                    "label": 0
                },
                {
                    "sent": "Any ideas what might be?",
                    "label": 0
                },
                {
                    "sent": "Subtle here.",
                    "label": 0
                },
                {
                    "sent": "What might go wrong?",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, that's what I want to talk about next.",
                    "label": 0
                },
                {
                    "sent": "What can go wrong?",
                    "label": 0
                },
                {
                    "sent": "We're doing this because we want to make progress, but it can happen that we don't make progress here.",
                    "label": 0
                },
                {
                    "sent": "Here's an example.",
                    "label": 0
                },
                {
                    "sent": "Well, so if the dictionary has a 0.",
                    "label": 1
                },
                {
                    "sent": "On one of these, what I call the right hand side values 'cause these are originally the right hand sides.",
                    "label": 0
                },
                {
                    "sent": "If one of these values is 0.",
                    "label": 0
                },
                {
                    "sent": "Then this is called the Degenerate Dictionary.",
                    "label": 0
                },
                {
                    "sent": "Where's the work?",
                    "label": 0
                },
                {
                    "sent": "Dictionaries degenerate, I highlighted the wrong thing here.",
                    "label": 0
                },
                {
                    "sent": "The dictionary is degenerate.",
                    "label": 1
                },
                {
                    "sent": "If one of if one or more of these entries is 0, being degenerate in itself is not a bad thing.",
                    "label": 1
                },
                {
                    "sent": "But doing it degenerate pivot is a bad thing, and that's different.",
                    "label": 0
                },
                {
                    "sent": "So let's take a look at this for a second.",
                    "label": 1
                },
                {
                    "sent": "I have all three of the objective function coefficients are positive.",
                    "label": 0
                },
                {
                    "sent": "I could pick any of them as my entering variable.",
                    "label": 0
                },
                {
                    "sent": "I am always greedy and choose the largest coefficient.",
                    "label": 0
                },
                {
                    "sent": "So if I choose the five here and look down, this is going at a rate of two starting from one.",
                    "label": 0
                },
                {
                    "sent": "So X2 could go to 1/2.",
                    "label": 0
                },
                {
                    "sent": "This ones going up, so I don't care.",
                    "label": 0
                },
                {
                    "sent": "This is going down, so I do care, but it's starting at 0.",
                    "label": 0
                },
                {
                    "sent": "See so that's kind of a.",
                    "label": 0
                },
                {
                    "sent": "A bad thing I want X2 to increase.",
                    "label": 0
                },
                {
                    "sent": "I'm trying to increase my objective function 6 to something larger and nothing changes if I do this pivot with W5 and X2 I can do the pivot.",
                    "label": 0
                },
                {
                    "sent": "I can rearrange the equations with X two here and W 5 here, but the objective function won't change.",
                    "label": 0
                },
                {
                    "sent": "Now that would be.",
                    "label": 0
                },
                {
                    "sent": "That's a degenerate pivot.",
                    "label": 0
                },
                {
                    "sent": "Not all pivots are degenerative.",
                    "label": 0
                },
                {
                    "sent": "I picked W 1.",
                    "label": 0
                },
                {
                    "sent": "For my entering variable look down here I go minus three.",
                    "label": 0
                },
                {
                    "sent": "That's so that gives me something there.",
                    "label": 0
                },
                {
                    "sent": "I got this minus here is like this one, but this one there's a + here on the W Five row W5 goes up so I don't have to worry about the zero here when there's a what I'm doing.",
                    "label": 0
                },
                {
                    "sent": "W one is by entering variable.",
                    "label": 0
                },
                {
                    "sent": "So this would be a degenerate dictionary, but if I pick W 1 to enter it will be a non degenerate pivot.",
                    "label": 0
                },
                {
                    "sent": "I will actually make progress, whereas if I pick X2 to enter.",
                    "label": 0
                },
                {
                    "sent": "I'll do a degenerate pivot.",
                    "label": 0
                },
                {
                    "sent": "I'll make no progress.",
                    "label": 0
                },
                {
                    "sent": "And making no progress as a boy.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Bad thing.",
                    "label": 0
                },
                {
                    "sent": "Mom.",
                    "label": 0
                },
                {
                    "sent": "Because it raises the possibility that things can really go wrong.",
                    "label": 0
                },
                {
                    "sent": "You could make a pivot and make another pivot, another pivot and come back to where you started.",
                    "label": 0
                },
                {
                    "sent": "That would be a bad thing, so that's called cycling.",
                    "label": 0
                },
                {
                    "sent": "And of course when we do this by hand on the screen with my little pivot tool, we can remember.",
                    "label": 0
                },
                {
                    "sent": "And if we get into trouble we can just do things differently the next time.",
                    "label": 0
                },
                {
                    "sent": "But if you program a computer to solve these things automatically, which is what we're really doing, what we're really talking about then.",
                    "label": 0
                },
                {
                    "sent": "Your computer is not quite as smart as you, and it might not realize what's going on.",
                    "label": 0
                },
                {
                    "sent": "It might just, it's just.",
                    "label": 0
                },
                {
                    "sent": "Using some rule for picking the entering variable and for picking the leading variable and an, it may unfortunately get into a cycle, and once it does that, it's an infinite loop and the thing never finishes, and that's a bad thing.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "But there's ambiguity in the pivot rules, there's a choice of who I pick to enter.",
                    "label": 1
                },
                {
                    "sent": "If there's lots of things that are positive, and there's often even choice of which variable will leave, I didn't.",
                    "label": 0
                },
                {
                    "sent": "We didn't have any examples of that yet, but you know, when I do all these little ratios, it could be two or three of them that were a tie on which one will leave and.",
                    "label": 0
                },
                {
                    "sent": "And so there is.",
                    "label": 0
                },
                {
                    "sent": "You have to talk about rules of how to pick the leading variable when there's ties as to which one hit zero first.",
                    "label": 0
                },
                {
                    "sent": "And so the simplex method as I showed it to you is not a well defined algorithm.",
                    "label": 0
                },
                {
                    "sent": "We have to specify what these particular rules are.",
                    "label": 0
                },
                {
                    "sent": "So we call these pivot rules, and I've been advocating the largest coefficient rule, but we don't have to use that rule.",
                    "label": 0
                },
                {
                    "sent": "It's just common thought makes the greatest rate of increase, but it might not make a big jump anyway.",
                    "label": 0
                },
                {
                    "sent": "The hope is that if we use some.",
                    "label": 0
                },
                {
                    "sent": "Smartly chosen pivot rule, such as the largest coefficient rule.",
                    "label": 1
                },
                {
                    "sent": "We can prove that the simplex method will not cycle.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let's see if we can do that.",
                    "label": 0
                },
                {
                    "sent": "Well, it turns out.",
                    "label": 0
                },
                {
                    "sent": "That that the largest coefficient rule is not immune to cycling.",
                    "label": 0
                },
                {
                    "sent": "And here is the smallest example known in the world I believe.",
                    "label": 0
                },
                {
                    "sent": "I could be wrong about that, but I just figured this one out a few weeks ago.",
                    "label": 0
                },
                {
                    "sent": "It's hard to find these examples, and this is a minor modification of a well known example, but it's a better one, I think, because the numbers are smaller.",
                    "label": 0
                },
                {
                    "sent": "It's been proved 50 years ago or something that you cannot have cycling in a problem with less than two variables and four constraints.",
                    "label": 0
                },
                {
                    "sent": "And by the way, I didn't need this extra.",
                    "label": 0
                },
                {
                    "sent": "Sorry I said that backwards two constraints and four variables.",
                    "label": 0
                },
                {
                    "sent": "I didn't need this last constraint here.",
                    "label": 0
                },
                {
                    "sent": "I only put this on because I wanted to have a problem where.",
                    "label": 0
                },
                {
                    "sent": "Once we do that, we can at some point make a non degenerate pivot and move away from this area of cycling.",
                    "label": 0
                },
                {
                    "sent": "So if I if I hadn't had this as a constraint, then there's nowhere to go.",
                    "label": 0
                },
                {
                    "sent": "The objective function has to be 0.",
                    "label": 0
                },
                {
                    "sent": "So I threw that on just to make the cycling be taking place at a non optimal point.",
                    "label": 0
                },
                {
                    "sent": "You can cycle at an optimal point and just not realize it's optimal because you're cycling among all these degenerate representations of the problem and not ever discovering the one that tells you.",
                    "label": 0
                },
                {
                    "sent": "Oh this is by the way, optimal.",
                    "label": 0
                },
                {
                    "sent": "So anyway, this is the smallest example and let me.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Show you what the pivot tool does so odisseia with.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Rules are I have to be very specific about it.",
                    "label": 0
                },
                {
                    "sent": "The entering variables, the largest coefficient rule, believing variable is what's called the smallest index rule index.",
                    "label": 0
                },
                {
                    "sent": "Is the subscript right?",
                    "label": 0
                },
                {
                    "sent": "So one is smaller than two is smaller than three, is smaller than 4 zero X one comes before X2B4X34X4 and the WS come after the X is so W one comes after X4 and W2 after W one and so on.",
                    "label": 0
                },
                {
                    "sent": "So I pick the smallest index when there's a choice in the leaving variable.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So if we use that rule.",
                    "label": 0
                },
                {
                    "sent": "X1 is the entering variable here and.",
                    "label": 0
                },
                {
                    "sent": "The smallest index rule tells me to use W one as my leaving variable smaller index and W2.",
                    "label": 0
                },
                {
                    "sent": "So I do that pivot and I get to here and so now five is bigger than four, so X2 is my entering variable.",
                    "label": 0
                },
                {
                    "sent": "And X one comes before W. Oh, I'm putting the WS first, not the excess first I guess, oh I forgot my ordering here.",
                    "label": 0
                },
                {
                    "sent": "So W2, or maybe I typed this wrong.",
                    "label": 0
                },
                {
                    "sent": "Anyway, what did I do?",
                    "label": 0
                },
                {
                    "sent": "I used X1 and X.",
                    "label": 0
                },
                {
                    "sent": "Yes, I did use W2.",
                    "label": 0
                },
                {
                    "sent": "Yes, OK, so W. So the WS come before the X is.",
                    "label": 0
                },
                {
                    "sent": "I forgot my convention.",
                    "label": 0
                },
                {
                    "sent": "So then W2 goes here and now I have X3 and I look here and X one comes before X2.",
                    "label": 0
                },
                {
                    "sent": "So it's X1 and X3 swap and here anyway you go through.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "An you just follow this rule rigorously and you get to hear where W1 and W2 are back on the left and X one X2X3 and X4 are back on the right.",
                    "label": 0
                },
                {
                    "sent": "We're back to the original dictionary.",
                    "label": 0
                },
                {
                    "sent": "The columns have been swapped around a little bit, but that doesn't matter, it's the.",
                    "label": 0
                },
                {
                    "sent": "It's the same dictionary.",
                    "label": 0
                },
                {
                    "sent": "And so we're back to where we started and we've cycled.",
                    "label": 0
                },
                {
                    "sent": "So this phenomenon is very rare.",
                    "label": 0
                },
                {
                    "sent": "I recently just a month ago wrote a program that generates random 2 by 4 problems that are that are degenerate, so both the right hand sides were zero and I ran this a billion times and did not find a single example that cycle, so it's hard to find.",
                    "label": 1
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I did find this example, but I didn't do it randomly.",
                    "label": 0
                },
                {
                    "sent": "I took a known example from 40 years ago or something and started with it and just made small changes to it to try to make the numbers better.",
                    "label": 0
                },
                {
                    "sent": "So this isn't that different from the.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "From the well known example.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Degeneracy can be a problem because you can cycle.",
                    "label": 0
                },
                {
                    "sent": "It's extraordinarily rare, at least on 2 by 4 problems.",
                    "label": 0
                },
                {
                    "sent": "I don't know how rare it is on bigger problems.",
                    "label": 0
                },
                {
                    "sent": "Probably not so rare on bigger problems.",
                    "label": 0
                },
                {
                    "sent": "Better have lots of degeneracy.",
                    "label": 1
                },
                {
                    "sent": "So we need a method for addressing this, and the method I want to show you is called the perturbation method.",
                    "label": 0
                },
                {
                    "sent": "So here's what we do.",
                    "label": 0
                },
                {
                    "sent": "We have a problem here that I'm showing here with just two variables X1 and X2.",
                    "label": 0
                },
                {
                    "sent": "And the right hand side is 0, all zeros.",
                    "label": 0
                },
                {
                    "sent": "And I, but I'm going to perturb the right hand side by adding epsilon one.",
                    "label": 0
                },
                {
                    "sent": "I didn't know how to make an epsilon in Java.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to put an epsilon one and add it to the 1st right hand side epsilon two.",
                    "label": 0
                },
                {
                    "sent": "I'm going to add to the second right hand side and epsilon three.",
                    "label": 0
                },
                {
                    "sent": "I'm going to add to the third right hand side, so I put this little identity matrix, multiplying this epsilon one epsilon.",
                    "label": 0
                },
                {
                    "sent": "This is now a new symbolic right hand side.",
                    "label": 1
                },
                {
                    "sent": "It's no longer all zeros at zeros perturbed by these epsilons, and these epsilons are not numbers, they're just symbols, and the symbols will have the following properties whenever I.",
                    "label": 0
                },
                {
                    "sent": "Whenever I'm doing ratios whenever checking any qualities, the data for the problem with big compared to the epsilon one, which will be huge compared epsilon, two etc.",
                    "label": 1
                },
                {
                    "sent": "But all the epsilons will be positive, so we without giving them particular values we think of them this way.",
                    "label": 0
                },
                {
                    "sent": "So if I do that and then I use the largest coefficient rules.",
                    "label": 0
                },
                {
                    "sent": "So I picked the four to enter and I go down here and I have two choices here for the leaving row of minus one here in the minus one there, but W one can go up to epsilon, 1X2 can go up to epsilon one before W 180.",
                    "label": 0
                },
                {
                    "sent": "And X2 can go up to epsilon two before W two hits zero but epsilon 2:00 is way smaller than epsilon one.",
                    "label": 0
                },
                {
                    "sent": "So W two hits, zero first.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "And so W2 is my leading variable and I do the pivot now have a 14 here an I think I showed it in the next slide.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I have a 14 here now.",
                    "label": 0
                },
                {
                    "sent": "I looked down and I have at the minus two and the minus one here this.",
                    "label": 0
                },
                {
                    "sent": "This act.",
                    "label": 0
                },
                {
                    "sent": "X1 can go up.",
                    "label": 0
                },
                {
                    "sent": "At a rate of two has to go up to epsilon, 1 minus epsilon, two epsilon, two is tiny compared epsilon one, so let's just that's basically epsilon one, whereas this one.",
                    "label": 0
                },
                {
                    "sent": "Can go up to epsilon 2 plus epsilon three, while it's tiny.",
                    "label": 0
                },
                {
                    "sent": "So basically epsilon two.",
                    "label": 0
                },
                {
                    "sent": "So Oh yeah, and that's the right one.",
                    "label": 0
                },
                {
                    "sent": "This is right too, but that doesn't really matter.",
                    "label": 0
                },
                {
                    "sent": "So the fact that there's this one can only go up on 2, and that's way smaller than epsilon.",
                    "label": 0
                },
                {
                    "sent": "One tells me that W 3 must be the leaving variable, and so I do the pivot and I've solved my problem.",
                    "label": 1
                },
                {
                    "sent": "I didn't do it, so the whole input.",
                    "label": 0
                },
                {
                    "sent": "The important point here is at every iteration now.",
                    "label": 0
                },
                {
                    "sent": "Even though I'm doing degenerate pivots.",
                    "label": 0
                },
                {
                    "sent": "My symbolic objective function is strictly increasing 'cause with the epsilons in there.",
                    "label": 0
                },
                {
                    "sent": "I never did a degenerate pivot.",
                    "label": 0
                },
                {
                    "sent": "And Furthermore you will never epsilons will.",
                    "label": 0
                },
                {
                    "sent": "You'll never get a row with all the epsilons having coefficients of 0.",
                    "label": 0
                },
                {
                    "sent": "Because all of our pivot operations are reversible and this is an identity we started with an identity matrix here.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you think of this little matrix here, this is a full rank matrix.",
                    "label": 0
                },
                {
                    "sent": "It's not possible to do a pivots and reduce the rank of this matrix, and so you'll always have some epsilon.",
                    "label": 0
                },
                {
                    "sent": "You won't get a roll of zero coefficients in this little three by three matrix.",
                    "label": 0
                },
                {
                    "sent": "You'll always have some epsilons.",
                    "label": 0
                },
                {
                    "sent": "You'll always be doing non degenerate pivots.",
                    "label": 0
                },
                {
                    "sent": "Not the objective function in the right hand side is never 0.",
                    "label": 0
                },
                {
                    "sent": "With the epsilons, but they were just symbolic parameters, and so once you're done once you've gotten.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Either solve the problem, or once you've just gotten out of the degenerate situation, you can throw away the epsilons and say I don't care about them.",
                    "label": 0
                },
                {
                    "sent": "I've solved my original problem, so the perturbation method is a very simple and useful technique for address.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sing the problem of cycling.",
                    "label": 0
                },
                {
                    "sent": "There are other pivot rules that one can talk about.",
                    "label": 1
                },
                {
                    "sent": "There's the smallest index rule, which is to choose the.",
                    "label": 1
                },
                {
                    "sent": "A variable with the smallest index.",
                    "label": 0
                },
                {
                    "sent": "So for entering variable that has to be, choose the entering, choose the variable with a positive coefficient that has the smallest index rather than the largest coefficient.",
                    "label": 1
                },
                {
                    "sent": "And so if you pick both the entering and the leaving variable using the smallest index rule that's known as Bland's rule.",
                    "label": 1
                },
                {
                    "sent": "Anne Bland's rule has been proved not to cycle.",
                    "label": 0
                },
                {
                    "sent": "You can also select at random.",
                    "label": 0
                },
                {
                    "sent": "And that's a good thing, because then the probability that you you may cycle 'cause you just select the things at random, but the next time you'll select things at random again and you make a different selection and you won't cycle.",
                    "label": 1
                },
                {
                    "sent": "So random selection is also a good rule for avoiding cycling in practice on a computer.",
                    "label": 0
                },
                {
                    "sent": "People have also considered the greatest increase rule actually figure out which of the possible entering variables would give me the biggest increase in my objective function.",
                    "label": 0
                },
                {
                    "sent": "But that actually if you think about it, is.",
                    "label": 0
                },
                {
                    "sent": "Doing a lot of.",
                    "label": 0
                },
                {
                    "sent": "Numerical linear algebra per pivot and the expense per pivot goes up quite a lot, and so that rule is actually not competitive computationally.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, just a brief few words about the geometry of degeneracy, so already qualities of course are.",
                    "label": 0
                },
                {
                    "sent": "Our hyperplane or half spaces, and we're intersecting these half spaces in N dimensional space and so are feasible.",
                    "label": 0
                },
                {
                    "sent": "Set is 2.",
                    "label": 0
                },
                {
                    "sent": "Dimensions is a Polygon and higher dimensions.",
                    "label": 0
                },
                {
                    "sent": "It's a polytope multifaceted convex object.",
                    "label": 0
                },
                {
                    "sent": "And the simplex method is going from from vertex to vertex.",
                    "label": 0
                },
                {
                    "sent": "So we started say at 000 and when we increase just one variable at a time, say if I pick X1 as my first entering variable, when I a dictionary corresponds to a vertex basically, and so if I did the first pivot with X one entering, I would pivot to hear if I did the second pivot with say X2 being my entering variable, I would go to this vertex if I pick my next pivot with.",
                    "label": 0
                },
                {
                    "sent": "With X3's mentoring variable, I would go to this vertex and so on, but.",
                    "label": 0
                },
                {
                    "sent": "And you'll notice each vertex here has this vertex is the intersection of three planes and the knowing which of the three planes?",
                    "label": 0
                },
                {
                    "sent": "Determines that vertex also determines which variables are the three basic variables for that problem.",
                    "label": 0
                },
                {
                    "sent": "Those are the.",
                    "label": 0
                },
                {
                    "sent": "Actually tell which ones, which variables are zero, so it tells me.",
                    "label": 0
                },
                {
                    "sent": "It tells me which ones are the non basics.",
                    "label": 0
                },
                {
                    "sent": "Anyway, look at this corner up here.",
                    "label": 0
                },
                {
                    "sent": "Well, I mean, look at this example.",
                    "label": 0
                },
                {
                    "sent": "In this example the corner up here actually has four faces defining it.",
                    "label": 0
                },
                {
                    "sent": "There's the three colored ones.",
                    "label": 0
                },
                {
                    "sent": "But then there's the back plane, the X 2X3 plane, so there's four faces making this single vertex, but a vertex is defined by just three, and so there's multiple ways of expressing this same geometric point.",
                    "label": 0
                },
                {
                    "sent": "I have to pick three of the faces.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Yeah, I said it wrong a minute ago to determine my basic variables.",
                    "label": 0
                },
                {
                    "sent": "Those are the.",
                    "label": 0
                },
                {
                    "sent": "R. Anyway, so.",
                    "label": 0
                },
                {
                    "sent": "I have a.",
                    "label": 0
                },
                {
                    "sent": "Multiple ways of representing this vertex here.",
                    "label": 0
                },
                {
                    "sent": "I could say that I could say X2.",
                    "label": 0
                },
                {
                    "sent": "Let's see this point here.",
                    "label": 0
                },
                {
                    "sent": "It has X 2 = 0 X 1 = 0 it has.",
                    "label": 0
                },
                {
                    "sent": "This inequality has a zero slack, so that's the first or second one that's the, that's the second one.",
                    "label": 0
                },
                {
                    "sent": "So let's W2 is equal to 0 at this one, and W one is equal to 0 at this One South.",
                    "label": 0
                },
                {
                    "sent": "Of those four things I have to pick.",
                    "label": 0
                },
                {
                    "sent": "Three of them to be non basic and one of them to be basic and so there's four different ways of doing that in those four different dictionaries that represent that single geometric vertex.",
                    "label": 0
                },
                {
                    "sent": "So that's what that's what the degeneracy is.",
                    "label": 0
                },
                {
                    "sent": "Geometrically.",
                    "label": 0
                },
                {
                    "sent": "It's too many faces coming together at a single vertex.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK. Now another thing is probably the most important thing is efficiency of these algorithms and the simplex method is a very efficient algorithm, and that's Huawei after 60 years or 70 years, it's still very popular.",
                    "label": 0
                },
                {
                    "sent": "So, given a problem of a certain size, how long does it take to solve it?",
                    "label": 1
                },
                {
                    "sent": "How many iterations does it take?",
                    "label": 0
                },
                {
                    "sent": "It's easy to figure out how much work per iteration, so the main question is how many iterations?",
                    "label": 1
                },
                {
                    "sent": "And there's two kinds of answers.",
                    "label": 0
                },
                {
                    "sent": "Of course, there's the average performance on typical problems of a certain size, and there's the worst case performance on the hardest problem.",
                    "label": 0
                },
                {
                    "sent": "The average case is, of course, mathematically difficult 'cause you have to introduce some probability space and say what's an average problem.",
                    "label": 0
                },
                {
                    "sent": "I mean, what's a?",
                    "label": 0
                },
                {
                    "sent": "What's a random problem look like and then try to take the average of how many pivots it takes.",
                    "label": 0
                },
                {
                    "sent": "Very difficult, but it's easy to do empirical studies and I'll show you one in just a minute.",
                    "label": 0
                },
                {
                    "sent": "The worst case analysis is is to say well, let me try to construct a really bad example and make it the worst possible example, and that actually we can do and I will do in a few minutes.",
                    "label": 0
                },
                {
                    "sent": "But it turns out that for the for the simplex method, there's a huge huge difference between the worst case and the average case, and so even though this is interesting, it's in practice of limited value.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, it's also, I think useful to think about how one should even measure the size of a problem.",
                    "label": 0
                },
                {
                    "sent": "I give you a matrix AB&C.",
                    "label": 0
                },
                {
                    "sent": "That's the data for the problem.",
                    "label": 0
                },
                {
                    "sent": "One could call the size of the problem M&N, but that's two parameters, not one and.",
                    "label": 0
                },
                {
                    "sent": "Size should just be one number somehow, so you could.",
                    "label": 1
                },
                {
                    "sent": "You could refer to the number of data elements which is.",
                    "label": 1
                },
                {
                    "sent": "Roughly M * N, It's actually 1 + 1 * N + 1.",
                    "label": 0
                },
                {
                    "sent": "If I throw in the B and the C. Enough to subtract 1 anyway.",
                    "label": 0
                },
                {
                    "sent": "But real world problems.",
                    "label": 0
                },
                {
                    "sent": "The amatrix is usually extraordinarily sparse.",
                    "label": 0
                },
                {
                    "sent": "Zeros all over the place.",
                    "label": 0
                },
                {
                    "sent": "So we store these matrices not as just dense, 2 dimensional arrays, but with sparse matrix technology, and it doesn't seem quite fair if I have, say, just a diagonal matrix and end by end matrix, which is just all zeros and just numbers except for numbers on the diagonal.",
                    "label": 0
                },
                {
                    "sent": "Seems unfair to call that an end squared.",
                    "label": 0
                },
                {
                    "sent": "Sized product matrix of data.",
                    "label": 0
                },
                {
                    "sent": "It's just N so it might make more sense.",
                    "label": 1
                },
                {
                    "sent": "This represents the size of the problem is the number of non zero data elements.",
                    "label": 0
                },
                {
                    "sent": "Or you could even say I have some language which allows me to formulate problems and my favorite language is ample.",
                    "label": 0
                },
                {
                    "sent": "For optimization.",
                    "label": 0
                },
                {
                    "sent": "And how long is my little model that expresses the problem together with the data that goes with that model?",
                    "label": 0
                },
                {
                    "sent": "How?",
                    "label": 0
                },
                {
                    "sent": "How big is that?",
                    "label": 0
                },
                {
                    "sent": "And that's really the size of the problem.",
                    "label": 0
                },
                {
                    "sent": "Anyway, these things it's a little bit tricky as to what you really mean, but people tend to just use the simplest things and stick with them.",
                    "label": 0
                },
                {
                    "sent": "And even though it's not really quite right.",
                    "label": 0
                },
                {
                    "sent": "Also, measuring time of course, computers get faster all the time and so the time per iteration is changing with technology, but the number of iterations is the fundamental mathematical thing, and so we focus on that.",
                    "label": 1
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here is the famous worst case problem discovered by Klee and Minty, published back in 1972.",
                    "label": 0
                },
                {
                    "sent": "It looks like this so it's got all these.",
                    "label": 0
                },
                {
                    "sent": "The data is growing exponentially with powers of two and powers of 100.",
                    "label": 0
                },
                {
                    "sent": "It's a big mess.",
                    "label": 0
                },
                {
                    "sent": "But if we look at just the N = 3 example of it.",
                    "label": 0
                },
                {
                    "sent": "Here it is and if we look at this, let's look at the constraints.",
                    "label": 0
                },
                {
                    "sent": "The variables are non negative.",
                    "label": 0
                },
                {
                    "sent": "The first constraint just says that X1 smaller than one.",
                    "label": 0
                },
                {
                    "sent": "So X ones are small number, well is between zero and one effects one is between zero and one, then 4X ones between zero and four, and so roughly speaking, this second constraint is saying that X2, which is already known to be bigger than zero, is less than a roughly 100, not exactly 100.",
                    "label": 0
                },
                {
                    "sent": "It depends a little bit on X1, but roughly 196 to 100, and so X one is between zero and one X2 is between 0 and 100 X 3.",
                    "label": 0
                },
                {
                    "sent": "By the same kind of logic.",
                    "label": 0
                },
                {
                    "sent": "That even though X one X2 appear here, they're kind of smallish numbers, and so roughly speaking, X3 is between 0 and 10,000.",
                    "label": 0
                },
                {
                    "sent": "So this looks like a distorted cube actually, and I have a pic.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Revit.",
                    "label": 0
                },
                {
                    "sent": "Here looks roughly like this.",
                    "label": 0
                },
                {
                    "sent": "It's not exactly, of course, that things have been stretched.",
                    "label": 0
                },
                {
                    "sent": "This is from zero to 1 here.",
                    "label": 0
                },
                {
                    "sent": "This is from zero to 100 here.",
                    "label": 0
                },
                {
                    "sent": "This is from zero to 10,000 here, so it's not a cube in the sense of having the same size in each direction.",
                    "label": 0
                },
                {
                    "sent": "But Furthermore, it's not exactly a cube because the Heights are not all the same.",
                    "label": 0
                },
                {
                    "sent": "This is 999 thousand 90, two 9590, two 9600.",
                    "label": 0
                },
                {
                    "sent": "This is 96, and so on.",
                    "label": 0
                },
                {
                    "sent": "But it's almost a cube and.",
                    "label": 0
                },
                {
                    "sent": "It takes, oh, I should go back if we do the simplex method with the largest coefficient rule.",
                    "label": 0
                },
                {
                    "sent": "What was the largest coefficient?",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Largest coefficient is 4 on X1, so X one wants to enter.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And but when X1 enters, we can only go this short distance to the one here.",
                    "label": 0
                },
                {
                    "sent": "And once we've done that, we're sort of in trouble and actually, well, here's what happens.",
                    "label": 0
                },
                {
                    "sent": "We go from here to here, to here to here.",
                    "label": 0
                },
                {
                    "sent": "Now we go up to here, then we go over here over here.",
                    "label": 0
                },
                {
                    "sent": "Over here we visit all.",
                    "label": 0
                },
                {
                    "sent": "8.",
                    "label": 0
                },
                {
                    "sent": "Vertices taking seven pivots to do it 2 to the N -- 1 pivots an that's true not with an equal to three, but in all cases with the Clementi problem.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I think it's fun and interesting to understand this fully an.",
                    "label": 0
                },
                {
                    "sent": "The original Clementi paper is a little bit hard to read, I thought, and so I spent some time thinking about it and it came up with, I think, a good way to to understand the Clementi.",
                    "label": 0
                },
                {
                    "sent": "Problem.",
                    "label": 0
                },
                {
                    "sent": "And so first of all these numbers, 110,000 are not terribly important.",
                    "label": 0
                },
                {
                    "sent": "We really just want a sequence of numbers, B1B2B3 and so on that are much that are increasing very rapidly.",
                    "label": 0
                },
                {
                    "sent": "But more importantly, at least for making the problem simple to understand, is not to just have the 1st right hand side BB1 and B2 and B3 and B4 etc.",
                    "label": 0
                },
                {
                    "sent": "But have B1 and for the 2nd right inside make it 2 B 1 + B two.",
                    "label": 0
                },
                {
                    "sent": "The third one should be 4 B 1 + 2 B 2 + B three, and so forth.",
                    "label": 0
                },
                {
                    "sent": "Because B4 is huge compared to B3 and B2 and B1, this is still essentially the same number of B4, but I put these little pieces on here.",
                    "label": 0
                },
                {
                    "sent": "This is like the perturbation method that I showed you a few minutes ago.",
                    "label": 0
                },
                {
                    "sent": "And that these things don't matter very much, but they make the.",
                    "label": 0
                },
                {
                    "sent": "A very simple pattern appear as we do the pivots and that's the key here, so let's see.",
                    "label": 0
                },
                {
                    "sent": "Do I have this thing coming up?",
                    "label": 0
                },
                {
                    "sent": "So all of this stuff here is just my.",
                    "label": 0
                },
                {
                    "sent": "Objective of.",
                    "label": 0
                },
                {
                    "sent": "My parameterized we're going to call it modified right hand sides.",
                    "label": 0
                },
                {
                    "sent": "The actual variables are here.",
                    "label": 0
                },
                {
                    "sent": "You got your geometric progression on the coefficients.",
                    "label": 0
                },
                {
                    "sent": "Here you've got zeros on the above the diagonal you got ones on the diagonal.",
                    "label": 0
                },
                {
                    "sent": "You got this geometric progression below the diagonal, which by the way skips the number 2, and I've actually never understood why, and I suspect you don't need to do that, but I'm not 100% sure interesting.",
                    "label": 0
                },
                {
                    "sent": "Simple maybe.",
                    "label": 0
                },
                {
                    "sent": "Minor research question.",
                    "label": 0
                },
                {
                    "sent": "Could I have done this with 1248 instead of 1, four, 816?",
                    "label": 0
                },
                {
                    "sent": "Not sure, I just stuck with what Klee and Minty did originally, but I did but I did discover that over here 1248 works and that's why I suspect it works over here as well.",
                    "label": 0
                },
                {
                    "sent": "OK, so here we're going to the pivots.",
                    "label": 0
                },
                {
                    "sent": "8 is the largest coefficients, 08 must enter.",
                    "label": 0
                },
                {
                    "sent": "If eight enters, who leaves?",
                    "label": 0
                },
                {
                    "sent": "Well, let's see W 1.",
                    "label": 0
                },
                {
                    "sent": "Can only go up to one.",
                    "label": 0
                },
                {
                    "sent": "'cause all these other only have to be one.",
                    "label": 0
                },
                {
                    "sent": "I mean all these other coefficients are zero so we always have zero above the diagonal here and so I have to pick X1.",
                    "label": 0
                },
                {
                    "sent": "And so I did that pivot.",
                    "label": 0
                },
                {
                    "sent": "And now I see the largest coefficient is 4.",
                    "label": 0
                },
                {
                    "sent": "And there's a 0 here.",
                    "label": 0
                },
                {
                    "sent": "There's always going to be zeros above the diagonal here, and so I have to pick one of these.",
                    "label": 0
                },
                {
                    "sent": "And it turns out that W2 basically is a size B2, and W3 is basically the size B3 'cause we always have zeros above here.",
                    "label": 0
                },
                {
                    "sent": "And so B2 is much smaller than B3, is much more than before.",
                    "label": 0
                },
                {
                    "sent": "So W2 is going to be the one to pick next.",
                    "label": 0
                },
                {
                    "sent": "So X2 goes with W2.",
                    "label": 0
                },
                {
                    "sent": "By the way, you can think about it whenever I pick something, the entering variable and the leading variable are in the same position.",
                    "label": 0
                },
                {
                    "sent": "So if it's the first one, there is the first one there.",
                    "label": 0
                },
                {
                    "sent": "If it's the second one, second one and so forth.",
                    "label": 0
                },
                {
                    "sent": "So I'm always clicking on these diagonal buttons actually.",
                    "label": 0
                },
                {
                    "sent": "But anyway, I did that second pivot and now this eight pops back in here.",
                    "label": 0
                },
                {
                    "sent": "So I have to click on this button again.",
                    "label": 0
                },
                {
                    "sent": "And now I've gotten both of those alright, but now there's this two here, so I have to click on this button, but when I click on that button, it brings that eight in the four back.",
                    "label": 0
                },
                {
                    "sent": "So you can see that this is kind of bad.",
                    "label": 0
                },
                {
                    "sent": "So now I have to click on here.",
                    "label": 0
                },
                {
                    "sent": "And then I have to click on here, but that brings the 8 back then I have to click on here.",
                    "label": 0
                },
                {
                    "sent": "OK, I'm half done.",
                    "label": 0
                },
                {
                    "sent": "Now when I click on here.",
                    "label": 0
                },
                {
                    "sent": "Brings all the 8, four and two back not to click on the 8 again, by the way.",
                    "label": 0
                },
                {
                    "sent": "We're counting to two to the N in base.",
                    "label": 0
                },
                {
                    "sent": "2.",
                    "label": 0
                },
                {
                    "sent": "That's exactly what's happening there.",
                    "label": 0
                },
                {
                    "sent": "I can write that here.",
                    "label": 0
                },
                {
                    "sent": "If I.",
                    "label": 0
                },
                {
                    "sent": "Do this in reverse order left.",
                    "label": 0
                },
                {
                    "sent": "Put this on the I'm going to put a zero or a one associate whether this is purple or not.",
                    "label": 0
                },
                {
                    "sent": "I'm going to put a 01 or this is purple or not.",
                    "label": 0
                },
                {
                    "sent": "Whether this is purple or not, and so on.",
                    "label": 0
                },
                {
                    "sent": "Zero for purple and one and one for not purple.",
                    "label": 0
                },
                {
                    "sent": "So they were all purple originally.",
                    "label": 0
                },
                {
                    "sent": "I'm putting the W 1 here in the W 4 here and after the first pivot I made this one good, but these guys were bad after the second pivot.",
                    "label": 0
                },
                {
                    "sent": "This one became good but that one went bad again and these were still bad after the next pivot.",
                    "label": 0
                },
                {
                    "sent": "I fixed this again.",
                    "label": 0
                },
                {
                    "sent": "This was still good and these were bad after the next pivot I fixed this one but then these went bad after the next pivot I refixed the W 1 one and so on.",
                    "label": 0
                },
                {
                    "sent": "So you can see clearly that I'm just counting to two to the N in base 2.",
                    "label": 0
                },
                {
                    "sent": "There's even more nice properties here.",
                    "label": 0
                },
                {
                    "sent": "I don't know if you've noticed anybody notice any other nice properties that I haven't mentioned.",
                    "label": 0
                },
                {
                    "sent": "So I do another pivot if.",
                    "label": 0
                },
                {
                    "sent": "You have a property in mind, check it.",
                    "label": 0
                },
                {
                    "sent": "Our pivot on this one so you see what happens.",
                    "label": 0
                },
                {
                    "sent": "I claim that the dictionary is very easy to predict.",
                    "label": 0
                },
                {
                    "sent": "Can you predict what the next every element of the dictionary is easy to pick predict?",
                    "label": 0
                },
                {
                    "sent": "If I click on this, can you tell me what happens to all of the numbers I already told you that these the Super diagonals the above the dial stays zero all the time, but that's not all that happens a lot more than that.",
                    "label": 0
                },
                {
                    "sent": "You see what happens.",
                    "label": 0
                },
                {
                    "sent": "Anybody see the pattern?",
                    "label": 0
                },
                {
                    "sent": "All the numbers stay the same except for minus science.",
                    "label": 0
                },
                {
                    "sent": "The only thing that changes are minus signs, and I think what happens when I click on.",
                    "label": 0
                },
                {
                    "sent": "I don't remember off the top of my head exactly what the rule is, but when I click on this.",
                    "label": 0
                },
                {
                    "sent": "I think I negate the row.",
                    "label": 0
                },
                {
                    "sent": "I negate the column and this gets negated twice and so that stays the same same I think.",
                    "label": 0
                },
                {
                    "sent": "In fact, I think I need it.",
                    "label": 0
                },
                {
                    "sent": "I forget exactly.",
                    "label": 0
                },
                {
                    "sent": "I forget what happens to these, do they?",
                    "label": 0
                },
                {
                    "sent": "Those change sign.",
                    "label": 0
                },
                {
                    "sent": "Let's just click on this guy.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so I forget exactly what the rule is.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "But it's a very simple rule, so we do it again.",
                    "label": 0
                },
                {
                    "sent": "So we pick the X1 here.",
                    "label": 0
                },
                {
                    "sent": "And you see that the numbers stay the same, it's just the the minus signs change.",
                    "label": 0
                },
                {
                    "sent": "So if we look for example at at this column here, it's 4148.",
                    "label": 0
                },
                {
                    "sent": "And it's going to stay 4148.",
                    "label": 0
                },
                {
                    "sent": "It's just who has the - changes.",
                    "label": 0
                },
                {
                    "sent": "Whoops, now I have to go here.",
                    "label": 0
                },
                {
                    "sent": "Now I have to go here.",
                    "label": 0
                },
                {
                    "sent": "Now I have to go here.",
                    "label": 0
                },
                {
                    "sent": "There's also a very simple rule for exactly how the signs change, I just don't remember it off the top of my head.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "So that's it.",
                    "label": 0
                }
            ]
        }
    }
}