{
    "id": "y6fscncp65ysuzadgrl6fuxopdev7vqd",
    "title": "Data science and the curse of phase transitions",
    "info": {
        "author": [
            "Marc Mézard, École Normale Supérieure (ENS)"
        ],
        "published": "Nov. 28, 2016",
        "recorded": "November 2016",
        "category": [
            "Top->Data Science",
            "Top->Computer Science",
            "Top->Mathematics",
            "Top->Mathematics->Statistics",
            "Top->Social Sciences->Economics",
            "Top->Physics"
        ]
    },
    "url": "http://videolectures.net/BIDSAconference2016_mezard_data_science/",
    "segmentation": [
        [
            "Thank you, thanks a lot for the.",
            "The invitation is a great pleasure to be here and the introduction, so I want I want to take my own path towards data science data science.",
            "You can accommodate any branch of science into it, so it's it's wonderful from this point of view, and I want really to."
        ],
        [
            "To address it through information theory and first of all, there is a good reason for that, which is that it's 100,000 anniversary of Claude Shannon and the founder of Information Theory, and they would also like to make a bridge with the field, which is mine which is statistical physics phase transition and disordered systems and I have put here some some key figures in statistical physics and in disordered systems that baby towels just got the Noble price.",
            "A month ago, as you may know, and actually what I really want to tell you is how important is the notion of phase transition and statistical physics in core problems of information theory.",
            "So in some sense I like this this very simple introduction to statistical physics, which is an introduction in three words.",
            "It's due to Phil Anderson in a beautiful paper in science in 1972.",
            "More is different.",
            "I cannot do that in French.",
            "Maybe I'm not sure I can do it in Italian either, but in English it works very well, so it just tells you something it tells you."
        ],
        [
            "OK, we are very smart physicist and are well on the shoulders of Giants.",
            "So we know Newton slow.",
            "Maybe we are a bit smarter when you're shredding girl.",
            "Oh, we know all the basic fundamental forces of the universe, so we put in the forces and we can compute the motion and we can even study.",
            "Underdamped or overdamped or critically damped system and accelerator algorithms using that but small detail.",
            "You have this system here, which is just.",
            "Water molecules, H2O and in these two phases there is a solid phase.",
            "There is liquid phase and actually there is also a gas phase with the gas H2O phase just above the sea.",
            "These are the same molecules.",
            "They are the same forces.",
            "The interactions are the same.",
            "They are electromagnetic interaction.",
            "How comes that they build a pattern which is so different?",
            "I mean in one case it's it's solid and.",
            "Titanic knows that, for instance.",
            "I mean it's not at all the same behavior and it's all the same molecules and the same interactions.",
            "So this is, this is where more is different.",
            "I mean to understand such a system, you really need to go to a large size problem and you will never understand that.",
            "If you study 10 molecules of water, you put 10 molecules of water in your computer.",
            "You will not.",
            "You will not get that behavior."
        ],
        [
            "So this mechanism is well understood, it's even proven rigorously in some case, since last Onsager in 1944.",
            "It was studied most in some systems, which are which are spin systems, in which instead of looking at the movement of molecules, you look at this error.",
            "So relatively simple problem, similar problem, which is a problem of spins which can point up or down.",
            "So you look at the magnet you have spins in the magnet, and it turns out that because of statistical.",
            "Horseman low, it turns out that two neighboring spins they have a larger probability to point parallel than pointing anti parallel.",
            "So this probability becomes more and more biased when the temperature is lower.",
            "This is Boltzmann wait for the energy of the parallel configuration is lower than the energy of the anti parallel.",
            "When you decrease the temperature, there is a stronger bias towards spins pointing in the same direction.",
            "So this is pretty simple.",
            "With that you can understand that.",
            "When you decrease temperature spins, we like to point more parallel than type error thing, which it does not tell you and which was a big puzzle is why there should be a transition.",
            "A sharp transition at a well defined temperature.",
            "It should be great.",
            "I mean it should be something which is more much more gradual and."
        ],
        [
            "And this is.",
            "This is where really more is different.",
            "That is, the sharp transition appears only when you have a large number of spins at work, and so it's a purely collective effect.",
            "If you have four spins you just don't have a transition, so it means that you cannot support ferromagnetic state.",
            "What is a ferromagnetic state?",
            "It's a state in which.",
            "Let's say at some given temperature you will have 90% of the spins which are in the top direction, 10% which are in the opposite, the one which are in the opposite are not always the same, it fluctuates in time, but it's a state which is extremely robust, so collective order.",
            "And that's why it has been used.",
            "It is being used, for instance in informal neural networks as as a concept the transition is very sharp at the well defined temperature and it takes place only in this what we call thermodynamic limit."
        ],
        [
            "So this is a magnetization.",
            "Let's say the proportion of spins which point up or down, and at a very well defined temperature.",
            "It depends on the material the transition takes place."
        ],
        [
            "So this this is the situation that we understood in statistical physics until 1960s, let's say.",
            "And gradually physicists started to try to understand to go a bit further and try to understand what happens in dirty material when you have disorder.",
            "So for instance, there is some very obscure material which is called copper, manganese.",
            "You put 1% of impurities of manganese and copper.",
            "It turns out that the manganese they have spins.",
            "The copper does not, roughly speaking, and the spins of the manganese, they interact.",
            "But their interaction depends on the distance, so if they are matter certain distance they will tend to point parallel, but at another distance they want to be anti parallel.",
            "So you have these magnetic impurities of manganese.",
            "There they are very well defined position.",
            "They don't move basically but their spins.",
            "Depending on the position they like to be parallel or they like to be anti parallel.",
            "This is a much more complicated.",
            "This is a much more complicated problem.",
            "Basically the previous problem you see each spin was doing the same thing.",
            "So speaking here in this University I would say there is a relatively simple way to address that, which is a theory of the representative spin.",
            "Like you look at the representative agent.",
            "If you have agents on the market, every agent has the same strategy.",
            "Well, you can say let me study one agent and I assume that all the other agents are doing the same thing, which is which is right and I write a self consistent equation.",
            "It with spins and I have the rough pattern of the phase transition in Ferromagnets now in spin glasses it's much, much more complicated.",
            "We have technically I don't have a representative spin, everyone is different individual and so basically what we had to do in order to understand what happens in a spin glasses.",
            "It was to keep track of each single individual, each single spin and at the same time understand the collective collective property.",
            "And then you can start and you can see that I'm slightly bridge bridging the small gap with with introduction of Michael previously when he was saying we want to go from a kind of collective pattern tools to understanding what happens at the level of every single individual.",
            "So spin glasses.",
            "They have some weird behavior."
        ],
        [
            "For one, the very fundamental reason is that if you take 3 spins, if you imagine that they are distances such that they like to be anti parallel where there is no way that you can satisfy all the three of them.",
            "Can you put one of them?",
            "You put the other one type error and the third one you can do it.",
            "So that's called frustration for obvious reason and because of this."
        ],
        [
            "These two properties, the fact that all the spins are different and there is frustration.",
            "It turns out that it is very difficult to find the optimal configuration.",
            "It's extremely difficult from a computational point of view.",
            "It's a NP hard problem and at."
        ],
        [
            "The same time we if you if you draw the energy landscape, if you like to see what is the energy of a spin configuration in a spin glass, it will look something like that.",
            "Uniform magnetic was very simple.",
            "Basically there was a convex well of the positive magnetization States and another convex well of the negative magnetization.",
            "So that was very easy, just two valets related by a symmetry.",
            "Here it's an extremely complex system and in some case you can have a very privileged configuration, which I called the crystal.",
            "And and you want to find this crystal in a sea of metastable states, which are the glass States and that's typically the kind of situation that we will have to face in many problems of information theory."
        ],
        [
            "I should have said it was just returning the previous site.",
            "That spin glasses are totally useless.",
            "When I started on spin glasses, that was several decades ago.",
            "There were already thousands of papers nobody has ever, as far as I know, nobody's had a grant on spin glass, and actually, probably because of that reason.",
            "Spin glasses was that much more in France and interleave them in the in the US, but it has always fascinated everybody, and I will come back to that at the end of the.",
            "Of the talk.",
            "Nevertheless, spin class later on was found out and called the Cornucopia.",
            "It turns out that in the understanding spin classes, we developed a very sophisticated and powerful corpus of concepts and methods which are used in very different fields."
        ],
        [
            "And why is that?",
            "Well, basically I was.",
            "I was telling you in some sense already before, that is understanding spin glass.",
            "It means going one big step beyond the representative agent.",
            "I mean, it means being able to understand what happens when you have a lot of singular element, individual element.",
            "Each of them is different from all the others and.",
            "You are able to do basically the statistics of all the agents anget simultaneously.",
            "The understanding of what happened at the individual agent level and."
        ],
        [
            "At the statistic of agents.",
            "So if you are able to do that well, you can do something much, much nicer than understanding of market in which everybody is doing the same thing."
        ],
        [
            "I mean, you can go to something which is much more real life application let's say so now after this introduction and spin classes I want to I want to go to information theory and I will.",
            "I will address 2 problems, 2 very basic problems of information theory and tell you the role of phase transitions in information theory and the 1st."
        ],
        [
            "One is in form is error correcting code, so this goes back really to early days of information theory.",
            "It goes back to Shannon's work in 1948 and Shannon asked the question of information transfer.",
            "That is, we are using information transfer.",
            "Or the time, and it's probably one of the most important part of science that we are using everyday.",
            "We use it if we want to communicate.",
            "We use it as soon as we write data on our hard disk."
        ],
        [
            "We use it when you when we have, for instance, vision going from the retina to the to the brain.",
            "We use it when we have cell division.",
            "We have information which is encoded in the DNA which has to be transferred to the daughter cells.",
            "And they use it as soon as I give a talk in front of you.",
            "In all this case."
        ],
        [
            "This we use a mechanism of error correction if there is no error correction, it's extremely difficult to communicate and actually I'm using error correction right now.",
            "Just because language is redundant, language is extremely redundant and that's.",
            "A very good thing because this redundancy is what allows you to correct.",
            "As soon as I have a slight mispronunciation.",
            "If language was not well, not redundant, then you will not be able to understand me.",
            "And the same thing if here if I see that someone is not following very well, well, probably I will just repeat what I was saying in a slightly different way that the basic basics of teaching.",
            "And that's what channel understood and he told he told us well, the general scheme is the following.",
            "You have a message that you want to send, then what you should do is encode the message and you will see an encoding.",
            "The message is adding redundancy and then you will send it through the noisy channel.",
            "You will receive a message which is blurred version of the encoded message and then you will decode.",
            "So that's the general scheme.",
            "So an example of the simplest example of redundancies or repetition code that is you have you want to send this image, for instance, and you just send it 3 times.",
            "That's a very clumsy way of doing redundancy that the basic one, and then you send it through the channel.",
            "This channel has probably 10% of noise or something a bit less than that, and you see that each bit can be corrupted.",
            "It can be flipped with a certain probability, so you receive these three images.",
            "How do you reconstruct the original?",
            "Image Ware here.",
            "You have a very simple algorithm.",
            "You look at each pixel and you look at the majority rule.",
            "So if the top left pixel was black, white and black, you decide that it is black and so on and so forth.",
            "And you see that yes indeed the picture that you get is a bit better than the one the without the redundancy.",
            "Kind of obvious in some sense.",
            "So how can you improve that immediately?",
            "Everybody will tell me where it see.",
            "It's very easy.",
            "Instead of sending three times the image you send it.",
            "17 times and then you will improve, and that's correct.",
            "But it's costly.",
            "And so you see that you have to trade off.",
            "You have to trade between the level of redundancy and the level of performance.",
            "And one thing that Shannon found and which was a surprise which is which is a really a surprise if you think about it a little bit is that there exists code which are able to.",
            "Far from optimally, that is to detect all errors and they have a finite rate that this is the other finite level of redundancy.",
            "So these are codes that have to be much smarter than the simple repetition code."
        ],
        [
            "And and let me tell you, just in in a few in a couple of minutes I want to tell you what is a proof of Shannon.",
            "Just very roughly speaking, because the proof of Shannon goes to phase transition.",
            "Basically that is what is the limiting factor.",
            "It is a phase transition phenomenon.",
            "It is this collective phenomenon that we saw with water molecules.",
            "So you have the setup of challenges of following.",
            "You want to send message of length on the binary alphabet over a noisy channel.",
            "And you decide that these messages you will not allow to send all kind of messages.",
            "You will send only those which are written somewhere in the code book.",
            "So you have a code book, it's it's a list of code words and you are.",
            "You will send one of these code words.",
            "And how does Shannon define the codebook?",
            "He defines it very easily, he says.",
            "Well, I take a random subset of the of the possible words, so I have N dimensional hypercube and so there are two to the N possible messages.",
            "And messages of length N over binary alphabet.",
            "These are two to the N. Among these two to then I select two to the L. This define my code book, so it means that this is a hypercube in dimension 5, for instance, just to just for the fun of it, and I decide that I have here L Equal 2.",
            "These are my 4 code works.",
            "And they will use that and they will transmit only that.",
            "And with Shannon, does he analyzes this system in the thermodynamic limit?",
            "What is called the thermodynamic limit?",
            "So here we have to go to the large size system, and that's the only way that you can get this optimal performance that I was telling you about at the beginning.",
            "So you will send L&N to Infinity by keeping the ratio alvarran fixed and this plays the role of the redundancy.",
            "So basically"
        ],
        [
            "Imagine that they have sent these codewords, which was here.",
            "The noise corrupts it a little bit.",
            "It changes one of the bits so it sends it to this point here.",
            "How do you decode?",
            "Well, you have received this message here.",
            "You know that this cannot be sent because it's not in your code book.",
            "So what you do is you look at the code book and you say where is the closest code word that was sent.",
            "You say, well, it was this one.",
            "OK, you have decoded you.",
            "Have corrected the error.",
            "So decoding is easy, it's just finding the closest code world.",
            "So now in order to assert what is the performance of such a code, you just need to understand."
        ],
        [
            "Simple geometric problem, relatively simple geometric problem.",
            "We take a hypercube.",
            "They could random code world and then you ask what how many code words are there at a certain distance of this original code?",
            "Because if there are none then you can correct the errors.",
            "But as soon as you have an A somewhere, a code word which is nearby then you cannot and so it's a purely geometric property.",
            "And what you find is that the number of code words is good like E to the North, the number of bits.",
            "Times a certain function, and this is a function and basically this function it is.",
            "Minus Infinity, so there are no codewords be within a certain range.",
            "So if you take a random code world within a certain range.",
            "In the large and limit there is no other code.",
            "Well, so it means that you have the space.",
            "All these all these distance you can decode exactly.",
            "So because of this geometric phase transition.",
            "You get this.",
            "You get this kind of bubble around each code world where you have no other neighbor."
        ],
        [
            "And because of that you can decode perfectly and the probability of perfect transmission with Shannon code is this one.",
            "It's in the large end limit.",
            "You transmit without error with probability one until a certain threshold which is called Shannon facial that you can compute by doing this simple geometric computation that I was hinting at that you can sit down and do in 10 minutes if you want, and with that you have computed something which is extremely essential information theory.",
            "It's Shannon threshold Shannon threshold.",
            "It's like water going from.",
            "Liquid water to ice.",
            "It safey it's a sharp phase transition in the in the large size system.",
            "Of course, this threshold, it depends.",
            "It depends on the size of your codebook, how many code words you have put, so you have a tradeoff between the kind of the level of noise that you can tolerate and the redundancy that you have.",
            "More redundant use more redundant is your is your code book.",
            "Then the larger the amount of noise that you can afford.",
            "There is just one small detail with, so this was done in 1948, so Shannon had server and by the way he also showed that his code is code that I was describing to you.",
            "This purely random code unstructured.",
            "It is optimal.",
            "You cannot do better.",
            "There is no code that is perfect which is above this Shannon threshold.",
            "This is beautiful.",
            "He had solved everything with one small detail.",
            "It is the fact that using this code is impossible because the decoding is extremely slow.",
            "I told you how do I decode.",
            "I have received a certain message and I need to find in my code book where is the closest code work, but there is no structure in the code book, so the only way I can do that is go through each of the code words of the codebook, compute the distance.",
            "But there are exponentially many code words.",
            "So this is an exponentially slow process, and as Michael was saying, we cannot no longer afford exponentially slow processes.",
            "We need very fast algorithm, basically linear if you want to handle large amount of data that we have now.",
            "So we have to do something else.",
            "And basically since 1948.",
            "All our colleagues working in information theory, not all but a large number of them have been working on this problem, which is to find structured code so that you can devise a good algorithm and which are which get us close as possible to this Shannon threshold.",
            "So this is 1 possible type of code.",
            "Very briefly this code is.",
            "Based on parity check.",
            "So instead of taking random points of the hypercube, you take points of the IP."
        ],
        [
            "Cube which which are defined by an algebraic structure.",
            "That is, you have, let's say here 7 bits and you say my code words, they must satisfy a set of algebraic equations.",
            "So it means that instead of being randomly randomly chosen on the hypercube, they are in a in a linear subspace.",
            "And this is for instance is.",
            "Here is defined by three equations, so it means that among the 227 words you have two to the four possible.",
            "Code was.",
            "Now, if you have that, it's called low density parity check codes.",
            "Basically you take a large number of bits and you have some constraints.",
            "The constraints the equations are described.",
            "Sorry I should have shown that here the equations are described by these squares and this this buildup.",
            "Constraints between my bits of information.",
            "For instance, equation a tells me X 1 + 6, Four plus six 5 + 7 is even and so on and so forth.",
            "And you build that."
        ],
        [
            "With the large number of bits.",
            "Let's say 1000 an with a large number of constraints, and again you can build for instance a random code based on this construction.",
            "So you build random parity check constraints.",
            "Now, how do you decode?",
            "Well again, let me assume that you have this channel that flips the bits with some probability, and so maybe the bits which are colored here they have been flipped by the channel.",
            "So how do I detect that there has been a mistake on the channel?",
            "I detect because I compute the parity equation and I find that some of the equations are violated.",
            "So basically I am back with some problem which is a big giant Sudoku problem.",
            "If some of you like Sudoku, this is a field where you have really big ones and the Sudoku problem is knowing that this equation has been violated and that one also and that one also.",
            "But this one has not been violated because there are actually two spins, 2 bits which were flipped.",
            "What's what is the beat Switch had been flipped by the channel?",
            "And this is how you can reconstruct it.",
            "It turns out that it is again a spin class problem of the same family of problems that I was telling you before and its spin glass, a variant of the spin class problem with multi spin interaction.",
            "And it has one of these weird phase transition which is a glass transition and basically when you when you want to decode you can look at it from by Asian POV.",
            "That is you have received a certain message and you write a probability distribution.",
            "On the initial bids that you have, this probability distribution is a product of two factors.",
            "You have the prior knowledge of the on the channel.",
            "That is, you know that the channel flips a bit with a certain probability and then you have the equations which are the parity check constraints that you can do.",
            "You know that the message that was sent was satisfying a certain number of constraints, so you want to find the most probable message according to this measure.",
            "This in general is not so easy.",
            "That is, if you have thousands of variables with weird measure like that, it's like finding the optimal state of spin glass, and I showed you before where it's a very complicated problem is very non convex.",
            "It has a lot of local minima and so on and so forth.",
            "If you just do for instance Montecarlo minimization it fails miserably."
        ],
        [
            "So what are the methods that people use for that when possible decoding algorithm?",
            "This is using mean field equations which were discovered in this field on the spin glass side by Thouless, Anderson and Palomar.",
            "Cavity method, belief propagation and it was used in codes by Gallagher.",
            "Actually, first we are totally in all case totally independent discoveries.",
            "And this mean field equations are these.",
            "Generalization of the representative agent is you look at basically the behavior of one of the bits in the neighborhood of the average position of all the other neighbors, and you write couple self consistent equation for them and you solve them typically by iteration."
        ],
        [
            "When you when you do that, you find that the probability of perfect transmission of your algorithm decoded by mean field.",
            "It is this purple line, and if you had a perfect way of sampling through this measure complicated measure that I was asking for this is called map decoding.",
            "This would be the red Line and Shannon is the blue line and two large extent a lot of the research in the in the last few years has consisted in finding families of code.",
            "Where this purple line the algorithmic threshold gets as close as possible to the Shannon threshold, and this has been now achieved in a large number of channels.",
            "So you see that all in some sense all this theory of communication is largely dominated by this analysis of what happens in the large size problem and by phase transition.",
            "Here you have a geometric phase transition.",
            "This is another geometric phase transition.",
            "This is an algorithmic phase transition which basically separates.",
            "A phase in which you can decode easily by some kind of mean field iteration and another one in which you have what we call a glass.",
            "That is, you have extremely slow relaxation time and the dynamics of your iteration does not converge, so you want to use the last 9 minutes that I have in order to.",
            "Tell you about."
        ],
        [
            "A more modern event problem in information theory, which called."
        ],
        [
            "Press sensing compressed sensing.",
            "Let me introduce it from just these two pictures.",
            "So this is 1 picture I don't remember which one is which, but let's say that OK randomly select this left one is it's a pixel, it's an image with 65,000 something pixels and the other one is a version of this which keeps only 25,000 coefficients.",
            "That is what has been done is do a wavelet decomposition of this image and keep the 25,000 most relevant.",
            "Wavelet coefficient and basically for my eye at least the other same, and so that's compression.",
            "This is something that you do every day, as soon as you take a picture, and so we know that we know very well that images can be compressed, and that's basically for most of the images.",
            "You can compress them quite a lot and you don't lose much of the information that is needed that you want to keep.",
            "This is related to the fact that interesting signals all interesting signals are sparse in some basis.",
            "I mean the basis of wavelet here.",
            "Why is the sum of the coefficients are zero?",
            "Basically in the wavelet decomposition you will take 2 neighboring pixels and you will take the sum and the difference between them.",
            "And as soon as you have a Gray uniform colored area, the two neighboring pixels, they are nearly equal and the difference is basically 0.",
            "So that's why you have a sparsity.",
            "In the interesting signal.",
            "So.",
            "Sparsity and possibility of compressing an image.",
            "It's used for data compression, but more recently people have asked this question which is can it be used at the level of acquisition of the signal, not as a post processor, but already at the acquisition.",
            "Where do you want to do that?",
            "Well, you want."
        ],
        [
            "You do that because you want maybe to be fast.",
            "So for instance, if you can do that at the level of acquisition, you can speed up magnetic resonance imaging.",
            "You can speed up tomography electron microscopy.",
            "You can you can use it in order to analyze biological systems by less with less irradiation.",
            "So there are many reasons why you would like to do such a thing."
        ],
        [
            "And I want to show you just a possible application which is demography and this is just to motivate why people like why I use.",
            "I like to use demography.",
            "Demography is trying to understand what there is in a system without opening it basically and so it can be used for instance for understanding.",
            "I mean reading what there is in this paper scrolls without using the traditional method which is trying to unfold it and it breaks very often when you unfold it.",
            "So."
        ],
        [
            "What is tomography?",
            "Let let let me imagine for simplicity, tomography of a binary mixture.",
            "So you have a system with two phases, Phase A, which is here in white and Phase B and typically in physics you like to see how Phase A is growing in Phase B and this is a slice of your sample, how you?"
        ],
        [
            "Analyze that you analyze that, typically by going to your synchrotron, then the next secret onya to you.",
            "You shine synchrotron light on this system and you look at what has what is being received here.",
            "And basically if you absorption is different in the black and white phase, what you will get is on each pixel.",
            "Here you will get something that will tell you what is the proportion of black and white along each of these Rays.",
            "Now again.",
            "I will get something like a Sudoku.",
            "I tell you all these proportions here, here, here, here here can you reconstruct the image?",
            "Well, if I have just one picture, it is very clear that I cannot do because I could decide that the order order black are here and all the white on the other side, so I cannot reconstruct anything.",
            "So what people do is that they take the sample and they rotate it and they take several pictures.",
            "How many pictures would they take?",
            "Well, for instance, imagine that you have that here you have L pixel measured simultaneously.",
            "You will rotate your sample L times you take at El different angles.",
            "So we have basically L square measurements and with this L square measurement you can reconstruct a system with the level of L square pixels.",
            "It's called radon transform inverse radon transform.",
            "It's like doing the inverse Fourier transform, something relatively simple.",
            "It's something that you can do that you do very frequently when you go to the synchrotron."
        ],
        [
            "Now imagine that this is my system, it has it has size L. So every single pixel's size 1 and imagine that the typical domain size here sigh is much larger than one.",
            "Is there a way to acquire this image by measuring not?",
            "L angles but a smaller, but this model number there should be.",
            "There should be because this image can be compressed a lot.",
            "You see it has a number of domain which is much less than L square.",
            "So I mean I can.",
            "I can describe this this image with a number of bits which is much less than L square.",
            "So actually it did."
        ],
        [
            "That this image on 1000 by 1000 Grid instead of taking 1000 measurement at 1000 different angle, I can reconstruct it with only 16 anger, so it's a it's a speedup of a factor 60."
        ],
        [
            "So how you do that?",
            "You do that again by your Bayesian method, in which you combine the constraint of the measurement.",
            "So the measurement tells you among all these pixels.",
            "Here, how many are black?",
            "How is the proportion of black and the proportion of white and a prior, and this is a very simple prior for physicists, at least it's it's a prior that favors the configuration in which neighboring pixels are the same, and this creates a domain.",
            "And if you choose the J here in the right manner.",
            "You will get the correct correlation length, which is the typical size of the domain.",
            "So you use prior knowledge and the data."
        ],
        [
            "Now, just to say a little bit of what can be done, imagine that you have a set of N variable which are now continuous variable.",
            "You measure them with a linear measurement.",
            "You do EM measurement so you have received.",
            "This is what you have measured.",
            "You know your measurement matrix.",
            "You want to reconstruct the signal.",
            "Very easy linear problem now.",
            "Problem is to find S when the number of measurement is smaller than the number of unknown.",
            "Well, this from your basic algebra course you tell me that's not possible.",
            "You have more unknown than equations.",
            "It will not work, but now I give you a hint.",
            "I tell you.",
            "Well, I know a priority that my signal is sparse.",
            "So I know that they have taken the right basis where some of the components of the signal R0.",
            "How can I use that?",
            "The answer is yes if I do a correct Oracle.",
            "If I guess correctly, which of the signal components are zero, then they will be able to do it now exactly as in Shannon.",
            "The question is to use that in a fast way."
        ],
        [
            "And people have tried several methods.",
            "One of them is a celebrated L1 norm minimization, in which you address this problem like an optimization problem.",
            "But if you look at this linear subspace and you want to come to minimize the norm of some of excites of power gamma, the thing that you would like to minimize is UL0 norm.",
            "The number of non zero component.",
            "But because you cannot do that, you go to a convex problem which is just minimizing the L1 norm and the standard method would be just to minimize, well, two norm.",
            "So."
        ],
        [
            "This the efficacy of this procedure can be measured by by your face diagram.",
            "This is a number of equations per variable and this is the sparsity that is a fraction of non zero variables and you find out that if you are below the blue line, reconstruction is impossible.",
            "You don't have enough measurement if you are above the green line you have more more measurement than unknown, so it's just trivial case you do it by just linear algebra.",
            "With this is a part of your linear algebra.",
            "'cause that you know from your childhood and in between you get something which is possible with L1 until you hit what a phase transition.",
            "And the whole thing that we have been working on is try to find another method which gets into this forbidden region and goes better than the phase transition."
        ],
        [
            "And they will just show in one minute how it goes.",
            "Basically what you have to do is again apply your Bayesian approach as you build up a probability measure which combines the constraints due to the measurement and the prior knowledge and sparsity.",
            "And you can sample with this probabilistic method using again mean field method, which is a message passing an by doing that."
        ],
        [
            "You can get something which is better.",
            "This is called belief propagation.",
            "Decoding of the of the compressed sensing and you can go better in the part of the forbidden region if you have a good prior knowledge of the signal.",
            "If you don't have it, you don't improve so much and what is.",
            "What is this phase transition here?",
            "It's a glass transition and so it's again a place where the algorithm your iteration of min field equation gets very slow and so the algorithm is not able to.",
            "Find."
        ],
        [
            "The system so you have."
        ],
        [
            "An easy phase when you have many measurement, you have an impossible phase when you don't have enough measurement and there are many possibilities of possible states of the variable X which are compatible with the measurement and there is intermediate hard of system in which there is a solution, but your algorithm is trapped by these metastable glassy state and the way to get out of it is to constrain."
        ],
        [
            "To construct a measurement matrix which seeds this crystalline state, and for this we use something which is well known in physics.",
            "That is, if you have if you want to build a crystal, for instance, this is supercooled water you drop in the supercooled water.",
            "You drop a small crystal of the ice and it freezes.",
            "And you can."
        ],
        [
            "Design that exactly in the measurement matrix you decide to insist on a subset of matrix, so you take a banded matrix like that and you do more measurement for the first group of variables."
        ],
        [
            "And it will create a seed of the solution that will propagate through the system, like a crystallization wave.",
            "So it's a crystallization in the algorithm."
        ],
        [
            "And using that you see that this is for instance decoding this image of Lennar.",
            "The sparsity is such that you should be able to do it down to a number.",
            "Alpha is the number of measurements, so this is large number of measurement.",
            "Every method is able to decode.",
            "This is small number of measurement.",
            "The Shannon threshold is .24.",
            "This is the minimization of L1 norm.",
            "This is a standard mean field and this is a mean field with the seeded variable.",
            "And you see that you improve a lot.",
            "The decoding, so this is just one one more example, I think that the message that I want to give to you is the fact that as soon as you start to handle many variable, many couple variables here through many measurement, many big data, large number of measurements you have to be very careful because you are working in large dimensional space in which very often you will see these phenomena, phase transition.",
            "And actually they play a major role.",
            "And they have shown you 2 examples in which they play major role.",
            "One is communication theory, Shannon theorem and the best possible error correcting code and the other one is compressed sensing.",
            "Thanks a lot."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thank you, thanks a lot for the.",
                    "label": 0
                },
                {
                    "sent": "The invitation is a great pleasure to be here and the introduction, so I want I want to take my own path towards data science data science.",
                    "label": 1
                },
                {
                    "sent": "You can accommodate any branch of science into it, so it's it's wonderful from this point of view, and I want really to.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To address it through information theory and first of all, there is a good reason for that, which is that it's 100,000 anniversary of Claude Shannon and the founder of Information Theory, and they would also like to make a bridge with the field, which is mine which is statistical physics phase transition and disordered systems and I have put here some some key figures in statistical physics and in disordered systems that baby towels just got the Noble price.",
                    "label": 1
                },
                {
                    "sent": "A month ago, as you may know, and actually what I really want to tell you is how important is the notion of phase transition and statistical physics in core problems of information theory.",
                    "label": 0
                },
                {
                    "sent": "So in some sense I like this this very simple introduction to statistical physics, which is an introduction in three words.",
                    "label": 0
                },
                {
                    "sent": "It's due to Phil Anderson in a beautiful paper in science in 1972.",
                    "label": 0
                },
                {
                    "sent": "More is different.",
                    "label": 0
                },
                {
                    "sent": "I cannot do that in French.",
                    "label": 0
                },
                {
                    "sent": "Maybe I'm not sure I can do it in Italian either, but in English it works very well, so it just tells you something it tells you.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, we are very smart physicist and are well on the shoulders of Giants.",
                    "label": 0
                },
                {
                    "sent": "So we know Newton slow.",
                    "label": 0
                },
                {
                    "sent": "Maybe we are a bit smarter when you're shredding girl.",
                    "label": 0
                },
                {
                    "sent": "Oh, we know all the basic fundamental forces of the universe, so we put in the forces and we can compute the motion and we can even study.",
                    "label": 0
                },
                {
                    "sent": "Underdamped or overdamped or critically damped system and accelerator algorithms using that but small detail.",
                    "label": 0
                },
                {
                    "sent": "You have this system here, which is just.",
                    "label": 0
                },
                {
                    "sent": "Water molecules, H2O and in these two phases there is a solid phase.",
                    "label": 0
                },
                {
                    "sent": "There is liquid phase and actually there is also a gas phase with the gas H2O phase just above the sea.",
                    "label": 0
                },
                {
                    "sent": "These are the same molecules.",
                    "label": 0
                },
                {
                    "sent": "They are the same forces.",
                    "label": 0
                },
                {
                    "sent": "The interactions are the same.",
                    "label": 0
                },
                {
                    "sent": "They are electromagnetic interaction.",
                    "label": 0
                },
                {
                    "sent": "How comes that they build a pattern which is so different?",
                    "label": 0
                },
                {
                    "sent": "I mean in one case it's it's solid and.",
                    "label": 0
                },
                {
                    "sent": "Titanic knows that, for instance.",
                    "label": 0
                },
                {
                    "sent": "I mean it's not at all the same behavior and it's all the same molecules and the same interactions.",
                    "label": 0
                },
                {
                    "sent": "So this is, this is where more is different.",
                    "label": 1
                },
                {
                    "sent": "I mean to understand such a system, you really need to go to a large size problem and you will never understand that.",
                    "label": 0
                },
                {
                    "sent": "If you study 10 molecules of water, you put 10 molecules of water in your computer.",
                    "label": 0
                },
                {
                    "sent": "You will not.",
                    "label": 0
                },
                {
                    "sent": "You will not get that behavior.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this mechanism is well understood, it's even proven rigorously in some case, since last Onsager in 1944.",
                    "label": 0
                },
                {
                    "sent": "It was studied most in some systems, which are which are spin systems, in which instead of looking at the movement of molecules, you look at this error.",
                    "label": 0
                },
                {
                    "sent": "So relatively simple problem, similar problem, which is a problem of spins which can point up or down.",
                    "label": 0
                },
                {
                    "sent": "So you look at the magnet you have spins in the magnet, and it turns out that because of statistical.",
                    "label": 0
                },
                {
                    "sent": "Horseman low, it turns out that two neighboring spins they have a larger probability to point parallel than pointing anti parallel.",
                    "label": 0
                },
                {
                    "sent": "So this probability becomes more and more biased when the temperature is lower.",
                    "label": 0
                },
                {
                    "sent": "This is Boltzmann wait for the energy of the parallel configuration is lower than the energy of the anti parallel.",
                    "label": 0
                },
                {
                    "sent": "When you decrease the temperature, there is a stronger bias towards spins pointing in the same direction.",
                    "label": 0
                },
                {
                    "sent": "So this is pretty simple.",
                    "label": 0
                },
                {
                    "sent": "With that you can understand that.",
                    "label": 0
                },
                {
                    "sent": "When you decrease temperature spins, we like to point more parallel than type error thing, which it does not tell you and which was a big puzzle is why there should be a transition.",
                    "label": 0
                },
                {
                    "sent": "A sharp transition at a well defined temperature.",
                    "label": 0
                },
                {
                    "sent": "It should be great.",
                    "label": 0
                },
                {
                    "sent": "I mean it should be something which is more much more gradual and.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is.",
                    "label": 0
                },
                {
                    "sent": "This is where really more is different.",
                    "label": 0
                },
                {
                    "sent": "That is, the sharp transition appears only when you have a large number of spins at work, and so it's a purely collective effect.",
                    "label": 0
                },
                {
                    "sent": "If you have four spins you just don't have a transition, so it means that you cannot support ferromagnetic state.",
                    "label": 0
                },
                {
                    "sent": "What is a ferromagnetic state?",
                    "label": 0
                },
                {
                    "sent": "It's a state in which.",
                    "label": 0
                },
                {
                    "sent": "Let's say at some given temperature you will have 90% of the spins which are in the top direction, 10% which are in the opposite, the one which are in the opposite are not always the same, it fluctuates in time, but it's a state which is extremely robust, so collective order.",
                    "label": 0
                },
                {
                    "sent": "And that's why it has been used.",
                    "label": 0
                },
                {
                    "sent": "It is being used, for instance in informal neural networks as as a concept the transition is very sharp at the well defined temperature and it takes place only in this what we call thermodynamic limit.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is a magnetization.",
                    "label": 0
                },
                {
                    "sent": "Let's say the proportion of spins which point up or down, and at a very well defined temperature.",
                    "label": 1
                },
                {
                    "sent": "It depends on the material the transition takes place.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this this is the situation that we understood in statistical physics until 1960s, let's say.",
                    "label": 0
                },
                {
                    "sent": "And gradually physicists started to try to understand to go a bit further and try to understand what happens in dirty material when you have disorder.",
                    "label": 0
                },
                {
                    "sent": "So for instance, there is some very obscure material which is called copper, manganese.",
                    "label": 0
                },
                {
                    "sent": "You put 1% of impurities of manganese and copper.",
                    "label": 0
                },
                {
                    "sent": "It turns out that the manganese they have spins.",
                    "label": 0
                },
                {
                    "sent": "The copper does not, roughly speaking, and the spins of the manganese, they interact.",
                    "label": 1
                },
                {
                    "sent": "But their interaction depends on the distance, so if they are matter certain distance they will tend to point parallel, but at another distance they want to be anti parallel.",
                    "label": 0
                },
                {
                    "sent": "So you have these magnetic impurities of manganese.",
                    "label": 0
                },
                {
                    "sent": "There they are very well defined position.",
                    "label": 1
                },
                {
                    "sent": "They don't move basically but their spins.",
                    "label": 0
                },
                {
                    "sent": "Depending on the position they like to be parallel or they like to be anti parallel.",
                    "label": 0
                },
                {
                    "sent": "This is a much more complicated.",
                    "label": 0
                },
                {
                    "sent": "This is a much more complicated problem.",
                    "label": 0
                },
                {
                    "sent": "Basically the previous problem you see each spin was doing the same thing.",
                    "label": 0
                },
                {
                    "sent": "So speaking here in this University I would say there is a relatively simple way to address that, which is a theory of the representative spin.",
                    "label": 0
                },
                {
                    "sent": "Like you look at the representative agent.",
                    "label": 0
                },
                {
                    "sent": "If you have agents on the market, every agent has the same strategy.",
                    "label": 0
                },
                {
                    "sent": "Well, you can say let me study one agent and I assume that all the other agents are doing the same thing, which is which is right and I write a self consistent equation.",
                    "label": 0
                },
                {
                    "sent": "It with spins and I have the rough pattern of the phase transition in Ferromagnets now in spin glasses it's much, much more complicated.",
                    "label": 0
                },
                {
                    "sent": "We have technically I don't have a representative spin, everyone is different individual and so basically what we had to do in order to understand what happens in a spin glasses.",
                    "label": 0
                },
                {
                    "sent": "It was to keep track of each single individual, each single spin and at the same time understand the collective collective property.",
                    "label": 0
                },
                {
                    "sent": "And then you can start and you can see that I'm slightly bridge bridging the small gap with with introduction of Michael previously when he was saying we want to go from a kind of collective pattern tools to understanding what happens at the level of every single individual.",
                    "label": 0
                },
                {
                    "sent": "So spin glasses.",
                    "label": 0
                },
                {
                    "sent": "They have some weird behavior.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For one, the very fundamental reason is that if you take 3 spins, if you imagine that they are distances such that they like to be anti parallel where there is no way that you can satisfy all the three of them.",
                    "label": 0
                },
                {
                    "sent": "Can you put one of them?",
                    "label": 0
                },
                {
                    "sent": "You put the other one type error and the third one you can do it.",
                    "label": 0
                },
                {
                    "sent": "So that's called frustration for obvious reason and because of this.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These two properties, the fact that all the spins are different and there is frustration.",
                    "label": 0
                },
                {
                    "sent": "It turns out that it is very difficult to find the optimal configuration.",
                    "label": 0
                },
                {
                    "sent": "It's extremely difficult from a computational point of view.",
                    "label": 0
                },
                {
                    "sent": "It's a NP hard problem and at.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The same time we if you if you draw the energy landscape, if you like to see what is the energy of a spin configuration in a spin glass, it will look something like that.",
                    "label": 0
                },
                {
                    "sent": "Uniform magnetic was very simple.",
                    "label": 0
                },
                {
                    "sent": "Basically there was a convex well of the positive magnetization States and another convex well of the negative magnetization.",
                    "label": 0
                },
                {
                    "sent": "So that was very easy, just two valets related by a symmetry.",
                    "label": 0
                },
                {
                    "sent": "Here it's an extremely complex system and in some case you can have a very privileged configuration, which I called the crystal.",
                    "label": 0
                },
                {
                    "sent": "And and you want to find this crystal in a sea of metastable states, which are the glass States and that's typically the kind of situation that we will have to face in many problems of information theory.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I should have said it was just returning the previous site.",
                    "label": 0
                },
                {
                    "sent": "That spin glasses are totally useless.",
                    "label": 0
                },
                {
                    "sent": "When I started on spin glasses, that was several decades ago.",
                    "label": 0
                },
                {
                    "sent": "There were already thousands of papers nobody has ever, as far as I know, nobody's had a grant on spin glass, and actually, probably because of that reason.",
                    "label": 0
                },
                {
                    "sent": "Spin glasses was that much more in France and interleave them in the in the US, but it has always fascinated everybody, and I will come back to that at the end of the.",
                    "label": 0
                },
                {
                    "sent": "Of the talk.",
                    "label": 0
                },
                {
                    "sent": "Nevertheless, spin class later on was found out and called the Cornucopia.",
                    "label": 0
                },
                {
                    "sent": "It turns out that in the understanding spin classes, we developed a very sophisticated and powerful corpus of concepts and methods which are used in very different fields.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And why is that?",
                    "label": 0
                },
                {
                    "sent": "Well, basically I was.",
                    "label": 0
                },
                {
                    "sent": "I was telling you in some sense already before, that is understanding spin glass.",
                    "label": 0
                },
                {
                    "sent": "It means going one big step beyond the representative agent.",
                    "label": 0
                },
                {
                    "sent": "I mean, it means being able to understand what happens when you have a lot of singular element, individual element.",
                    "label": 0
                },
                {
                    "sent": "Each of them is different from all the others and.",
                    "label": 0
                },
                {
                    "sent": "You are able to do basically the statistics of all the agents anget simultaneously.",
                    "label": 0
                },
                {
                    "sent": "The understanding of what happened at the individual agent level and.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At the statistic of agents.",
                    "label": 0
                },
                {
                    "sent": "So if you are able to do that well, you can do something much, much nicer than understanding of market in which everybody is doing the same thing.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I mean, you can go to something which is much more real life application let's say so now after this introduction and spin classes I want to I want to go to information theory and I will.",
                    "label": 0
                },
                {
                    "sent": "I will address 2 problems, 2 very basic problems of information theory and tell you the role of phase transitions in information theory and the 1st.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One is in form is error correcting code, so this goes back really to early days of information theory.",
                    "label": 0
                },
                {
                    "sent": "It goes back to Shannon's work in 1948 and Shannon asked the question of information transfer.",
                    "label": 0
                },
                {
                    "sent": "That is, we are using information transfer.",
                    "label": 0
                },
                {
                    "sent": "Or the time, and it's probably one of the most important part of science that we are using everyday.",
                    "label": 0
                },
                {
                    "sent": "We use it if we want to communicate.",
                    "label": 0
                },
                {
                    "sent": "We use it as soon as we write data on our hard disk.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We use it when you when we have, for instance, vision going from the retina to the to the brain.",
                    "label": 0
                },
                {
                    "sent": "We use it when we have cell division.",
                    "label": 0
                },
                {
                    "sent": "We have information which is encoded in the DNA which has to be transferred to the daughter cells.",
                    "label": 0
                },
                {
                    "sent": "And they use it as soon as I give a talk in front of you.",
                    "label": 0
                },
                {
                    "sent": "In all this case.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This we use a mechanism of error correction if there is no error correction, it's extremely difficult to communicate and actually I'm using error correction right now.",
                    "label": 0
                },
                {
                    "sent": "Just because language is redundant, language is extremely redundant and that's.",
                    "label": 0
                },
                {
                    "sent": "A very good thing because this redundancy is what allows you to correct.",
                    "label": 0
                },
                {
                    "sent": "As soon as I have a slight mispronunciation.",
                    "label": 0
                },
                {
                    "sent": "If language was not well, not redundant, then you will not be able to understand me.",
                    "label": 0
                },
                {
                    "sent": "And the same thing if here if I see that someone is not following very well, well, probably I will just repeat what I was saying in a slightly different way that the basic basics of teaching.",
                    "label": 0
                },
                {
                    "sent": "And that's what channel understood and he told he told us well, the general scheme is the following.",
                    "label": 0
                },
                {
                    "sent": "You have a message that you want to send, then what you should do is encode the message and you will see an encoding.",
                    "label": 0
                },
                {
                    "sent": "The message is adding redundancy and then you will send it through the noisy channel.",
                    "label": 0
                },
                {
                    "sent": "You will receive a message which is blurred version of the encoded message and then you will decode.",
                    "label": 0
                },
                {
                    "sent": "So that's the general scheme.",
                    "label": 0
                },
                {
                    "sent": "So an example of the simplest example of redundancies or repetition code that is you have you want to send this image, for instance, and you just send it 3 times.",
                    "label": 0
                },
                {
                    "sent": "That's a very clumsy way of doing redundancy that the basic one, and then you send it through the channel.",
                    "label": 0
                },
                {
                    "sent": "This channel has probably 10% of noise or something a bit less than that, and you see that each bit can be corrupted.",
                    "label": 0
                },
                {
                    "sent": "It can be flipped with a certain probability, so you receive these three images.",
                    "label": 0
                },
                {
                    "sent": "How do you reconstruct the original?",
                    "label": 0
                },
                {
                    "sent": "Image Ware here.",
                    "label": 0
                },
                {
                    "sent": "You have a very simple algorithm.",
                    "label": 0
                },
                {
                    "sent": "You look at each pixel and you look at the majority rule.",
                    "label": 0
                },
                {
                    "sent": "So if the top left pixel was black, white and black, you decide that it is black and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "And you see that yes indeed the picture that you get is a bit better than the one the without the redundancy.",
                    "label": 0
                },
                {
                    "sent": "Kind of obvious in some sense.",
                    "label": 0
                },
                {
                    "sent": "So how can you improve that immediately?",
                    "label": 0
                },
                {
                    "sent": "Everybody will tell me where it see.",
                    "label": 0
                },
                {
                    "sent": "It's very easy.",
                    "label": 0
                },
                {
                    "sent": "Instead of sending three times the image you send it.",
                    "label": 0
                },
                {
                    "sent": "17 times and then you will improve, and that's correct.",
                    "label": 0
                },
                {
                    "sent": "But it's costly.",
                    "label": 0
                },
                {
                    "sent": "And so you see that you have to trade off.",
                    "label": 0
                },
                {
                    "sent": "You have to trade between the level of redundancy and the level of performance.",
                    "label": 0
                },
                {
                    "sent": "And one thing that Shannon found and which was a surprise which is which is a really a surprise if you think about it a little bit is that there exists code which are able to.",
                    "label": 0
                },
                {
                    "sent": "Far from optimally, that is to detect all errors and they have a finite rate that this is the other finite level of redundancy.",
                    "label": 0
                },
                {
                    "sent": "So these are codes that have to be much smarter than the simple repetition code.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And and let me tell you, just in in a few in a couple of minutes I want to tell you what is a proof of Shannon.",
                    "label": 0
                },
                {
                    "sent": "Just very roughly speaking, because the proof of Shannon goes to phase transition.",
                    "label": 0
                },
                {
                    "sent": "Basically that is what is the limiting factor.",
                    "label": 0
                },
                {
                    "sent": "It is a phase transition phenomenon.",
                    "label": 0
                },
                {
                    "sent": "It is this collective phenomenon that we saw with water molecules.",
                    "label": 0
                },
                {
                    "sent": "So you have the setup of challenges of following.",
                    "label": 0
                },
                {
                    "sent": "You want to send message of length on the binary alphabet over a noisy channel.",
                    "label": 0
                },
                {
                    "sent": "And you decide that these messages you will not allow to send all kind of messages.",
                    "label": 0
                },
                {
                    "sent": "You will send only those which are written somewhere in the code book.",
                    "label": 0
                },
                {
                    "sent": "So you have a code book, it's it's a list of code words and you are.",
                    "label": 0
                },
                {
                    "sent": "You will send one of these code words.",
                    "label": 0
                },
                {
                    "sent": "And how does Shannon define the codebook?",
                    "label": 0
                },
                {
                    "sent": "He defines it very easily, he says.",
                    "label": 0
                },
                {
                    "sent": "Well, I take a random subset of the of the possible words, so I have N dimensional hypercube and so there are two to the N possible messages.",
                    "label": 0
                },
                {
                    "sent": "And messages of length N over binary alphabet.",
                    "label": 0
                },
                {
                    "sent": "These are two to the N. Among these two to then I select two to the L. This define my code book, so it means that this is a hypercube in dimension 5, for instance, just to just for the fun of it, and I decide that I have here L Equal 2.",
                    "label": 0
                },
                {
                    "sent": "These are my 4 code works.",
                    "label": 0
                },
                {
                    "sent": "And they will use that and they will transmit only that.",
                    "label": 0
                },
                {
                    "sent": "And with Shannon, does he analyzes this system in the thermodynamic limit?",
                    "label": 0
                },
                {
                    "sent": "What is called the thermodynamic limit?",
                    "label": 0
                },
                {
                    "sent": "So here we have to go to the large size system, and that's the only way that you can get this optimal performance that I was telling you about at the beginning.",
                    "label": 0
                },
                {
                    "sent": "So you will send L&N to Infinity by keeping the ratio alvarran fixed and this plays the role of the redundancy.",
                    "label": 0
                },
                {
                    "sent": "So basically",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Imagine that they have sent these codewords, which was here.",
                    "label": 0
                },
                {
                    "sent": "The noise corrupts it a little bit.",
                    "label": 0
                },
                {
                    "sent": "It changes one of the bits so it sends it to this point here.",
                    "label": 0
                },
                {
                    "sent": "How do you decode?",
                    "label": 0
                },
                {
                    "sent": "Well, you have received this message here.",
                    "label": 0
                },
                {
                    "sent": "You know that this cannot be sent because it's not in your code book.",
                    "label": 0
                },
                {
                    "sent": "So what you do is you look at the code book and you say where is the closest code word that was sent.",
                    "label": 0
                },
                {
                    "sent": "You say, well, it was this one.",
                    "label": 0
                },
                {
                    "sent": "OK, you have decoded you.",
                    "label": 0
                },
                {
                    "sent": "Have corrected the error.",
                    "label": 0
                },
                {
                    "sent": "So decoding is easy, it's just finding the closest code world.",
                    "label": 0
                },
                {
                    "sent": "So now in order to assert what is the performance of such a code, you just need to understand.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Simple geometric problem, relatively simple geometric problem.",
                    "label": 0
                },
                {
                    "sent": "We take a hypercube.",
                    "label": 0
                },
                {
                    "sent": "They could random code world and then you ask what how many code words are there at a certain distance of this original code?",
                    "label": 0
                },
                {
                    "sent": "Because if there are none then you can correct the errors.",
                    "label": 0
                },
                {
                    "sent": "But as soon as you have an A somewhere, a code word which is nearby then you cannot and so it's a purely geometric property.",
                    "label": 0
                },
                {
                    "sent": "And what you find is that the number of code words is good like E to the North, the number of bits.",
                    "label": 0
                },
                {
                    "sent": "Times a certain function, and this is a function and basically this function it is.",
                    "label": 0
                },
                {
                    "sent": "Minus Infinity, so there are no codewords be within a certain range.",
                    "label": 0
                },
                {
                    "sent": "So if you take a random code world within a certain range.",
                    "label": 0
                },
                {
                    "sent": "In the large and limit there is no other code.",
                    "label": 0
                },
                {
                    "sent": "Well, so it means that you have the space.",
                    "label": 0
                },
                {
                    "sent": "All these all these distance you can decode exactly.",
                    "label": 0
                },
                {
                    "sent": "So because of this geometric phase transition.",
                    "label": 0
                },
                {
                    "sent": "You get this.",
                    "label": 0
                },
                {
                    "sent": "You get this kind of bubble around each code world where you have no other neighbor.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And because of that you can decode perfectly and the probability of perfect transmission with Shannon code is this one.",
                    "label": 0
                },
                {
                    "sent": "It's in the large end limit.",
                    "label": 0
                },
                {
                    "sent": "You transmit without error with probability one until a certain threshold which is called Shannon facial that you can compute by doing this simple geometric computation that I was hinting at that you can sit down and do in 10 minutes if you want, and with that you have computed something which is extremely essential information theory.",
                    "label": 0
                },
                {
                    "sent": "It's Shannon threshold Shannon threshold.",
                    "label": 0
                },
                {
                    "sent": "It's like water going from.",
                    "label": 0
                },
                {
                    "sent": "Liquid water to ice.",
                    "label": 0
                },
                {
                    "sent": "It safey it's a sharp phase transition in the in the large size system.",
                    "label": 0
                },
                {
                    "sent": "Of course, this threshold, it depends.",
                    "label": 0
                },
                {
                    "sent": "It depends on the size of your codebook, how many code words you have put, so you have a tradeoff between the kind of the level of noise that you can tolerate and the redundancy that you have.",
                    "label": 0
                },
                {
                    "sent": "More redundant use more redundant is your is your code book.",
                    "label": 0
                },
                {
                    "sent": "Then the larger the amount of noise that you can afford.",
                    "label": 0
                },
                {
                    "sent": "There is just one small detail with, so this was done in 1948, so Shannon had server and by the way he also showed that his code is code that I was describing to you.",
                    "label": 0
                },
                {
                    "sent": "This purely random code unstructured.",
                    "label": 0
                },
                {
                    "sent": "It is optimal.",
                    "label": 0
                },
                {
                    "sent": "You cannot do better.",
                    "label": 0
                },
                {
                    "sent": "There is no code that is perfect which is above this Shannon threshold.",
                    "label": 0
                },
                {
                    "sent": "This is beautiful.",
                    "label": 0
                },
                {
                    "sent": "He had solved everything with one small detail.",
                    "label": 0
                },
                {
                    "sent": "It is the fact that using this code is impossible because the decoding is extremely slow.",
                    "label": 0
                },
                {
                    "sent": "I told you how do I decode.",
                    "label": 0
                },
                {
                    "sent": "I have received a certain message and I need to find in my code book where is the closest code work, but there is no structure in the code book, so the only way I can do that is go through each of the code words of the codebook, compute the distance.",
                    "label": 0
                },
                {
                    "sent": "But there are exponentially many code words.",
                    "label": 0
                },
                {
                    "sent": "So this is an exponentially slow process, and as Michael was saying, we cannot no longer afford exponentially slow processes.",
                    "label": 0
                },
                {
                    "sent": "We need very fast algorithm, basically linear if you want to handle large amount of data that we have now.",
                    "label": 0
                },
                {
                    "sent": "So we have to do something else.",
                    "label": 0
                },
                {
                    "sent": "And basically since 1948.",
                    "label": 0
                },
                {
                    "sent": "All our colleagues working in information theory, not all but a large number of them have been working on this problem, which is to find structured code so that you can devise a good algorithm and which are which get us close as possible to this Shannon threshold.",
                    "label": 0
                },
                {
                    "sent": "So this is 1 possible type of code.",
                    "label": 0
                },
                {
                    "sent": "Very briefly this code is.",
                    "label": 0
                },
                {
                    "sent": "Based on parity check.",
                    "label": 0
                },
                {
                    "sent": "So instead of taking random points of the hypercube, you take points of the IP.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Cube which which are defined by an algebraic structure.",
                    "label": 0
                },
                {
                    "sent": "That is, you have, let's say here 7 bits and you say my code words, they must satisfy a set of algebraic equations.",
                    "label": 0
                },
                {
                    "sent": "So it means that instead of being randomly randomly chosen on the hypercube, they are in a in a linear subspace.",
                    "label": 0
                },
                {
                    "sent": "And this is for instance is.",
                    "label": 0
                },
                {
                    "sent": "Here is defined by three equations, so it means that among the 227 words you have two to the four possible.",
                    "label": 0
                },
                {
                    "sent": "Code was.",
                    "label": 0
                },
                {
                    "sent": "Now, if you have that, it's called low density parity check codes.",
                    "label": 0
                },
                {
                    "sent": "Basically you take a large number of bits and you have some constraints.",
                    "label": 0
                },
                {
                    "sent": "The constraints the equations are described.",
                    "label": 0
                },
                {
                    "sent": "Sorry I should have shown that here the equations are described by these squares and this this buildup.",
                    "label": 0
                },
                {
                    "sent": "Constraints between my bits of information.",
                    "label": 0
                },
                {
                    "sent": "For instance, equation a tells me X 1 + 6, Four plus six 5 + 7 is even and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "And you build that.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With the large number of bits.",
                    "label": 0
                },
                {
                    "sent": "Let's say 1000 an with a large number of constraints, and again you can build for instance a random code based on this construction.",
                    "label": 0
                },
                {
                    "sent": "So you build random parity check constraints.",
                    "label": 0
                },
                {
                    "sent": "Now, how do you decode?",
                    "label": 0
                },
                {
                    "sent": "Well again, let me assume that you have this channel that flips the bits with some probability, and so maybe the bits which are colored here they have been flipped by the channel.",
                    "label": 0
                },
                {
                    "sent": "So how do I detect that there has been a mistake on the channel?",
                    "label": 0
                },
                {
                    "sent": "I detect because I compute the parity equation and I find that some of the equations are violated.",
                    "label": 0
                },
                {
                    "sent": "So basically I am back with some problem which is a big giant Sudoku problem.",
                    "label": 0
                },
                {
                    "sent": "If some of you like Sudoku, this is a field where you have really big ones and the Sudoku problem is knowing that this equation has been violated and that one also and that one also.",
                    "label": 0
                },
                {
                    "sent": "But this one has not been violated because there are actually two spins, 2 bits which were flipped.",
                    "label": 0
                },
                {
                    "sent": "What's what is the beat Switch had been flipped by the channel?",
                    "label": 0
                },
                {
                    "sent": "And this is how you can reconstruct it.",
                    "label": 0
                },
                {
                    "sent": "It turns out that it is again a spin class problem of the same family of problems that I was telling you before and its spin glass, a variant of the spin class problem with multi spin interaction.",
                    "label": 0
                },
                {
                    "sent": "And it has one of these weird phase transition which is a glass transition and basically when you when you want to decode you can look at it from by Asian POV.",
                    "label": 0
                },
                {
                    "sent": "That is you have received a certain message and you write a probability distribution.",
                    "label": 0
                },
                {
                    "sent": "On the initial bids that you have, this probability distribution is a product of two factors.",
                    "label": 0
                },
                {
                    "sent": "You have the prior knowledge of the on the channel.",
                    "label": 0
                },
                {
                    "sent": "That is, you know that the channel flips a bit with a certain probability and then you have the equations which are the parity check constraints that you can do.",
                    "label": 0
                },
                {
                    "sent": "You know that the message that was sent was satisfying a certain number of constraints, so you want to find the most probable message according to this measure.",
                    "label": 0
                },
                {
                    "sent": "This in general is not so easy.",
                    "label": 0
                },
                {
                    "sent": "That is, if you have thousands of variables with weird measure like that, it's like finding the optimal state of spin glass, and I showed you before where it's a very complicated problem is very non convex.",
                    "label": 0
                },
                {
                    "sent": "It has a lot of local minima and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "If you just do for instance Montecarlo minimization it fails miserably.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what are the methods that people use for that when possible decoding algorithm?",
                    "label": 0
                },
                {
                    "sent": "This is using mean field equations which were discovered in this field on the spin glass side by Thouless, Anderson and Palomar.",
                    "label": 0
                },
                {
                    "sent": "Cavity method, belief propagation and it was used in codes by Gallagher.",
                    "label": 0
                },
                {
                    "sent": "Actually, first we are totally in all case totally independent discoveries.",
                    "label": 0
                },
                {
                    "sent": "And this mean field equations are these.",
                    "label": 0
                },
                {
                    "sent": "Generalization of the representative agent is you look at basically the behavior of one of the bits in the neighborhood of the average position of all the other neighbors, and you write couple self consistent equation for them and you solve them typically by iteration.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When you when you do that, you find that the probability of perfect transmission of your algorithm decoded by mean field.",
                    "label": 0
                },
                {
                    "sent": "It is this purple line, and if you had a perfect way of sampling through this measure complicated measure that I was asking for this is called map decoding.",
                    "label": 0
                },
                {
                    "sent": "This would be the red Line and Shannon is the blue line and two large extent a lot of the research in the in the last few years has consisted in finding families of code.",
                    "label": 0
                },
                {
                    "sent": "Where this purple line the algorithmic threshold gets as close as possible to the Shannon threshold, and this has been now achieved in a large number of channels.",
                    "label": 0
                },
                {
                    "sent": "So you see that all in some sense all this theory of communication is largely dominated by this analysis of what happens in the large size problem and by phase transition.",
                    "label": 0
                },
                {
                    "sent": "Here you have a geometric phase transition.",
                    "label": 0
                },
                {
                    "sent": "This is another geometric phase transition.",
                    "label": 0
                },
                {
                    "sent": "This is an algorithmic phase transition which basically separates.",
                    "label": 0
                },
                {
                    "sent": "A phase in which you can decode easily by some kind of mean field iteration and another one in which you have what we call a glass.",
                    "label": 0
                },
                {
                    "sent": "That is, you have extremely slow relaxation time and the dynamics of your iteration does not converge, so you want to use the last 9 minutes that I have in order to.",
                    "label": 0
                },
                {
                    "sent": "Tell you about.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A more modern event problem in information theory, which called.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Press sensing compressed sensing.",
                    "label": 0
                },
                {
                    "sent": "Let me introduce it from just these two pictures.",
                    "label": 0
                },
                {
                    "sent": "So this is 1 picture I don't remember which one is which, but let's say that OK randomly select this left one is it's a pixel, it's an image with 65,000 something pixels and the other one is a version of this which keeps only 25,000 coefficients.",
                    "label": 0
                },
                {
                    "sent": "That is what has been done is do a wavelet decomposition of this image and keep the 25,000 most relevant.",
                    "label": 0
                },
                {
                    "sent": "Wavelet coefficient and basically for my eye at least the other same, and so that's compression.",
                    "label": 0
                },
                {
                    "sent": "This is something that you do every day, as soon as you take a picture, and so we know that we know very well that images can be compressed, and that's basically for most of the images.",
                    "label": 0
                },
                {
                    "sent": "You can compress them quite a lot and you don't lose much of the information that is needed that you want to keep.",
                    "label": 0
                },
                {
                    "sent": "This is related to the fact that interesting signals all interesting signals are sparse in some basis.",
                    "label": 0
                },
                {
                    "sent": "I mean the basis of wavelet here.",
                    "label": 0
                },
                {
                    "sent": "Why is the sum of the coefficients are zero?",
                    "label": 0
                },
                {
                    "sent": "Basically in the wavelet decomposition you will take 2 neighboring pixels and you will take the sum and the difference between them.",
                    "label": 0
                },
                {
                    "sent": "And as soon as you have a Gray uniform colored area, the two neighboring pixels, they are nearly equal and the difference is basically 0.",
                    "label": 0
                },
                {
                    "sent": "So that's why you have a sparsity.",
                    "label": 0
                },
                {
                    "sent": "In the interesting signal.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Sparsity and possibility of compressing an image.",
                    "label": 0
                },
                {
                    "sent": "It's used for data compression, but more recently people have asked this question which is can it be used at the level of acquisition of the signal, not as a post processor, but already at the acquisition.",
                    "label": 0
                },
                {
                    "sent": "Where do you want to do that?",
                    "label": 0
                },
                {
                    "sent": "Well, you want.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You do that because you want maybe to be fast.",
                    "label": 0
                },
                {
                    "sent": "So for instance, if you can do that at the level of acquisition, you can speed up magnetic resonance imaging.",
                    "label": 0
                },
                {
                    "sent": "You can speed up tomography electron microscopy.",
                    "label": 0
                },
                {
                    "sent": "You can you can use it in order to analyze biological systems by less with less irradiation.",
                    "label": 0
                },
                {
                    "sent": "So there are many reasons why you would like to do such a thing.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I want to show you just a possible application which is demography and this is just to motivate why people like why I use.",
                    "label": 0
                },
                {
                    "sent": "I like to use demography.",
                    "label": 0
                },
                {
                    "sent": "Demography is trying to understand what there is in a system without opening it basically and so it can be used for instance for understanding.",
                    "label": 0
                },
                {
                    "sent": "I mean reading what there is in this paper scrolls without using the traditional method which is trying to unfold it and it breaks very often when you unfold it.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What is tomography?",
                    "label": 0
                },
                {
                    "sent": "Let let let me imagine for simplicity, tomography of a binary mixture.",
                    "label": 0
                },
                {
                    "sent": "So you have a system with two phases, Phase A, which is here in white and Phase B and typically in physics you like to see how Phase A is growing in Phase B and this is a slice of your sample, how you?",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Analyze that you analyze that, typically by going to your synchrotron, then the next secret onya to you.",
                    "label": 0
                },
                {
                    "sent": "You shine synchrotron light on this system and you look at what has what is being received here.",
                    "label": 0
                },
                {
                    "sent": "And basically if you absorption is different in the black and white phase, what you will get is on each pixel.",
                    "label": 0
                },
                {
                    "sent": "Here you will get something that will tell you what is the proportion of black and white along each of these Rays.",
                    "label": 0
                },
                {
                    "sent": "Now again.",
                    "label": 0
                },
                {
                    "sent": "I will get something like a Sudoku.",
                    "label": 0
                },
                {
                    "sent": "I tell you all these proportions here, here, here, here here can you reconstruct the image?",
                    "label": 0
                },
                {
                    "sent": "Well, if I have just one picture, it is very clear that I cannot do because I could decide that the order order black are here and all the white on the other side, so I cannot reconstruct anything.",
                    "label": 0
                },
                {
                    "sent": "So what people do is that they take the sample and they rotate it and they take several pictures.",
                    "label": 0
                },
                {
                    "sent": "How many pictures would they take?",
                    "label": 0
                },
                {
                    "sent": "Well, for instance, imagine that you have that here you have L pixel measured simultaneously.",
                    "label": 0
                },
                {
                    "sent": "You will rotate your sample L times you take at El different angles.",
                    "label": 0
                },
                {
                    "sent": "So we have basically L square measurements and with this L square measurement you can reconstruct a system with the level of L square pixels.",
                    "label": 0
                },
                {
                    "sent": "It's called radon transform inverse radon transform.",
                    "label": 0
                },
                {
                    "sent": "It's like doing the inverse Fourier transform, something relatively simple.",
                    "label": 0
                },
                {
                    "sent": "It's something that you can do that you do very frequently when you go to the synchrotron.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now imagine that this is my system, it has it has size L. So every single pixel's size 1 and imagine that the typical domain size here sigh is much larger than one.",
                    "label": 0
                },
                {
                    "sent": "Is there a way to acquire this image by measuring not?",
                    "label": 0
                },
                {
                    "sent": "L angles but a smaller, but this model number there should be.",
                    "label": 0
                },
                {
                    "sent": "There should be because this image can be compressed a lot.",
                    "label": 0
                },
                {
                    "sent": "You see it has a number of domain which is much less than L square.",
                    "label": 0
                },
                {
                    "sent": "So I mean I can.",
                    "label": 0
                },
                {
                    "sent": "I can describe this this image with a number of bits which is much less than L square.",
                    "label": 0
                },
                {
                    "sent": "So actually it did.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That this image on 1000 by 1000 Grid instead of taking 1000 measurement at 1000 different angle, I can reconstruct it with only 16 anger, so it's a it's a speedup of a factor 60.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So how you do that?",
                    "label": 0
                },
                {
                    "sent": "You do that again by your Bayesian method, in which you combine the constraint of the measurement.",
                    "label": 0
                },
                {
                    "sent": "So the measurement tells you among all these pixels.",
                    "label": 0
                },
                {
                    "sent": "Here, how many are black?",
                    "label": 0
                },
                {
                    "sent": "How is the proportion of black and the proportion of white and a prior, and this is a very simple prior for physicists, at least it's it's a prior that favors the configuration in which neighboring pixels are the same, and this creates a domain.",
                    "label": 0
                },
                {
                    "sent": "And if you choose the J here in the right manner.",
                    "label": 0
                },
                {
                    "sent": "You will get the correct correlation length, which is the typical size of the domain.",
                    "label": 0
                },
                {
                    "sent": "So you use prior knowledge and the data.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now, just to say a little bit of what can be done, imagine that you have a set of N variable which are now continuous variable.",
                    "label": 0
                },
                {
                    "sent": "You measure them with a linear measurement.",
                    "label": 0
                },
                {
                    "sent": "You do EM measurement so you have received.",
                    "label": 0
                },
                {
                    "sent": "This is what you have measured.",
                    "label": 0
                },
                {
                    "sent": "You know your measurement matrix.",
                    "label": 0
                },
                {
                    "sent": "You want to reconstruct the signal.",
                    "label": 0
                },
                {
                    "sent": "Very easy linear problem now.",
                    "label": 0
                },
                {
                    "sent": "Problem is to find S when the number of measurement is smaller than the number of unknown.",
                    "label": 0
                },
                {
                    "sent": "Well, this from your basic algebra course you tell me that's not possible.",
                    "label": 0
                },
                {
                    "sent": "You have more unknown than equations.",
                    "label": 0
                },
                {
                    "sent": "It will not work, but now I give you a hint.",
                    "label": 0
                },
                {
                    "sent": "I tell you.",
                    "label": 0
                },
                {
                    "sent": "Well, I know a priority that my signal is sparse.",
                    "label": 0
                },
                {
                    "sent": "So I know that they have taken the right basis where some of the components of the signal R0.",
                    "label": 0
                },
                {
                    "sent": "How can I use that?",
                    "label": 0
                },
                {
                    "sent": "The answer is yes if I do a correct Oracle.",
                    "label": 0
                },
                {
                    "sent": "If I guess correctly, which of the signal components are zero, then they will be able to do it now exactly as in Shannon.",
                    "label": 0
                },
                {
                    "sent": "The question is to use that in a fast way.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And people have tried several methods.",
                    "label": 0
                },
                {
                    "sent": "One of them is a celebrated L1 norm minimization, in which you address this problem like an optimization problem.",
                    "label": 0
                },
                {
                    "sent": "But if you look at this linear subspace and you want to come to minimize the norm of some of excites of power gamma, the thing that you would like to minimize is UL0 norm.",
                    "label": 0
                },
                {
                    "sent": "The number of non zero component.",
                    "label": 0
                },
                {
                    "sent": "But because you cannot do that, you go to a convex problem which is just minimizing the L1 norm and the standard method would be just to minimize, well, two norm.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This the efficacy of this procedure can be measured by by your face diagram.",
                    "label": 0
                },
                {
                    "sent": "This is a number of equations per variable and this is the sparsity that is a fraction of non zero variables and you find out that if you are below the blue line, reconstruction is impossible.",
                    "label": 0
                },
                {
                    "sent": "You don't have enough measurement if you are above the green line you have more more measurement than unknown, so it's just trivial case you do it by just linear algebra.",
                    "label": 0
                },
                {
                    "sent": "With this is a part of your linear algebra.",
                    "label": 0
                },
                {
                    "sent": "'cause that you know from your childhood and in between you get something which is possible with L1 until you hit what a phase transition.",
                    "label": 0
                },
                {
                    "sent": "And the whole thing that we have been working on is try to find another method which gets into this forbidden region and goes better than the phase transition.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And they will just show in one minute how it goes.",
                    "label": 0
                },
                {
                    "sent": "Basically what you have to do is again apply your Bayesian approach as you build up a probability measure which combines the constraints due to the measurement and the prior knowledge and sparsity.",
                    "label": 0
                },
                {
                    "sent": "And you can sample with this probabilistic method using again mean field method, which is a message passing an by doing that.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can get something which is better.",
                    "label": 0
                },
                {
                    "sent": "This is called belief propagation.",
                    "label": 0
                },
                {
                    "sent": "Decoding of the of the compressed sensing and you can go better in the part of the forbidden region if you have a good prior knowledge of the signal.",
                    "label": 0
                },
                {
                    "sent": "If you don't have it, you don't improve so much and what is.",
                    "label": 0
                },
                {
                    "sent": "What is this phase transition here?",
                    "label": 0
                },
                {
                    "sent": "It's a glass transition and so it's again a place where the algorithm your iteration of min field equation gets very slow and so the algorithm is not able to.",
                    "label": 0
                },
                {
                    "sent": "Find.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The system so you have.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "An easy phase when you have many measurement, you have an impossible phase when you don't have enough measurement and there are many possibilities of possible states of the variable X which are compatible with the measurement and there is intermediate hard of system in which there is a solution, but your algorithm is trapped by these metastable glassy state and the way to get out of it is to constrain.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To construct a measurement matrix which seeds this crystalline state, and for this we use something which is well known in physics.",
                    "label": 0
                },
                {
                    "sent": "That is, if you have if you want to build a crystal, for instance, this is supercooled water you drop in the supercooled water.",
                    "label": 0
                },
                {
                    "sent": "You drop a small crystal of the ice and it freezes.",
                    "label": 0
                },
                {
                    "sent": "And you can.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Design that exactly in the measurement matrix you decide to insist on a subset of matrix, so you take a banded matrix like that and you do more measurement for the first group of variables.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And it will create a seed of the solution that will propagate through the system, like a crystallization wave.",
                    "label": 0
                },
                {
                    "sent": "So it's a crystallization in the algorithm.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And using that you see that this is for instance decoding this image of Lennar.",
                    "label": 0
                },
                {
                    "sent": "The sparsity is such that you should be able to do it down to a number.",
                    "label": 0
                },
                {
                    "sent": "Alpha is the number of measurements, so this is large number of measurement.",
                    "label": 0
                },
                {
                    "sent": "Every method is able to decode.",
                    "label": 0
                },
                {
                    "sent": "This is small number of measurement.",
                    "label": 0
                },
                {
                    "sent": "The Shannon threshold is .24.",
                    "label": 0
                },
                {
                    "sent": "This is the minimization of L1 norm.",
                    "label": 0
                },
                {
                    "sent": "This is a standard mean field and this is a mean field with the seeded variable.",
                    "label": 0
                },
                {
                    "sent": "And you see that you improve a lot.",
                    "label": 0
                },
                {
                    "sent": "The decoding, so this is just one one more example, I think that the message that I want to give to you is the fact that as soon as you start to handle many variable, many couple variables here through many measurement, many big data, large number of measurements you have to be very careful because you are working in large dimensional space in which very often you will see these phenomena, phase transition.",
                    "label": 0
                },
                {
                    "sent": "And actually they play a major role.",
                    "label": 0
                },
                {
                    "sent": "And they have shown you 2 examples in which they play major role.",
                    "label": 0
                },
                {
                    "sent": "One is communication theory, Shannon theorem and the best possible error correcting code and the other one is compressed sensing.",
                    "label": 0
                },
                {
                    "sent": "Thanks a lot.",
                    "label": 0
                }
            ]
        }
    }
}