{
    "id": "z37hwt2iof73tkezklnmtc56tcyjkdu3",
    "title": "Building AI: Our Shared Enterprise",
    "info": {
        "author": [
            "Steven Minton, InferLink Corporation"
        ],
        "published": "Aug. 17, 2012",
        "recorded": "July 2012",
        "category": [
            "Top->Computer Science->Artificial Intelligence",
            "Top->Computer Science->Robotics",
            "Top->Computer Science->Crowdsourcing"
        ]
    },
    "url": "http://videolectures.net/aaai2012_minton_ai/",
    "segmentation": [
        [
            "I am really very gratified to receive this award and also to have the opportunity to give a non technical talk in a way that is a little different than my usual talks, but probably near and dear to my heart in a lot of ways."
        ],
        [
            "So I'd like to start this talk by asking you to consider a question, which is why are you here?",
            "And by that I don't mean why you're here listening to me in this room as opposed to down the Hall.",
            "What I mean is you know why you're here in Toronto, which for many of you is hundreds or thousands of miles away from your home.",
            "And if you think about that kind of question, that question is kind of fun because you realize that we're all here for essentially the same reasons we want to exchange your ideas, find out what's going on in the field that you haven't heard about, bounce ideas off other people, and then we're also passionately interested in artificial intelligence."
        ],
        [
            "Now.",
            "I'm very excited to see what AI looks like in 20 years.",
            "I don't know whether it will have, you know, a super Siri that can tell jokes and help me around the house and all sorts of great things like that."
        ],
        [
            "Or maybe something that's less useful around the house, but more strategic in nature can help me answer big questions and help us find the cure to cancer and so forth.",
            "Whatever it is, it's certainly exciting and I'm excited to see it happen.",
            "I've been excited by all the great progress we've made in the last 20 years.",
            "Some of it's very surprising.",
            "But you know, as I've gotten older, I'm not.",
            "I'm thinking maybe it's not happening fast enough, and so I really wanted, you know to."
        ],
        [
            "It up and so this talks.",
            "This sort of like.",
            "Designed to consider how we get from here to there.",
            "One of the things that we can do effectively to make it happen faster.",
            "And I think one of the most important things that we can do is to share our work better and faster.",
            "So this I'm going to talk about open science and the importance of collaboration.",
            "How we share, why we share, how we can support sharing and can we do a better job."
        ],
        [
            "I want to start by talking about this kind of a myth that's at least out there in the general public, and it's the myth that that science happens and breakthroughs happen by really, really smart people, kind of who sit in their room and think really hard about things and all of a sudden there's a breakthrough.",
            "That's that's how it happens.",
            "But in reality, I think we all recognize that doesn't happen like that at all, in fact.",
            "I think almost all the developments that I thought were significant that I watched or participated in happened to the work of groups of people.",
            "Evolving ideas overtime.",
            "Sometimes that happens relatively rapidly if everyone is excited about a new thing, but there's always, you know, almost everything I've seen.",
            "There's a bunch of people in."
        ],
        [
            "Soft, and if you think about this question, how did the web come about?",
            "I think that illustrates it.",
            "So the web is probably the biggest breakthrough you all seen in our generation.",
            "Fact there are tons of people that contributed to that, and this is just sort of, you know, a few names that are associated with you, know web pioneers.",
            "So if you looked in the in the early 90s and there's a search for Internet pioneers, this is the kind of names that you find, and there are people that are working on things like.",
            "Internet infrastructure development of the Internet and the domain naming system and indexing systems like wastes and Archie, Veronica and hypertext systems of various types for viewing files.",
            "Things like.",
            "Go for.",
            "And their search engine's and development of browsers like Mosaic.",
            "These are all really important developments.",
            "However, if you look to the popular press today, you'll see the question who invented the web and when you kind of put it like that, it's really this one guy that comes down to well deserved in a lot of ways, to spurn Berners Lee, did some tremendous contributions, for example, development of HTML in the HTTP hypertext system.",
            "He also named the Thing that we use today, the World Wide Web.",
            "So so if you see, you know in the newspaper who invented the web was Tim Berners Lee.",
            "But in fact, as much as I admire him, that's a misleading way to look at the world.",
            "And that it kind of sometimes I think, creeps into our own thinking.",
            "Because it really happened through, you know, a lot of people collaborating."
        ],
        [
            "Now I'm going to use the term open science here today that generally refers to.",
            "The movement that scientific knowledge should be openly shared with no barriers to dissemination and reuse.",
            "And if you are inspired by this quote by Isaac Newton, if I have seen further it is by standing on the shoulders of Giants, then you know.",
            "You're certainly believer in sharing of work."
        ],
        [
            "So what we're going to do here is kind of take a tour through open signs today.",
            "And I have two goals in this talk.",
            "The first one is to really buy sort of emphasizing the big picture.",
            "We don't often get a chance to look at everything that's happening.",
            "I'm trying to put this together in a quick whirlwind tour.",
            "OK, so that you can see really how important this is, actually, how critical it is today, and all the things that we've accomplished in terms of sharing our work and how it affects us today.",
            "Because appreciation of that is important.",
            "'cause often we have to fight to remove these barriers, so that's one of my goals.",
            "The second goal is hopefully to inspire at least a few of you to go out and start your own open science projects.",
            "So I'm going to as I'm doing that, or I'm going to pull up some lessons I've learned about essentially organizational psychology, what it takes for an organization to succeed, and I'm going to point to some specific instances I thought were good illustration of.",
            "Helpful hints if you want to think about that in terms of creating your own open science project.",
            "And I'm going to start by talking about education, just very briefly, because in fact that is.",
            "Really, a big issue today.",
            "Open open education.",
            "Or Open Access to education and you can you know it exists out there in terms of things like video lectures.",
            "Which are we can all you know download easily to our laptop.",
            "Resources like Khan Academy.",
            "And in particular, what scrub so much attention lately is things like massive online courses.",
            "For instance on Monday, and Ruin gave a terrific talk on what it's like to teach his machine learning course at Stanford.",
            "200,000 people.",
            "Which was is it was a great talk.",
            "I actually.",
            "I think I was the first person to teach that course at Stanford.",
            "I taught it for a couple of years in the early 90s and they were like 20 people in my course.",
            "Anne.",
            "In fact, a couple of them went on to become professors.",
            "But just think teaching to 100,000 people.",
            "If just a small proportion of people going to do graduate work in machine learning, think of the impact that has.",
            "Anyway, it was really inspiring and obviously Open Access education is important because so present everyone and you know so many other people are talking about it.",
            "Even at this conference.",
            "So I'm just going to ask."
        ],
        [
            "Eat that and go to the next.",
            "Peace, which is Open Access publications."
        ],
        [
            "And that includes journals.",
            "So today we have a lot of Open Access journals like Geron, GLR, and the Journal Field Robotics, so they're generalists not only in AI, but alive fields, and in fact the rest of science is definitely jumped on this.",
            "So this is the Public Library.",
            "Science is a good example of a major scientific Journal that's Open Access."
        ],
        [
            "And there's also preprint and archive servers that are really important, so archive.org is an example that was a print server in the physics community that was pioneering in many ways.",
            "Online access and its cousin.",
            "The computing research repository, which is run by Joe Halpern.",
            "It's really important to us for archiving articles and so forth in this field."
        ],
        [
            "So lots of good things happening in open Nexus over the last 20 years.",
            "I want to talk about Geron specifically.",
            "'cause I have some, you know that's the thing that I most familiar with and just point out a couple of things.",
            "So Jeff was organized in 1992 and began publishing in 1993.",
            "That was a really fortuitous.",
            "Timing when we started organizing it.",
            "The idea was that we were going to advertise the articles on bulletin boards and published via FTP.",
            "OK, and then you know few months we were already on moving to go for so we can sort of get a hypertext view of all the files and a few months later we had, you know, the web became mosaic and just come out and became popular and so we built an early website.",
            "And that was great timing because as David said, you know it allowed us to make a big impact quickly and it was.",
            "It wasn't long before Jerry had a very high impact factor.",
            "And submissions are going up.",
            "You know it's still still growing today, so the thing I want to point out though, is that a lot of people contributed to that, so I was sort of holding the flag, but but in line with my general theme here, these are the names of just a few of the people that had a major impact and actually participated at least as much as I did in organizing the Journal.",
            "And like, I'd like to thank them, certainly.",
            "There's also we've had a strong series of executive editors that guide the Journal and made it what it is today and then associate Editors, editorial board members, authors, reviewers.",
            "All these people have contributed to the Journal in important ways.",
            "So it's it's a.",
            "It's a big effort with a lot of people looking back.",
            "One of the things I really worried about when we starting the Journal.",
            "And looking, you know, talking about organizing it with this group of people.",
            "The initial group of people at the top.",
            "I was really concerned about how it's going to get people.",
            "To do what you know, I should have clearly, so I wasn't going to be able to do it myself.",
            "It's going to take a lot of work by a lot of people.",
            "And at the time I was, I was taking a course on leadership at a organization called Landmark Education, which.",
            "Which actually helped give me some coaching.",
            "I want to relate to you.",
            "You know first of all, coaching is great because anyone who has an advisor knows it's great to get coaching and that's in business or whatever.",
            "And one of the things I learned there was that.",
            "It's hard to get people to do what you want to do.",
            "If you look at it that way, but but it turns out that people are really, really happy to contribute.",
            "So all you need to do, sometimes it just put it out there and make A and people either accept or decline the request, but you'll often be surprised so you don't have to beg your control typically.",
            "But if you give people the chance to contribute, you'll be surprised what happens.",
            "A lot of times."
        ],
        [
            "The other point about Jerrod, sort of interesting to sort of reflect upon, was that we didn't actually need to be radically new.",
            "We didn't when we launch a general a lot of discussion, you know.",
            "Well, maybe we should get rid of pure View.",
            "I mean, we could do so many different things that people were looking at.",
            "In the end, the main confusion contributions that we were looking for, and that we.",
            "That we made was that we made the Journal freely available, and I think that makes a big difference to folks in developing countries and students who are not major universities need to get access.",
            "We also improved the response time quite a bit at the time it took.",
            "I don't know Year 2, sometimes three years to get a Journal article published and we were able to turn that around a few months.",
            "An we made we encourage authors to contribute online dependencies with code and data and a lot of people took advantage of that, so those are the major contributions.",
            "But we still ended up with a technical Journal.",
            "I think that was a really good good choice.",
            "Had traditional reviewing articles look like Journal articles and we had a hardcopy version.",
            "And that was important for kind of getting us over the hump because.",
            "It's hard to imagine this, but at the time people were like, well, you know it's not really going to be, it's electronic.",
            "It's not going to be a real Journal.",
            "Anne.",
            "By kind of keeping.",
            "You might say the business model very similar to what were traditionally traditional journalists work.",
            "We were able to make a big impact, so I guess the point is you don't have to change a huge amount.",
            "To make something successful in a new way."
        ],
        [
            "OK, so the next thing I want to talk about is software."
        ],
        [
            "Open source software and when I was compiling this list of a few examples of open source software, you can see on the top line we've got kind of the big systems that are out there, Linux, my SQL, Apache, new.",
            "You know you thought thought as well when you look at that list, you really realize that open source software helps run the whole world.",
            "Really big and really important and pretty amazing what what been accomplished through open source.",
            "If you look in the AI world.",
            "I think there's a lot of really, really great toolkits out there.",
            "Things like gate and natural language.",
            "I'm going to talk about that in a minute.",
            "Waka for doing machine learning.",
            "Eclipse is a library for constraint programming.",
            "Mahut's, another example.",
            "It's a library for scalable data mining.",
            "And I think these are underappreciated in a way.",
            "So consider waka for example.",
            "If you're got a machine learning problem.",
            "Some comes to you with a new problem.",
            "The first thing that you want to do is try some standard algorithms on it right.",
            "Mac, Wacko and things like that is what makes that possible.",
            "OK, because you can just grab an algorithm, try it out, and that's your starting point.",
            "You may end up writing some custom algorithm for that problem, and you know we may never end up citing Wicca, but sort of what makes it possible to operate quickly.",
            "And that's a important point.",
            "There's also been a lot of individual AI projects with people have open source their code, and as someone who's.",
            "The user, other people's open source projects as well as a contributor myself, it's always sort of surprising what people will do if you open source your code and.",
            "You know, I think it's something that we should support.",
            "Continued support makes a big difference to people.",
            "Sometimes folks are reluctant to put out their code is open source because actually it doesn't look that.",
            "I mean, you know what the code is.",
            "Kind of messy doesn't look so great.",
            "I remember when I was doing my my thesis topic I thought.",
            "When I first started, I thought this is going to be the best thing since sliced bread on this big impact.",
            "And by the time I was done, it was like a hope.",
            "No one really looks too closely at some of the code I've written, but in fact you know open source that and then there were people they did amazing things that I hadn't.",
            "I hadn't even thought of.",
            "And anyway, so.",
            "I think that's a big contributor.",
            "I'd encourage everyone to keep keep doing that."
        ],
        [
            "I'd like to look at gate for a second point out some of the things that I think that they did right.",
            "Gate is a full lifecycle open source solution for text processing.",
            "For those of you who aren't familiar with it.",
            "It's been it's been going for 15 more than 15 years and has at the University of Sheffield's where.",
            "Kind of resides.",
            "It's gotten at least 5 million dollars, 55 million euros of funding.",
            "Just to Sheffield.",
            "And there are many users, both corporate and research, and it's got a bunch of plug and play modules.",
            "It's really terrific system.",
            "The thing that struck me when I looked at the gate website, I think they did a really good job is the first thing they say is that gate is a community of developers, users and scientists in that Community point is really critical for a lot of open source projects."
        ],
        [
            "In fact, you know.",
            "It's it's not really to an economist.",
            "You know, in the classical economic sense, contributing to open source is not necessary rational thing to do, right.",
            "This is a quote from a couple guys from Harvard.",
            "You said to an economist the behavior of individual programmers and commercial companies engaged in open source processes is startling.",
            "And in fact."
        ],
        [
            "There's been a lot of spend, a lot of work in social Sciences looking at.",
            "Why do people contribute to open source projects?",
            "And here's this, tables from a study.",
            "And includes a little little little.",
            "Literature review, and it's not nearly complete, but just sort of an illustration of some of the motivations that people have investigated.",
            "So people contribute because the software has value to them because of the status of recognition within the open source community, 'cause they learn from building open source, they enjoy coding.",
            "Sometimes they get paid or advance their career.",
            "They may believe in the free software, ideology and so forth.",
            "It turns out when you look at this.",
            "You know the studies make it clear.",
            "In fact, all these things are important.",
            "There's no one overriding reason why people contribute to open open source, but what some studies have definitely found is that intrinsic motivation.",
            "Is more important than extreme extrinsic motivation.",
            "So intrinsic motivation is just doing something for the self satisfaction type of reasons as opposed to any external reward or consequence."
        ],
        [
            "An in a couple of practical lessons we can take away from this.",
            "I'm just going to summarize real quickly here that you know people will contribute if they see the value and so you need to need to see the value in what you're doing.",
            "And they also need to see how to contribute.",
            "So, for example, Wikipedia.",
            "One of the reasons it's so successful is that it's so easy they make it so easy to sort of, you know, article.",
            "And add not add to the knowledge base.",
            "And people also need to see that they're not being taken advantage of.",
            "No one likes to know that you know or hear that someone is making a lot of money off their opens up there freely contributed work.",
            "I'll talk a little bit more about that in a few minutes."
        ],
        [
            "I'd like to turn in this store to open data which is, which is a really hot topic."
        ],
        [
            "Out there and there are a bunch of web scale projects.",
            "Mostly people know about, I think, which is certainly Wikipedia and its cousin DB Pedia, which which is basically taking the facts in the fact boxes of Wikipedia and making the machine readable so that folks like you and I can use that data.",
            "There's also the linked Open Data Project or initiative that's been.",
            "Driven by folks in the semantic Web community like like Tim Berners Lee.",
            "And that's about taking datasets.",
            "And publishing kind of like web pages.",
            "All the links and the metadata is easy to get to, and that's also a great resource.",
            "This been free or freemium.",
            "Databases from for profit companies like Factual and Freebase which was recently bought by Google not too long ago Opencyc.",
            "The thing I want to focus on is is in fact that open data is.",
            "This has been for a long time critical to AI, so if you think of some of the things that we rely on.",
            "Word, that's a good example.",
            "So when it's been around for a really long time, but think of how critical it is to work in natural language, just used by lots and lots and lots of projects in different ways."
        ],
        [
            "And then there's the UCI machine learning repository, so I'd like to to pick that as an example to focus in on.",
            "You see I sort of pozza.",
            "Tori consists of hundreds of publicly available datasets for people to train and test their machine learning algorithms.",
            "And was it was actually started in 1987 before that people did write, you know, including myself wrote machine learning.",
            "Systems, but you know your paper would be like well.",
            "So here's my algorithm.",
            "Here's why I think it's important.",
            "I'm going to show it on some toy data, maybe, maybe if I'm lucky I have access to a data set from some proprietary source.",
            "But it was such an important contribution that almost immediately became obligatory to use UCA UCI data for your experiments, because everyone knows how easy it is to fool yourself.",
            "If you're not running your stuff on real data, and also.",
            "Now the combination of open source.",
            "Code plus plus open data makes the work completely replicable for important from a scientific point of view.",
            "Now the neat thing I'd like to point out is that this was founded by David a while he was still a graduate student.",
            "And he wasn't the first guide to think of this.",
            "There was a fellow by the name of Spencer.",
            "Start seeing who tried to do this.",
            "Didn't really work, but kind of got the idea going.",
            "Ann and David was supported by by folks like Pat Langley and Dennis Kibler and Jeff Schlemmer, UCI.",
            "But he was able to kind of gather a bunch of datasets.",
            "I started out with about 20, made them publicly accessible and then it just grew from there and he did some good things when he when he put that initiative together.",
            "First of all, he set it up with the maintainers.",
            "Rotate overtime so every couple of years this is a new set of people maintaining the pozza Tori.",
            "And what's interesting is that the website provides very clear guidance on how to cite contributions in the repository, so you should cite the repository itself and the maintainers as well as the particular datasets and their contributors.",
            "And it's interesting because in fact the first version of the website didn't contain anything on how to site.",
            "But it quickly became apparent that this is something they should do, and it's in fact a really good idea.",
            "It seems obvious now, but but I'm you know it was sort of a novel contribution in a lot of ways, and.",
            "You know citation is the common currency in which we, in the academic world, sort of used to sort of.",
            "In a way reward people whose work that we're building on to knowledge them.",
            "As of 2009, David told me he there were over 9000 citations to the repository in the different maintainers over the years."
        ],
        [
            "Just a short digression to talk about the importance of things like citation.",
            "And fairness.",
            "It's a well known economics experiment demonstration called the Ultimatum Game, and it works like this.",
            "There are two players, player and play, and be an plays given amount of money.",
            "Let's say $20.",
            "And he's told he has to share some of that money with player big, but he can.",
            "You can split it, or you can just offer player be a dollar whatever he wants.",
            "An employee knows this.",
            "It's a full sort of full knowledge open sort of game.",
            "And player B has two choices.",
            "He can either accept the offer from player A.",
            "US or he can turn it down now if he accepts the offer.",
            "So for example, player A decides is going to split it $10.10 dollars.",
            "They both whatever it is.",
            "They both walk away with the money, but Player B rejects the offer.",
            "Then both players lose.",
            "You know, no one gets any money.",
            "From irrationality POV, player B should in fact you know.",
            "Just take whatever we can get, but as it turns out, experimentally people found no matter really what the amount of money is or the exact conditions.",
            "If player it gives player be less than about 20% will play.",
            "AB is often inclined to just say to heck with it.",
            "OK, so it's a nice illustration.",
            "You know the fairness really matters to people.",
            "And in fact, it's kind of a funny sort of side point.",
            "Which is they've done this kind of experiment with chimpanzees to see to see if they operate.",
            "Similarly, chimpanzees will be completely rational about it.",
            "It just take what they can get.",
            "But people people are different.",
            "This is important to them.",
            "OK, so.",
            "And then that point obviously relates to the whole citation."
        ],
        [
            "Then I would like to sort of also talk about what's been called crowds."
        ],
        [
            "For science, and that includes things like classification so.",
            "Galaxy Zoo is a an effort where basically scientists are posted pictures of thousands and thousands of different galaxies and they're getting people to classify the kind of web community classify those galaxies based on their shape.",
            "Well FM is is something where there are a bunch of whale songs that scientists have put on on the web and people classify the type of song it is and start it at home is a similar effort for classifying interstellar dust particles which were collected and there are thousands and thousands and thousands of those as well.",
            "So it's a lot of different things.",
            "This is only a smattering of the many things out there like this, and those are making a real contribution is also some neat things like.",
            "Kaggle, I don't know how many of you have looked at that, which is a site that makes it really easy to set up a competition, and it's been used to set up a bunch of data mining competitions where companies or people can contribute some data about a problem.",
            "That curious about and then sort of web community attacks it, and they've got some great results.",
            "And Henry mentioned folded, Henry can recounts in his talk the other day mentioned fold it, which is an example of.",
            "A site that lets people do fold proteins and in fact people can often do a better job than computers and scientists are learning from that data.",
            "There's also been a bunch of efforts in this community at doing things like creating ontologies and knowledge bases by having people play games or.",
            "Basically just contribute knowledge to system.",
            "And some important scientific collaborations.",
            "So a couple of years ago, and Marty Tenenbaum gave I think this exact talk, and he's talking about Cancer Commons, which is a great effort that he's been involved in to make it easier for cancer scientists working on cancer to share results so that you don't have to do massive trials.",
            "But every time you want to test something, so it's a more flexible way to use data.",
            "And the developing tools and technology to sort of improve the whole.",
            "Cancer experimentation lifecycle.",
            "And polymath is is not a project in our in our community, but I'd like to spend a minute talking about it because it's such a cool thing."
        ],
        [
            "Is in 2009 Tim Gowers, who is a field medalist fields medalist.",
            "And had a very active blog.",
            "Ask the following question is massively collaborative mathematics possible?",
            "And he posed a conjecture and invited people to participate with him in kind of a structured way.",
            "It wasn't like a divide and conquer problem, but the idea was to post your comments and conjectures and ideas and work collaboratively like that.",
            "So.",
            "The idea was that they're working on was to create a new combinatorial proof of the density Hales Jewett theorem.",
            "There was some kind of existing issues with the existing way that that had been proved, and that is a kind of a geometric kind of problem.",
            "It's actually has some relevance to computer science, but this is purely a mathematical exercise.",
            "In the first day.",
            "I think 6 people contributed with something like 24 different comments and by the end of three months there's been 40 significant different contributors.",
            "Result was actually a simple, beautiful combinatorial proof that generated a couple of papers under the name under the pseudonym DHJ polymath in the mathematical literature, and since then still active.",
            "I think they've done about 8 different problems, so it's a continuing experiment.",
            "Very, very interesting."
        ],
        [
            "OK, so here's the things that we've quickly looked at today.",
            "I would like to just talk for a couple of minutes about so few ideas.",
            "You know that I've called from a longer list on illustrations of things that we don't have today that we could be doing or just sort of terminating now in different ways.",
            "So actually when I was kind of looking to put this talk together.",
            "It reminded me of something that I've felt like we needed for several years, which is we don't have a directory of open source.",
            "AI, particularly in effect.",
            "You know I've worked on a bunch of different projects where we use open source.",
            "Data, open source code and you really have to hunt around for it, and there's no way to really know it's out there other than sort of just scouring the Internet.",
            "It would be great to have a directory of resources like this would be even better if people could figure out a way kind of to track how many people you know using what things and the value that they provide and so forth.",
            "So that would be a terrific contribution.",
            "Doug Fisher mentioned this idea the other day, which is he's working on.",
            "Wiki book he told me so.",
            "We don't really have.",
            "Yet the good examples of crowdsourced books or textbooks.",
            "That you know are really popular and great resources, but I think I think we could have them.",
            "You can also mention of course, like one of the massive online courses that are being organized.",
            "Consist typically of like small segments of five or 10 minute videos and a little subtopic, and they're all sort of strung together into a course.",
            "Right now those questions are put together by individual lecturers.",
            "But you can imagine crowd sourcing that.",
            "So you could actually get the best sort of video.",
            "I mean, there's tons of great educators out there.",
            "You can imagine putting together, you know.",
            "Of course it takes a certain amount of organization 'cause you don't want a bunch of unconnected sort of tidbits.",
            "But you can imagine putting together a course that has the best way to sort of lecture about the different pieces of the problem, and I think that would be better than any specific individual.",
            "Of course, that we might be able to put together.",
            "Possibly.",
            "There's also the idea of virtual research groups.",
            "So today you know most research groups in AI consists of faculty member of Pie with a couple of few graduate students, or maybe a slightly larger group with two or three pies and a bunch of programmers working with them.",
            "Maybe 5 or 10 people.",
            "But those groups almost always physically Co located and there physically Co located for good reason.",
            "Because you typically want to have very intense collaboration with someone who you're working closely with where you're talking every day or every two days.",
            "But you know technology is getting better and better.",
            "I think Skype is kind of.",
            "Well, things like Skype are impressive, but there's at least there may be the floor of what we could be doing.",
            "Imagine if you know it was really easy to to invite someone to participate in your research group from overseas or from anywhere, just as long as they were passionately interested in what you're doing.",
            "I think as our communication tools get better in our collaboration tools improve, this is going to be something that comes a real possibility.",
            "I'd like to also mention.",
            "The possibility of what you might call Big AI.",
            "This collaboration on a really massive scale.",
            "So as I said, our research groups tend to be pretty small in our field.",
            "I certainly enjoy working that way, but I've also worked in larger projects, like Caillou, we had 2525 different groups and companies in a DARPA funded project.",
            "That ostensibly led to something like Siri.",
            "Actually, that is, Siri was group out of piece of the work that Sri was doing there.",
            "Um?",
            "And that was exciting collaboration, except it sooner, triple typical DARPA project in a lot of ways, really separate groups, and we have collaborated at Pi meetings and so forth, and that was the extent of it.",
            "I think the best example of a small community really collaborating over extended period of time is the sore sore project which is run by John Laird, Paul Rosenbloom and Allan Newell originally.",
            "And, um.",
            "So it was definitely driven by a big idea and had sustained, sustained collaborative work by.",
            "Well, John told me about 50 people come to the store workshop every every year.",
            "That's stated that level for a long time, and it's an ongoing project and people are really collaborating on that single architecture.",
            "But think for a second about."
        ],
        [
            "Other communities, like the physics community, so the Atlas experiment.",
            "A lot of you have heard about it recently because may not have been realized.",
            "It was Atlas, but it was basically involved in the discovery of the Higgs Bozon at the Large Hadron Collider.",
            "And this is Atlas is the detector.",
            "And you can see it's a really big piece of equipment so.",
            "That little arrow the arrow to that little green thing down the bottom.",
            "That's a person.",
            "Alice, it's like weighs about as much as the Eiffel Tower.",
            "I have no idea what it costs, but in fact all the Atlas papers are signed by the scientists.",
            "You know that the peas on the prod.",
            "Not sure exactly what P is, but the major sort of scientifically.",
            "People that are working on the project together collaborating and that's over 2500 people.",
            "You sign those papers.",
            "Now.",
            "We don't have anything like that in the world either in terms of infrastructure or projects.",
            "Where people are collaborating on that level and I'm not.",
            "I'm not even sure that we want to, but it's certainly we might want to do something.",
            "But it certainly makes you think about the kind of scale that we could be working on in collaborating with.",
            "Right, it may be premature in our field, but it's certainly.",
            "I think there's some real possibilities.",
            "Imagine what we could build with something that big.",
            "I will say there are some big projects out there, like Watson, Siri, even Google right is a lot of AI going on there, but those are all closed systems.",
            "Right, we can't, we can't, you know, I can't take Watson and sort of start building on it.",
            "And and so imagine you know the possibility if we had something where we had a lot of us working together on some infrastructure that was completely shareable, I think that would be amazing."
        ],
        [
            "So I want to conclude.",
            "Bye.",
            "Just just pointing out.",
            "Then I guess my point here is that sharing our work is of vital importance.",
            "Today it's easy to forget.",
            "Easy to forget how important it really is to what we do.",
            "It's easy to just, you know, think of the work itself and the sharing is just something you do on the side.",
            "But in fact, sharing your work might be the most important thing that you do.",
            "And how you can help in open science initiatives is the following.",
            "If you're from a Funding Agency.",
            "Well, I hope that you'll support open source code and open data.",
            "I notice that they are very rare that I see an announcement from Funding Agency where they are highly encouraging people to open source the code, but I don't see why they shouldn't.",
            "It would be great if they were, you know, more DARPA projects that left, you know, resulted in things like.",
            "Resources like.",
            "You know ontology or or something.",
            "Even like word net, right?",
            "Just something that there's a value that was kind of left behind from that project.",
            "In addition to the papers.",
            "A paper is certainly important, but I think there's a lot more that could be done if funds were really looking to make that happen.",
            "Senior faculty members.",
            "If you're single and faculty members, I hope that you'll think about rewarding impactful contributions that are essentially non traditional.",
            "I'm not saying that service should replace, you know you have intellectual contribution, but I think that intellectual contributions can come in a bunch of different forms and the impact of something can be measured in more than just the paper that you write.",
            "And if people really take that seriously and things like promotion committees and tenure, I think you know the whole community will benefit.",
            "And if you're a student or researcher, please continue sending your papers to Open Access publications.",
            "If you think about that, I think I think I think.",
            "I think it's something that you should think about doing consciously.",
            "Open search your code in your data.",
            "As I said before, some people are reluctant to do that because they're a little embarrassed, but in fact you shouldn't be.",
            "Fact not not.",
            "You know this so much.",
            "So many contributions you can make and nothing, everything, everyone recognizes that nothing is perfect out there.",
            "And last but not least, you know I hope I hope that you consider starting your own open science project.",
            "It may be easier than you think and lead to greater impact.",
            "And I can tell you, it's very satisfying to do that.",
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I am really very gratified to receive this award and also to have the opportunity to give a non technical talk in a way that is a little different than my usual talks, but probably near and dear to my heart in a lot of ways.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I'd like to start this talk by asking you to consider a question, which is why are you here?",
                    "label": 0
                },
                {
                    "sent": "And by that I don't mean why you're here listening to me in this room as opposed to down the Hall.",
                    "label": 0
                },
                {
                    "sent": "What I mean is you know why you're here in Toronto, which for many of you is hundreds or thousands of miles away from your home.",
                    "label": 0
                },
                {
                    "sent": "And if you think about that kind of question, that question is kind of fun because you realize that we're all here for essentially the same reasons we want to exchange your ideas, find out what's going on in the field that you haven't heard about, bounce ideas off other people, and then we're also passionately interested in artificial intelligence.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "I'm very excited to see what AI looks like in 20 years.",
                    "label": 0
                },
                {
                    "sent": "I don't know whether it will have, you know, a super Siri that can tell jokes and help me around the house and all sorts of great things like that.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or maybe something that's less useful around the house, but more strategic in nature can help me answer big questions and help us find the cure to cancer and so forth.",
                    "label": 0
                },
                {
                    "sent": "Whatever it is, it's certainly exciting and I'm excited to see it happen.",
                    "label": 0
                },
                {
                    "sent": "I've been excited by all the great progress we've made in the last 20 years.",
                    "label": 0
                },
                {
                    "sent": "Some of it's very surprising.",
                    "label": 0
                },
                {
                    "sent": "But you know, as I've gotten older, I'm not.",
                    "label": 0
                },
                {
                    "sent": "I'm thinking maybe it's not happening fast enough, and so I really wanted, you know to.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It up and so this talks.",
                    "label": 0
                },
                {
                    "sent": "This sort of like.",
                    "label": 0
                },
                {
                    "sent": "Designed to consider how we get from here to there.",
                    "label": 0
                },
                {
                    "sent": "One of the things that we can do effectively to make it happen faster.",
                    "label": 0
                },
                {
                    "sent": "And I think one of the most important things that we can do is to share our work better and faster.",
                    "label": 0
                },
                {
                    "sent": "So this I'm going to talk about open science and the importance of collaboration.",
                    "label": 0
                },
                {
                    "sent": "How we share, why we share, how we can support sharing and can we do a better job.",
                    "label": 1
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I want to start by talking about this kind of a myth that's at least out there in the general public, and it's the myth that that science happens and breakthroughs happen by really, really smart people, kind of who sit in their room and think really hard about things and all of a sudden there's a breakthrough.",
                    "label": 0
                },
                {
                    "sent": "That's that's how it happens.",
                    "label": 0
                },
                {
                    "sent": "But in reality, I think we all recognize that doesn't happen like that at all, in fact.",
                    "label": 0
                },
                {
                    "sent": "I think almost all the developments that I thought were significant that I watched or participated in happened to the work of groups of people.",
                    "label": 0
                },
                {
                    "sent": "Evolving ideas overtime.",
                    "label": 0
                },
                {
                    "sent": "Sometimes that happens relatively rapidly if everyone is excited about a new thing, but there's always, you know, almost everything I've seen.",
                    "label": 0
                },
                {
                    "sent": "There's a bunch of people in.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Soft, and if you think about this question, how did the web come about?",
                    "label": 1
                },
                {
                    "sent": "I think that illustrates it.",
                    "label": 0
                },
                {
                    "sent": "So the web is probably the biggest breakthrough you all seen in our generation.",
                    "label": 0
                },
                {
                    "sent": "Fact there are tons of people that contributed to that, and this is just sort of, you know, a few names that are associated with you, know web pioneers.",
                    "label": 0
                },
                {
                    "sent": "So if you looked in the in the early 90s and there's a search for Internet pioneers, this is the kind of names that you find, and there are people that are working on things like.",
                    "label": 0
                },
                {
                    "sent": "Internet infrastructure development of the Internet and the domain naming system and indexing systems like wastes and Archie, Veronica and hypertext systems of various types for viewing files.",
                    "label": 0
                },
                {
                    "sent": "Things like.",
                    "label": 0
                },
                {
                    "sent": "Go for.",
                    "label": 0
                },
                {
                    "sent": "And their search engine's and development of browsers like Mosaic.",
                    "label": 0
                },
                {
                    "sent": "These are all really important developments.",
                    "label": 0
                },
                {
                    "sent": "However, if you look to the popular press today, you'll see the question who invented the web and when you kind of put it like that, it's really this one guy that comes down to well deserved in a lot of ways, to spurn Berners Lee, did some tremendous contributions, for example, development of HTML in the HTTP hypertext system.",
                    "label": 0
                },
                {
                    "sent": "He also named the Thing that we use today, the World Wide Web.",
                    "label": 0
                },
                {
                    "sent": "So so if you see, you know in the newspaper who invented the web was Tim Berners Lee.",
                    "label": 0
                },
                {
                    "sent": "But in fact, as much as I admire him, that's a misleading way to look at the world.",
                    "label": 0
                },
                {
                    "sent": "And that it kind of sometimes I think, creeps into our own thinking.",
                    "label": 0
                },
                {
                    "sent": "Because it really happened through, you know, a lot of people collaborating.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now I'm going to use the term open science here today that generally refers to.",
                    "label": 0
                },
                {
                    "sent": "The movement that scientific knowledge should be openly shared with no barriers to dissemination and reuse.",
                    "label": 1
                },
                {
                    "sent": "And if you are inspired by this quote by Isaac Newton, if I have seen further it is by standing on the shoulders of Giants, then you know.",
                    "label": 1
                },
                {
                    "sent": "You're certainly believer in sharing of work.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what we're going to do here is kind of take a tour through open signs today.",
                    "label": 0
                },
                {
                    "sent": "And I have two goals in this talk.",
                    "label": 0
                },
                {
                    "sent": "The first one is to really buy sort of emphasizing the big picture.",
                    "label": 0
                },
                {
                    "sent": "We don't often get a chance to look at everything that's happening.",
                    "label": 0
                },
                {
                    "sent": "I'm trying to put this together in a quick whirlwind tour.",
                    "label": 0
                },
                {
                    "sent": "OK, so that you can see really how important this is, actually, how critical it is today, and all the things that we've accomplished in terms of sharing our work and how it affects us today.",
                    "label": 0
                },
                {
                    "sent": "Because appreciation of that is important.",
                    "label": 0
                },
                {
                    "sent": "'cause often we have to fight to remove these barriers, so that's one of my goals.",
                    "label": 0
                },
                {
                    "sent": "The second goal is hopefully to inspire at least a few of you to go out and start your own open science projects.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to as I'm doing that, or I'm going to pull up some lessons I've learned about essentially organizational psychology, what it takes for an organization to succeed, and I'm going to point to some specific instances I thought were good illustration of.",
                    "label": 0
                },
                {
                    "sent": "Helpful hints if you want to think about that in terms of creating your own open science project.",
                    "label": 0
                },
                {
                    "sent": "And I'm going to start by talking about education, just very briefly, because in fact that is.",
                    "label": 0
                },
                {
                    "sent": "Really, a big issue today.",
                    "label": 0
                },
                {
                    "sent": "Open open education.",
                    "label": 0
                },
                {
                    "sent": "Or Open Access to education and you can you know it exists out there in terms of things like video lectures.",
                    "label": 0
                },
                {
                    "sent": "Which are we can all you know download easily to our laptop.",
                    "label": 0
                },
                {
                    "sent": "Resources like Khan Academy.",
                    "label": 0
                },
                {
                    "sent": "And in particular, what scrub so much attention lately is things like massive online courses.",
                    "label": 0
                },
                {
                    "sent": "For instance on Monday, and Ruin gave a terrific talk on what it's like to teach his machine learning course at Stanford.",
                    "label": 0
                },
                {
                    "sent": "200,000 people.",
                    "label": 0
                },
                {
                    "sent": "Which was is it was a great talk.",
                    "label": 0
                },
                {
                    "sent": "I actually.",
                    "label": 0
                },
                {
                    "sent": "I think I was the first person to teach that course at Stanford.",
                    "label": 0
                },
                {
                    "sent": "I taught it for a couple of years in the early 90s and they were like 20 people in my course.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "In fact, a couple of them went on to become professors.",
                    "label": 0
                },
                {
                    "sent": "But just think teaching to 100,000 people.",
                    "label": 0
                },
                {
                    "sent": "If just a small proportion of people going to do graduate work in machine learning, think of the impact that has.",
                    "label": 0
                },
                {
                    "sent": "Anyway, it was really inspiring and obviously Open Access education is important because so present everyone and you know so many other people are talking about it.",
                    "label": 0
                },
                {
                    "sent": "Even at this conference.",
                    "label": 0
                },
                {
                    "sent": "So I'm just going to ask.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Eat that and go to the next.",
                    "label": 0
                },
                {
                    "sent": "Peace, which is Open Access publications.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And that includes journals.",
                    "label": 0
                },
                {
                    "sent": "So today we have a lot of Open Access journals like Geron, GLR, and the Journal Field Robotics, so they're generalists not only in AI, but alive fields, and in fact the rest of science is definitely jumped on this.",
                    "label": 0
                },
                {
                    "sent": "So this is the Public Library.",
                    "label": 0
                },
                {
                    "sent": "Science is a good example of a major scientific Journal that's Open Access.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And there's also preprint and archive servers that are really important, so archive.org is an example that was a print server in the physics community that was pioneering in many ways.",
                    "label": 0
                },
                {
                    "sent": "Online access and its cousin.",
                    "label": 0
                },
                {
                    "sent": "The computing research repository, which is run by Joe Halpern.",
                    "label": 0
                },
                {
                    "sent": "It's really important to us for archiving articles and so forth in this field.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So lots of good things happening in open Nexus over the last 20 years.",
                    "label": 0
                },
                {
                    "sent": "I want to talk about Geron specifically.",
                    "label": 0
                },
                {
                    "sent": "'cause I have some, you know that's the thing that I most familiar with and just point out a couple of things.",
                    "label": 0
                },
                {
                    "sent": "So Jeff was organized in 1992 and began publishing in 1993.",
                    "label": 1
                },
                {
                    "sent": "That was a really fortuitous.",
                    "label": 0
                },
                {
                    "sent": "Timing when we started organizing it.",
                    "label": 0
                },
                {
                    "sent": "The idea was that we were going to advertise the articles on bulletin boards and published via FTP.",
                    "label": 0
                },
                {
                    "sent": "OK, and then you know few months we were already on moving to go for so we can sort of get a hypertext view of all the files and a few months later we had, you know, the web became mosaic and just come out and became popular and so we built an early website.",
                    "label": 0
                },
                {
                    "sent": "And that was great timing because as David said, you know it allowed us to make a big impact quickly and it was.",
                    "label": 1
                },
                {
                    "sent": "It wasn't long before Jerry had a very high impact factor.",
                    "label": 0
                },
                {
                    "sent": "And submissions are going up.",
                    "label": 0
                },
                {
                    "sent": "You know it's still still growing today, so the thing I want to point out though, is that a lot of people contributed to that, so I was sort of holding the flag, but but in line with my general theme here, these are the names of just a few of the people that had a major impact and actually participated at least as much as I did in organizing the Journal.",
                    "label": 0
                },
                {
                    "sent": "And like, I'd like to thank them, certainly.",
                    "label": 1
                },
                {
                    "sent": "There's also we've had a strong series of executive editors that guide the Journal and made it what it is today and then associate Editors, editorial board members, authors, reviewers.",
                    "label": 0
                },
                {
                    "sent": "All these people have contributed to the Journal in important ways.",
                    "label": 0
                },
                {
                    "sent": "So it's it's a.",
                    "label": 0
                },
                {
                    "sent": "It's a big effort with a lot of people looking back.",
                    "label": 0
                },
                {
                    "sent": "One of the things I really worried about when we starting the Journal.",
                    "label": 0
                },
                {
                    "sent": "And looking, you know, talking about organizing it with this group of people.",
                    "label": 0
                },
                {
                    "sent": "The initial group of people at the top.",
                    "label": 0
                },
                {
                    "sent": "I was really concerned about how it's going to get people.",
                    "label": 0
                },
                {
                    "sent": "To do what you know, I should have clearly, so I wasn't going to be able to do it myself.",
                    "label": 0
                },
                {
                    "sent": "It's going to take a lot of work by a lot of people.",
                    "label": 0
                },
                {
                    "sent": "And at the time I was, I was taking a course on leadership at a organization called Landmark Education, which.",
                    "label": 0
                },
                {
                    "sent": "Which actually helped give me some coaching.",
                    "label": 0
                },
                {
                    "sent": "I want to relate to you.",
                    "label": 0
                },
                {
                    "sent": "You know first of all, coaching is great because anyone who has an advisor knows it's great to get coaching and that's in business or whatever.",
                    "label": 0
                },
                {
                    "sent": "And one of the things I learned there was that.",
                    "label": 1
                },
                {
                    "sent": "It's hard to get people to do what you want to do.",
                    "label": 0
                },
                {
                    "sent": "If you look at it that way, but but it turns out that people are really, really happy to contribute.",
                    "label": 0
                },
                {
                    "sent": "So all you need to do, sometimes it just put it out there and make A and people either accept or decline the request, but you'll often be surprised so you don't have to beg your control typically.",
                    "label": 0
                },
                {
                    "sent": "But if you give people the chance to contribute, you'll be surprised what happens.",
                    "label": 0
                },
                {
                    "sent": "A lot of times.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The other point about Jerrod, sort of interesting to sort of reflect upon, was that we didn't actually need to be radically new.",
                    "label": 0
                },
                {
                    "sent": "We didn't when we launch a general a lot of discussion, you know.",
                    "label": 0
                },
                {
                    "sent": "Well, maybe we should get rid of pure View.",
                    "label": 0
                },
                {
                    "sent": "I mean, we could do so many different things that people were looking at.",
                    "label": 0
                },
                {
                    "sent": "In the end, the main confusion contributions that we were looking for, and that we.",
                    "label": 0
                },
                {
                    "sent": "That we made was that we made the Journal freely available, and I think that makes a big difference to folks in developing countries and students who are not major universities need to get access.",
                    "label": 0
                },
                {
                    "sent": "We also improved the response time quite a bit at the time it took.",
                    "label": 0
                },
                {
                    "sent": "I don't know Year 2, sometimes three years to get a Journal article published and we were able to turn that around a few months.",
                    "label": 0
                },
                {
                    "sent": "An we made we encourage authors to contribute online dependencies with code and data and a lot of people took advantage of that, so those are the major contributions.",
                    "label": 0
                },
                {
                    "sent": "But we still ended up with a technical Journal.",
                    "label": 1
                },
                {
                    "sent": "I think that was a really good good choice.",
                    "label": 0
                },
                {
                    "sent": "Had traditional reviewing articles look like Journal articles and we had a hardcopy version.",
                    "label": 1
                },
                {
                    "sent": "And that was important for kind of getting us over the hump because.",
                    "label": 0
                },
                {
                    "sent": "It's hard to imagine this, but at the time people were like, well, you know it's not really going to be, it's electronic.",
                    "label": 0
                },
                {
                    "sent": "It's not going to be a real Journal.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "By kind of keeping.",
                    "label": 0
                },
                {
                    "sent": "You might say the business model very similar to what were traditionally traditional journalists work.",
                    "label": 0
                },
                {
                    "sent": "We were able to make a big impact, so I guess the point is you don't have to change a huge amount.",
                    "label": 0
                },
                {
                    "sent": "To make something successful in a new way.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so the next thing I want to talk about is software.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Open source software and when I was compiling this list of a few examples of open source software, you can see on the top line we've got kind of the big systems that are out there, Linux, my SQL, Apache, new.",
                    "label": 0
                },
                {
                    "sent": "You know you thought thought as well when you look at that list, you really realize that open source software helps run the whole world.",
                    "label": 0
                },
                {
                    "sent": "Really big and really important and pretty amazing what what been accomplished through open source.",
                    "label": 0
                },
                {
                    "sent": "If you look in the AI world.",
                    "label": 0
                },
                {
                    "sent": "I think there's a lot of really, really great toolkits out there.",
                    "label": 0
                },
                {
                    "sent": "Things like gate and natural language.",
                    "label": 0
                },
                {
                    "sent": "I'm going to talk about that in a minute.",
                    "label": 0
                },
                {
                    "sent": "Waka for doing machine learning.",
                    "label": 0
                },
                {
                    "sent": "Eclipse is a library for constraint programming.",
                    "label": 0
                },
                {
                    "sent": "Mahut's, another example.",
                    "label": 0
                },
                {
                    "sent": "It's a library for scalable data mining.",
                    "label": 0
                },
                {
                    "sent": "And I think these are underappreciated in a way.",
                    "label": 0
                },
                {
                    "sent": "So consider waka for example.",
                    "label": 0
                },
                {
                    "sent": "If you're got a machine learning problem.",
                    "label": 0
                },
                {
                    "sent": "Some comes to you with a new problem.",
                    "label": 0
                },
                {
                    "sent": "The first thing that you want to do is try some standard algorithms on it right.",
                    "label": 0
                },
                {
                    "sent": "Mac, Wacko and things like that is what makes that possible.",
                    "label": 0
                },
                {
                    "sent": "OK, because you can just grab an algorithm, try it out, and that's your starting point.",
                    "label": 0
                },
                {
                    "sent": "You may end up writing some custom algorithm for that problem, and you know we may never end up citing Wicca, but sort of what makes it possible to operate quickly.",
                    "label": 0
                },
                {
                    "sent": "And that's a important point.",
                    "label": 0
                },
                {
                    "sent": "There's also been a lot of individual AI projects with people have open source their code, and as someone who's.",
                    "label": 1
                },
                {
                    "sent": "The user, other people's open source projects as well as a contributor myself, it's always sort of surprising what people will do if you open source your code and.",
                    "label": 0
                },
                {
                    "sent": "You know, I think it's something that we should support.",
                    "label": 0
                },
                {
                    "sent": "Continued support makes a big difference to people.",
                    "label": 0
                },
                {
                    "sent": "Sometimes folks are reluctant to put out their code is open source because actually it doesn't look that.",
                    "label": 0
                },
                {
                    "sent": "I mean, you know what the code is.",
                    "label": 0
                },
                {
                    "sent": "Kind of messy doesn't look so great.",
                    "label": 0
                },
                {
                    "sent": "I remember when I was doing my my thesis topic I thought.",
                    "label": 0
                },
                {
                    "sent": "When I first started, I thought this is going to be the best thing since sliced bread on this big impact.",
                    "label": 0
                },
                {
                    "sent": "And by the time I was done, it was like a hope.",
                    "label": 0
                },
                {
                    "sent": "No one really looks too closely at some of the code I've written, but in fact you know open source that and then there were people they did amazing things that I hadn't.",
                    "label": 0
                },
                {
                    "sent": "I hadn't even thought of.",
                    "label": 0
                },
                {
                    "sent": "And anyway, so.",
                    "label": 0
                },
                {
                    "sent": "I think that's a big contributor.",
                    "label": 0
                },
                {
                    "sent": "I'd encourage everyone to keep keep doing that.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'd like to look at gate for a second point out some of the things that I think that they did right.",
                    "label": 0
                },
                {
                    "sent": "Gate is a full lifecycle open source solution for text processing.",
                    "label": 1
                },
                {
                    "sent": "For those of you who aren't familiar with it.",
                    "label": 0
                },
                {
                    "sent": "It's been it's been going for 15 more than 15 years and has at the University of Sheffield's where.",
                    "label": 0
                },
                {
                    "sent": "Kind of resides.",
                    "label": 0
                },
                {
                    "sent": "It's gotten at least 5 million dollars, 55 million euros of funding.",
                    "label": 0
                },
                {
                    "sent": "Just to Sheffield.",
                    "label": 1
                },
                {
                    "sent": "And there are many users, both corporate and research, and it's got a bunch of plug and play modules.",
                    "label": 0
                },
                {
                    "sent": "It's really terrific system.",
                    "label": 0
                },
                {
                    "sent": "The thing that struck me when I looked at the gate website, I think they did a really good job is the first thing they say is that gate is a community of developers, users and scientists in that Community point is really critical for a lot of open source projects.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In fact, you know.",
                    "label": 0
                },
                {
                    "sent": "It's it's not really to an economist.",
                    "label": 0
                },
                {
                    "sent": "You know, in the classical economic sense, contributing to open source is not necessary rational thing to do, right.",
                    "label": 0
                },
                {
                    "sent": "This is a quote from a couple guys from Harvard.",
                    "label": 0
                },
                {
                    "sent": "You said to an economist the behavior of individual programmers and commercial companies engaged in open source processes is startling.",
                    "label": 1
                },
                {
                    "sent": "And in fact.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There's been a lot of spend, a lot of work in social Sciences looking at.",
                    "label": 0
                },
                {
                    "sent": "Why do people contribute to open source projects?",
                    "label": 0
                },
                {
                    "sent": "And here's this, tables from a study.",
                    "label": 0
                },
                {
                    "sent": "And includes a little little little.",
                    "label": 0
                },
                {
                    "sent": "Literature review, and it's not nearly complete, but just sort of an illustration of some of the motivations that people have investigated.",
                    "label": 0
                },
                {
                    "sent": "So people contribute because the software has value to them because of the status of recognition within the open source community, 'cause they learn from building open source, they enjoy coding.",
                    "label": 0
                },
                {
                    "sent": "Sometimes they get paid or advance their career.",
                    "label": 0
                },
                {
                    "sent": "They may believe in the free software, ideology and so forth.",
                    "label": 0
                },
                {
                    "sent": "It turns out when you look at this.",
                    "label": 0
                },
                {
                    "sent": "You know the studies make it clear.",
                    "label": 0
                },
                {
                    "sent": "In fact, all these things are important.",
                    "label": 0
                },
                {
                    "sent": "There's no one overriding reason why people contribute to open open source, but what some studies have definitely found is that intrinsic motivation.",
                    "label": 0
                },
                {
                    "sent": "Is more important than extreme extrinsic motivation.",
                    "label": 0
                },
                {
                    "sent": "So intrinsic motivation is just doing something for the self satisfaction type of reasons as opposed to any external reward or consequence.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "An in a couple of practical lessons we can take away from this.",
                    "label": 0
                },
                {
                    "sent": "I'm just going to summarize real quickly here that you know people will contribute if they see the value and so you need to need to see the value in what you're doing.",
                    "label": 0
                },
                {
                    "sent": "And they also need to see how to contribute.",
                    "label": 1
                },
                {
                    "sent": "So, for example, Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "One of the reasons it's so successful is that it's so easy they make it so easy to sort of, you know, article.",
                    "label": 0
                },
                {
                    "sent": "And add not add to the knowledge base.",
                    "label": 0
                },
                {
                    "sent": "And people also need to see that they're not being taken advantage of.",
                    "label": 1
                },
                {
                    "sent": "No one likes to know that you know or hear that someone is making a lot of money off their opens up there freely contributed work.",
                    "label": 0
                },
                {
                    "sent": "I'll talk a little bit more about that in a few minutes.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'd like to turn in this store to open data which is, which is a really hot topic.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Out there and there are a bunch of web scale projects.",
                    "label": 0
                },
                {
                    "sent": "Mostly people know about, I think, which is certainly Wikipedia and its cousin DB Pedia, which which is basically taking the facts in the fact boxes of Wikipedia and making the machine readable so that folks like you and I can use that data.",
                    "label": 0
                },
                {
                    "sent": "There's also the linked Open Data Project or initiative that's been.",
                    "label": 1
                },
                {
                    "sent": "Driven by folks in the semantic Web community like like Tim Berners Lee.",
                    "label": 0
                },
                {
                    "sent": "And that's about taking datasets.",
                    "label": 0
                },
                {
                    "sent": "And publishing kind of like web pages.",
                    "label": 0
                },
                {
                    "sent": "All the links and the metadata is easy to get to, and that's also a great resource.",
                    "label": 0
                },
                {
                    "sent": "This been free or freemium.",
                    "label": 0
                },
                {
                    "sent": "Databases from for profit companies like Factual and Freebase which was recently bought by Google not too long ago Opencyc.",
                    "label": 0
                },
                {
                    "sent": "The thing I want to focus on is is in fact that open data is.",
                    "label": 0
                },
                {
                    "sent": "This has been for a long time critical to AI, so if you think of some of the things that we rely on.",
                    "label": 0
                },
                {
                    "sent": "Word, that's a good example.",
                    "label": 0
                },
                {
                    "sent": "So when it's been around for a really long time, but think of how critical it is to work in natural language, just used by lots and lots and lots of projects in different ways.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then there's the UCI machine learning repository, so I'd like to to pick that as an example to focus in on.",
                    "label": 0
                },
                {
                    "sent": "You see I sort of pozza.",
                    "label": 0
                },
                {
                    "sent": "Tori consists of hundreds of publicly available datasets for people to train and test their machine learning algorithms.",
                    "label": 0
                },
                {
                    "sent": "And was it was actually started in 1987 before that people did write, you know, including myself wrote machine learning.",
                    "label": 0
                },
                {
                    "sent": "Systems, but you know your paper would be like well.",
                    "label": 0
                },
                {
                    "sent": "So here's my algorithm.",
                    "label": 0
                },
                {
                    "sent": "Here's why I think it's important.",
                    "label": 0
                },
                {
                    "sent": "I'm going to show it on some toy data, maybe, maybe if I'm lucky I have access to a data set from some proprietary source.",
                    "label": 0
                },
                {
                    "sent": "But it was such an important contribution that almost immediately became obligatory to use UCA UCI data for your experiments, because everyone knows how easy it is to fool yourself.",
                    "label": 1
                },
                {
                    "sent": "If you're not running your stuff on real data, and also.",
                    "label": 0
                },
                {
                    "sent": "Now the combination of open source.",
                    "label": 0
                },
                {
                    "sent": "Code plus plus open data makes the work completely replicable for important from a scientific point of view.",
                    "label": 0
                },
                {
                    "sent": "Now the neat thing I'd like to point out is that this was founded by David a while he was still a graduate student.",
                    "label": 0
                },
                {
                    "sent": "And he wasn't the first guide to think of this.",
                    "label": 0
                },
                {
                    "sent": "There was a fellow by the name of Spencer.",
                    "label": 0
                },
                {
                    "sent": "Start seeing who tried to do this.",
                    "label": 0
                },
                {
                    "sent": "Didn't really work, but kind of got the idea going.",
                    "label": 0
                },
                {
                    "sent": "Ann and David was supported by by folks like Pat Langley and Dennis Kibler and Jeff Schlemmer, UCI.",
                    "label": 0
                },
                {
                    "sent": "But he was able to kind of gather a bunch of datasets.",
                    "label": 0
                },
                {
                    "sent": "I started out with about 20, made them publicly accessible and then it just grew from there and he did some good things when he when he put that initiative together.",
                    "label": 0
                },
                {
                    "sent": "First of all, he set it up with the maintainers.",
                    "label": 0
                },
                {
                    "sent": "Rotate overtime so every couple of years this is a new set of people maintaining the pozza Tori.",
                    "label": 0
                },
                {
                    "sent": "And what's interesting is that the website provides very clear guidance on how to cite contributions in the repository, so you should cite the repository itself and the maintainers as well as the particular datasets and their contributors.",
                    "label": 1
                },
                {
                    "sent": "And it's interesting because in fact the first version of the website didn't contain anything on how to site.",
                    "label": 0
                },
                {
                    "sent": "But it quickly became apparent that this is something they should do, and it's in fact a really good idea.",
                    "label": 0
                },
                {
                    "sent": "It seems obvious now, but but I'm you know it was sort of a novel contribution in a lot of ways, and.",
                    "label": 0
                },
                {
                    "sent": "You know citation is the common currency in which we, in the academic world, sort of used to sort of.",
                    "label": 0
                },
                {
                    "sent": "In a way reward people whose work that we're building on to knowledge them.",
                    "label": 0
                },
                {
                    "sent": "As of 2009, David told me he there were over 9000 citations to the repository in the different maintainers over the years.",
                    "label": 1
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just a short digression to talk about the importance of things like citation.",
                    "label": 0
                },
                {
                    "sent": "And fairness.",
                    "label": 0
                },
                {
                    "sent": "It's a well known economics experiment demonstration called the Ultimatum Game, and it works like this.",
                    "label": 1
                },
                {
                    "sent": "There are two players, player and play, and be an plays given amount of money.",
                    "label": 0
                },
                {
                    "sent": "Let's say $20.",
                    "label": 0
                },
                {
                    "sent": "And he's told he has to share some of that money with player big, but he can.",
                    "label": 0
                },
                {
                    "sent": "You can split it, or you can just offer player be a dollar whatever he wants.",
                    "label": 0
                },
                {
                    "sent": "An employee knows this.",
                    "label": 0
                },
                {
                    "sent": "It's a full sort of full knowledge open sort of game.",
                    "label": 0
                },
                {
                    "sent": "And player B has two choices.",
                    "label": 0
                },
                {
                    "sent": "He can either accept the offer from player A.",
                    "label": 0
                },
                {
                    "sent": "US or he can turn it down now if he accepts the offer.",
                    "label": 0
                },
                {
                    "sent": "So for example, player A decides is going to split it $10.10 dollars.",
                    "label": 0
                },
                {
                    "sent": "They both whatever it is.",
                    "label": 0
                },
                {
                    "sent": "They both walk away with the money, but Player B rejects the offer.",
                    "label": 0
                },
                {
                    "sent": "Then both players lose.",
                    "label": 0
                },
                {
                    "sent": "You know, no one gets any money.",
                    "label": 0
                },
                {
                    "sent": "From irrationality POV, player B should in fact you know.",
                    "label": 0
                },
                {
                    "sent": "Just take whatever we can get, but as it turns out, experimentally people found no matter really what the amount of money is or the exact conditions.",
                    "label": 0
                },
                {
                    "sent": "If player it gives player be less than about 20% will play.",
                    "label": 0
                },
                {
                    "sent": "AB is often inclined to just say to heck with it.",
                    "label": 0
                },
                {
                    "sent": "OK, so it's a nice illustration.",
                    "label": 0
                },
                {
                    "sent": "You know the fairness really matters to people.",
                    "label": 0
                },
                {
                    "sent": "And in fact, it's kind of a funny sort of side point.",
                    "label": 0
                },
                {
                    "sent": "Which is they've done this kind of experiment with chimpanzees to see to see if they operate.",
                    "label": 0
                },
                {
                    "sent": "Similarly, chimpanzees will be completely rational about it.",
                    "label": 0
                },
                {
                    "sent": "It just take what they can get.",
                    "label": 0
                },
                {
                    "sent": "But people people are different.",
                    "label": 0
                },
                {
                    "sent": "This is important to them.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "And then that point obviously relates to the whole citation.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then I would like to sort of also talk about what's been called crowds.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For science, and that includes things like classification so.",
                    "label": 0
                },
                {
                    "sent": "Galaxy Zoo is a an effort where basically scientists are posted pictures of thousands and thousands of different galaxies and they're getting people to classify the kind of web community classify those galaxies based on their shape.",
                    "label": 0
                },
                {
                    "sent": "Well FM is is something where there are a bunch of whale songs that scientists have put on on the web and people classify the type of song it is and start it at home is a similar effort for classifying interstellar dust particles which were collected and there are thousands and thousands and thousands of those as well.",
                    "label": 0
                },
                {
                    "sent": "So it's a lot of different things.",
                    "label": 0
                },
                {
                    "sent": "This is only a smattering of the many things out there like this, and those are making a real contribution is also some neat things like.",
                    "label": 0
                },
                {
                    "sent": "Kaggle, I don't know how many of you have looked at that, which is a site that makes it really easy to set up a competition, and it's been used to set up a bunch of data mining competitions where companies or people can contribute some data about a problem.",
                    "label": 0
                },
                {
                    "sent": "That curious about and then sort of web community attacks it, and they've got some great results.",
                    "label": 0
                },
                {
                    "sent": "And Henry mentioned folded, Henry can recounts in his talk the other day mentioned fold it, which is an example of.",
                    "label": 0
                },
                {
                    "sent": "A site that lets people do fold proteins and in fact people can often do a better job than computers and scientists are learning from that data.",
                    "label": 0
                },
                {
                    "sent": "There's also been a bunch of efforts in this community at doing things like creating ontologies and knowledge bases by having people play games or.",
                    "label": 0
                },
                {
                    "sent": "Basically just contribute knowledge to system.",
                    "label": 0
                },
                {
                    "sent": "And some important scientific collaborations.",
                    "label": 0
                },
                {
                    "sent": "So a couple of years ago, and Marty Tenenbaum gave I think this exact talk, and he's talking about Cancer Commons, which is a great effort that he's been involved in to make it easier for cancer scientists working on cancer to share results so that you don't have to do massive trials.",
                    "label": 0
                },
                {
                    "sent": "But every time you want to test something, so it's a more flexible way to use data.",
                    "label": 0
                },
                {
                    "sent": "And the developing tools and technology to sort of improve the whole.",
                    "label": 0
                },
                {
                    "sent": "Cancer experimentation lifecycle.",
                    "label": 0
                },
                {
                    "sent": "And polymath is is not a project in our in our community, but I'd like to spend a minute talking about it because it's such a cool thing.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is in 2009 Tim Gowers, who is a field medalist fields medalist.",
                    "label": 0
                },
                {
                    "sent": "And had a very active blog.",
                    "label": 0
                },
                {
                    "sent": "Ask the following question is massively collaborative mathematics possible?",
                    "label": 1
                },
                {
                    "sent": "And he posed a conjecture and invited people to participate with him in kind of a structured way.",
                    "label": 0
                },
                {
                    "sent": "It wasn't like a divide and conquer problem, but the idea was to post your comments and conjectures and ideas and work collaboratively like that.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The idea was that they're working on was to create a new combinatorial proof of the density Hales Jewett theorem.",
                    "label": 1
                },
                {
                    "sent": "There was some kind of existing issues with the existing way that that had been proved, and that is a kind of a geometric kind of problem.",
                    "label": 0
                },
                {
                    "sent": "It's actually has some relevance to computer science, but this is purely a mathematical exercise.",
                    "label": 0
                },
                {
                    "sent": "In the first day.",
                    "label": 1
                },
                {
                    "sent": "I think 6 people contributed with something like 24 different comments and by the end of three months there's been 40 significant different contributors.",
                    "label": 0
                },
                {
                    "sent": "Result was actually a simple, beautiful combinatorial proof that generated a couple of papers under the name under the pseudonym DHJ polymath in the mathematical literature, and since then still active.",
                    "label": 0
                },
                {
                    "sent": "I think they've done about 8 different problems, so it's a continuing experiment.",
                    "label": 0
                },
                {
                    "sent": "Very, very interesting.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so here's the things that we've quickly looked at today.",
                    "label": 0
                },
                {
                    "sent": "I would like to just talk for a couple of minutes about so few ideas.",
                    "label": 0
                },
                {
                    "sent": "You know that I've called from a longer list on illustrations of things that we don't have today that we could be doing or just sort of terminating now in different ways.",
                    "label": 0
                },
                {
                    "sent": "So actually when I was kind of looking to put this talk together.",
                    "label": 0
                },
                {
                    "sent": "It reminded me of something that I've felt like we needed for several years, which is we don't have a directory of open source.",
                    "label": 1
                },
                {
                    "sent": "AI, particularly in effect.",
                    "label": 0
                },
                {
                    "sent": "You know I've worked on a bunch of different projects where we use open source.",
                    "label": 0
                },
                {
                    "sent": "Data, open source code and you really have to hunt around for it, and there's no way to really know it's out there other than sort of just scouring the Internet.",
                    "label": 0
                },
                {
                    "sent": "It would be great to have a directory of resources like this would be even better if people could figure out a way kind of to track how many people you know using what things and the value that they provide and so forth.",
                    "label": 0
                },
                {
                    "sent": "So that would be a terrific contribution.",
                    "label": 0
                },
                {
                    "sent": "Doug Fisher mentioned this idea the other day, which is he's working on.",
                    "label": 0
                },
                {
                    "sent": "Wiki book he told me so.",
                    "label": 0
                },
                {
                    "sent": "We don't really have.",
                    "label": 0
                },
                {
                    "sent": "Yet the good examples of crowdsourced books or textbooks.",
                    "label": 0
                },
                {
                    "sent": "That you know are really popular and great resources, but I think I think we could have them.",
                    "label": 0
                },
                {
                    "sent": "You can also mention of course, like one of the massive online courses that are being organized.",
                    "label": 0
                },
                {
                    "sent": "Consist typically of like small segments of five or 10 minute videos and a little subtopic, and they're all sort of strung together into a course.",
                    "label": 0
                },
                {
                    "sent": "Right now those questions are put together by individual lecturers.",
                    "label": 0
                },
                {
                    "sent": "But you can imagine crowd sourcing that.",
                    "label": 0
                },
                {
                    "sent": "So you could actually get the best sort of video.",
                    "label": 0
                },
                {
                    "sent": "I mean, there's tons of great educators out there.",
                    "label": 0
                },
                {
                    "sent": "You can imagine putting together, you know.",
                    "label": 0
                },
                {
                    "sent": "Of course it takes a certain amount of organization 'cause you don't want a bunch of unconnected sort of tidbits.",
                    "label": 0
                },
                {
                    "sent": "But you can imagine putting together a course that has the best way to sort of lecture about the different pieces of the problem, and I think that would be better than any specific individual.",
                    "label": 0
                },
                {
                    "sent": "Of course, that we might be able to put together.",
                    "label": 0
                },
                {
                    "sent": "Possibly.",
                    "label": 0
                },
                {
                    "sent": "There's also the idea of virtual research groups.",
                    "label": 1
                },
                {
                    "sent": "So today you know most research groups in AI consists of faculty member of Pie with a couple of few graduate students, or maybe a slightly larger group with two or three pies and a bunch of programmers working with them.",
                    "label": 0
                },
                {
                    "sent": "Maybe 5 or 10 people.",
                    "label": 0
                },
                {
                    "sent": "But those groups almost always physically Co located and there physically Co located for good reason.",
                    "label": 0
                },
                {
                    "sent": "Because you typically want to have very intense collaboration with someone who you're working closely with where you're talking every day or every two days.",
                    "label": 0
                },
                {
                    "sent": "But you know technology is getting better and better.",
                    "label": 0
                },
                {
                    "sent": "I think Skype is kind of.",
                    "label": 0
                },
                {
                    "sent": "Well, things like Skype are impressive, but there's at least there may be the floor of what we could be doing.",
                    "label": 0
                },
                {
                    "sent": "Imagine if you know it was really easy to to invite someone to participate in your research group from overseas or from anywhere, just as long as they were passionately interested in what you're doing.",
                    "label": 0
                },
                {
                    "sent": "I think as our communication tools get better in our collaboration tools improve, this is going to be something that comes a real possibility.",
                    "label": 0
                },
                {
                    "sent": "I'd like to also mention.",
                    "label": 0
                },
                {
                    "sent": "The possibility of what you might call Big AI.",
                    "label": 0
                },
                {
                    "sent": "This collaboration on a really massive scale.",
                    "label": 0
                },
                {
                    "sent": "So as I said, our research groups tend to be pretty small in our field.",
                    "label": 0
                },
                {
                    "sent": "I certainly enjoy working that way, but I've also worked in larger projects, like Caillou, we had 2525 different groups and companies in a DARPA funded project.",
                    "label": 0
                },
                {
                    "sent": "That ostensibly led to something like Siri.",
                    "label": 0
                },
                {
                    "sent": "Actually, that is, Siri was group out of piece of the work that Sri was doing there.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And that was exciting collaboration, except it sooner, triple typical DARPA project in a lot of ways, really separate groups, and we have collaborated at Pi meetings and so forth, and that was the extent of it.",
                    "label": 0
                },
                {
                    "sent": "I think the best example of a small community really collaborating over extended period of time is the sore sore project which is run by John Laird, Paul Rosenbloom and Allan Newell originally.",
                    "label": 0
                },
                {
                    "sent": "And, um.",
                    "label": 0
                },
                {
                    "sent": "So it was definitely driven by a big idea and had sustained, sustained collaborative work by.",
                    "label": 0
                },
                {
                    "sent": "Well, John told me about 50 people come to the store workshop every every year.",
                    "label": 0
                },
                {
                    "sent": "That's stated that level for a long time, and it's an ongoing project and people are really collaborating on that single architecture.",
                    "label": 0
                },
                {
                    "sent": "But think for a second about.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Other communities, like the physics community, so the Atlas experiment.",
                    "label": 0
                },
                {
                    "sent": "A lot of you have heard about it recently because may not have been realized.",
                    "label": 0
                },
                {
                    "sent": "It was Atlas, but it was basically involved in the discovery of the Higgs Bozon at the Large Hadron Collider.",
                    "label": 0
                },
                {
                    "sent": "And this is Atlas is the detector.",
                    "label": 0
                },
                {
                    "sent": "And you can see it's a really big piece of equipment so.",
                    "label": 0
                },
                {
                    "sent": "That little arrow the arrow to that little green thing down the bottom.",
                    "label": 0
                },
                {
                    "sent": "That's a person.",
                    "label": 0
                },
                {
                    "sent": "Alice, it's like weighs about as much as the Eiffel Tower.",
                    "label": 0
                },
                {
                    "sent": "I have no idea what it costs, but in fact all the Atlas papers are signed by the scientists.",
                    "label": 0
                },
                {
                    "sent": "You know that the peas on the prod.",
                    "label": 0
                },
                {
                    "sent": "Not sure exactly what P is, but the major sort of scientifically.",
                    "label": 0
                },
                {
                    "sent": "People that are working on the project together collaborating and that's over 2500 people.",
                    "label": 0
                },
                {
                    "sent": "You sign those papers.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "We don't have anything like that in the world either in terms of infrastructure or projects.",
                    "label": 0
                },
                {
                    "sent": "Where people are collaborating on that level and I'm not.",
                    "label": 0
                },
                {
                    "sent": "I'm not even sure that we want to, but it's certainly we might want to do something.",
                    "label": 0
                },
                {
                    "sent": "But it certainly makes you think about the kind of scale that we could be working on in collaborating with.",
                    "label": 0
                },
                {
                    "sent": "Right, it may be premature in our field, but it's certainly.",
                    "label": 0
                },
                {
                    "sent": "I think there's some real possibilities.",
                    "label": 0
                },
                {
                    "sent": "Imagine what we could build with something that big.",
                    "label": 0
                },
                {
                    "sent": "I will say there are some big projects out there, like Watson, Siri, even Google right is a lot of AI going on there, but those are all closed systems.",
                    "label": 0
                },
                {
                    "sent": "Right, we can't, we can't, you know, I can't take Watson and sort of start building on it.",
                    "label": 0
                },
                {
                    "sent": "And and so imagine you know the possibility if we had something where we had a lot of us working together on some infrastructure that was completely shareable, I think that would be amazing.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I want to conclude.",
                    "label": 0
                },
                {
                    "sent": "Bye.",
                    "label": 0
                },
                {
                    "sent": "Just just pointing out.",
                    "label": 0
                },
                {
                    "sent": "Then I guess my point here is that sharing our work is of vital importance.",
                    "label": 1
                },
                {
                    "sent": "Today it's easy to forget.",
                    "label": 0
                },
                {
                    "sent": "Easy to forget how important it really is to what we do.",
                    "label": 0
                },
                {
                    "sent": "It's easy to just, you know, think of the work itself and the sharing is just something you do on the side.",
                    "label": 0
                },
                {
                    "sent": "But in fact, sharing your work might be the most important thing that you do.",
                    "label": 1
                },
                {
                    "sent": "And how you can help in open science initiatives is the following.",
                    "label": 0
                },
                {
                    "sent": "If you're from a Funding Agency.",
                    "label": 0
                },
                {
                    "sent": "Well, I hope that you'll support open source code and open data.",
                    "label": 0
                },
                {
                    "sent": "I notice that they are very rare that I see an announcement from Funding Agency where they are highly encouraging people to open source the code, but I don't see why they shouldn't.",
                    "label": 0
                },
                {
                    "sent": "It would be great if they were, you know, more DARPA projects that left, you know, resulted in things like.",
                    "label": 0
                },
                {
                    "sent": "Resources like.",
                    "label": 0
                },
                {
                    "sent": "You know ontology or or something.",
                    "label": 0
                },
                {
                    "sent": "Even like word net, right?",
                    "label": 0
                },
                {
                    "sent": "Just something that there's a value that was kind of left behind from that project.",
                    "label": 0
                },
                {
                    "sent": "In addition to the papers.",
                    "label": 0
                },
                {
                    "sent": "A paper is certainly important, but I think there's a lot more that could be done if funds were really looking to make that happen.",
                    "label": 0
                },
                {
                    "sent": "Senior faculty members.",
                    "label": 0
                },
                {
                    "sent": "If you're single and faculty members, I hope that you'll think about rewarding impactful contributions that are essentially non traditional.",
                    "label": 0
                },
                {
                    "sent": "I'm not saying that service should replace, you know you have intellectual contribution, but I think that intellectual contributions can come in a bunch of different forms and the impact of something can be measured in more than just the paper that you write.",
                    "label": 1
                },
                {
                    "sent": "And if people really take that seriously and things like promotion committees and tenure, I think you know the whole community will benefit.",
                    "label": 0
                },
                {
                    "sent": "And if you're a student or researcher, please continue sending your papers to Open Access publications.",
                    "label": 0
                },
                {
                    "sent": "If you think about that, I think I think I think.",
                    "label": 0
                },
                {
                    "sent": "I think it's something that you should think about doing consciously.",
                    "label": 0
                },
                {
                    "sent": "Open search your code in your data.",
                    "label": 0
                },
                {
                    "sent": "As I said before, some people are reluctant to do that because they're a little embarrassed, but in fact you shouldn't be.",
                    "label": 0
                },
                {
                    "sent": "Fact not not.",
                    "label": 0
                },
                {
                    "sent": "You know this so much.",
                    "label": 0
                },
                {
                    "sent": "So many contributions you can make and nothing, everything, everyone recognizes that nothing is perfect out there.",
                    "label": 0
                },
                {
                    "sent": "And last but not least, you know I hope I hope that you consider starting your own open science project.",
                    "label": 0
                },
                {
                    "sent": "It may be easier than you think and lead to greater impact.",
                    "label": 0
                },
                {
                    "sent": "And I can tell you, it's very satisfying to do that.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}