{
    "id": "z3rz2oniew62uhf33myo2vdgg6pnns4l",
    "title": "Context as a non-ontological determinant of semantics",
    "info": {
        "coauthor": [
            "Simone Santini, Autonomous University of Madrid"
        ],
        "published": "Dec. 18, 2008",
        "recorded": "December 2008",
        "category": [
            "Top->Computer Science->Semantic Web->Ontologies"
        ]
    },
    "url": "http://videolectures.net/samt08_santini_cnod/",
    "segmentation": [
        [
            "Christian vision isn't still protecting activity games as non traditional model of semantics."
        ],
        [
            "Friends.",
            "Romance.",
            "Controlman I come here to Bury ontology, not to praise it.",
            "OK, in order to do that I will divide my presentation in two parts.",
            "So the first part will be mostly rambling and ranting, and that's my own.",
            "Doing that, there will be a second part which will be some good, solid, honest work.",
            "That's mostly the work of Alexander with Resco who's sitting here, trying to look inconspicuous.",
            "So I will talk about semantics, of course, and I will talk about.",
            "Something connected to the semantic web.",
            "I have to specify here because there are several interpretation.",
            "There are several things about the semantic web.",
            "There is one which is represented by this IBM document that says, well, basically, semantic web technologies help separate meaning from data content or code using technologies based on open standards and if the computer understand the semantics, it just doesn't.",
            "It understand the documents meaning, so that is 1 view of the semantic web, that is the one I'm concerned about.",
            "This is not exactly, for instance, but Mr. Berners Lee meant."
        ],
        [
            "In his view, the semantic Web is like at this giant database and he's using ontologies and other things to do schema integration, basically.",
            "But that is not the only view there is that view, and that is the view I want to talk about.",
            "It works.",
            "So annotations in this view is men."
        ],
        [
            "To represent the pure meaning of a document, sort of a distilled, meaning the authors intention.",
            "What the author meant to say with a document.",
            "I will tell you why I don't like that view, and I think it's completely not equipped to represent meaning or anything even close.",
            "Miller to that.",
            "So the idea.",
            "But the idea is this approach is that you can somehow formalized meaning, so we can reduce semantics in the in the sense of natural language to formal semantics.",
            "So over task in view of semantics I see so many problems with this it's even funny.",
            "But two orders, the first one is pragmatic, the second one is quote unquote theoretical.",
            "The first one actually is not a new observation.",
            "There is a wonderful.",
            "Online document by Cory Doctorow is called meta crab.",
            "And it argues why annotations are not reliable.",
            "Why you should not rely on that.",
            "Well, he has seven arguments.",
            "I will only use 3.",
            "Argument number one."
        ],
        [
            "People lie.",
            "These are three emails that I received.",
            "The first one is an email from my bank notifying me that my account had been suspended and I should log into a certain webpage to reactivate it.",
            "Well, guess not.",
            "Guess what, it's not true.",
            "The second one is somebody telling me that they need my bank account to transfer $30,000,000 from someplace in Africa.",
            "You know what?",
            "It ain't true.",
            "The third one was particularly painful.",
            "It's a good looking girl who wants to sleep with me.",
            "And.",
            "It wasn't true.",
            "So people lie.",
            "If people want you to look at the data.",
            "If they have an interest in you looking at their data, well, they will lie to you.",
            "They won't even think twice about that."
        ],
        [
            "Second, one people are lazy.",
            "You know how many emails you receive without the subject line?",
            "How many emails you received with the subject line of an email that you sent three months before?",
            "It's completely unrelated to that?",
            "How many of your friends have files called untitled Doc?",
            "I know I do.",
            "So people are lazy, people are not accurate.",
            "3rd one well people are stupid."
        ],
        [
            "There are cases where you really want to be accurate.",
            "You know you're selling things on eBay.",
            "If they don't find the things that you're selling, you will not sell well, you try this.",
            "You go on eBay and look for plan.",
            "You will find many plan pilots.",
            "Or even plan plans.",
            "You look for Apple with one P. You will find many computers so people, even when they should be accurate they are not.",
            "I will not.",
            "I will not continue piling up, but Doctorow made seven cases out of this.",
            "What why they did the.",
            "Assumption that everybody will be out there.",
            "Annotating everything faithfully and accurately and completely just.",
            "Just doesn't work.",
            "People are not like that.",
            "People are lazy, stupid liars.",
            "So this was this was sort of a pragmatic, not let's go.",
            "Let's go into print."
        ],
        [
            "Symbols of the matter, so this is sort of the semantic web.",
            "There is an essence that originates from the author, so there is a document and the author has a pre linguistic meaning in mind.",
            "This pre linguistic meaning is somehow encoded up there in language and you, the receiver, decodes the meaning.",
            "And somehow reconstruct what the author meant to say.",
            "This is sort of the basis of this kind of formalization, because it allows you to do some detour like this.",
            "You have the pre linguistic meaning.",
            "You include that in a formula in a formal system, in a way that you can have an algorithm somehow decode what you meant.",
            "I always say that this is a weaker epistemological assumption than artificial intelligence.",
            "Artificial intelligence always assume that this passage should also be automatic if the semantic web doesn't go that far, you might assume that there is a guy who does the encoding, but it does assume this part, so the encoding exists.",
            "And once you have that formal encoding of meaning.",
            "You can analyze it.",
            "You're using an algorithm.",
            "Well, this pretty much flies in the face of what language is.",
            "Meaning is not really encoded in.",
            "Language is created by language.",
            "There is no pre linguistic meaning and in a sense there is no.",
            "There is no essence of the author because language is a is a cultural thing.",
            "We can stand.",
            "There is no private language.",
            "So the end the interpretation is a dialectic process.",
            "It's not really a one way understanding a one-way reception one.",
            "OK then then I will say later.",
            "Another problem classifica."
        ],
        [
            "Asians most?",
            "Formal approaches mean there is no reason why it should be that way, but in practice they are based on taxonomies.",
            "Most of them you know ancient deductive databases where Baeza Central and Horn logic new things are tend to be based on description, logic and description.",
            "Logic is is a glorified taxonomy.",
            "I mean is a taxonomy plus plus.",
            "So when you do things, you start doing hierarchies, but nothing of this is innocent innocence.",
            "So these are two car taxonomies.",
            "So the first one you know there is a car there gonna sit down and there is an SUVs sedan.",
            "Can be a full sized mid-size or compact that this was originally for presentation in the US, so full sized mid-size things like that.",
            "Well, the second one is another taxonomy.",
            "Is a car can be a low mileage mid range, high Mount mileage, so the low mileage can be a full size sedan.",
            "Commune SUV can be the mid range.",
            "Can be a mid size sedan.",
            "High mileage can be a hybrid.",
            "Well, you know it.",
            "Things change a lot depending on which one of these you publish.",
            "Probably if you're a car manufacturer will publish this one.",
            "If you work for Greenpeace, you probably published that one in either case.",
            "You are somehow putting your your ideology on that, and this is you must understand this is not because you're bad people.",
            "You can be as good as you want, but as soon as you do something like this you are creating criteria you're imposing.",
            "These criteria on the people who will access the data.",
            "So always a classification is inevitably an act of power.",
            "I like that you're imposing and whoever received this information has no choice but to accept what you were doing."
        ],
        [
            "So let's work and we look forward for an alternative.",
            "This isn't mathematical.",
            "Where can we look for Alternative 1 interesting parallel?",
            "Since you know after all you are thinking about translating documents into formal systems.",
            "Let's see what translator is doing for the past 50 years.",
            "The idea that a translation is somehow it correspondence of documents is pretty much been abandoned.",
            "This was at least from your Eugene Nida he used to publish in the 60s, so he's a he's a pastor.",
            "He was interested in translation of the Bible.",
            "His idea was that you have an original text in original language that interacts with the reader and with all the social codes in which the reader is immerse.",
            "So this text somehow has a place in a network of connections.",
            "The idea is that you should translate to a text that plays the same role.",
            "Of the original text.",
            "Into the new language, so you're not really translating the text, you're you're translating the relation between the reader and the text, and you know there are very, very practical things you look.",
            "You look at the menu.",
            "I mean you don't have to.",
            "We don't have to talk about philosophy here.",
            "You look at the menu.",
            "The manual in English, especially in the US, it's always described with no.",
            "With luscious stream of fresh butter.",
            "You translate that in Spanish you look silly.",
            "You translated in Spanish, so there's brother and that's the end of it.",
            "So you know it, you have to.",
            "You have to play.",
            "You cannot just translate the text.",
            "You have to play with interaction between the text and the social codes and the reader.",
            "Actually, there is a translation device called the Scopus Theory was born here in Germany and Heidelberg.",
            "Actually even the functional relation is normalizing form or freshman.",
            "It's actually the.",
            "Goal of the translator to the side.",
            "What function should the new text so this always tell you something about?",
            "Up translating from one code to another, you cannot just say this is a document I just represent in a different way.",
            "No there different way has to take into account.",
            "The relation with the reader."
        ],
        [
            "So Reading is an active.",
            "I said dialectic process.",
            "Take for instance, you know the little charade I did at the beginning of this presentation.",
            "How did you?",
            "How did you interpret that?",
            "Well, you know Alexandra knows me very well, so she might have thought.",
            "I know that's typical of my behavior.",
            "US tamatea doesn't know me as well, but we were the conference together before she saw me that I was doing some nasty question.",
            "Well, maybe she thought also typical.",
            "The way you interpret that, well, maybe it depends on how you see a conference.",
            "Know if you have a very strict view of a conference as a dignified thing, you might have thought I was an idiot.",
            "If you maybe if you if you thought conference with two serious, you might have to well have.",
            "Finally somebody who demystify's the whole mystique or the academic conference so.",
            "That thing didn't really mean anything.",
            "It only meant what you read in it, and even worse now I revealed to you that my little charade was not just random, it had a place in my presentation.",
            "So probably you might still think.",
            "I mean, I'm an idiot, but probably your interpretation of my little thing has changed is somebody had left the room before I came to this.",
            "His idea of what I did would be different, so you really cannot do anything without considering who is going to interpret.",
            "And what is the context?",
            "In which this thing is going to be interpreted.",
            "So I did all these.",
            "10 minutes blabbering essentially to arrive to this world context.",
            "You cannot have meaning if you don't interpret that in a context.",
            "Let's see what I have next.",
            "I don't remember OK.",
            "So this is a little bit where we started."
        ],
        [
            "So we want to do context what is context?",
            "Many times.",
            "You consider context as something that changes the meaning of what you do know.",
            "You have something something has a certain meaning.",
            "Depending on the context where you are, that meaning changes, but how about you do it the other way around?",
            "You are in a certain context.",
            "You access the document while your context changes.",
            "You know you're in a restaurant, you you're in the context where you don't know what they serve.",
            "You read the menu well, your context changes.",
            "Now you know what they serve.",
            "You are at the airport.",
            "You you want to fly to New York, you don't know where to go, where you read gate CC-30 four now you're in a different context.",
            "The meaning.",
            "The semantics of the document is exactly this is the changing context.",
            "If a document doesn't change your context, it has absolutely no meaning.",
            "It's like it's like Reading War and peace in Russian.",
            "Unless you're Russian, of course.",
            "It doesn't mean anything is good.",
            "I can make any sense of it.",
            "It doesn't change my context.",
            "So this is the first thing semantics should be looked in account exchange.",
            "The second thing is that context is really.",
            "Part of what you do?",
            "You're doing something your context is not always the same.",
            "A trivial example, you are if you are a computer scientist and you're looking for virus.",
            "Well, maybe you're looking for one thing before it biologist.",
            "You're looking for virus.",
            "You're looking for a fairly different thing, but if you're a computer scientist and you have a cold.",
            "And you're looking for virus?",
            "Well, maybe you're looking for the same thing as the biology you're not looking for a computer virus, so your context is doesn't really depend on who you are as a you know.",
            "Kantian category.",
            "It depends on what you do at the moment.",
            "And information access is always.",
            "Part of some activity.",
            "Usually you're doing something and you need some information so.",
            "I I I like to model this as a sort of a language game, you're doing something you're.",
            "You're preparing a presentation, so you're making several moves.",
            "That will resolve in the end of you are you having the presentation.",
            "Some of these moves?",
            "My involved information access.",
            "So this is this sort of breaks down the concept of a query.",
            "As an independent activity.",
            "If you're looking for something while you're editing a document, it's not really the same thing.",
            "As if you're looking for something because you want to go skiing.",
            "So they're different activities and they're sort of querying is introduced into this.",
            "These different chains are activities.",
            "Uh.",
            "So these are the two essential point."
        ],
        [
            "Meaning as a change in document an that.",
            "So now let me.",
            "Come down from the rambling and ranting.",
            "And see exactly a little bit what we actually have done, so I said that context is part of an activity if.",
            "If your activity is completely disconnected from computers that really, there's nothing I can do about it, sorry.",
            "But let's say it's not.",
            "Let's say you're doing many of us now.",
            "We're working with computers, even when they're listening to the presentation.",
            "Look at that.",
            "I see I see more laptops than faces here.",
            "So.",
            "Many of our activities take place on computers.",
            "They leave a digital trace.",
            "No there there.",
            "There are activities that do not just die.",
            "You you leave residues behind and these red residues are digital.",
            "Again, I'm preparing a presentation for for a conference, let's call it sound just.",
            "Just just to pick a name.",
            "I will have a bunch of.",
            "Directories where I keep my things, so this is the directory I'm working on.",
            "Those are the things more directly related to the things I'm doing.",
            "I called it the primary context.",
            "There are a few things around it, no materials on collecting, and the paper that I was preparing or one of the 15 versions I submitted for this conference.",
            "You know that.",
            "Bibliography so this is what I call the secondary context that there is where I go look for the information that I need to focus my query.",
            "This is this is who I am and at this moment.",
            "How do we do that well?",
            "There is a bunch of."
        ],
        [
            "Technical details but.",
            "Let's put it this way.",
            "You could do it.",
            "You could do it in many ways.",
            "At this point you have to become pragmatic.",
            "The general idea is I want to have a representation of these things.",
            "The time that I'm doing all these documents that I have in my context.",
            "In order to formulate a query, so I'm looking for something I type in a word and I want to modify that query to reflect my context.",
            "That is the general idea.",
            "You can do it in many different ways.",
            "You could use logical.",
            "Statements thank you for pointing that out to me.",
            "You could use logical statements.",
            "The problem is that we wanted to try it out.",
            "And let's face it.",
            "Everybody's talking about the semantic web, but I still have to see places up there with larger documents.",
            "There have been there have been annotated semantically.",
            "If anybody knows places with a lot of documents, please tell me so.",
            "The best thing is you have to go.",
            "A lot how many?",
            "Yes, 10,000,000.",
            "10,000 yes.",
            "OK, will talk about you.",
            "I'll take it.",
            "I'll take that advice, but with the second one, let's use.",
            "Let's try to do something with standard search engines.",
            "So we went looking for information retrieval representations because that it's easier than to transform into a query that you can send to a standard web search engine.",
            "So we take all the documents in a in the context.",
            "We do stop word removal.",
            "We do stemming.",
            "We do all the bells and whistles.",
            "Then we take groups of words.",
            "Can be 2, can be more.",
            "We take groups because essentially a lot of times.",
            "Co location is a very important clue for disambiguating words.",
            "Collocation is actually sometimes more important than the single words that you use.",
            "So we take this these things.",
            "We do a geometric model, A space of words with one axis for each word.",
            "Pairs will be points in planes.",
            "If you take triples, there will be points in three dimensional subspaces.",
            "Things like that we get.",
            "We do wait for each one of these words, sort of proportional to the frequency of the words.",
            "We don't use the TF IDF.",
            "If you want to know why, I will tell you later.",
            "And we do we put a self organizing map into this thing.",
            "So they have been used.",
            "There's a web, some semantic self organizing map model.",
            "They've been using information retrieval.",
            "We use that as opposed to things like latent semantics, for instance, because we need a nonlinear model.",
            "Because in this case we are sort of taking information retrieval techniques, but using them backwards.",
            "I mean, usually these models very they're used to model your collection, the model, your database.",
            "In this case, we're not modeling the database, we are modeling the context and then we, sort of.",
            "From this we need to to derive a query.",
            "So how do we derive a query?",
            "You type you type in a few words.",
            "Which is a query point.",
            "We have this map so you have a few words.",
            "We sort of pinch the map and pull it towards your query so that you know this is a self rising map.",
            "So you pull the winning neuron and there is a whole neighborhood that comes out with it.",
            "So we got.",
            "Sort of a thing like this.",
            "This was the original map.",
            "This is the new one.",
            "We get a difference.",
            "That is sort of the difference in context that I was talking about.",
            "So that difference between the two Maps before and after you type in the query.",
            "It's sort of the.",
            "Description of the document that we want to have now.",
            "What do we do with this now?",
            "The ideal situation would be to have a server dedicated to this and believe me we're working on that.",
            "'cause this is now you have this map representation of the query.",
            "If you do an information retrieval server that uses the same representation, you can sort of compare them and see what areas of your space is more relevant to you.",
            "We're working on that.",
            "So far, what do we do?",
            "We take this deformation we projected onto the axis and take the most relevant words with their weights.",
            "So from your couple of words.",
            "You come up with a query that maybe maybe 40 words with weights.",
            "And that is the thing that we want to send to the."
        ],
        [
            "Then we want to send to the to the search engine.",
            "In the case of Google, we had to make a further approximation because it doesn't really accept weights, but what it does, we found out and accept replication awards.",
            "So I will give you the details if you want offline, but we sort of approximate this thing with Google, so we did a couple of tests and I repeat these are.",
            "This is sort of a minimum level of results because we don't really use context at its best.",
            "So this is the.",
            "This is a.",
            "These are a bunch of papers of mine.",
            "One of my directory's.",
            "On my computers we did 30 queries.",
            "Considering the context, non not considering the context and look at the precision of the first 8 results.",
            "And these are things.",
            "These are the mean and variance over the 30 queries.",
            "This is without context.",
            "The thing up there, the black one is with context and this one is when you download documents and use them to change your context.",
            "That's something I don't have time to go into.",
            "But of course your context evolves as you do things.",
            "So this is that is a preparation of a collection of papers for neural Physiology.",
            "You should also see the same thing.",
            "The improvement of you see that's the improvement is not quite as big.",
            "I think one of the reasons is that new physiologists use that.",
            "They make up their own words so you know a word is much more.",
            "Contextual.",
            "Then, in computing computing, usually you you recycle, we recycled words.",
            "So there there is much more ambiguity, so this is in this case we basically double the precision of the results.",
            "This is the same thing using Google Image.",
            "So this."
        ],
        [
            "As an image retrieval thing and more or less, you can see the same same kind of thing, same kind of same kind of behavior."
        ],
        [
            "This is an example.",
            "The query was to execute.",
            "So the first, the first set with other Contacts, pretty gruesome I I don't visit.",
            "There's this example of was from Alexandra.",
            "I don't know why she picked this one.",
            "I was too scared to ask.",
            "But the second one is a little chart about the execution of software.",
            "Because you know, programs.",
            "Except for this one.",
            "So you can see in this case the.",
            "Change was quite noticeable, especially for the."
        ],
        [
            "People were being hacked.",
            "So conclusions.",
            "We are trying to.",
            "Sort of.",
            "Reverse things a little bit.",
            "Instead of modeling the documents, we are modeling the user.",
            "Of course, as in as in everything.",
            "Before we before we start asking any other questions, we want to see how well the thing might work.",
            "So if you ask me, why haven't you thought about integrating thing with document annotation?",
            "Well because it's not time yet.",
            "But first I want to see.",
            "If this thing makes sense, if I can get some mileage from this, how well can we do then?",
            "I will think about maybe integrated with other things, but we're sort of taking this.",
            "This is the.",
            "Meaning of a document is really what it means to you, not what it means to somebody who made the annotation.",
            "Because the person who made the annotation might have a different concept of the document for you, we want to build a better server because these results were obtained using Google.",
            "And really Google is was not made for this.",
            "Maybe the maybe the collection you were mentioning when might be more useful.",
            "In this respect, another thing I would like to do was to work a little more on the image issue.",
            "Right now we do image retrieval, but the context is completely textual, but of course in your context you have documents and you have images and you can represent images with features.",
            "And since we have a geometric approach that you can mix and match pretty well together, so that's.",
            "Sort of the other one there actually.",
            "Now I have a visitor from Italy who staying in Madrid.",
            "Three months, but probably like everybody else, will never leave.",
            "People come to Madrid and they never go away.",
            "And he's working a little bit on this one.",
            "More on the.",
            "Social network driven classification, but it's it's more or less the same idea.",
            "And I think I'm pretty much passed out of time as a good Italian should, and so thank you for your attention."
        ],
        [
            "Answer questions, remarks but makes many more months.",
            "I think you do several major non trivial mistakes.",
            "So first mistakes of course confuse semantics and pragmatics.",
            "Along with one star stops and the other ends.",
            "But there is a long tradition in linguistics, for example, to talk about these things.",
            "I don't think we should talk a lot about the show, meaning of things that has to do with.",
            "Actually, I think the people who make mistakes or those who make a distinction, but we will talk about that.",
            "These models they offer use and that was their great, but of course models are tools right?",
            "And sometimes you need a screwdriver.",
            "Sometimes need a hammer and it has a lot of problem.",
            "Your hand if you have must acre.",
            "You don't have supervised data.",
            "Loser some other scenarios will say you will find that you have a different scenario.",
            "You have different workflows for holding, so just rather relying on coding using Snowman and I guess they will be actually.",
            "Patient records that are encoded using snowman music lesson alive, right?",
            "These are too large extent.",
            "Just document this text.",
            "So there are not the same data as your final, where you're right.",
            "Just try not to lie.",
            "So depends on the problem you have that you choose the tool.",
            "And 3rd about context actually has also have some systems.",
            "After all, trying to better my various more handy.",
            "OK, well the first the first one will talk about it.",
            "I don't want.",
            "I don't want to do the exegeses of Heidegger right here.",
            "The second one, yes, I mean there are different levels of formalization or different that medical records that you were talking about.",
            "We already talking about semi formalized data from the start and in the first slide I said that you know.",
            "Structure.",
            "Fairly structure.",
            "So as I said in the first light, there are different ideas or what the semantic web is.",
            "There is what I call the Berners Lee semantic Web, which is I I see that kind of data to fall into that.",
            "In that case, absolutely.",
            "I mean, this is basically a.",
            "Extension of Schema integration works.",
            "I mean when people were doing deductive databases in the 80s, it works.",
            "No problem.",
            "I I agree with that there's no discussion, but so from the beginning explicitly I sort of put myself into the other.",
            "Category to say we want there are people who want to use these things.",
            "That's the main thing.",
            "Seamlessly from one to the other anymore.",
            "Because replication they have.",
            "There is no boundary.",
            "There is a boundary.",
            "There are documents that I mean the documents were talking about from the beginning.",
            "There sort of semi structured documents I'm talking about are not.",
            "They are the things.",
            "Documents we just no paper.",
            "But if you wanna take if you notated patient record, really your document is the annotation is not a document.",
            "Wrong.",
            "So you're annotating things you're searching for that.",
            "Let's say if you were if you were to prove your case in court.",
            "Would I have a good case to saying that you made the wrong annotation or you would say no?",
            "Well, you know what the annotation is, what really counts.",
            "So if I I'm a doctor, I made a search.",
            "It came up with something and my because of what I read there and my patient died.",
            "If I say, well, I read, I read this and maybe there was a mismatch between the annotation and the document.",
            "So what counts the annotation that I retrieved?",
            "Or the OR the document?",
            "Question.",
            "Without innovation, something station captain question does not depend on performance and people go to jail for that, no, but that's what that's what I say.",
            "'cause if you're if you're saying that really, the annotation is what counts, then what you're really doing, you're creating a structure document and on the side you have another document that people can read, but your.",
            "There is government which uses the genealogy.",
            "We access the full text abstracts format, right?",
            "People use that community.",
            "And so I mean.",
            "There is No Fear.",
            "I would suggest that.",
            "We can go like this until six that's.",
            "The result of questions in the room.",
            "Yes.",
            "Think about.",
            "What you're looking for is a global demand.",
            "So.",
            "That's what I'm doing.",
            "Well, the recall it's really, really problem and this is the web.",
            "Are you really sure you want to recall everything?",
            "I don't, I honestly I don't know how to measure recall on Google on the Google database.",
            "I don't know how many, how many significant documents are there?",
            "If anybody knows how to measure recall on the Google database, I don't know how to do it and I'm not really sure you want, but I'm sorry for your first thing.",
            "No, I don't want global semantics, that's exactly what I do not want.",
            "I want your own semantics.",
            "The semantics that you want to give to the documents.",
            "Why do I have to see the document?",
            "Check.",
            "Why do I have to see a document as a message between three humans?",
            "The message.",
            "As being message or medium.",
            "Transport.",
            "That was that was.",
            "No, no, but that's actually the model of communication.",
            "Was the model I was criticizing.",
            "I don't see the document as a as a as a message between two humans.",
            "I just see it as a document.",
            "Someone?",
            "Not without exactly.",
            "I want to put the emphasis on the interpreter.",
            "I don't care about the author.",
            "There may be no author.",
            "The Odyssey, who wrote the Odyssey, but I can read it.",
            "the Bible, who wrote the Bible?",
            "I can read it.",
            "Ending on whether we know how Bible was written, so you can assume it was written by one author or as it happened for your time zone, but that is my assumption that is my assumption exactly.",
            "So what counts is not who wrote the Bible when it comes my view of who wrote the Bible.",
            "So this is part of my context is not the author of the Bible.",
            "I don't care about the author of the Bible or of the Odyssey."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Christian vision isn't still protecting activity games as non traditional model of semantics.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Friends.",
                    "label": 0
                },
                {
                    "sent": "Romance.",
                    "label": 0
                },
                {
                    "sent": "Controlman I come here to Bury ontology, not to praise it.",
                    "label": 0
                },
                {
                    "sent": "OK, in order to do that I will divide my presentation in two parts.",
                    "label": 0
                },
                {
                    "sent": "So the first part will be mostly rambling and ranting, and that's my own.",
                    "label": 0
                },
                {
                    "sent": "Doing that, there will be a second part which will be some good, solid, honest work.",
                    "label": 0
                },
                {
                    "sent": "That's mostly the work of Alexander with Resco who's sitting here, trying to look inconspicuous.",
                    "label": 0
                },
                {
                    "sent": "So I will talk about semantics, of course, and I will talk about.",
                    "label": 0
                },
                {
                    "sent": "Something connected to the semantic web.",
                    "label": 0
                },
                {
                    "sent": "I have to specify here because there are several interpretation.",
                    "label": 0
                },
                {
                    "sent": "There are several things about the semantic web.",
                    "label": 0
                },
                {
                    "sent": "There is one which is represented by this IBM document that says, well, basically, semantic web technologies help separate meaning from data content or code using technologies based on open standards and if the computer understand the semantics, it just doesn't.",
                    "label": 0
                },
                {
                    "sent": "It understand the documents meaning, so that is 1 view of the semantic web, that is the one I'm concerned about.",
                    "label": 0
                },
                {
                    "sent": "This is not exactly, for instance, but Mr. Berners Lee meant.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In his view, the semantic Web is like at this giant database and he's using ontologies and other things to do schema integration, basically.",
                    "label": 0
                },
                {
                    "sent": "But that is not the only view there is that view, and that is the view I want to talk about.",
                    "label": 0
                },
                {
                    "sent": "It works.",
                    "label": 0
                },
                {
                    "sent": "So annotations in this view is men.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To represent the pure meaning of a document, sort of a distilled, meaning the authors intention.",
                    "label": 1
                },
                {
                    "sent": "What the author meant to say with a document.",
                    "label": 0
                },
                {
                    "sent": "I will tell you why I don't like that view, and I think it's completely not equipped to represent meaning or anything even close.",
                    "label": 0
                },
                {
                    "sent": "Miller to that.",
                    "label": 0
                },
                {
                    "sent": "So the idea.",
                    "label": 0
                },
                {
                    "sent": "But the idea is this approach is that you can somehow formalized meaning, so we can reduce semantics in the in the sense of natural language to formal semantics.",
                    "label": 0
                },
                {
                    "sent": "So over task in view of semantics I see so many problems with this it's even funny.",
                    "label": 1
                },
                {
                    "sent": "But two orders, the first one is pragmatic, the second one is quote unquote theoretical.",
                    "label": 0
                },
                {
                    "sent": "The first one actually is not a new observation.",
                    "label": 0
                },
                {
                    "sent": "There is a wonderful.",
                    "label": 0
                },
                {
                    "sent": "Online document by Cory Doctorow is called meta crab.",
                    "label": 0
                },
                {
                    "sent": "And it argues why annotations are not reliable.",
                    "label": 0
                },
                {
                    "sent": "Why you should not rely on that.",
                    "label": 0
                },
                {
                    "sent": "Well, he has seven arguments.",
                    "label": 0
                },
                {
                    "sent": "I will only use 3.",
                    "label": 0
                },
                {
                    "sent": "Argument number one.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "People lie.",
                    "label": 0
                },
                {
                    "sent": "These are three emails that I received.",
                    "label": 0
                },
                {
                    "sent": "The first one is an email from my bank notifying me that my account had been suspended and I should log into a certain webpage to reactivate it.",
                    "label": 0
                },
                {
                    "sent": "Well, guess not.",
                    "label": 0
                },
                {
                    "sent": "Guess what, it's not true.",
                    "label": 0
                },
                {
                    "sent": "The second one is somebody telling me that they need my bank account to transfer $30,000,000 from someplace in Africa.",
                    "label": 0
                },
                {
                    "sent": "You know what?",
                    "label": 0
                },
                {
                    "sent": "It ain't true.",
                    "label": 0
                },
                {
                    "sent": "The third one was particularly painful.",
                    "label": 0
                },
                {
                    "sent": "It's a good looking girl who wants to sleep with me.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "It wasn't true.",
                    "label": 0
                },
                {
                    "sent": "So people lie.",
                    "label": 0
                },
                {
                    "sent": "If people want you to look at the data.",
                    "label": 0
                },
                {
                    "sent": "If they have an interest in you looking at their data, well, they will lie to you.",
                    "label": 0
                },
                {
                    "sent": "They won't even think twice about that.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Second, one people are lazy.",
                    "label": 1
                },
                {
                    "sent": "You know how many emails you receive without the subject line?",
                    "label": 0
                },
                {
                    "sent": "How many emails you received with the subject line of an email that you sent three months before?",
                    "label": 0
                },
                {
                    "sent": "It's completely unrelated to that?",
                    "label": 0
                },
                {
                    "sent": "How many of your friends have files called untitled Doc?",
                    "label": 1
                },
                {
                    "sent": "I know I do.",
                    "label": 1
                },
                {
                    "sent": "So people are lazy, people are not accurate.",
                    "label": 0
                },
                {
                    "sent": "3rd one well people are stupid.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There are cases where you really want to be accurate.",
                    "label": 0
                },
                {
                    "sent": "You know you're selling things on eBay.",
                    "label": 0
                },
                {
                    "sent": "If they don't find the things that you're selling, you will not sell well, you try this.",
                    "label": 0
                },
                {
                    "sent": "You go on eBay and look for plan.",
                    "label": 0
                },
                {
                    "sent": "You will find many plan pilots.",
                    "label": 0
                },
                {
                    "sent": "Or even plan plans.",
                    "label": 0
                },
                {
                    "sent": "You look for Apple with one P. You will find many computers so people, even when they should be accurate they are not.",
                    "label": 0
                },
                {
                    "sent": "I will not.",
                    "label": 0
                },
                {
                    "sent": "I will not continue piling up, but Doctorow made seven cases out of this.",
                    "label": 0
                },
                {
                    "sent": "What why they did the.",
                    "label": 0
                },
                {
                    "sent": "Assumption that everybody will be out there.",
                    "label": 0
                },
                {
                    "sent": "Annotating everything faithfully and accurately and completely just.",
                    "label": 0
                },
                {
                    "sent": "Just doesn't work.",
                    "label": 0
                },
                {
                    "sent": "People are not like that.",
                    "label": 0
                },
                {
                    "sent": "People are lazy, stupid liars.",
                    "label": 0
                },
                {
                    "sent": "So this was this was sort of a pragmatic, not let's go.",
                    "label": 0
                },
                {
                    "sent": "Let's go into print.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Symbols of the matter, so this is sort of the semantic web.",
                    "label": 1
                },
                {
                    "sent": "There is an essence that originates from the author, so there is a document and the author has a pre linguistic meaning in mind.",
                    "label": 1
                },
                {
                    "sent": "This pre linguistic meaning is somehow encoded up there in language and you, the receiver, decodes the meaning.",
                    "label": 0
                },
                {
                    "sent": "And somehow reconstruct what the author meant to say.",
                    "label": 0
                },
                {
                    "sent": "This is sort of the basis of this kind of formalization, because it allows you to do some detour like this.",
                    "label": 0
                },
                {
                    "sent": "You have the pre linguistic meaning.",
                    "label": 0
                },
                {
                    "sent": "You include that in a formula in a formal system, in a way that you can have an algorithm somehow decode what you meant.",
                    "label": 0
                },
                {
                    "sent": "I always say that this is a weaker epistemological assumption than artificial intelligence.",
                    "label": 0
                },
                {
                    "sent": "Artificial intelligence always assume that this passage should also be automatic if the semantic web doesn't go that far, you might assume that there is a guy who does the encoding, but it does assume this part, so the encoding exists.",
                    "label": 0
                },
                {
                    "sent": "And once you have that formal encoding of meaning.",
                    "label": 0
                },
                {
                    "sent": "You can analyze it.",
                    "label": 0
                },
                {
                    "sent": "You're using an algorithm.",
                    "label": 1
                },
                {
                    "sent": "Well, this pretty much flies in the face of what language is.",
                    "label": 1
                },
                {
                    "sent": "Meaning is not really encoded in.",
                    "label": 0
                },
                {
                    "sent": "Language is created by language.",
                    "label": 0
                },
                {
                    "sent": "There is no pre linguistic meaning and in a sense there is no.",
                    "label": 0
                },
                {
                    "sent": "There is no essence of the author because language is a is a cultural thing.",
                    "label": 0
                },
                {
                    "sent": "We can stand.",
                    "label": 0
                },
                {
                    "sent": "There is no private language.",
                    "label": 1
                },
                {
                    "sent": "So the end the interpretation is a dialectic process.",
                    "label": 0
                },
                {
                    "sent": "It's not really a one way understanding a one-way reception one.",
                    "label": 0
                },
                {
                    "sent": "OK then then I will say later.",
                    "label": 0
                },
                {
                    "sent": "Another problem classifica.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Asians most?",
                    "label": 0
                },
                {
                    "sent": "Formal approaches mean there is no reason why it should be that way, but in practice they are based on taxonomies.",
                    "label": 0
                },
                {
                    "sent": "Most of them you know ancient deductive databases where Baeza Central and Horn logic new things are tend to be based on description, logic and description.",
                    "label": 0
                },
                {
                    "sent": "Logic is is a glorified taxonomy.",
                    "label": 0
                },
                {
                    "sent": "I mean is a taxonomy plus plus.",
                    "label": 0
                },
                {
                    "sent": "So when you do things, you start doing hierarchies, but nothing of this is innocent innocence.",
                    "label": 0
                },
                {
                    "sent": "So these are two car taxonomies.",
                    "label": 0
                },
                {
                    "sent": "So the first one you know there is a car there gonna sit down and there is an SUVs sedan.",
                    "label": 0
                },
                {
                    "sent": "Can be a full sized mid-size or compact that this was originally for presentation in the US, so full sized mid-size things like that.",
                    "label": 0
                },
                {
                    "sent": "Well, the second one is another taxonomy.",
                    "label": 0
                },
                {
                    "sent": "Is a car can be a low mileage mid range, high Mount mileage, so the low mileage can be a full size sedan.",
                    "label": 1
                },
                {
                    "sent": "Commune SUV can be the mid range.",
                    "label": 0
                },
                {
                    "sent": "Can be a mid size sedan.",
                    "label": 1
                },
                {
                    "sent": "High mileage can be a hybrid.",
                    "label": 0
                },
                {
                    "sent": "Well, you know it.",
                    "label": 0
                },
                {
                    "sent": "Things change a lot depending on which one of these you publish.",
                    "label": 0
                },
                {
                    "sent": "Probably if you're a car manufacturer will publish this one.",
                    "label": 0
                },
                {
                    "sent": "If you work for Greenpeace, you probably published that one in either case.",
                    "label": 0
                },
                {
                    "sent": "You are somehow putting your your ideology on that, and this is you must understand this is not because you're bad people.",
                    "label": 0
                },
                {
                    "sent": "You can be as good as you want, but as soon as you do something like this you are creating criteria you're imposing.",
                    "label": 1
                },
                {
                    "sent": "These criteria on the people who will access the data.",
                    "label": 0
                },
                {
                    "sent": "So always a classification is inevitably an act of power.",
                    "label": 1
                },
                {
                    "sent": "I like that you're imposing and whoever received this information has no choice but to accept what you were doing.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let's work and we look forward for an alternative.",
                    "label": 0
                },
                {
                    "sent": "This isn't mathematical.",
                    "label": 0
                },
                {
                    "sent": "Where can we look for Alternative 1 interesting parallel?",
                    "label": 0
                },
                {
                    "sent": "Since you know after all you are thinking about translating documents into formal systems.",
                    "label": 0
                },
                {
                    "sent": "Let's see what translator is doing for the past 50 years.",
                    "label": 0
                },
                {
                    "sent": "The idea that a translation is somehow it correspondence of documents is pretty much been abandoned.",
                    "label": 0
                },
                {
                    "sent": "This was at least from your Eugene Nida he used to publish in the 60s, so he's a he's a pastor.",
                    "label": 1
                },
                {
                    "sent": "He was interested in translation of the Bible.",
                    "label": 0
                },
                {
                    "sent": "His idea was that you have an original text in original language that interacts with the reader and with all the social codes in which the reader is immerse.",
                    "label": 0
                },
                {
                    "sent": "So this text somehow has a place in a network of connections.",
                    "label": 0
                },
                {
                    "sent": "The idea is that you should translate to a text that plays the same role.",
                    "label": 0
                },
                {
                    "sent": "Of the original text.",
                    "label": 0
                },
                {
                    "sent": "Into the new language, so you're not really translating the text, you're you're translating the relation between the reader and the text, and you know there are very, very practical things you look.",
                    "label": 0
                },
                {
                    "sent": "You look at the menu.",
                    "label": 0
                },
                {
                    "sent": "I mean you don't have to.",
                    "label": 0
                },
                {
                    "sent": "We don't have to talk about philosophy here.",
                    "label": 0
                },
                {
                    "sent": "You look at the menu.",
                    "label": 0
                },
                {
                    "sent": "The manual in English, especially in the US, it's always described with no.",
                    "label": 0
                },
                {
                    "sent": "With luscious stream of fresh butter.",
                    "label": 0
                },
                {
                    "sent": "You translate that in Spanish you look silly.",
                    "label": 0
                },
                {
                    "sent": "You translated in Spanish, so there's brother and that's the end of it.",
                    "label": 0
                },
                {
                    "sent": "So you know it, you have to.",
                    "label": 0
                },
                {
                    "sent": "You have to play.",
                    "label": 0
                },
                {
                    "sent": "You cannot just translate the text.",
                    "label": 0
                },
                {
                    "sent": "You have to play with interaction between the text and the social codes and the reader.",
                    "label": 1
                },
                {
                    "sent": "Actually, there is a translation device called the Scopus Theory was born here in Germany and Heidelberg.",
                    "label": 0
                },
                {
                    "sent": "Actually even the functional relation is normalizing form or freshman.",
                    "label": 1
                },
                {
                    "sent": "It's actually the.",
                    "label": 0
                },
                {
                    "sent": "Goal of the translator to the side.",
                    "label": 0
                },
                {
                    "sent": "What function should the new text so this always tell you something about?",
                    "label": 0
                },
                {
                    "sent": "Up translating from one code to another, you cannot just say this is a document I just represent in a different way.",
                    "label": 0
                },
                {
                    "sent": "No there different way has to take into account.",
                    "label": 0
                },
                {
                    "sent": "The relation with the reader.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So Reading is an active.",
                    "label": 1
                },
                {
                    "sent": "I said dialectic process.",
                    "label": 0
                },
                {
                    "sent": "Take for instance, you know the little charade I did at the beginning of this presentation.",
                    "label": 0
                },
                {
                    "sent": "How did you?",
                    "label": 0
                },
                {
                    "sent": "How did you interpret that?",
                    "label": 0
                },
                {
                    "sent": "Well, you know Alexandra knows me very well, so she might have thought.",
                    "label": 0
                },
                {
                    "sent": "I know that's typical of my behavior.",
                    "label": 0
                },
                {
                    "sent": "US tamatea doesn't know me as well, but we were the conference together before she saw me that I was doing some nasty question.",
                    "label": 0
                },
                {
                    "sent": "Well, maybe she thought also typical.",
                    "label": 0
                },
                {
                    "sent": "The way you interpret that, well, maybe it depends on how you see a conference.",
                    "label": 0
                },
                {
                    "sent": "Know if you have a very strict view of a conference as a dignified thing, you might have thought I was an idiot.",
                    "label": 0
                },
                {
                    "sent": "If you maybe if you if you thought conference with two serious, you might have to well have.",
                    "label": 0
                },
                {
                    "sent": "Finally somebody who demystify's the whole mystique or the academic conference so.",
                    "label": 0
                },
                {
                    "sent": "That thing didn't really mean anything.",
                    "label": 0
                },
                {
                    "sent": "It only meant what you read in it, and even worse now I revealed to you that my little charade was not just random, it had a place in my presentation.",
                    "label": 0
                },
                {
                    "sent": "So probably you might still think.",
                    "label": 0
                },
                {
                    "sent": "I mean, I'm an idiot, but probably your interpretation of my little thing has changed is somebody had left the room before I came to this.",
                    "label": 0
                },
                {
                    "sent": "His idea of what I did would be different, so you really cannot do anything without considering who is going to interpret.",
                    "label": 0
                },
                {
                    "sent": "And what is the context?",
                    "label": 0
                },
                {
                    "sent": "In which this thing is going to be interpreted.",
                    "label": 0
                },
                {
                    "sent": "So I did all these.",
                    "label": 0
                },
                {
                    "sent": "10 minutes blabbering essentially to arrive to this world context.",
                    "label": 0
                },
                {
                    "sent": "You cannot have meaning if you don't interpret that in a context.",
                    "label": 0
                },
                {
                    "sent": "Let's see what I have next.",
                    "label": 0
                },
                {
                    "sent": "I don't remember OK.",
                    "label": 0
                },
                {
                    "sent": "So this is a little bit where we started.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we want to do context what is context?",
                    "label": 0
                },
                {
                    "sent": "Many times.",
                    "label": 0
                },
                {
                    "sent": "You consider context as something that changes the meaning of what you do know.",
                    "label": 1
                },
                {
                    "sent": "You have something something has a certain meaning.",
                    "label": 1
                },
                {
                    "sent": "Depending on the context where you are, that meaning changes, but how about you do it the other way around?",
                    "label": 0
                },
                {
                    "sent": "You are in a certain context.",
                    "label": 1
                },
                {
                    "sent": "You access the document while your context changes.",
                    "label": 0
                },
                {
                    "sent": "You know you're in a restaurant, you you're in the context where you don't know what they serve.",
                    "label": 0
                },
                {
                    "sent": "You read the menu well, your context changes.",
                    "label": 0
                },
                {
                    "sent": "Now you know what they serve.",
                    "label": 0
                },
                {
                    "sent": "You are at the airport.",
                    "label": 0
                },
                {
                    "sent": "You you want to fly to New York, you don't know where to go, where you read gate CC-30 four now you're in a different context.",
                    "label": 0
                },
                {
                    "sent": "The meaning.",
                    "label": 0
                },
                {
                    "sent": "The semantics of the document is exactly this is the changing context.",
                    "label": 1
                },
                {
                    "sent": "If a document doesn't change your context, it has absolutely no meaning.",
                    "label": 0
                },
                {
                    "sent": "It's like it's like Reading War and peace in Russian.",
                    "label": 0
                },
                {
                    "sent": "Unless you're Russian, of course.",
                    "label": 0
                },
                {
                    "sent": "It doesn't mean anything is good.",
                    "label": 1
                },
                {
                    "sent": "I can make any sense of it.",
                    "label": 0
                },
                {
                    "sent": "It doesn't change my context.",
                    "label": 0
                },
                {
                    "sent": "So this is the first thing semantics should be looked in account exchange.",
                    "label": 0
                },
                {
                    "sent": "The second thing is that context is really.",
                    "label": 0
                },
                {
                    "sent": "Part of what you do?",
                    "label": 0
                },
                {
                    "sent": "You're doing something your context is not always the same.",
                    "label": 0
                },
                {
                    "sent": "A trivial example, you are if you are a computer scientist and you're looking for virus.",
                    "label": 0
                },
                {
                    "sent": "Well, maybe you're looking for one thing before it biologist.",
                    "label": 0
                },
                {
                    "sent": "You're looking for virus.",
                    "label": 0
                },
                {
                    "sent": "You're looking for a fairly different thing, but if you're a computer scientist and you have a cold.",
                    "label": 0
                },
                {
                    "sent": "And you're looking for virus?",
                    "label": 0
                },
                {
                    "sent": "Well, maybe you're looking for the same thing as the biology you're not looking for a computer virus, so your context is doesn't really depend on who you are as a you know.",
                    "label": 0
                },
                {
                    "sent": "Kantian category.",
                    "label": 0
                },
                {
                    "sent": "It depends on what you do at the moment.",
                    "label": 0
                },
                {
                    "sent": "And information access is always.",
                    "label": 0
                },
                {
                    "sent": "Part of some activity.",
                    "label": 0
                },
                {
                    "sent": "Usually you're doing something and you need some information so.",
                    "label": 1
                },
                {
                    "sent": "I I I like to model this as a sort of a language game, you're doing something you're.",
                    "label": 0
                },
                {
                    "sent": "You're preparing a presentation, so you're making several moves.",
                    "label": 0
                },
                {
                    "sent": "That will resolve in the end of you are you having the presentation.",
                    "label": 1
                },
                {
                    "sent": "Some of these moves?",
                    "label": 0
                },
                {
                    "sent": "My involved information access.",
                    "label": 0
                },
                {
                    "sent": "So this is this sort of breaks down the concept of a query.",
                    "label": 1
                },
                {
                    "sent": "As an independent activity.",
                    "label": 0
                },
                {
                    "sent": "If you're looking for something while you're editing a document, it's not really the same thing.",
                    "label": 0
                },
                {
                    "sent": "As if you're looking for something because you want to go skiing.",
                    "label": 0
                },
                {
                    "sent": "So they're different activities and they're sort of querying is introduced into this.",
                    "label": 0
                },
                {
                    "sent": "These different chains are activities.",
                    "label": 0
                },
                {
                    "sent": "Uh.",
                    "label": 0
                },
                {
                    "sent": "So these are the two essential point.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Meaning as a change in document an that.",
                    "label": 0
                },
                {
                    "sent": "So now let me.",
                    "label": 0
                },
                {
                    "sent": "Come down from the rambling and ranting.",
                    "label": 0
                },
                {
                    "sent": "And see exactly a little bit what we actually have done, so I said that context is part of an activity if.",
                    "label": 1
                },
                {
                    "sent": "If your activity is completely disconnected from computers that really, there's nothing I can do about it, sorry.",
                    "label": 0
                },
                {
                    "sent": "But let's say it's not.",
                    "label": 0
                },
                {
                    "sent": "Let's say you're doing many of us now.",
                    "label": 0
                },
                {
                    "sent": "We're working with computers, even when they're listening to the presentation.",
                    "label": 0
                },
                {
                    "sent": "Look at that.",
                    "label": 0
                },
                {
                    "sent": "I see I see more laptops than faces here.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Many of our activities take place on computers.",
                    "label": 0
                },
                {
                    "sent": "They leave a digital trace.",
                    "label": 0
                },
                {
                    "sent": "No there there.",
                    "label": 0
                },
                {
                    "sent": "There are activities that do not just die.",
                    "label": 0
                },
                {
                    "sent": "You you leave residues behind and these red residues are digital.",
                    "label": 0
                },
                {
                    "sent": "Again, I'm preparing a presentation for for a conference, let's call it sound just.",
                    "label": 0
                },
                {
                    "sent": "Just just to pick a name.",
                    "label": 0
                },
                {
                    "sent": "I will have a bunch of.",
                    "label": 0
                },
                {
                    "sent": "Directories where I keep my things, so this is the directory I'm working on.",
                    "label": 0
                },
                {
                    "sent": "Those are the things more directly related to the things I'm doing.",
                    "label": 0
                },
                {
                    "sent": "I called it the primary context.",
                    "label": 1
                },
                {
                    "sent": "There are a few things around it, no materials on collecting, and the paper that I was preparing or one of the 15 versions I submitted for this conference.",
                    "label": 1
                },
                {
                    "sent": "You know that.",
                    "label": 0
                },
                {
                    "sent": "Bibliography so this is what I call the secondary context that there is where I go look for the information that I need to focus my query.",
                    "label": 1
                },
                {
                    "sent": "This is this is who I am and at this moment.",
                    "label": 0
                },
                {
                    "sent": "How do we do that well?",
                    "label": 0
                },
                {
                    "sent": "There is a bunch of.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Technical details but.",
                    "label": 0
                },
                {
                    "sent": "Let's put it this way.",
                    "label": 0
                },
                {
                    "sent": "You could do it.",
                    "label": 0
                },
                {
                    "sent": "You could do it in many ways.",
                    "label": 0
                },
                {
                    "sent": "At this point you have to become pragmatic.",
                    "label": 0
                },
                {
                    "sent": "The general idea is I want to have a representation of these things.",
                    "label": 0
                },
                {
                    "sent": "The time that I'm doing all these documents that I have in my context.",
                    "label": 0
                },
                {
                    "sent": "In order to formulate a query, so I'm looking for something I type in a word and I want to modify that query to reflect my context.",
                    "label": 0
                },
                {
                    "sent": "That is the general idea.",
                    "label": 0
                },
                {
                    "sent": "You can do it in many different ways.",
                    "label": 0
                },
                {
                    "sent": "You could use logical.",
                    "label": 0
                },
                {
                    "sent": "Statements thank you for pointing that out to me.",
                    "label": 0
                },
                {
                    "sent": "You could use logical statements.",
                    "label": 0
                },
                {
                    "sent": "The problem is that we wanted to try it out.",
                    "label": 0
                },
                {
                    "sent": "And let's face it.",
                    "label": 0
                },
                {
                    "sent": "Everybody's talking about the semantic web, but I still have to see places up there with larger documents.",
                    "label": 0
                },
                {
                    "sent": "There have been there have been annotated semantically.",
                    "label": 0
                },
                {
                    "sent": "If anybody knows places with a lot of documents, please tell me so.",
                    "label": 0
                },
                {
                    "sent": "The best thing is you have to go.",
                    "label": 0
                },
                {
                    "sent": "A lot how many?",
                    "label": 0
                },
                {
                    "sent": "Yes, 10,000,000.",
                    "label": 0
                },
                {
                    "sent": "10,000 yes.",
                    "label": 0
                },
                {
                    "sent": "OK, will talk about you.",
                    "label": 0
                },
                {
                    "sent": "I'll take it.",
                    "label": 0
                },
                {
                    "sent": "I'll take that advice, but with the second one, let's use.",
                    "label": 0
                },
                {
                    "sent": "Let's try to do something with standard search engines.",
                    "label": 0
                },
                {
                    "sent": "So we went looking for information retrieval representations because that it's easier than to transform into a query that you can send to a standard web search engine.",
                    "label": 0
                },
                {
                    "sent": "So we take all the documents in a in the context.",
                    "label": 0
                },
                {
                    "sent": "We do stop word removal.",
                    "label": 0
                },
                {
                    "sent": "We do stemming.",
                    "label": 0
                },
                {
                    "sent": "We do all the bells and whistles.",
                    "label": 0
                },
                {
                    "sent": "Then we take groups of words.",
                    "label": 0
                },
                {
                    "sent": "Can be 2, can be more.",
                    "label": 0
                },
                {
                    "sent": "We take groups because essentially a lot of times.",
                    "label": 0
                },
                {
                    "sent": "Co location is a very important clue for disambiguating words.",
                    "label": 0
                },
                {
                    "sent": "Collocation is actually sometimes more important than the single words that you use.",
                    "label": 0
                },
                {
                    "sent": "So we take this these things.",
                    "label": 0
                },
                {
                    "sent": "We do a geometric model, A space of words with one axis for each word.",
                    "label": 0
                },
                {
                    "sent": "Pairs will be points in planes.",
                    "label": 0
                },
                {
                    "sent": "If you take triples, there will be points in three dimensional subspaces.",
                    "label": 0
                },
                {
                    "sent": "Things like that we get.",
                    "label": 0
                },
                {
                    "sent": "We do wait for each one of these words, sort of proportional to the frequency of the words.",
                    "label": 0
                },
                {
                    "sent": "We don't use the TF IDF.",
                    "label": 0
                },
                {
                    "sent": "If you want to know why, I will tell you later.",
                    "label": 0
                },
                {
                    "sent": "And we do we put a self organizing map into this thing.",
                    "label": 0
                },
                {
                    "sent": "So they have been used.",
                    "label": 0
                },
                {
                    "sent": "There's a web, some semantic self organizing map model.",
                    "label": 0
                },
                {
                    "sent": "They've been using information retrieval.",
                    "label": 0
                },
                {
                    "sent": "We use that as opposed to things like latent semantics, for instance, because we need a nonlinear model.",
                    "label": 0
                },
                {
                    "sent": "Because in this case we are sort of taking information retrieval techniques, but using them backwards.",
                    "label": 0
                },
                {
                    "sent": "I mean, usually these models very they're used to model your collection, the model, your database.",
                    "label": 0
                },
                {
                    "sent": "In this case, we're not modeling the database, we are modeling the context and then we, sort of.",
                    "label": 0
                },
                {
                    "sent": "From this we need to to derive a query.",
                    "label": 0
                },
                {
                    "sent": "So how do we derive a query?",
                    "label": 0
                },
                {
                    "sent": "You type you type in a few words.",
                    "label": 0
                },
                {
                    "sent": "Which is a query point.",
                    "label": 0
                },
                {
                    "sent": "We have this map so you have a few words.",
                    "label": 0
                },
                {
                    "sent": "We sort of pinch the map and pull it towards your query so that you know this is a self rising map.",
                    "label": 0
                },
                {
                    "sent": "So you pull the winning neuron and there is a whole neighborhood that comes out with it.",
                    "label": 0
                },
                {
                    "sent": "So we got.",
                    "label": 0
                },
                {
                    "sent": "Sort of a thing like this.",
                    "label": 0
                },
                {
                    "sent": "This was the original map.",
                    "label": 0
                },
                {
                    "sent": "This is the new one.",
                    "label": 0
                },
                {
                    "sent": "We get a difference.",
                    "label": 0
                },
                {
                    "sent": "That is sort of the difference in context that I was talking about.",
                    "label": 0
                },
                {
                    "sent": "So that difference between the two Maps before and after you type in the query.",
                    "label": 0
                },
                {
                    "sent": "It's sort of the.",
                    "label": 0
                },
                {
                    "sent": "Description of the document that we want to have now.",
                    "label": 0
                },
                {
                    "sent": "What do we do with this now?",
                    "label": 0
                },
                {
                    "sent": "The ideal situation would be to have a server dedicated to this and believe me we're working on that.",
                    "label": 0
                },
                {
                    "sent": "'cause this is now you have this map representation of the query.",
                    "label": 0
                },
                {
                    "sent": "If you do an information retrieval server that uses the same representation, you can sort of compare them and see what areas of your space is more relevant to you.",
                    "label": 0
                },
                {
                    "sent": "We're working on that.",
                    "label": 0
                },
                {
                    "sent": "So far, what do we do?",
                    "label": 0
                },
                {
                    "sent": "We take this deformation we projected onto the axis and take the most relevant words with their weights.",
                    "label": 0
                },
                {
                    "sent": "So from your couple of words.",
                    "label": 0
                },
                {
                    "sent": "You come up with a query that maybe maybe 40 words with weights.",
                    "label": 0
                },
                {
                    "sent": "And that is the thing that we want to send to the.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then we want to send to the to the search engine.",
                    "label": 1
                },
                {
                    "sent": "In the case of Google, we had to make a further approximation because it doesn't really accept weights, but what it does, we found out and accept replication awards.",
                    "label": 0
                },
                {
                    "sent": "So I will give you the details if you want offline, but we sort of approximate this thing with Google, so we did a couple of tests and I repeat these are.",
                    "label": 0
                },
                {
                    "sent": "This is sort of a minimum level of results because we don't really use context at its best.",
                    "label": 1
                },
                {
                    "sent": "So this is the.",
                    "label": 0
                },
                {
                    "sent": "This is a.",
                    "label": 0
                },
                {
                    "sent": "These are a bunch of papers of mine.",
                    "label": 0
                },
                {
                    "sent": "One of my directory's.",
                    "label": 0
                },
                {
                    "sent": "On my computers we did 30 queries.",
                    "label": 0
                },
                {
                    "sent": "Considering the context, non not considering the context and look at the precision of the first 8 results.",
                    "label": 1
                },
                {
                    "sent": "And these are things.",
                    "label": 0
                },
                {
                    "sent": "These are the mean and variance over the 30 queries.",
                    "label": 1
                },
                {
                    "sent": "This is without context.",
                    "label": 0
                },
                {
                    "sent": "The thing up there, the black one is with context and this one is when you download documents and use them to change your context.",
                    "label": 0
                },
                {
                    "sent": "That's something I don't have time to go into.",
                    "label": 0
                },
                {
                    "sent": "But of course your context evolves as you do things.",
                    "label": 0
                },
                {
                    "sent": "So this is that is a preparation of a collection of papers for neural Physiology.",
                    "label": 1
                },
                {
                    "sent": "You should also see the same thing.",
                    "label": 0
                },
                {
                    "sent": "The improvement of you see that's the improvement is not quite as big.",
                    "label": 0
                },
                {
                    "sent": "I think one of the reasons is that new physiologists use that.",
                    "label": 0
                },
                {
                    "sent": "They make up their own words so you know a word is much more.",
                    "label": 0
                },
                {
                    "sent": "Contextual.",
                    "label": 0
                },
                {
                    "sent": "Then, in computing computing, usually you you recycle, we recycled words.",
                    "label": 0
                },
                {
                    "sent": "So there there is much more ambiguity, so this is in this case we basically double the precision of the results.",
                    "label": 0
                },
                {
                    "sent": "This is the same thing using Google Image.",
                    "label": 0
                },
                {
                    "sent": "So this.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As an image retrieval thing and more or less, you can see the same same kind of thing, same kind of same kind of behavior.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is an example.",
                    "label": 0
                },
                {
                    "sent": "The query was to execute.",
                    "label": 1
                },
                {
                    "sent": "So the first, the first set with other Contacts, pretty gruesome I I don't visit.",
                    "label": 0
                },
                {
                    "sent": "There's this example of was from Alexandra.",
                    "label": 0
                },
                {
                    "sent": "I don't know why she picked this one.",
                    "label": 0
                },
                {
                    "sent": "I was too scared to ask.",
                    "label": 0
                },
                {
                    "sent": "But the second one is a little chart about the execution of software.",
                    "label": 0
                },
                {
                    "sent": "Because you know, programs.",
                    "label": 0
                },
                {
                    "sent": "Except for this one.",
                    "label": 0
                },
                {
                    "sent": "So you can see in this case the.",
                    "label": 0
                },
                {
                    "sent": "Change was quite noticeable, especially for the.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "People were being hacked.",
                    "label": 0
                },
                {
                    "sent": "So conclusions.",
                    "label": 0
                },
                {
                    "sent": "We are trying to.",
                    "label": 0
                },
                {
                    "sent": "Sort of.",
                    "label": 0
                },
                {
                    "sent": "Reverse things a little bit.",
                    "label": 0
                },
                {
                    "sent": "Instead of modeling the documents, we are modeling the user.",
                    "label": 0
                },
                {
                    "sent": "Of course, as in as in everything.",
                    "label": 0
                },
                {
                    "sent": "Before we before we start asking any other questions, we want to see how well the thing might work.",
                    "label": 0
                },
                {
                    "sent": "So if you ask me, why haven't you thought about integrating thing with document annotation?",
                    "label": 0
                },
                {
                    "sent": "Well because it's not time yet.",
                    "label": 0
                },
                {
                    "sent": "But first I want to see.",
                    "label": 0
                },
                {
                    "sent": "If this thing makes sense, if I can get some mileage from this, how well can we do then?",
                    "label": 0
                },
                {
                    "sent": "I will think about maybe integrated with other things, but we're sort of taking this.",
                    "label": 0
                },
                {
                    "sent": "This is the.",
                    "label": 0
                },
                {
                    "sent": "Meaning of a document is really what it means to you, not what it means to somebody who made the annotation.",
                    "label": 0
                },
                {
                    "sent": "Because the person who made the annotation might have a different concept of the document for you, we want to build a better server because these results were obtained using Google.",
                    "label": 0
                },
                {
                    "sent": "And really Google is was not made for this.",
                    "label": 0
                },
                {
                    "sent": "Maybe the maybe the collection you were mentioning when might be more useful.",
                    "label": 0
                },
                {
                    "sent": "In this respect, another thing I would like to do was to work a little more on the image issue.",
                    "label": 0
                },
                {
                    "sent": "Right now we do image retrieval, but the context is completely textual, but of course in your context you have documents and you have images and you can represent images with features.",
                    "label": 0
                },
                {
                    "sent": "And since we have a geometric approach that you can mix and match pretty well together, so that's.",
                    "label": 0
                },
                {
                    "sent": "Sort of the other one there actually.",
                    "label": 0
                },
                {
                    "sent": "Now I have a visitor from Italy who staying in Madrid.",
                    "label": 0
                },
                {
                    "sent": "Three months, but probably like everybody else, will never leave.",
                    "label": 0
                },
                {
                    "sent": "People come to Madrid and they never go away.",
                    "label": 0
                },
                {
                    "sent": "And he's working a little bit on this one.",
                    "label": 0
                },
                {
                    "sent": "More on the.",
                    "label": 0
                },
                {
                    "sent": "Social network driven classification, but it's it's more or less the same idea.",
                    "label": 0
                },
                {
                    "sent": "And I think I'm pretty much passed out of time as a good Italian should, and so thank you for your attention.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Answer questions, remarks but makes many more months.",
                    "label": 0
                },
                {
                    "sent": "I think you do several major non trivial mistakes.",
                    "label": 0
                },
                {
                    "sent": "So first mistakes of course confuse semantics and pragmatics.",
                    "label": 0
                },
                {
                    "sent": "Along with one star stops and the other ends.",
                    "label": 0
                },
                {
                    "sent": "But there is a long tradition in linguistics, for example, to talk about these things.",
                    "label": 0
                },
                {
                    "sent": "I don't think we should talk a lot about the show, meaning of things that has to do with.",
                    "label": 0
                },
                {
                    "sent": "Actually, I think the people who make mistakes or those who make a distinction, but we will talk about that.",
                    "label": 0
                },
                {
                    "sent": "These models they offer use and that was their great, but of course models are tools right?",
                    "label": 0
                },
                {
                    "sent": "And sometimes you need a screwdriver.",
                    "label": 0
                },
                {
                    "sent": "Sometimes need a hammer and it has a lot of problem.",
                    "label": 0
                },
                {
                    "sent": "Your hand if you have must acre.",
                    "label": 0
                },
                {
                    "sent": "You don't have supervised data.",
                    "label": 0
                },
                {
                    "sent": "Loser some other scenarios will say you will find that you have a different scenario.",
                    "label": 0
                },
                {
                    "sent": "You have different workflows for holding, so just rather relying on coding using Snowman and I guess they will be actually.",
                    "label": 0
                },
                {
                    "sent": "Patient records that are encoded using snowman music lesson alive, right?",
                    "label": 0
                },
                {
                    "sent": "These are too large extent.",
                    "label": 0
                },
                {
                    "sent": "Just document this text.",
                    "label": 0
                },
                {
                    "sent": "So there are not the same data as your final, where you're right.",
                    "label": 0
                },
                {
                    "sent": "Just try not to lie.",
                    "label": 0
                },
                {
                    "sent": "So depends on the problem you have that you choose the tool.",
                    "label": 0
                },
                {
                    "sent": "And 3rd about context actually has also have some systems.",
                    "label": 0
                },
                {
                    "sent": "After all, trying to better my various more handy.",
                    "label": 0
                },
                {
                    "sent": "OK, well the first the first one will talk about it.",
                    "label": 0
                },
                {
                    "sent": "I don't want.",
                    "label": 0
                },
                {
                    "sent": "I don't want to do the exegeses of Heidegger right here.",
                    "label": 0
                },
                {
                    "sent": "The second one, yes, I mean there are different levels of formalization or different that medical records that you were talking about.",
                    "label": 0
                },
                {
                    "sent": "We already talking about semi formalized data from the start and in the first slide I said that you know.",
                    "label": 0
                },
                {
                    "sent": "Structure.",
                    "label": 0
                },
                {
                    "sent": "Fairly structure.",
                    "label": 0
                },
                {
                    "sent": "So as I said in the first light, there are different ideas or what the semantic web is.",
                    "label": 0
                },
                {
                    "sent": "There is what I call the Berners Lee semantic Web, which is I I see that kind of data to fall into that.",
                    "label": 0
                },
                {
                    "sent": "In that case, absolutely.",
                    "label": 0
                },
                {
                    "sent": "I mean, this is basically a.",
                    "label": 0
                },
                {
                    "sent": "Extension of Schema integration works.",
                    "label": 0
                },
                {
                    "sent": "I mean when people were doing deductive databases in the 80s, it works.",
                    "label": 0
                },
                {
                    "sent": "No problem.",
                    "label": 0
                },
                {
                    "sent": "I I agree with that there's no discussion, but so from the beginning explicitly I sort of put myself into the other.",
                    "label": 0
                },
                {
                    "sent": "Category to say we want there are people who want to use these things.",
                    "label": 0
                },
                {
                    "sent": "That's the main thing.",
                    "label": 0
                },
                {
                    "sent": "Seamlessly from one to the other anymore.",
                    "label": 0
                },
                {
                    "sent": "Because replication they have.",
                    "label": 0
                },
                {
                    "sent": "There is no boundary.",
                    "label": 0
                },
                {
                    "sent": "There is a boundary.",
                    "label": 0
                },
                {
                    "sent": "There are documents that I mean the documents were talking about from the beginning.",
                    "label": 0
                },
                {
                    "sent": "There sort of semi structured documents I'm talking about are not.",
                    "label": 0
                },
                {
                    "sent": "They are the things.",
                    "label": 0
                },
                {
                    "sent": "Documents we just no paper.",
                    "label": 0
                },
                {
                    "sent": "But if you wanna take if you notated patient record, really your document is the annotation is not a document.",
                    "label": 0
                },
                {
                    "sent": "Wrong.",
                    "label": 0
                },
                {
                    "sent": "So you're annotating things you're searching for that.",
                    "label": 0
                },
                {
                    "sent": "Let's say if you were if you were to prove your case in court.",
                    "label": 0
                },
                {
                    "sent": "Would I have a good case to saying that you made the wrong annotation or you would say no?",
                    "label": 0
                },
                {
                    "sent": "Well, you know what the annotation is, what really counts.",
                    "label": 0
                },
                {
                    "sent": "So if I I'm a doctor, I made a search.",
                    "label": 0
                },
                {
                    "sent": "It came up with something and my because of what I read there and my patient died.",
                    "label": 0
                },
                {
                    "sent": "If I say, well, I read, I read this and maybe there was a mismatch between the annotation and the document.",
                    "label": 0
                },
                {
                    "sent": "So what counts the annotation that I retrieved?",
                    "label": 0
                },
                {
                    "sent": "Or the OR the document?",
                    "label": 0
                },
                {
                    "sent": "Question.",
                    "label": 0
                },
                {
                    "sent": "Without innovation, something station captain question does not depend on performance and people go to jail for that, no, but that's what that's what I say.",
                    "label": 0
                },
                {
                    "sent": "'cause if you're if you're saying that really, the annotation is what counts, then what you're really doing, you're creating a structure document and on the side you have another document that people can read, but your.",
                    "label": 0
                },
                {
                    "sent": "There is government which uses the genealogy.",
                    "label": 0
                },
                {
                    "sent": "We access the full text abstracts format, right?",
                    "label": 0
                },
                {
                    "sent": "People use that community.",
                    "label": 0
                },
                {
                    "sent": "And so I mean.",
                    "label": 0
                },
                {
                    "sent": "There is No Fear.",
                    "label": 0
                },
                {
                    "sent": "I would suggest that.",
                    "label": 0
                },
                {
                    "sent": "We can go like this until six that's.",
                    "label": 0
                },
                {
                    "sent": "The result of questions in the room.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Think about.",
                    "label": 0
                },
                {
                    "sent": "What you're looking for is a global demand.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "That's what I'm doing.",
                    "label": 0
                },
                {
                    "sent": "Well, the recall it's really, really problem and this is the web.",
                    "label": 0
                },
                {
                    "sent": "Are you really sure you want to recall everything?",
                    "label": 0
                },
                {
                    "sent": "I don't, I honestly I don't know how to measure recall on Google on the Google database.",
                    "label": 0
                },
                {
                    "sent": "I don't know how many, how many significant documents are there?",
                    "label": 0
                },
                {
                    "sent": "If anybody knows how to measure recall on the Google database, I don't know how to do it and I'm not really sure you want, but I'm sorry for your first thing.",
                    "label": 0
                },
                {
                    "sent": "No, I don't want global semantics, that's exactly what I do not want.",
                    "label": 0
                },
                {
                    "sent": "I want your own semantics.",
                    "label": 0
                },
                {
                    "sent": "The semantics that you want to give to the documents.",
                    "label": 0
                },
                {
                    "sent": "Why do I have to see the document?",
                    "label": 0
                },
                {
                    "sent": "Check.",
                    "label": 0
                },
                {
                    "sent": "Why do I have to see a document as a message between three humans?",
                    "label": 0
                },
                {
                    "sent": "The message.",
                    "label": 0
                },
                {
                    "sent": "As being message or medium.",
                    "label": 0
                },
                {
                    "sent": "Transport.",
                    "label": 0
                },
                {
                    "sent": "That was that was.",
                    "label": 0
                },
                {
                    "sent": "No, no, but that's actually the model of communication.",
                    "label": 0
                },
                {
                    "sent": "Was the model I was criticizing.",
                    "label": 0
                },
                {
                    "sent": "I don't see the document as a as a as a message between two humans.",
                    "label": 0
                },
                {
                    "sent": "I just see it as a document.",
                    "label": 0
                },
                {
                    "sent": "Someone?",
                    "label": 0
                },
                {
                    "sent": "Not without exactly.",
                    "label": 0
                },
                {
                    "sent": "I want to put the emphasis on the interpreter.",
                    "label": 0
                },
                {
                    "sent": "I don't care about the author.",
                    "label": 0
                },
                {
                    "sent": "There may be no author.",
                    "label": 0
                },
                {
                    "sent": "The Odyssey, who wrote the Odyssey, but I can read it.",
                    "label": 0
                },
                {
                    "sent": "the Bible, who wrote the Bible?",
                    "label": 0
                },
                {
                    "sent": "I can read it.",
                    "label": 0
                },
                {
                    "sent": "Ending on whether we know how Bible was written, so you can assume it was written by one author or as it happened for your time zone, but that is my assumption that is my assumption exactly.",
                    "label": 0
                },
                {
                    "sent": "So what counts is not who wrote the Bible when it comes my view of who wrote the Bible.",
                    "label": 0
                },
                {
                    "sent": "So this is part of my context is not the author of the Bible.",
                    "label": 0
                },
                {
                    "sent": "I don't care about the author of the Bible or of the Odyssey.",
                    "label": 0
                }
            ]
        }
    }
}