{
    "id": "z6yc53um3xpigrnwktrib5d33zrqnvim",
    "title": "User Modeling Combining Access Logs, Page Content and Semantics",
    "info": {
        "author": [
            "Blaž Fortuna, Artificial Intelligence Laboratory, Jožef Stefan Institute"
        ],
        "published": "April 16, 2011",
        "recorded": "March 2011",
        "category": [
            "Top->Computer Science->Web Mining"
        ]
    },
    "url": "http://videolectures.net/www2011_fortuna_umc/",
    "segmentation": [
        [
            "OK, so I'm glad for tonight and as you heard them coming from other Steven Institute and I'm presenting work that I did read it in collaboration with doing another mission, Mark robotic.",
            "And also we did so the data and everything that we see is coming to our compilation collaboration with one of the major news publishing website and the title of the Talk is user modeling combining access log speech can't."
        ],
        [
            "In semantics, so the outline of the talk 1st, I'll give the overview of the system we developed.",
            "And then I'll go into more details about the data source we have, the way the tools we developed and how do we define user segments?",
            "And our approach to user modeling, and we conclude with couple of experiments and experiments."
        ],
        [
            "Conclusions, so this is the system overview, so we have several data sources.",
            "One of them is access locks, so this is click through data on the website.",
            "So for each user we know which page we saw in which moment.",
            "We combine this with articles, so articles since we have news, publishing websites, articles or news articles and we have both content so the raw text of the article together with the several semantics, semantic annotations of the data.",
            "So the name entity is the.",
            "Topics authors publish dates and stuff like that.",
            "So various metadata about the articles and we also have user data.",
            "So for registered subset of users we have.",
            "Details such as location, gender, age and stuff like that.",
            "So we combine all these data into big index, so we'll see later what exactly do we mean by that?",
            "And this is used by the domain experts, which can define the segment.",
            "So through some interface and use this segment definitions to through by using user modeling and this segment definition together with all the three data sources, we derive segment profiles in this segment.",
            "Profits can be used by advertiser or analysts for either understanding the user profile.",
            "So what is particular segment of users reading?",
            "What kind of users are reading particular type of content?",
            "And also to we can apply this user models to, for example, unregistered users to generalize.",
            "Gender or stuff like that to unregistered users for the purpose, for example of."
        ],
        [
            "At targeting.",
            "OK, so now we go through all the three data sources.",
            "So the first data sources, access logs and what access locks basically do is record the user interactions with the website.",
            "Since we have a news website, what we record is the which article was seen by which user and for each page you so user reading an article or section front or front page we have the user ID which is collected collected through tagging users with cookies, date and time.",
            "So when was the interaction happened?",
            "Location which we decode from the IP of the user.",
            "The requested page that so the page is being read at the moment where is the user coming from.",
            "So referring page search query if it's possible.",
            "So if user comes from the search engine, we can pull out the search queries and from the user agent we can also get the browser operating system and device.",
            "So this kind of describes this.",
            "Current context of the user in the in the particular visit.",
            "And as I mentioned, we use cookies to track the user."
        ],
        [
            "This is 1 example, so here we have a user with some random number for the cookie.",
            "So based on the IP we can guess that you see that he's coming from Beijing, China.",
            "He's reading a particular article, so this is this Ural, so some opinion by.",
            "So author and he's he's coming today.",
            "He found this page by searching for query Obama.",
            "Then we can see that from the referring URL and the visit was done in August 2009.",
            "And he was using Safari."
        ],
        [
            "Windows PC OK, so the second source of articles of data is articles, So what are the things that people are actually reading on the website?",
            "And here we have both use both content and semantics about the pages, so the content would be the actual text so.",
            "Actually text would be this just raw data there from the page and we compliment this by several metadata, someone pinkies annotations which are rather automatically extracted to manually.",
            "So we have both automatically extracted entities and manually added name entities.",
            "Litter selected by the editors and authors.",
            "Then we have a topic.",
            "So what is the article talking about?",
            "Foreign politics, opinion, sports and so on?",
            "Have a metadata.",
            "So who is the author?",
            "What kind of article is it?",
            "What kind of page is it?",
            "And several other page metadata so?"
        ],
        [
            "And the first source of data is user data, so this is provided only for registered users, which is a manual process and the user has to decide whether to go through it.",
            "In our case, we had around 20% of unique users registered, and as we'll see later we can use machine learning to generalize some of the dimensions.",
            "Components of this demographic profiles to non registered users and will be in more detail.",
            "Will be looking in gender, year of birth and household income in this year of birth we.",
            "Translate it into H so important thing is that data is collected voluntarily, so people opt in and it's since it's on the Internet, so there's no reason why people would be accurate about these things, so it can be quite noisy and this is 1 example form that we can see on the Internet for collecting such data.",
            "So so basically just a simple form of people go in and.",
            "Enters gender and so on."
        ],
        [
            "OK, so this is the source of the data.",
            "Now what do we mean by user segment?",
            "So for US user segment is a subset of visitors that are visiting website and they are sharing some common characteristics.",
            "So what would be examples of such common characteristics?",
            "For example, all the users that are that have a gender male so or domestic another segment would be all the users that are H 40 or above.",
            "So this would be segments based on the demographics.",
            "We can also use other features to construct segments, for example referring domain.",
            "So give me a segment of all the users that are coming from Facebook there to our website or all the people that are reading about travel topics.",
            "So in this we can see by either referring pages or requested topics of requested pages and we can also have a more fine grained segments.",
            "We could combine any of this."
        ],
        [
            "Features.",
            "So how do we define segments as a user?",
            "So we wanted to make this simple, so 'cause the system we were developing was ended up being used by domain experts.",
            "So there advertising analysts or so on and our solution was to index all the users so each user.",
            "That comes to a website is indexed by several fields.",
            "Inverted index and then this segment definitions definition translates into a faceted search query that the domain experts defines.",
            "And this allows for Adcock segment definitions, so here is example.",
            "So here is a list of fields that we index, so we choose a Reese index by several types of URL things, page URL, page title, page content, the domain, so the name entities that is coming.",
            "He was reading about such term that he was using and location data and demographics."
        ],
        [
            "Here are a couple of examples in the interface.",
            "So for example, this is a definition of a segment of users, so their females with household income between 100 and hundred $50,000 that are at some point reading style section front.",
            "Another example would be all the people with this decision making titles, job titles.",
            "Another example would be all the people that are reading about healthcare and Obama and are coming from Twitter to overlap."
        ],
        [
            "Site.",
            "So next step is the user modeling.",
            "So once you define a segment we want to develop user model around it.",
            "So for this we first extract features.",
            "So feature is a set of extracted from one or more fields so that we extracted from these data sources.",
            "For example, the demographics page, content, metadata and so on, and we're using vector space model to represent one particular visit and then we to construct the training set we represent front user as a centric.",
            "Of all the visit vectors.",
            "And users from the segments are positive class user from sample for the users form negative class and we're using support vector machine to model as a classification algorithm and we're using one particular implementation based on stochastic gradient descent that has inherent support for this sampling.",
            "So we don't need to compute features for all the users that just for."
        ],
        [
            "Um subset.",
            "And one side effect of this is that we can use SVM as a feature selection.",
            "So there are some approaches to use them as a feature selection method and we can use this to visualize important keywords for a particular segment.",
            "So if you look at this category of females with more than 100,000 household income interested in style category on the website, we can then see what are the keywords that are responsible for positive classification.",
            "Of a user given given user his history into this."
        ],
        [
            "Ignant OK, now the experimental setting, so we have.",
            "We evaluated this approach on major news publishing website with 5 million daily users, out of which one million was registered.",
            "And we were trying to predict the demographic dimensions, gender, age and income.",
            "We had three groups of users segregated by the number of visits, so to 1010 to 50 visits or 50 or above visits, and we were using 10 fold cross validation break even point in here at the bottom is the list of the categories.",
            "So we grouped the H and income category categories.",
            "Into so the H was grouped into decades, for example."
        ],
        [
            "And we check the performance of the algorithm on along several dimensions.",
            "So just using the context so the location under where the user came from the referring page and the device.",
            "Then you several content features.",
            "So texts only keywords name entities or only metadata.",
            "So topics and organizations that were manually edited added by editors.",
            "And then combination of this speech."
        ],
        [
            "So first for the gender, so this is data for people with this 10 visits we can see that so 50% would be random.",
            "So this is the bottom and we can see that by just using the text we come to almost 65%.",
            "But if you only use metadata, so topics of the pages and.",
            "Editorially selected, the name entities in the articles and authors we can come up to 70%.",
            "So for both almost up to 70% for both male and female."
        ],
        [
            "And if you look at the number, if you look at this, how does this improve?",
            "If increase the number of visits from a user?",
            "So if you get more of the observations from a particular reason, we see that for Mail it increases from, so people that had at least two visits.",
            "We are around 6065%.",
            "And by going to 50 or more visits we see that we come out almost 50, almost 80%.",
            "For Mail.",
            "It's interesting that from female.",
            "So this highly engaged female users that this doesn't increase and this is mostly cause.",
            "So.",
            "There is A at some point of the map merge with this highly engaged users population, which is either male or female.",
            "So there's a cloud of both and there's a separate cloud.",
            "This mill engage users.",
            "It can be kind of segregated, still away."
        ],
        [
            "Then if you look at another Democratic dimension, so the H we can see that it's fairly easy to distinguish young people.",
            "So from 20 to 30 years and older people, so from 60 to 80.",
            "But it's very hard to the bottom baseline is random.",
            "It's very hard to distinguish people.",
            "So from 30 to 60, so this, and the reason for this, if you would look into the models, is that these are people that are.",
            "More or less so young people would be more mostly students there.",
            "At the end it would be retired.",
            "People in between the what are you reading?",
            "Mostly depends on your profession and other features and not so much on their age.",
            "So whether you're 30 something or 40."
        ],
        [
            "Cooking doesn't change much.",
            "And we can look at the which metadata is important, which, which features are the most important for good classifications, and we see that name entities are extremely useful for.",
            "Older population so from 6 do category 1680 and that.",
            "And also for younger population so."
        ],
        [
            "Just for the and from the income.",
            "So for income it's fairly random to distinguish anybody that has a lower medium income.",
            "The only people that were more or less above random where people with high incomes, 450,000 or more."
        ],
        [
            "So the conclusions.",
            "So we presented approach for modeling user segments.",
            "We had a user friendly way of defining fairly complex user segments and we used to combine several data sources both for defining the segments and for defining the model and justice little advertising.",
            "So there's a tomorrow we have a paper at semantic search where it's learning to rank for semantic search where we are using usage data from Wikipedia for ranking."
        ],
        [
            "Save data.",
            "OK, thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so I'm glad for tonight and as you heard them coming from other Steven Institute and I'm presenting work that I did read it in collaboration with doing another mission, Mark robotic.",
                    "label": 0
                },
                {
                    "sent": "And also we did so the data and everything that we see is coming to our compilation collaboration with one of the major news publishing website and the title of the Talk is user modeling combining access log speech can't.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In semantics, so the outline of the talk 1st, I'll give the overview of the system we developed.",
                    "label": 0
                },
                {
                    "sent": "And then I'll go into more details about the data source we have, the way the tools we developed and how do we define user segments?",
                    "label": 0
                },
                {
                    "sent": "And our approach to user modeling, and we conclude with couple of experiments and experiments.",
                    "label": 1
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Conclusions, so this is the system overview, so we have several data sources.",
                    "label": 1
                },
                {
                    "sent": "One of them is access locks, so this is click through data on the website.",
                    "label": 0
                },
                {
                    "sent": "So for each user we know which page we saw in which moment.",
                    "label": 0
                },
                {
                    "sent": "We combine this with articles, so articles since we have news, publishing websites, articles or news articles and we have both content so the raw text of the article together with the several semantics, semantic annotations of the data.",
                    "label": 0
                },
                {
                    "sent": "So the name entity is the.",
                    "label": 0
                },
                {
                    "sent": "Topics authors publish dates and stuff like that.",
                    "label": 0
                },
                {
                    "sent": "So various metadata about the articles and we also have user data.",
                    "label": 1
                },
                {
                    "sent": "So for registered subset of users we have.",
                    "label": 0
                },
                {
                    "sent": "Details such as location, gender, age and stuff like that.",
                    "label": 0
                },
                {
                    "sent": "So we combine all these data into big index, so we'll see later what exactly do we mean by that?",
                    "label": 0
                },
                {
                    "sent": "And this is used by the domain experts, which can define the segment.",
                    "label": 0
                },
                {
                    "sent": "So through some interface and use this segment definitions to through by using user modeling and this segment definition together with all the three data sources, we derive segment profiles in this segment.",
                    "label": 1
                },
                {
                    "sent": "Profits can be used by advertiser or analysts for either understanding the user profile.",
                    "label": 0
                },
                {
                    "sent": "So what is particular segment of users reading?",
                    "label": 0
                },
                {
                    "sent": "What kind of users are reading particular type of content?",
                    "label": 0
                },
                {
                    "sent": "And also to we can apply this user models to, for example, unregistered users to generalize.",
                    "label": 0
                },
                {
                    "sent": "Gender or stuff like that to unregistered users for the purpose, for example of.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "At targeting.",
                    "label": 0
                },
                {
                    "sent": "OK, so now we go through all the three data sources.",
                    "label": 0
                },
                {
                    "sent": "So the first data sources, access logs and what access locks basically do is record the user interactions with the website.",
                    "label": 1
                },
                {
                    "sent": "Since we have a news website, what we record is the which article was seen by which user and for each page you so user reading an article or section front or front page we have the user ID which is collected collected through tagging users with cookies, date and time.",
                    "label": 0
                },
                {
                    "sent": "So when was the interaction happened?",
                    "label": 0
                },
                {
                    "sent": "Location which we decode from the IP of the user.",
                    "label": 0
                },
                {
                    "sent": "The requested page that so the page is being read at the moment where is the user coming from.",
                    "label": 1
                },
                {
                    "sent": "So referring page search query if it's possible.",
                    "label": 0
                },
                {
                    "sent": "So if user comes from the search engine, we can pull out the search queries and from the user agent we can also get the browser operating system and device.",
                    "label": 0
                },
                {
                    "sent": "So this kind of describes this.",
                    "label": 0
                },
                {
                    "sent": "Current context of the user in the in the particular visit.",
                    "label": 0
                },
                {
                    "sent": "And as I mentioned, we use cookies to track the user.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is 1 example, so here we have a user with some random number for the cookie.",
                    "label": 0
                },
                {
                    "sent": "So based on the IP we can guess that you see that he's coming from Beijing, China.",
                    "label": 0
                },
                {
                    "sent": "He's reading a particular article, so this is this Ural, so some opinion by.",
                    "label": 0
                },
                {
                    "sent": "So author and he's he's coming today.",
                    "label": 0
                },
                {
                    "sent": "He found this page by searching for query Obama.",
                    "label": 0
                },
                {
                    "sent": "Then we can see that from the referring URL and the visit was done in August 2009.",
                    "label": 0
                },
                {
                    "sent": "And he was using Safari.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Windows PC OK, so the second source of articles of data is articles, So what are the things that people are actually reading on the website?",
                    "label": 0
                },
                {
                    "sent": "And here we have both use both content and semantics about the pages, so the content would be the actual text so.",
                    "label": 1
                },
                {
                    "sent": "Actually text would be this just raw data there from the page and we compliment this by several metadata, someone pinkies annotations which are rather automatically extracted to manually.",
                    "label": 0
                },
                {
                    "sent": "So we have both automatically extracted entities and manually added name entities.",
                    "label": 0
                },
                {
                    "sent": "Litter selected by the editors and authors.",
                    "label": 0
                },
                {
                    "sent": "Then we have a topic.",
                    "label": 0
                },
                {
                    "sent": "So what is the article talking about?",
                    "label": 1
                },
                {
                    "sent": "Foreign politics, opinion, sports and so on?",
                    "label": 0
                },
                {
                    "sent": "Have a metadata.",
                    "label": 0
                },
                {
                    "sent": "So who is the author?",
                    "label": 0
                },
                {
                    "sent": "What kind of article is it?",
                    "label": 1
                },
                {
                    "sent": "What kind of page is it?",
                    "label": 0
                },
                {
                    "sent": "And several other page metadata so?",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the first source of data is user data, so this is provided only for registered users, which is a manual process and the user has to decide whether to go through it.",
                    "label": 1
                },
                {
                    "sent": "In our case, we had around 20% of unique users registered, and as we'll see later we can use machine learning to generalize some of the dimensions.",
                    "label": 0
                },
                {
                    "sent": "Components of this demographic profiles to non registered users and will be in more detail.",
                    "label": 0
                },
                {
                    "sent": "Will be looking in gender, year of birth and household income in this year of birth we.",
                    "label": 1
                },
                {
                    "sent": "Translate it into H so important thing is that data is collected voluntarily, so people opt in and it's since it's on the Internet, so there's no reason why people would be accurate about these things, so it can be quite noisy and this is 1 example form that we can see on the Internet for collecting such data.",
                    "label": 0
                },
                {
                    "sent": "So so basically just a simple form of people go in and.",
                    "label": 0
                },
                {
                    "sent": "Enters gender and so on.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so this is the source of the data.",
                    "label": 0
                },
                {
                    "sent": "Now what do we mean by user segment?",
                    "label": 1
                },
                {
                    "sent": "So for US user segment is a subset of visitors that are visiting website and they are sharing some common characteristics.",
                    "label": 1
                },
                {
                    "sent": "So what would be examples of such common characteristics?",
                    "label": 0
                },
                {
                    "sent": "For example, all the users that are that have a gender male so or domestic another segment would be all the users that are H 40 or above.",
                    "label": 0
                },
                {
                    "sent": "So this would be segments based on the demographics.",
                    "label": 0
                },
                {
                    "sent": "We can also use other features to construct segments, for example referring domain.",
                    "label": 0
                },
                {
                    "sent": "So give me a segment of all the users that are coming from Facebook there to our website or all the people that are reading about travel topics.",
                    "label": 0
                },
                {
                    "sent": "So in this we can see by either referring pages or requested topics of requested pages and we can also have a more fine grained segments.",
                    "label": 0
                },
                {
                    "sent": "We could combine any of this.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Features.",
                    "label": 0
                },
                {
                    "sent": "So how do we define segments as a user?",
                    "label": 0
                },
                {
                    "sent": "So we wanted to make this simple, so 'cause the system we were developing was ended up being used by domain experts.",
                    "label": 0
                },
                {
                    "sent": "So there advertising analysts or so on and our solution was to index all the users so each user.",
                    "label": 0
                },
                {
                    "sent": "That comes to a website is indexed by several fields.",
                    "label": 0
                },
                {
                    "sent": "Inverted index and then this segment definitions definition translates into a faceted search query that the domain experts defines.",
                    "label": 1
                },
                {
                    "sent": "And this allows for Adcock segment definitions, so here is example.",
                    "label": 1
                },
                {
                    "sent": "So here is a list of fields that we index, so we choose a Reese index by several types of URL things, page URL, page title, page content, the domain, so the name entities that is coming.",
                    "label": 0
                },
                {
                    "sent": "He was reading about such term that he was using and location data and demographics.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here are a couple of examples in the interface.",
                    "label": 0
                },
                {
                    "sent": "So for example, this is a definition of a segment of users, so their females with household income between 100 and hundred $50,000 that are at some point reading style section front.",
                    "label": 0
                },
                {
                    "sent": "Another example would be all the people with this decision making titles, job titles.",
                    "label": 0
                },
                {
                    "sent": "Another example would be all the people that are reading about healthcare and Obama and are coming from Twitter to overlap.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Site.",
                    "label": 0
                },
                {
                    "sent": "So next step is the user modeling.",
                    "label": 0
                },
                {
                    "sent": "So once you define a segment we want to develop user model around it.",
                    "label": 0
                },
                {
                    "sent": "So for this we first extract features.",
                    "label": 0
                },
                {
                    "sent": "So feature is a set of extracted from one or more fields so that we extracted from these data sources.",
                    "label": 0
                },
                {
                    "sent": "For example, the demographics page, content, metadata and so on, and we're using vector space model to represent one particular visit and then we to construct the training set we represent front user as a centric.",
                    "label": 0
                },
                {
                    "sent": "Of all the visit vectors.",
                    "label": 1
                },
                {
                    "sent": "And users from the segments are positive class user from sample for the users form negative class and we're using support vector machine to model as a classification algorithm and we're using one particular implementation based on stochastic gradient descent that has inherent support for this sampling.",
                    "label": 1
                },
                {
                    "sent": "So we don't need to compute features for all the users that just for.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um subset.",
                    "label": 0
                },
                {
                    "sent": "And one side effect of this is that we can use SVM as a feature selection.",
                    "label": 0
                },
                {
                    "sent": "So there are some approaches to use them as a feature selection method and we can use this to visualize important keywords for a particular segment.",
                    "label": 0
                },
                {
                    "sent": "So if you look at this category of females with more than 100,000 household income interested in style category on the website, we can then see what are the keywords that are responsible for positive classification.",
                    "label": 0
                },
                {
                    "sent": "Of a user given given user his history into this.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ignant OK, now the experimental setting, so we have.",
                    "label": 1
                },
                {
                    "sent": "We evaluated this approach on major news publishing website with 5 million daily users, out of which one million was registered.",
                    "label": 1
                },
                {
                    "sent": "And we were trying to predict the demographic dimensions, gender, age and income.",
                    "label": 1
                },
                {
                    "sent": "We had three groups of users segregated by the number of visits, so to 1010 to 50 visits or 50 or above visits, and we were using 10 fold cross validation break even point in here at the bottom is the list of the categories.",
                    "label": 0
                },
                {
                    "sent": "So we grouped the H and income category categories.",
                    "label": 0
                },
                {
                    "sent": "Into so the H was grouped into decades, for example.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we check the performance of the algorithm on along several dimensions.",
                    "label": 0
                },
                {
                    "sent": "So just using the context so the location under where the user came from the referring page and the device.",
                    "label": 1
                },
                {
                    "sent": "Then you several content features.",
                    "label": 0
                },
                {
                    "sent": "So texts only keywords name entities or only metadata.",
                    "label": 1
                },
                {
                    "sent": "So topics and organizations that were manually edited added by editors.",
                    "label": 0
                },
                {
                    "sent": "And then combination of this speech.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So first for the gender, so this is data for people with this 10 visits we can see that so 50% would be random.",
                    "label": 0
                },
                {
                    "sent": "So this is the bottom and we can see that by just using the text we come to almost 65%.",
                    "label": 0
                },
                {
                    "sent": "But if you only use metadata, so topics of the pages and.",
                    "label": 0
                },
                {
                    "sent": "Editorially selected, the name entities in the articles and authors we can come up to 70%.",
                    "label": 0
                },
                {
                    "sent": "So for both almost up to 70% for both male and female.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And if you look at the number, if you look at this, how does this improve?",
                    "label": 0
                },
                {
                    "sent": "If increase the number of visits from a user?",
                    "label": 0
                },
                {
                    "sent": "So if you get more of the observations from a particular reason, we see that for Mail it increases from, so people that had at least two visits.",
                    "label": 0
                },
                {
                    "sent": "We are around 6065%.",
                    "label": 0
                },
                {
                    "sent": "And by going to 50 or more visits we see that we come out almost 50, almost 80%.",
                    "label": 0
                },
                {
                    "sent": "For Mail.",
                    "label": 0
                },
                {
                    "sent": "It's interesting that from female.",
                    "label": 0
                },
                {
                    "sent": "So this highly engaged female users that this doesn't increase and this is mostly cause.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "There is A at some point of the map merge with this highly engaged users population, which is either male or female.",
                    "label": 0
                },
                {
                    "sent": "So there's a cloud of both and there's a separate cloud.",
                    "label": 0
                },
                {
                    "sent": "This mill engage users.",
                    "label": 0
                },
                {
                    "sent": "It can be kind of segregated, still away.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then if you look at another Democratic dimension, so the H we can see that it's fairly easy to distinguish young people.",
                    "label": 0
                },
                {
                    "sent": "So from 20 to 30 years and older people, so from 60 to 80.",
                    "label": 0
                },
                {
                    "sent": "But it's very hard to the bottom baseline is random.",
                    "label": 0
                },
                {
                    "sent": "It's very hard to distinguish people.",
                    "label": 0
                },
                {
                    "sent": "So from 30 to 60, so this, and the reason for this, if you would look into the models, is that these are people that are.",
                    "label": 0
                },
                {
                    "sent": "More or less so young people would be more mostly students there.",
                    "label": 0
                },
                {
                    "sent": "At the end it would be retired.",
                    "label": 0
                },
                {
                    "sent": "People in between the what are you reading?",
                    "label": 0
                },
                {
                    "sent": "Mostly depends on your profession and other features and not so much on their age.",
                    "label": 0
                },
                {
                    "sent": "So whether you're 30 something or 40.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Cooking doesn't change much.",
                    "label": 0
                },
                {
                    "sent": "And we can look at the which metadata is important, which, which features are the most important for good classifications, and we see that name entities are extremely useful for.",
                    "label": 0
                },
                {
                    "sent": "Older population so from 6 do category 1680 and that.",
                    "label": 0
                },
                {
                    "sent": "And also for younger population so.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just for the and from the income.",
                    "label": 0
                },
                {
                    "sent": "So for income it's fairly random to distinguish anybody that has a lower medium income.",
                    "label": 0
                },
                {
                    "sent": "The only people that were more or less above random where people with high incomes, 450,000 or more.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the conclusions.",
                    "label": 0
                },
                {
                    "sent": "So we presented approach for modeling user segments.",
                    "label": 1
                },
                {
                    "sent": "We had a user friendly way of defining fairly complex user segments and we used to combine several data sources both for defining the segments and for defining the model and justice little advertising.",
                    "label": 1
                },
                {
                    "sent": "So there's a tomorrow we have a paper at semantic search where it's learning to rank for semantic search where we are using usage data from Wikipedia for ranking.",
                    "label": 1
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Save data.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you.",
                    "label": 0
                }
            ]
        }
    }
}