{
    "id": "zcnpw2cxihokbojwy3nlo5cqqv6pwcro",
    "title": "An introduction to Levy processes with financial modelling in mind",
    "info": {
        "author": [
            "Matthias Winkel, University of Oxford"
        ],
        "published": "Aug. 5, 2008",
        "recorded": "May 2008",
        "category": [
            "Top->Computer Science"
        ]
    },
    "url": "http://videolectures.net/aispds08_winkel_ailp/",
    "segmentation": [
        [
            "Thank you very much for the invitation to speak here.",
            "It's not my usual activity to talk to machine learning people, but with a bit of luck I'll learn something about the interface between probability and statistics and machine learning during the my time here.",
            "So levy processes.",
            "Well, that's where my research is and the application that I have looked into a little bit is in mathematical finance, so I'll give this a little bit of a finance flavor when it comes to.",
            "To the modeling part of the talk, but I'll."
        ],
        [
            "Just spend some time really.",
            "I'm looking at the structure of levy processes so that you get a feeling for for what the modeling freedom really is and how we are modeling using levy processes.",
            "So this is going to involve from some of the technical material related to infinite divisibility and delivery khinchin formula.",
            "But then really with a view towards constructing and simulating.",
            "These these levy processes.",
            "When doing inference later, it is going to be very useful to have some parametric families at our disposal, so I will review some some of these parametric families that have been been studied and used for for applications, particularly in finance, but I mean there's no reason why that would be.",
            "The application that you have in mind.",
            "So in well, this is.",
            "This is the main part of the talk, and when I then turn to to modeling and inference, I'll just look in very very briefly about models more general than levy processes, where levy processes play a key role as driving process of some some other stochastic processes that well can model financial price processes or other quantities.",
            "And if there's time, then I'll talk a little bit about quadratic variation and the problem of of estimating or making inference on volatility in financial.",
            "Data and then, well, this last bit would be some.",
            "Some of the work that I've been involved in about volatility in front, in particular in the in the presence of jumps."
        ],
        [
            "OK, so this first some some motivation historically, why?",
            "Only the process is being studied.",
            "While there's a bottom up reason that you may want to have continuous time analogs or limits of random walks, or indeed generalizations of Brownian motion realizing that Brownian motion is maybe not the very best model for the kind of data that you want to fit."
        ],
        [
            "It has also a top down recent for studying levy processes.",
            "If you're looking at larger classes of stochastic processes, these might be Markov processes or semimartingale, so that you look at for various reasons such as simple dependence structure or that you want to do some stochastic calculus with them.",
            "Then levy processes are prototypes of these and actually a very good idea to study them first and then move into these more general classes of processes if needed."
        ],
        [
            "So other than this, historically the main applications have been insurance through in storage problems, dams in particular, and that's been driving the very early research in direction of levy processes.",
            "If you process this show up in more general context of Markov processes as a means of turning one Markov process into another Markov process by a time change called subordination, and you can study levy processes also because they are related to other Markov processes that you may be interested in, such as branching processes or self similar Markov processes."
        ],
        [
            "More recently, the applications that have driven recent research and put levy processes very much at the forefront of.",
            "Of of.",
            "Visibility in essentially is they come from financial modeling.",
            "We've got no normal returns, and the Black Scholes model says they are normal.",
            "So this leads to all sorts of undesirable effects, such as volatility smiles which are in contradiction with the model that's being used.",
            "So levy processes are a means of addressing such such problems, and you can go further.",
            "Stochastic volatility is another such keyword from financial modeling.",
            "And leverage effects.",
            "So there are models around based on levy processes that can address these these features that that one would like to model in financial applications.",
            "So I've put at the very bottom something that's that's also close to to my research, but I'm not going to touch up on this, which is that the importance of levy processes in population and phylogenetic models, where particularly for large trees that one one looks at there.",
            "One can find Levy process descriptions or interpretations of the of the results in the area."
        ],
        [
            "So the structure of living processes we should define levy processes.",
            "As follows, we are looking at continuous time stochastic processes with three properties, stationarity of increment, independence of increments and kadelak paths."
        ],
        [
            "And what this means is that if we look at an increment of lag S of a levy process, then its distribution will only depend on S. And that being true for all, T&S is what we call stationarity of incriments."
        ],
        [
            "Independence of increments is looking at increments of a disjoint time intervals.",
            "I've chosen to look at consecutive increments.",
            "And we require these to be independent random variables, so we are really building a model from rather basic independent random variables and we can then specify joint distributions based on these two.",
            "Parag"
        ],
        [
            "Times so kudlock paths is a technical condition.",
            "You might replace that by stochastic continuity.",
            "It's not really very very relevant for us.",
            "It sort of means that we can look at the random function as well as the collection of random variables.",
            "So we want right, continuous and past paths with left limits just to be to be definite here.",
            "OK."
        ],
        [
            "So.",
            "I haven't said what the state space is.",
            "Well, this definition makes sense in very high generality.",
            "If you have something like a locally compact topological group then this is a meaningful definition.",
            "But of course we're going to focus on on real valued processes and well possibly extensions to K dimensional Euclidean space.",
            "So you can have two or three dimensional processes if you think of financial applications, then you may just have lots of assets and you want to study.",
            "Their joint evolution and we can set up levy process models in that space which has the dimension.",
            "As the number of assets."
        ],
        [
            "So many examples that you will have come across.",
            "I, I suppose is Brownian motion, where we have normally distributed increments.",
            "And the person process where we have person distributed increments.",
            "Notice that the properties of stationarity and independence of increments are related to the fact that we have and the parameters just be linear in T here.",
            "So I've got two simulations of Brownian motion and Opossum process for you to look at here.",
            "What we can do is calculate moment generating functions that characterize these distributions.",
            "This is something of course very very elementary here that nevertheless leads to a form that we're going to see in the more general case of of an arbitrary levy process later on.",
            "So.",
            "The."
        ],
        [
            "Next main example to construct levy processes is going to be the compound Poisson process.",
            "The compound processing processes built from a possum process N, as we've just looked at and a number of independent and identically distributed random variables.",
            "So we sum up as many of them by time T as the possum process tells us.",
            "So the evolution of this process is then to start from zero and then make that jump A1, then do nothing until the possum process.",
            "Jumps to tube and by which case we we add the random variable A2 to our process and we get this evolution.",
            "So to calculate this moment generating function we need to do a little bit more work.",
            "And one way of doing it is to condition on on the value of NT.",
            "If we do this, then the random variable that we are looking at is just the sum of N independent identically distributed random variables and the moment generating function of one of such a sum of random variables is just the NTH power of the moment generating function of the random variable.",
            "And what we're looking at here for our moment generating function that we are interested in.",
            "Is a.",
            "An exponential series that we can write as exponential well and then we get this maybe slightly strange term of T Lambda into expectation E to the gamma A 1 -- 1.",
            "Well, that minus one and we can actually."
        ],
        [
            "Move that bracket over here, 'cause the expectation of one is 1 and what we're looking at here is an integral of E to the gamma X -- 1.",
            "Integrated against the distribution of the random variable A1, and this is a key observation that we will get back to."
        ],
        [
            "So.",
            "Levy processes are.",
            "Our process is with some strong properties and one of them is infinite divisibility.",
            "The definition is that a random variable is infinitely divisible.",
            "If you can write it as the sum of N independent, identically distributed random variables for all N greater than or equal to two.",
            "Now the meaning of this is that the distribution of YJN will depend on N but not on J. OK, so such a property you can sort of cut down your random variable and consider it as the sum of smaller pieces."
        ],
        [
            "That's a property that our levy processes have been cause.",
            "If we look at XT.",
            "Then we've got that stationarity and independence of increments so we can actually take as YJN increments of lag T / N. And if we take the consecutive increments here, then summing over these we get a telescoping sum, which means we are left with the first term for J = N and the second term for J equals one.",
            "And that means we fall back onto XT.",
            "Well.",
            "But we know that these random variables here are identically distributed and independent, so this is showing.",
            "The.",
            "Infinite divisibility of of Levy processes their distributions."
        ],
        [
            "OK, well this is probably the most technical part of the talk.",
            "Infinite divisibility had been studied and there is this this complicated looking formula.",
            "The levy khinchin formula which tells us that every infinitely divisible random variable has a characteristic function of this form.",
            "Well, we've got parameters, or rather characteristics.",
            "Mu is in the negative.",
            "Israel Sigma squared is non negative and knew is a measure on the real line but not charging zero which has some integrability condition which means that it may be a finite measure or it may be infinite, but if it is then it still integrates X squared around 0.",
            "So this is, this is what that result tells us, and rather than looking at characteristic functions, we could equally well be looking at moment generating functions provided these exists and we get exactly the same formula with all its eyes replaced by gammas.",
            "OK, so we've got that term here in red, which is going to play a very important role when constructing."
        ],
        [
            "Levy processes.",
            "Nevertheless, yes.",
            "Of the variable X in that case.",
            "You have a measure XDX have some intuitive that X has a meaning that acts sort of corresponds to the jump sizes of the process, so new is a measure that will be related to jumps as we will as we will see.",
            "But first, let's look at this formula to sort of explain where things are coming from.",
            "So if we just look at that first term, this is what we ricalde as the moment generating function of the normal distribution.",
            "So we're really looking at a normal random variable plus something."
        ],
        [
            "Now that's something else we've also seen.",
            "At least part of it when we were looking at the moment generating function of the compound person process, we were looking at the distribution of the jumps of the compound person process and we had that integral of E to the gamma X -- 1 against that distribution.",
            "So again we know what this meaning is and we make that identification of X as the jump size and then.",
            "Then, in the sense of the compound for some prices.",
            "But there's no."
        ],
        [
            "More and well, that more is essentially something that we also understand.",
            "May cause what this new is doing is just shifting by mu.",
            "If you look at the moment generating function of of constant mu and you get exactly that term, there's no randomness and this is another such term which is a multiple of gamma.",
            "That's what what characterizes this interpretation?",
            "So we're really looking at something constant here, except that."
        ],
        [
            "The integral as it stands does not converge separately for this part, and for that part in general.",
            "So that's where where this term has a second interpretation, not just as as shift by a constant, but as convergence generating term in this in this integral and we need to carefully look at how that convergence translates into properties of the."
        ],
        [
            "Of the levy process that we're going to construct associated with such an infinitely divisible distribution?",
            "So what I've I've talked you through was to say, well, a random variable, an infinitely divisible random variable is the sum of a.",
            "Normally distributed random variable of a compound Poisson distributed random variable.",
            "While there were some problems with this with this integrability near 0, if this is to be a distribution, it has to be a finite measure.",
            "But this measure in general can be infinite.",
            "But what we can do is restrict attention to.",
            "To the range of X values outside the interval minus one one.",
            "This is the interpretation of these accesses jump sizes, so we are looking at big jumps and that C1 here now in my representation is.",
            "Coming from my compound processing process with jump distribution that knew restricted to minus one one compliment so the big jumps are being generated and they're being put into C1.",
            "That Lambda was the rate of our person process and the interpretation in our formula.",
            "I mean the Lambda was just sitting as a factor to this term.",
            "So we just move it out of the knew when we normalize it and really identify that compound fossil component.",
            "Here the small jumps that we've forgotten about.",
            "Here they are the term that's most problematic here.",
            "But what we can do is not just do this argument for jumps greater than one, but we can do that argument for jumps greater than epsilon for any small epsilon, and we can construct such a compound for some process.",
            "I've now chosen here jumps.",
            "Of sizes between epsilon and one in absolute value with distribution, just as in this case, the restriction of our measure knew 2 -- 1 epsilon minus epsilon and epsilon up to one.",
            "We've got a rate associated which is the.",
            "The measure evaluated on that strip from epsilon to one in absolute value, and for every epsilon this quantity makes sense.",
            "But to construct the.",
            "The random variable M1 we need to let epsilon tend to zero, and there's some technicalities in form of an L2 limit.",
            "This can be made mathematically precise.",
            "OK, so this was just to say that an infinitely divisible random variable has such a structure, 'cause we recognize the ingredients.",
            "But of course we can now use this this."
        ],
        [
            "Construct a levy process along the lines that I've I've explained on the previous slide to take a Brownian motion to give us that normally distributed.",
            "Part of our levy process that involves the parameters mu and Sigma.",
            "I've chosen to write that BT that we had earlier as Muti Plus Sigma WT, where W is a standard Brownian motion with zero mean and variance equal to T at time T. And that taking a factor and a shift is then explicit in our representation here.",
            "The CT as I said, is the compound for some process of jumps of size greater than one and the.",
            "Empty epsilon that we need before we pass through the limit is such a compound for some process where we had to subtract something in order for it.",
            "Characteristic function to have the form that we had.",
            "Why do you care?",
            "It is.",
            "It was interesting.",
            "Why is it interesting?",
            "What we've seen is that any levy process has an infinitely divisible distribution.",
            "So just from the assumptions of a levy process, we got that information.",
            "So if we take any other distribution that's not infinitely divisible, such as the uniform distribution, then we cannot construct a levy process with that distribution as marginal distribution.",
            "So there are restrictions that we need to be aware of before we can model using levy processes.",
            "What?",
            "Search process and we see in the end statements of his heart, his condition for true food.",
            "There.",
            "Do I get the.",
            "What happens well, what I'm doing here is I'm taking an infinitely divisible distribution.",
            "I'm taking its parameters Mu Sigma squared and you.",
            "And in that framework, I can construct the levy process if you give me a distribution like the uniform distribution, then I wouldn't get anywhere near this, 'cause I wouldn't know how to get started.",
            "I can't, I can't set set up any part of this formula becausw my distribution is not infinitely divisible.",
            "That doesn't give me a mu Sigma squared and and you and I cannot do this construction, so it fails at the very beginning of having that distribution and not knowing what to do with it.",
            "OK, but for good.",
            "The financial time series, yes.",
            "Do or do I not want to?",
            "OK, well I would say you do want to do that.",
            "There are other models around.",
            "Why would you want to do it?",
            "Becausw Brownian motion is not good enough and we need other models and the levy processes are a model that is reasonably tractable.",
            "You can do calculations with levy processes that you cannot do with more general classes of stochastic processes.",
            "Tractability's is one reason.",
            "And of course, better model fit, right?",
            "That's the starting point.",
            "OK, so here we've got a way to construct our our levy process with a given infinitely divisible distribution as marginal distribution.",
            "So we've got lots of of compound.",
            "For some processes, one for each epsilon you let epsilon tend to zero.",
            "Course what you can say is for a rough approximation I fix a small epsilon and that's what my approximation of the levy process is."
        ],
        [
            "Going to be weaken slightly rephrase this and say well making Absolon smaller is something that we can do iteratively.",
            "We can fix our epsilons, I call them am here and we can.",
            "We can sort of decrease more and more to get a better and better approximation of our levy process that we actually want to consider, and we can sort of keep the previous steps of approximation and justice.",
            "Add more jumps.",
            "We've sort of started with with all jumps that are greater than one.",
            "Then we add a compound person process that contains all the jumps between one and say 1/2.",
            "Then we take another one that takes all the jumps between 1/2 and 1/4 and if we keep going.",
            "And pass through a limit.",
            "Then that quantity is going to.",
            "Construct precisely a levy process and saying we stop at some finite value is saying, well, that's where the approximation is good enough, we stop.",
            "OK, so I've I've put in red for a couple of slides now that compensation of small jumps.",
            "I've already said that it's sort of necessary for the convergence of this integral because we say we want to integrate X squared at zero.",
            "But if you just look at this term then this behaves like X at 0, and that's not good enough.",
            "It has to do.",
            "Behave like X squared, so we take away essentially the first term and the second term of the expansion of E to the IXIX here, so that is needed in general.",
            "But of course if we have a stronger condition of integrability of modx, then we do not need that term.",
            "And what we can do is we can move that term."
        ],
        [
            "Into the drift term because it was of that precisely that same nature a multiple of PSI.",
            "So that's one case where we can simplify our our formula.",
            "The other cases where we have a stronger integrability condition at Infinity at Infinity, this function is constant one.",
            "But if we can actually also integrate MoD X There, then what we can do is we can drop that indicator.",
            "And."
        ],
        [
            "Move the.",
            "The resulting error by integrating over the whole range now again into the into the mu term at the beginning and we get another simpler representation for our infinitely divisible distribution."
        ],
        [
            "OK, so that is how the compensation is.",
            "Can be slightly twisted now.",
            "What is that compensation doing?",
            "Here's an example.",
            "If we take mu and Sigma squared equal to nought, let's put ourselves into the situation where we've compensated all jumps as we call it.",
            "So we're looking at GNU double prime and let's take a knew that has that.",
            "We can take your ability of X squared times new DX being finite at zero, but does not have the property that MoD X is integrable at zero against knew.",
            "So what that means is that in our approximation we've got these compensating drifts that report we can explicitly calculate what they are if we take epsilon equals 1.3 point 1.1.",
            "In our aim to approximate the levy process, then these drifts are going to be .845, two .55, nineteen, etc.",
            "And effectively that's going to increase to Infinity as absolom tends to zero.",
            "OK, so we're really looking at at a very steep slope.",
            "That's the interpretation of this this term here.",
            "As epsilon is equal to 1, the slope is fairly fairly weak, but as we increase our the.",
            "The quality of our approximation, the slope is getting steeper and steeper, and here you already.",
            "You can't really see what what is slope and what are downward jumps, so you've.",
            "You've also reached a kind of reasonably stable regime passing from here to here.",
            "There's not much change in the picture meaning that although you've added up lots of small jumps, you have also put down a constant.",
            "Time to compensate them and that makes makes the well they cancel each other out essentially.",
            "So really taking .014 epsilon here is going to be good enough for any reasonable purposes of of an approximation.",
            "One can of course quantify that and.",
            "Say within what limits we are in this approximation, but I'm not going to guess.",
            "Good to have a good enough proximation or to learn, and it's just like a private as you said.",
            "Well, I mean, you can work out what what the variance of the difference is and if you want to just control that variance of the difference, that's that's something you can do.",
            "In special cases you can go further.",
            "You can say, well, I want that to be.",
            "Within.",
            "Say plus minus Delta at the end.",
            "So So what you do is you.",
            "You make that the probability that that the error that you commit by omitting the small jumps is greater than Delta is less than the small.",
            "A small value so you can.",
            "You can sometimes calculate these quantities explicitly, or do do some further simulations to assess them.",
            "So there's methods around to really decide how good an approximation is."
        ],
        [
            "OK.",
            "So.",
            "These discussions so far actually give us ways of simulating levy processes.",
            "We can simulate by time discretization.",
            "Certainly if we have reasonably explicit knowledge of the distribution of our process at time Delta, then we can calculate the inverse distribution function and by standard method generate random variables, YK with distribution X Delta.",
            "And if we sum them up, then our levy process is going to be.",
            "We some such as some evaluated at integer part of T over Delta, so that's a sort of in a talk approximation of a levy process, but requires knowledge of the distribution of X Delta.",
            "So what we've done is not start from that such a distribution, because we would have had to check that it's infinitely divisible, etc.",
            "But we've said, well, really, infinitely divisible distributions are characterized by mu Sigma squared, and you and we can construct such levy processes, and we can use that information of how to construct them to simulate these levy processes by throwing away all small jumps.",
            "That is, by fixing an epsilon.",
            "And by taking the approximation that we've seen to level up to threshold absolom so in.",
            "Practice.",
            "This would mean that what we need to be able to calculate is something like the inverse distribution function of the jump size distribution rather than the increment distribution of the levy process, and then we can simulate two quantities, then simulate the for some process that tells me how tells us how many jumps we've seen by time T, and that's awesome process of rate.",
            "Lambda, epsilon, zed, K. Are the exponential interarrival distributions of the person process and then we can simulate the jump sizes and we can add up the jump sizes to form our well compensated.",
            "Compound person process.",
            "So here this is exactly the same method as what we were using to generate the.",
            "The increments in the in the first method, so this is of course still something very general for specific distributions you can can use some tricks or some some approximations of this of this inverse distribution functions from the what we need here is only a way to generate to generate random variables with a given jump size distribution that's determined by our.",
            "Measure knew."
        ],
        [
            "OK, so that simulations one can improve simulations.",
            "By saying, well, we've thrown something away so we can at least try a variance correction.",
            "Our random variable, Now that's approximating the levy process, has a smaller variance.",
            "So would it be appropriate to add something to increase that variance?",
            "And there's a result by Asmussen and Rosinski, which says that if we have a levy process and lets us implicitly take the Brownian motion component out, then we can sort of say whether it's appropriate to add a multiple of Brownian motion to reflect all the small jumps thrown away.",
            "'cause after all, what is a process that's making very very many very small movements?",
            "Well, it ought to be a Brownian motion, because that's what.",
            "Or Brownian motion approximates in in the sense of the normal distribution always arising.",
            "If you've got contributions of lots of independent.",
            "Identically distributed bits central limit theorem well, but here it turns out that there's actually a condition needed for such an approximation to be valid, and that condition looks at at this integral of X squared new DX from minus epsilon to epsilon, and if that increases more quickly than epsilon squared, then we get an approximation of the bit that we've.",
            "Thrown away, this is what we want to simulate.",
            "This is what we do simulate, so the difference is our error and we divide that by its variance and it converges to Brownian motion under that additional condition.",
            "So what we should then do is slightly modify the method two of throwing away the small jumps and adding something to replace the small jumps that something being a multiple of an independent Brownian motion.",
            "OK, so this is sort of a slight risk."
        ],
        [
            "Feynman tavour have our simulation methods.",
            "Now, some parametric families.",
            "We've already seen Brownian motion as a very particular example, Brownian motion manasu, as we've now seen as the only levy process that has continuous sample paths.",
            "All the other levy processes were constructed by adding some.",
            "Sort of compound for some process of jumps and then passing to limits so they'll always be jumps in any other levy process.",
            "Some explicit distributions that are infinitely divisible include the gamma distribution, so we can consider a gamma process with gamma increments.",
            "It's going to be an increasing process, or we can take differences of two gamma processes.",
            "It's easily seen that that all is also a levy process, which is called the generalized variance gamma process.",
            "We can.",
            "Have some more sophisticated ways of constructing levy processes.",
            "The normal inverse Gaussian process is such an example where we take a 2 dimensional Brownian motion that we run until it exceeds a threshold in one of its and coordinates, and then we look at where the process is in its other coordinate and that random variable.",
            "The Second Brownian motion evaluated when the first Brownian motion exceeds a threshold.",
            "As that threshold varies, that gives us a process that turns out to be a levy process, and it's called the inverse Gaussian normal inverse Gaussian levy process, because we're sort of taking an inverse here of the Gaussian process and that Brownian motion here and then, we take and sort of make that the variance of the normally distributed other Brownian motion.",
            "That's where that name comes from.",
            "So these are processes that we can construct, and distributions that we can describe without worrying about infinite divisibility.",
            "Really, while we do, but we don't need to go into specifying mu Sigma squared and knew here because we've got other means of seeing that we've got infinite divisibility, which is that that gamma distribution if you add up to gamma variables with the same beta, you get another gamma variable.",
            "And if you if you look at this construction with some care, you see that you've got a strong Markov property which tells you that again, this IT process is a process with stationary independent increments, and that property translates to that same property of ZT.",
            "So advantages of this is that we get reasonably explicit densities and that is very useful for parameter estimation.",
            "Here we've got these three parameters or the four parameters that.",
            "Of course, if we want to do modeling, will need to be fitted.",
            "So.",
            "Disadvantages are that, well, we haven't exactly got a lot of modeling freedom, and it's actually not so clear how with such approaches you generate more general levy processes, so this construction that we've gone through now is really coming and bear fruit when we say, well, why don't we use mu Sigma squared and knew for the modeling?",
            "What are natural classes of.",
            "Mu Sigma Squared knew particularly new want that would give natural levy."
        ],
        [
            "Processes so well, I forgot that I had some simulations of these just for you to look at.",
            "So here let's look at the gamma process we can.",
            "Vary the parameters I've chosen Alpha equals beta because anything else would just have changed the scale said of the scaling of our of our pictures.",
            "So this is the behavior what gamma processes can express something that's pretty much dominated by the very big jumps, and you'll see smaller jumps there.",
            "Infinitely many jumps.",
            "In fact they are no longer visible at this scale.",
            "And then as you increase the parameter you see that.",
            "The individual jumps are becoming more and more important of similar sizes, and as you increase further and further, you get a convergence to a linear drift.",
            "Eventually that's a sort of strong law of large numbers behavior that you see here in these classes of gamma processes looking at variants, processes, we take differences of two such independent processes.",
            "And."
        ],
        [
            "Then again, I've chosen a certain relationship between the parameters in order to keep the variance of the variance gamma process the same all the time, and so again what you see here is the range of possibility that the.",
            "Well, the symmetric variance gamma process can can achieve.",
            "So again you see very much dominance by by the of the picture by the biggest jumps for small parameters and for bigger parameters you see another convergence.",
            "This is a convergence to Brownian motion instead of central Limit theorem.",
            "Within the class of variance gamma processes.",
            "And you might say, well, what we're looking at here is really we zoom into into a variance gamma process here to see such a picture and resume out to see such a picture.",
            "So that's aggregate normality.",
            "That's quite useful for financial time series, because in the very long term the normal distribution is not all that bad.",
            "But when you have a reasonably short horizon, it's just not not very useful.",
            "There's other problems if you take 2 short in horizon and look into intraday behavior than any of these models is inadequate anyway, but I'll get to the."
        ],
        [
            "If I have time at the end, so I was saying really our modeling freedom comes from specifying the characteristics rather than the increment distribution.",
            "So famous earlier examples have been stable processes that have been studied for their scaling relation, where the distribution at a time 80 can be derived from the distribution at time T just by multiplying a random variable by by a constant.",
            "So such processes can be obtained by specifying in maybe the simplest possible way, the density of the measure knew, so you just take powers of of X as densities, so that makes sense for Alpha between zero and two.",
            "I've separated out the two cases here in order to be explicit about what kind of compensation we use.",
            "Here, we don't need to compensate any jumps.",
            "And here we can compensate all jumps.",
            "Other than that, the two are the same.",
            "There's also Alpha equals one, which looks a little different and Alpha equals 2, which is very different, which is Brownian motion.",
            "Then maybe more interesting Lee is a class of processes which is sort of the next most natural where you've got both a a polynomial term and an exponential term, where of course, this polynomial term describes the behavior near 0 and the exponential term describes the behavior near Infinity in the one case and near minus Infinity in the other case.",
            "So you've then got a a certain number of parameters.",
            "There's five parameters.",
            "In this, in this density of our measure knew, and that gives us quite a bit of modeling freedom just out of out of such simple definitions.",
            "Here you could go on and take linear combinations of these, or take any take your favorite function on the real line as soon as it satisfies this.",
            "This integrability condition of 1 minimum X squared and you can take it as well.",
            "If it's not negative as well.",
            "You can take it as the density of the measuring you, so that's a lot of freedom.",
            "And disadvantage then, of course, is that if you then ask to fit your model to data, then well, the probability density function is not available in closed form.",
            "You can have some integral representations or some you can invert some characteristic functions or moment generating functions and and you've got a way of doing the the model fitting.",
            "But it's sort of a little less elementary then then by modeling the increment distribution.",
            "I've got some."
        ],
        [
            "Simulations of stable processes, so you see again very similar behavior in the symmetric case for small value of Alpha we get very much pictures dominated by small jumps for large values of Alpha 1.8.",
            "Is this one.",
            "Here you get something that is moving closer together, and if you let Alpha 1:50 it.",
            "Actually, some sort of continuity that makes this converge to a Brownian motion again."
        ],
        [
            "So in the There's another interesting class of stable processes where you've only got positive jumps or only got negative jumps, as the case may be.",
            "Here is positive jumps, then we've got due to our compensation rule for Alpha between zero and one.",
            "We were not compensating and you jump, so we're really just adding up jumps in this process and it's dominated by by big jumps as Alpha moves across one.",
            "We can compensate and do compensate all jumps.",
            "And then we get a behavior that that has drift downwards, but in that infinite sense that I've been been looking at in an example and upward jumps again, big jumps being being quite dominant here.",
            "And well, this is.",
            "This is what this table processes then look like."
        ],
        [
            "OK, so that's modeling levy processes themselves.",
            "We can go further once we've got levy processes because they are semimartingales.",
            "Essentially, we've got stochastic integration at our disposal.",
            "We can look at stochastic integrals, either of deterministic functions, which means that we take these increments or the jump sizes and according to Winner Jump happens.",
            "It's scaled by that function F, or we have a stochastic process that sort of interacts with the randomness of our levy process.",
            "Or has some additional randomness in it and?",
            "That gives us.",
            "Gives us another form of models that that we can form from levy processes where the levy processes sort of the bid with stationary independent increments.",
            "So over any little time interval it's feeding in in dependently some randomness of the same type, so it's giving some sort of stationary flavor to the process, but the cube can then of course make some dependence between.",
            "Between neighboring increments of the of this stochastic integral.",
            "So an example of such such a model, while actually off the first model here, is the class of Ornstein Uhlenbeck processes, non Gaussian on central bank processes.",
            "More precisely we can define Whitey to be such an integral from North to TE to the minus, Lambda T -- S the excess.",
            "What is this process doing while this process?",
            "Instead of, well, if we look at a compound for some process in particular, then our processes starting from wynaut and it's decreasing exponentially.",
            "And when the 1st jump happens that jump well if it happens at time T then then the T -- T is equal to 0.",
            "So we're really multiplying by one that Trump of our levy process X is taken just as is and added to our to our process and then.",
            "There's the again this exponential decay, which steps in and it's sort of an interaction between that exponential decay and the upward jump.",
            "So if there are lots of jumps, then it can go very high up, but also slopes down very steeply and we get an interesting class of processes that sort of returning to determine value all the time.",
            "So it's a mean reverting process that's quite useful.",
            "You can get a stationary regime and.",
            "And use this to models processes that ought to be stationary."
        ],
        [
            "So there are other classes of levy driven stochastic processes we can look at stochastic differential equations or we can look at time changes where we somehow change either the scale of our process or the speed at which the process travels and that gives gives larger classes of of stochastic processes based on."
        ],
        [
            "On levy processes.",
            "So if we now move more, particularly towards modeling financial price processes, and of course this is starting from the Black Scholes model, which is taking geometric Brownian motion as a model for a stock price.",
            "And this is a model that's being used in practice a lot, because it's just so tractable.",
            "You can do very quick and efficient computations and value lots of options overnight.",
            "And that is.",
            "That is still making this model.",
            "The only model that's that's of any practical use essentially, but on the side you really need other models 'cause there's abundant empirical evidence that financial price processes are not normally distributed.",
            "These while returns or log returns.",
            "They they are the quantities that where this model claims they are normally distributed and, well, we need to really address that.",
            "And say, well, if they're not, then maybe what we should be looking at is a so-called levy market model, where we take instead of Brownian motion levy process in the exponent of this of this process.",
            "So these are levy markets, that's."
        ],
        [
            "One step in one can go further.",
            "There's more problems with the Black Scholes model and what the markets do is just focus on the return distribution.",
            "You can then argue well, there's also evidence against independence of increments that leads to the looking at stochastic volatility models.",
            "Some leverage effects and you can set up models to address.",
            "To address this, let me just look at one example here, which brings in our own standalone back process, again bound of Nielsen and Shepard introduced such a model.",
            "It's only one in many, but it's one that that sort of fits.",
            "Our framework of levy modeling, so you can take your Brownian motion and rather than having a constant volatility, have a stochastic volatility process where that stochastic volatility process is.",
            "The Ornstein Uhlenbeck process that I introduced earlier.",
            "It had better be non negative so we achieve that by taking zed and increasing levy process.",
            "So this is this is a model which has that behavior that I've described for that oh you process on the level of volatility.",
            "So what does that mean?",
            "Well that means we've sort of got upward jumps.",
            "You can think that's when information is coming in saying.",
            "Well the company releases, it's it's.",
            "It's quarterly report or there's somebody saying, well, that company really doesn't do very well and lots of people go to the market and that's just increasing the activity at which the otherwise Brownian model then evolves.",
            "So you get an increase in activity and that slows down as time goes by until the next piece of information is is released and.",
            "Yes, independence.",
            "Negatives of squared or absolute increments?",
            "Or are you talking about she imagines of English?",
            "I'm talking about actual independence of increments, as in the definition of our levy process.",
            "OK, OK. That's what we're already.",
            "Processes have by definition.",
            "And now we're saying, well, if we look at market data then we consider study correlation of adjacent increments or sum of higher form of independent of dependence.",
            "Square.",
            "OK, so.",
            "Right, I mean what you probably mean is correlation of increments.",
            "That zero correlation is quite quite OK, but the squares have have have correlation.",
            "Yeah, so.",
            "Anyway, so this is this is our interpretation of this model and."
        ],
        [
            "Well, that model.",
            "Setup is something that we've then also studied in our work.",
            "So how much time?",
            "They use 5 minutes?",
            "Yeah, that's that's certainly certainly enough to now now.",
            "Just just briefly indicate that that little contribution that I've made together with all the band of Nielsen and Neil Shepherd.",
            "So the framework is the following.",
            "The volatility process cannot be observed, So what you see is the price process and the price process.",
            "Well, contains information about the volatility process, but does not a priore allow you to?",
            "Via simple transformation, get back that volatility process.",
            "So what we then want to do is find information about the volatility process Sigma S from the price process Y.",
            "And what one can do is common can look at increments of the Y process and raise them to certain powers.",
            "If that power is 2, then this stands some chance of converging to some sort of quantity involving squares over there.",
            "What I've done instead is I've taken adjacent increments M of them, and I've raised each one of them through a power 2 / M. Now that's a quantity that's quite complicated, but it's.",
            "Purely described in terms of the prices that you can see at a lag of Delta.",
            "So there's two to the minus 10 should be a Delta early here.",
            "So that in fact converges to an integral of the volatility process.",
            "This quantity here in the case of a continuous stochastic process is called the quadratic variation of that process and has been studied in probability theory as well as in the financial applications.",
            "So what we see here is a way of finding information about the volatility process.",
            "Well, we don't know how good such an approximation is.",
            "We can't let Delta 10 to 0 really.",
            "'cause of market microstructure locali these paths are constant and the approximation actually only works because very assuming that paths have fat Brownian behavior at all scales.",
            "So we need to somewhere stop at a finite Delta and it's sort of important to know well how far off are we going to be so.",
            "To get a feeling for that, she sort of take the difference.",
            "Redscale appropriately, and indeed there is a central limit theorem under slightly more restrictive assumptions were still pretty general.",
            "That give us precise information about the amount of error that we commit by using this as the integrated volatility prices, so this is in a model with continuous paths an hour."
        ],
        [
            "Contribution has been really to study how far we can push such results when we have.",
            "A part of our price process which is no longer why but which is S now where we've added an independent levy process or on standalone back process or something with reasonably levy like like jumps and the result that we've obtained is that there is a sort of Alpha that matters in the modeling of our levy process.",
            "We've studied that integrability with conditions gamma equals one or gamma equals 2.",
            "But of course anything between.",
            "Is something where sort of the upper limit might might sit by which we get a finite value for that integral, and that Alpha quantity which is by the way the Y in the CGM Y process that turns out to be important in order to say that we can still.",
            "Make inference on our our volatility process.",
            "We've got convergence in probability essentially under no conditions, Alpha less than two just exclude some weird processes.",
            "That's not a restriction, but if you want a central limit theorem, we need two things.",
            "We need Alpha less than one, which is restricting quite seriously.",
            "Our modeling freedom, and we need a further restriction on M essentially, But we can sort of then tweak tweak M so that it lies between these bounds.",
            "And we then have a central limit theorem and can make inference on the stochastic volatility in a model that's sort of perturbed by by a levy process."
        ],
        [
            "That's it, I've got some references here.",
            "If anybody would like to to look at either theorie or this particular application that I've been talking about.",
            "OK, it's OK, thank you.",
            "Questions any other questions with time for one or two questions?",
            "About stochastic withdrawal.",
            "Because liquation program.",
            "By these poses, I know them got some frozen promotion form were useful plus of feeding times from the prophecies, unfaltering if there are processes with, for example, Porsche on a driving components which have some coffee, dimensional transistor density statistiques, finite dimensional of finite dimensional world.",
            "Sufficient statistics?",
            "Ford Transit, some density is all.",
            "In the same sense as the Goshen processes are very useful class and they correspond to problem motion linear differential equations.",
            "Question process instead of the motion.",
            "Do I have some class of differential equations where I calculate so you're talking about the the partial differential equations associated with with Brownian motion, while there's an analog which would not be a, we would not be at differential equation, but which would be an integral equation, because these terms that.",
            "Model that jumps if you look at the generator of a levy process, then it's no longer a a differential operator, but it is an integral operator, so you get a support one, cause nonlocal term and there's a study of integral operators that can be pushed to a certain level, but not anywhere as far as as what the.",
            "The situation for Brownian motion allows you to do.",
            "Is that?",
            "Is that the right direction or?",
            "Power transistor density point was ordering stochastic displays.",
            "Just wondering if there exist classes so liberal causes driven differential equations which would have closed form transition densities.",
            "For example.",
            "Well, the clothes from transition densities are the increment distributions for levy processes, so we've got some examples where they are explicit they are the parametric families.",
            "The first group of parametric families such as the variance gamma processes the normal inverse Gaussian processes.",
            "Where you've got some reasonably explicit densities, it may involve some Bessel functions or so, but but it's explicit.",
            "So they are very useful in impractical in first.",
            "So yes, OK. What yes?",
            "Yeah, there's."
        ],
        [
            "Integral of X power gamma is like more what is gamma?",
            "Gamma is.",
            "You're sort of looking for the smallest gamma for which for the highest.",
            "The smallest camera for which you've got this integrability.",
            "It can be less than one.",
            "Yes, it's.",
            "I mean what we always have.",
            "Is integrability of X squared nude X?",
            "That's our condition that we need in order to construct the levy process.",
            "What we said is that if we have integrability of X near X, then we can forget about compensation and we can go go lower than this and that gives us gives us strong integrability.",
            "For instance, for the gamma process you'd get gamma equal to 0 here.",
            "What are the countries speak at?",
            "This pace is not replacing?",
            "OK, well, we're not really worried about about the norms associated.",
            "It yes, but.",
            "But that's not why we're looking at this.",
            "It's more about summability of jumps and being able to some certain powers of jumps.",
            "As far as I recall, this game, mixture of Gaussian and Wilson process yes.",
            "Of course, the most important things about this particular.",
            "Processes as a continuous spectrum and also has discrete yes, so any reflections.",
            "Well, I constructed that most general levy process from a Brownian motion and a limit of compound person processes.",
            "I haven't really looked at spectral properties, that's not the area that's close to what I've been working on, but.",
            "Yes, this is certainly a lot is known about this."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you very much for the invitation to speak here.",
                    "label": 0
                },
                {
                    "sent": "It's not my usual activity to talk to machine learning people, but with a bit of luck I'll learn something about the interface between probability and statistics and machine learning during the my time here.",
                    "label": 0
                },
                {
                    "sent": "So levy processes.",
                    "label": 0
                },
                {
                    "sent": "Well, that's where my research is and the application that I have looked into a little bit is in mathematical finance, so I'll give this a little bit of a finance flavor when it comes to.",
                    "label": 0
                },
                {
                    "sent": "To the modeling part of the talk, but I'll.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just spend some time really.",
                    "label": 0
                },
                {
                    "sent": "I'm looking at the structure of levy processes so that you get a feeling for for what the modeling freedom really is and how we are modeling using levy processes.",
                    "label": 1
                },
                {
                    "sent": "So this is going to involve from some of the technical material related to infinite divisibility and delivery khinchin formula.",
                    "label": 0
                },
                {
                    "sent": "But then really with a view towards constructing and simulating.",
                    "label": 0
                },
                {
                    "sent": "These these levy processes.",
                    "label": 0
                },
                {
                    "sent": "When doing inference later, it is going to be very useful to have some parametric families at our disposal, so I will review some some of these parametric families that have been been studied and used for for applications, particularly in finance, but I mean there's no reason why that would be.",
                    "label": 0
                },
                {
                    "sent": "The application that you have in mind.",
                    "label": 1
                },
                {
                    "sent": "So in well, this is.",
                    "label": 0
                },
                {
                    "sent": "This is the main part of the talk, and when I then turn to to modeling and inference, I'll just look in very very briefly about models more general than levy processes, where levy processes play a key role as driving process of some some other stochastic processes that well can model financial price processes or other quantities.",
                    "label": 1
                },
                {
                    "sent": "And if there's time, then I'll talk a little bit about quadratic variation and the problem of of estimating or making inference on volatility in financial.",
                    "label": 0
                },
                {
                    "sent": "Data and then, well, this last bit would be some.",
                    "label": 1
                },
                {
                    "sent": "Some of the work that I've been involved in about volatility in front, in particular in the in the presence of jumps.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so this first some some motivation historically, why?",
                    "label": 0
                },
                {
                    "sent": "Only the process is being studied.",
                    "label": 0
                },
                {
                    "sent": "While there's a bottom up reason that you may want to have continuous time analogs or limits of random walks, or indeed generalizations of Brownian motion realizing that Brownian motion is maybe not the very best model for the kind of data that you want to fit.",
                    "label": 1
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It has also a top down recent for studying levy processes.",
                    "label": 0
                },
                {
                    "sent": "If you're looking at larger classes of stochastic processes, these might be Markov processes or semimartingale, so that you look at for various reasons such as simple dependence structure or that you want to do some stochastic calculus with them.",
                    "label": 1
                },
                {
                    "sent": "Then levy processes are prototypes of these and actually a very good idea to study them first and then move into these more general classes of processes if needed.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So other than this, historically the main applications have been insurance through in storage problems, dams in particular, and that's been driving the very early research in direction of levy processes.",
                    "label": 0
                },
                {
                    "sent": "If you process this show up in more general context of Markov processes as a means of turning one Markov process into another Markov process by a time change called subordination, and you can study levy processes also because they are related to other Markov processes that you may be interested in, such as branching processes or self similar Markov processes.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "More recently, the applications that have driven recent research and put levy processes very much at the forefront of.",
                    "label": 0
                },
                {
                    "sent": "Of of.",
                    "label": 0
                },
                {
                    "sent": "Visibility in essentially is they come from financial modeling.",
                    "label": 0
                },
                {
                    "sent": "We've got no normal returns, and the Black Scholes model says they are normal.",
                    "label": 0
                },
                {
                    "sent": "So this leads to all sorts of undesirable effects, such as volatility smiles which are in contradiction with the model that's being used.",
                    "label": 0
                },
                {
                    "sent": "So levy processes are a means of addressing such such problems, and you can go further.",
                    "label": 0
                },
                {
                    "sent": "Stochastic volatility is another such keyword from financial modeling.",
                    "label": 0
                },
                {
                    "sent": "And leverage effects.",
                    "label": 0
                },
                {
                    "sent": "So there are models around based on levy processes that can address these these features that that one would like to model in financial applications.",
                    "label": 0
                },
                {
                    "sent": "So I've put at the very bottom something that's that's also close to to my research, but I'm not going to touch up on this, which is that the importance of levy processes in population and phylogenetic models, where particularly for large trees that one one looks at there.",
                    "label": 0
                },
                {
                    "sent": "One can find Levy process descriptions or interpretations of the of the results in the area.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the structure of living processes we should define levy processes.",
                    "label": 0
                },
                {
                    "sent": "As follows, we are looking at continuous time stochastic processes with three properties, stationarity of increment, independence of increments and kadelak paths.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And what this means is that if we look at an increment of lag S of a levy process, then its distribution will only depend on S. And that being true for all, T&S is what we call stationarity of incriments.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Independence of increments is looking at increments of a disjoint time intervals.",
                    "label": 0
                },
                {
                    "sent": "I've chosen to look at consecutive increments.",
                    "label": 0
                },
                {
                    "sent": "And we require these to be independent random variables, so we are really building a model from rather basic independent random variables and we can then specify joint distributions based on these two.",
                    "label": 0
                },
                {
                    "sent": "Parag",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Times so kudlock paths is a technical condition.",
                    "label": 0
                },
                {
                    "sent": "You might replace that by stochastic continuity.",
                    "label": 0
                },
                {
                    "sent": "It's not really very very relevant for us.",
                    "label": 0
                },
                {
                    "sent": "It sort of means that we can look at the random function as well as the collection of random variables.",
                    "label": 0
                },
                {
                    "sent": "So we want right, continuous and past paths with left limits just to be to be definite here.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "I haven't said what the state space is.",
                    "label": 0
                },
                {
                    "sent": "Well, this definition makes sense in very high generality.",
                    "label": 1
                },
                {
                    "sent": "If you have something like a locally compact topological group then this is a meaningful definition.",
                    "label": 1
                },
                {
                    "sent": "But of course we're going to focus on on real valued processes and well possibly extensions to K dimensional Euclidean space.",
                    "label": 0
                },
                {
                    "sent": "So you can have two or three dimensional processes if you think of financial applications, then you may just have lots of assets and you want to study.",
                    "label": 0
                },
                {
                    "sent": "Their joint evolution and we can set up levy process models in that space which has the dimension.",
                    "label": 0
                },
                {
                    "sent": "As the number of assets.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So many examples that you will have come across.",
                    "label": 0
                },
                {
                    "sent": "I, I suppose is Brownian motion, where we have normally distributed increments.",
                    "label": 0
                },
                {
                    "sent": "And the person process where we have person distributed increments.",
                    "label": 0
                },
                {
                    "sent": "Notice that the properties of stationarity and independence of increments are related to the fact that we have and the parameters just be linear in T here.",
                    "label": 0
                },
                {
                    "sent": "So I've got two simulations of Brownian motion and Opossum process for you to look at here.",
                    "label": 0
                },
                {
                    "sent": "What we can do is calculate moment generating functions that characterize these distributions.",
                    "label": 0
                },
                {
                    "sent": "This is something of course very very elementary here that nevertheless leads to a form that we're going to see in the more general case of of an arbitrary levy process later on.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Next main example to construct levy processes is going to be the compound Poisson process.",
                    "label": 1
                },
                {
                    "sent": "The compound processing processes built from a possum process N, as we've just looked at and a number of independent and identically distributed random variables.",
                    "label": 0
                },
                {
                    "sent": "So we sum up as many of them by time T as the possum process tells us.",
                    "label": 0
                },
                {
                    "sent": "So the evolution of this process is then to start from zero and then make that jump A1, then do nothing until the possum process.",
                    "label": 0
                },
                {
                    "sent": "Jumps to tube and by which case we we add the random variable A2 to our process and we get this evolution.",
                    "label": 0
                },
                {
                    "sent": "So to calculate this moment generating function we need to do a little bit more work.",
                    "label": 0
                },
                {
                    "sent": "And one way of doing it is to condition on on the value of NT.",
                    "label": 0
                },
                {
                    "sent": "If we do this, then the random variable that we are looking at is just the sum of N independent identically distributed random variables and the moment generating function of one of such a sum of random variables is just the NTH power of the moment generating function of the random variable.",
                    "label": 1
                },
                {
                    "sent": "And what we're looking at here for our moment generating function that we are interested in.",
                    "label": 0
                },
                {
                    "sent": "Is a.",
                    "label": 0
                },
                {
                    "sent": "An exponential series that we can write as exponential well and then we get this maybe slightly strange term of T Lambda into expectation E to the gamma A 1 -- 1.",
                    "label": 0
                },
                {
                    "sent": "Well, that minus one and we can actually.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Move that bracket over here, 'cause the expectation of one is 1 and what we're looking at here is an integral of E to the gamma X -- 1.",
                    "label": 0
                },
                {
                    "sent": "Integrated against the distribution of the random variable A1, and this is a key observation that we will get back to.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Levy processes are.",
                    "label": 0
                },
                {
                    "sent": "Our process is with some strong properties and one of them is infinite divisibility.",
                    "label": 0
                },
                {
                    "sent": "The definition is that a random variable is infinitely divisible.",
                    "label": 0
                },
                {
                    "sent": "If you can write it as the sum of N independent, identically distributed random variables for all N greater than or equal to two.",
                    "label": 0
                },
                {
                    "sent": "Now the meaning of this is that the distribution of YJN will depend on N but not on J. OK, so such a property you can sort of cut down your random variable and consider it as the sum of smaller pieces.",
                    "label": 1
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That's a property that our levy processes have been cause.",
                    "label": 0
                },
                {
                    "sent": "If we look at XT.",
                    "label": 0
                },
                {
                    "sent": "Then we've got that stationarity and independence of increments so we can actually take as YJN increments of lag T / N. And if we take the consecutive increments here, then summing over these we get a telescoping sum, which means we are left with the first term for J = N and the second term for J equals one.",
                    "label": 1
                },
                {
                    "sent": "And that means we fall back onto XT.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "But we know that these random variables here are identically distributed and independent, so this is showing.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 1
                },
                {
                    "sent": "Infinite divisibility of of Levy processes their distributions.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, well this is probably the most technical part of the talk.",
                    "label": 0
                },
                {
                    "sent": "Infinite divisibility had been studied and there is this this complicated looking formula.",
                    "label": 0
                },
                {
                    "sent": "The levy khinchin formula which tells us that every infinitely divisible random variable has a characteristic function of this form.",
                    "label": 0
                },
                {
                    "sent": "Well, we've got parameters, or rather characteristics.",
                    "label": 0
                },
                {
                    "sent": "Mu is in the negative.",
                    "label": 0
                },
                {
                    "sent": "Israel Sigma squared is non negative and knew is a measure on the real line but not charging zero which has some integrability condition which means that it may be a finite measure or it may be infinite, but if it is then it still integrates X squared around 0.",
                    "label": 0
                },
                {
                    "sent": "So this is, this is what that result tells us, and rather than looking at characteristic functions, we could equally well be looking at moment generating functions provided these exists and we get exactly the same formula with all its eyes replaced by gammas.",
                    "label": 0
                },
                {
                    "sent": "OK, so we've got that term here in red, which is going to play a very important role when constructing.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Levy processes.",
                    "label": 0
                },
                {
                    "sent": "Nevertheless, yes.",
                    "label": 0
                },
                {
                    "sent": "Of the variable X in that case.",
                    "label": 0
                },
                {
                    "sent": "You have a measure XDX have some intuitive that X has a meaning that acts sort of corresponds to the jump sizes of the process, so new is a measure that will be related to jumps as we will as we will see.",
                    "label": 0
                },
                {
                    "sent": "But first, let's look at this formula to sort of explain where things are coming from.",
                    "label": 0
                },
                {
                    "sent": "So if we just look at that first term, this is what we ricalde as the moment generating function of the normal distribution.",
                    "label": 0
                },
                {
                    "sent": "So we're really looking at a normal random variable plus something.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now that's something else we've also seen.",
                    "label": 0
                },
                {
                    "sent": "At least part of it when we were looking at the moment generating function of the compound person process, we were looking at the distribution of the jumps of the compound person process and we had that integral of E to the gamma X -- 1 against that distribution.",
                    "label": 0
                },
                {
                    "sent": "So again we know what this meaning is and we make that identification of X as the jump size and then.",
                    "label": 0
                },
                {
                    "sent": "Then, in the sense of the compound for some prices.",
                    "label": 0
                },
                {
                    "sent": "But there's no.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "More and well, that more is essentially something that we also understand.",
                    "label": 0
                },
                {
                    "sent": "May cause what this new is doing is just shifting by mu.",
                    "label": 0
                },
                {
                    "sent": "If you look at the moment generating function of of constant mu and you get exactly that term, there's no randomness and this is another such term which is a multiple of gamma.",
                    "label": 0
                },
                {
                    "sent": "That's what what characterizes this interpretation?",
                    "label": 0
                },
                {
                    "sent": "So we're really looking at something constant here, except that.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The integral as it stands does not converge separately for this part, and for that part in general.",
                    "label": 0
                },
                {
                    "sent": "So that's where where this term has a second interpretation, not just as as shift by a constant, but as convergence generating term in this in this integral and we need to carefully look at how that convergence translates into properties of the.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of the levy process that we're going to construct associated with such an infinitely divisible distribution?",
                    "label": 0
                },
                {
                    "sent": "So what I've I've talked you through was to say, well, a random variable, an infinitely divisible random variable is the sum of a.",
                    "label": 1
                },
                {
                    "sent": "Normally distributed random variable of a compound Poisson distributed random variable.",
                    "label": 0
                },
                {
                    "sent": "While there were some problems with this with this integrability near 0, if this is to be a distribution, it has to be a finite measure.",
                    "label": 0
                },
                {
                    "sent": "But this measure in general can be infinite.",
                    "label": 0
                },
                {
                    "sent": "But what we can do is restrict attention to.",
                    "label": 0
                },
                {
                    "sent": "To the range of X values outside the interval minus one one.",
                    "label": 0
                },
                {
                    "sent": "This is the interpretation of these accesses jump sizes, so we are looking at big jumps and that C1 here now in my representation is.",
                    "label": 0
                },
                {
                    "sent": "Coming from my compound processing process with jump distribution that knew restricted to minus one one compliment so the big jumps are being generated and they're being put into C1.",
                    "label": 1
                },
                {
                    "sent": "That Lambda was the rate of our person process and the interpretation in our formula.",
                    "label": 0
                },
                {
                    "sent": "I mean the Lambda was just sitting as a factor to this term.",
                    "label": 0
                },
                {
                    "sent": "So we just move it out of the knew when we normalize it and really identify that compound fossil component.",
                    "label": 0
                },
                {
                    "sent": "Here the small jumps that we've forgotten about.",
                    "label": 0
                },
                {
                    "sent": "Here they are the term that's most problematic here.",
                    "label": 0
                },
                {
                    "sent": "But what we can do is not just do this argument for jumps greater than one, but we can do that argument for jumps greater than epsilon for any small epsilon, and we can construct such a compound for some process.",
                    "label": 0
                },
                {
                    "sent": "I've now chosen here jumps.",
                    "label": 0
                },
                {
                    "sent": "Of sizes between epsilon and one in absolute value with distribution, just as in this case, the restriction of our measure knew 2 -- 1 epsilon minus epsilon and epsilon up to one.",
                    "label": 0
                },
                {
                    "sent": "We've got a rate associated which is the.",
                    "label": 0
                },
                {
                    "sent": "The measure evaluated on that strip from epsilon to one in absolute value, and for every epsilon this quantity makes sense.",
                    "label": 0
                },
                {
                    "sent": "But to construct the.",
                    "label": 0
                },
                {
                    "sent": "The random variable M1 we need to let epsilon tend to zero, and there's some technicalities in form of an L2 limit.",
                    "label": 0
                },
                {
                    "sent": "This can be made mathematically precise.",
                    "label": 0
                },
                {
                    "sent": "OK, so this was just to say that an infinitely divisible random variable has such a structure, 'cause we recognize the ingredients.",
                    "label": 0
                },
                {
                    "sent": "But of course we can now use this this.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Construct a levy process along the lines that I've I've explained on the previous slide to take a Brownian motion to give us that normally distributed.",
                    "label": 0
                },
                {
                    "sent": "Part of our levy process that involves the parameters mu and Sigma.",
                    "label": 0
                },
                {
                    "sent": "I've chosen to write that BT that we had earlier as Muti Plus Sigma WT, where W is a standard Brownian motion with zero mean and variance equal to T at time T. And that taking a factor and a shift is then explicit in our representation here.",
                    "label": 1
                },
                {
                    "sent": "The CT as I said, is the compound for some process of jumps of size greater than one and the.",
                    "label": 0
                },
                {
                    "sent": "Empty epsilon that we need before we pass through the limit is such a compound for some process where we had to subtract something in order for it.",
                    "label": 0
                },
                {
                    "sent": "Characteristic function to have the form that we had.",
                    "label": 0
                },
                {
                    "sent": "Why do you care?",
                    "label": 0
                },
                {
                    "sent": "It is.",
                    "label": 0
                },
                {
                    "sent": "It was interesting.",
                    "label": 0
                },
                {
                    "sent": "Why is it interesting?",
                    "label": 0
                },
                {
                    "sent": "What we've seen is that any levy process has an infinitely divisible distribution.",
                    "label": 0
                },
                {
                    "sent": "So just from the assumptions of a levy process, we got that information.",
                    "label": 0
                },
                {
                    "sent": "So if we take any other distribution that's not infinitely divisible, such as the uniform distribution, then we cannot construct a levy process with that distribution as marginal distribution.",
                    "label": 1
                },
                {
                    "sent": "So there are restrictions that we need to be aware of before we can model using levy processes.",
                    "label": 0
                },
                {
                    "sent": "What?",
                    "label": 0
                },
                {
                    "sent": "Search process and we see in the end statements of his heart, his condition for true food.",
                    "label": 0
                },
                {
                    "sent": "There.",
                    "label": 0
                },
                {
                    "sent": "Do I get the.",
                    "label": 0
                },
                {
                    "sent": "What happens well, what I'm doing here is I'm taking an infinitely divisible distribution.",
                    "label": 0
                },
                {
                    "sent": "I'm taking its parameters Mu Sigma squared and you.",
                    "label": 0
                },
                {
                    "sent": "And in that framework, I can construct the levy process if you give me a distribution like the uniform distribution, then I wouldn't get anywhere near this, 'cause I wouldn't know how to get started.",
                    "label": 0
                },
                {
                    "sent": "I can't, I can't set set up any part of this formula becausw my distribution is not infinitely divisible.",
                    "label": 0
                },
                {
                    "sent": "That doesn't give me a mu Sigma squared and and you and I cannot do this construction, so it fails at the very beginning of having that distribution and not knowing what to do with it.",
                    "label": 0
                },
                {
                    "sent": "OK, but for good.",
                    "label": 0
                },
                {
                    "sent": "The financial time series, yes.",
                    "label": 0
                },
                {
                    "sent": "Do or do I not want to?",
                    "label": 0
                },
                {
                    "sent": "OK, well I would say you do want to do that.",
                    "label": 0
                },
                {
                    "sent": "There are other models around.",
                    "label": 0
                },
                {
                    "sent": "Why would you want to do it?",
                    "label": 1
                },
                {
                    "sent": "Becausw Brownian motion is not good enough and we need other models and the levy processes are a model that is reasonably tractable.",
                    "label": 0
                },
                {
                    "sent": "You can do calculations with levy processes that you cannot do with more general classes of stochastic processes.",
                    "label": 0
                },
                {
                    "sent": "Tractability's is one reason.",
                    "label": 0
                },
                {
                    "sent": "And of course, better model fit, right?",
                    "label": 0
                },
                {
                    "sent": "That's the starting point.",
                    "label": 0
                },
                {
                    "sent": "OK, so here we've got a way to construct our our levy process with a given infinitely divisible distribution as marginal distribution.",
                    "label": 1
                },
                {
                    "sent": "So we've got lots of of compound.",
                    "label": 0
                },
                {
                    "sent": "For some processes, one for each epsilon you let epsilon tend to zero.",
                    "label": 0
                },
                {
                    "sent": "Course what you can say is for a rough approximation I fix a small epsilon and that's what my approximation of the levy process is.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Going to be weaken slightly rephrase this and say well making Absolon smaller is something that we can do iteratively.",
                    "label": 0
                },
                {
                    "sent": "We can fix our epsilons, I call them am here and we can.",
                    "label": 0
                },
                {
                    "sent": "We can sort of decrease more and more to get a better and better approximation of our levy process that we actually want to consider, and we can sort of keep the previous steps of approximation and justice.",
                    "label": 0
                },
                {
                    "sent": "Add more jumps.",
                    "label": 0
                },
                {
                    "sent": "We've sort of started with with all jumps that are greater than one.",
                    "label": 0
                },
                {
                    "sent": "Then we add a compound person process that contains all the jumps between one and say 1/2.",
                    "label": 0
                },
                {
                    "sent": "Then we take another one that takes all the jumps between 1/2 and 1/4 and if we keep going.",
                    "label": 0
                },
                {
                    "sent": "And pass through a limit.",
                    "label": 0
                },
                {
                    "sent": "Then that quantity is going to.",
                    "label": 0
                },
                {
                    "sent": "Construct precisely a levy process and saying we stop at some finite value is saying, well, that's where the approximation is good enough, we stop.",
                    "label": 0
                },
                {
                    "sent": "OK, so I've I've put in red for a couple of slides now that compensation of small jumps.",
                    "label": 1
                },
                {
                    "sent": "I've already said that it's sort of necessary for the convergence of this integral because we say we want to integrate X squared at zero.",
                    "label": 0
                },
                {
                    "sent": "But if you just look at this term then this behaves like X at 0, and that's not good enough.",
                    "label": 1
                },
                {
                    "sent": "It has to do.",
                    "label": 0
                },
                {
                    "sent": "Behave like X squared, so we take away essentially the first term and the second term of the expansion of E to the IXIX here, so that is needed in general.",
                    "label": 1
                },
                {
                    "sent": "But of course if we have a stronger condition of integrability of modx, then we do not need that term.",
                    "label": 0
                },
                {
                    "sent": "And what we can do is we can move that term.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Into the drift term because it was of that precisely that same nature a multiple of PSI.",
                    "label": 0
                },
                {
                    "sent": "So that's one case where we can simplify our our formula.",
                    "label": 0
                },
                {
                    "sent": "The other cases where we have a stronger integrability condition at Infinity at Infinity, this function is constant one.",
                    "label": 0
                },
                {
                    "sent": "But if we can actually also integrate MoD X There, then what we can do is we can drop that indicator.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Move the.",
                    "label": 0
                },
                {
                    "sent": "The resulting error by integrating over the whole range now again into the into the mu term at the beginning and we get another simpler representation for our infinitely divisible distribution.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so that is how the compensation is.",
                    "label": 0
                },
                {
                    "sent": "Can be slightly twisted now.",
                    "label": 0
                },
                {
                    "sent": "What is that compensation doing?",
                    "label": 0
                },
                {
                    "sent": "Here's an example.",
                    "label": 0
                },
                {
                    "sent": "If we take mu and Sigma squared equal to nought, let's put ourselves into the situation where we've compensated all jumps as we call it.",
                    "label": 0
                },
                {
                    "sent": "So we're looking at GNU double prime and let's take a knew that has that.",
                    "label": 0
                },
                {
                    "sent": "We can take your ability of X squared times new DX being finite at zero, but does not have the property that MoD X is integrable at zero against knew.",
                    "label": 0
                },
                {
                    "sent": "So what that means is that in our approximation we've got these compensating drifts that report we can explicitly calculate what they are if we take epsilon equals 1.3 point 1.1.",
                    "label": 0
                },
                {
                    "sent": "In our aim to approximate the levy process, then these drifts are going to be .845, two .55, nineteen, etc.",
                    "label": 0
                },
                {
                    "sent": "And effectively that's going to increase to Infinity as absolom tends to zero.",
                    "label": 0
                },
                {
                    "sent": "OK, so we're really looking at at a very steep slope.",
                    "label": 0
                },
                {
                    "sent": "That's the interpretation of this this term here.",
                    "label": 0
                },
                {
                    "sent": "As epsilon is equal to 1, the slope is fairly fairly weak, but as we increase our the.",
                    "label": 0
                },
                {
                    "sent": "The quality of our approximation, the slope is getting steeper and steeper, and here you already.",
                    "label": 0
                },
                {
                    "sent": "You can't really see what what is slope and what are downward jumps, so you've.",
                    "label": 0
                },
                {
                    "sent": "You've also reached a kind of reasonably stable regime passing from here to here.",
                    "label": 0
                },
                {
                    "sent": "There's not much change in the picture meaning that although you've added up lots of small jumps, you have also put down a constant.",
                    "label": 0
                },
                {
                    "sent": "Time to compensate them and that makes makes the well they cancel each other out essentially.",
                    "label": 0
                },
                {
                    "sent": "So really taking .014 epsilon here is going to be good enough for any reasonable purposes of of an approximation.",
                    "label": 0
                },
                {
                    "sent": "One can of course quantify that and.",
                    "label": 0
                },
                {
                    "sent": "Say within what limits we are in this approximation, but I'm not going to guess.",
                    "label": 0
                },
                {
                    "sent": "Good to have a good enough proximation or to learn, and it's just like a private as you said.",
                    "label": 0
                },
                {
                    "sent": "Well, I mean, you can work out what what the variance of the difference is and if you want to just control that variance of the difference, that's that's something you can do.",
                    "label": 0
                },
                {
                    "sent": "In special cases you can go further.",
                    "label": 0
                },
                {
                    "sent": "You can say, well, I want that to be.",
                    "label": 0
                },
                {
                    "sent": "Within.",
                    "label": 0
                },
                {
                    "sent": "Say plus minus Delta at the end.",
                    "label": 0
                },
                {
                    "sent": "So So what you do is you.",
                    "label": 0
                },
                {
                    "sent": "You make that the probability that that the error that you commit by omitting the small jumps is greater than Delta is less than the small.",
                    "label": 0
                },
                {
                    "sent": "A small value so you can.",
                    "label": 0
                },
                {
                    "sent": "You can sometimes calculate these quantities explicitly, or do do some further simulations to assess them.",
                    "label": 0
                },
                {
                    "sent": "So there's methods around to really decide how good an approximation is.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "These discussions so far actually give us ways of simulating levy processes.",
                    "label": 1
                },
                {
                    "sent": "We can simulate by time discretization.",
                    "label": 1
                },
                {
                    "sent": "Certainly if we have reasonably explicit knowledge of the distribution of our process at time Delta, then we can calculate the inverse distribution function and by standard method generate random variables, YK with distribution X Delta.",
                    "label": 0
                },
                {
                    "sent": "And if we sum them up, then our levy process is going to be.",
                    "label": 0
                },
                {
                    "sent": "We some such as some evaluated at integer part of T over Delta, so that's a sort of in a talk approximation of a levy process, but requires knowledge of the distribution of X Delta.",
                    "label": 0
                },
                {
                    "sent": "So what we've done is not start from that such a distribution, because we would have had to check that it's infinitely divisible, etc.",
                    "label": 0
                },
                {
                    "sent": "But we've said, well, really, infinitely divisible distributions are characterized by mu Sigma squared, and you and we can construct such levy processes, and we can use that information of how to construct them to simulate these levy processes by throwing away all small jumps.",
                    "label": 1
                },
                {
                    "sent": "That is, by fixing an epsilon.",
                    "label": 0
                },
                {
                    "sent": "And by taking the approximation that we've seen to level up to threshold absolom so in.",
                    "label": 0
                },
                {
                    "sent": "Practice.",
                    "label": 0
                },
                {
                    "sent": "This would mean that what we need to be able to calculate is something like the inverse distribution function of the jump size distribution rather than the increment distribution of the levy process, and then we can simulate two quantities, then simulate the for some process that tells me how tells us how many jumps we've seen by time T, and that's awesome process of rate.",
                    "label": 0
                },
                {
                    "sent": "Lambda, epsilon, zed, K. Are the exponential interarrival distributions of the person process and then we can simulate the jump sizes and we can add up the jump sizes to form our well compensated.",
                    "label": 0
                },
                {
                    "sent": "Compound person process.",
                    "label": 0
                },
                {
                    "sent": "So here this is exactly the same method as what we were using to generate the.",
                    "label": 0
                },
                {
                    "sent": "The increments in the in the first method, so this is of course still something very general for specific distributions you can can use some tricks or some some approximations of this of this inverse distribution functions from the what we need here is only a way to generate to generate random variables with a given jump size distribution that's determined by our.",
                    "label": 0
                },
                {
                    "sent": "Measure knew.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so that simulations one can improve simulations.",
                    "label": 0
                },
                {
                    "sent": "By saying, well, we've thrown something away so we can at least try a variance correction.",
                    "label": 0
                },
                {
                    "sent": "Our random variable, Now that's approximating the levy process, has a smaller variance.",
                    "label": 0
                },
                {
                    "sent": "So would it be appropriate to add something to increase that variance?",
                    "label": 0
                },
                {
                    "sent": "And there's a result by Asmussen and Rosinski, which says that if we have a levy process and lets us implicitly take the Brownian motion component out, then we can sort of say whether it's appropriate to add a multiple of Brownian motion to reflect all the small jumps thrown away.",
                    "label": 1
                },
                {
                    "sent": "'cause after all, what is a process that's making very very many very small movements?",
                    "label": 0
                },
                {
                    "sent": "Well, it ought to be a Brownian motion, because that's what.",
                    "label": 0
                },
                {
                    "sent": "Or Brownian motion approximates in in the sense of the normal distribution always arising.",
                    "label": 0
                },
                {
                    "sent": "If you've got contributions of lots of independent.",
                    "label": 0
                },
                {
                    "sent": "Identically distributed bits central limit theorem well, but here it turns out that there's actually a condition needed for such an approximation to be valid, and that condition looks at at this integral of X squared new DX from minus epsilon to epsilon, and if that increases more quickly than epsilon squared, then we get an approximation of the bit that we've.",
                    "label": 0
                },
                {
                    "sent": "Thrown away, this is what we want to simulate.",
                    "label": 0
                },
                {
                    "sent": "This is what we do simulate, so the difference is our error and we divide that by its variance and it converges to Brownian motion under that additional condition.",
                    "label": 0
                },
                {
                    "sent": "So what we should then do is slightly modify the method two of throwing away the small jumps and adding something to replace the small jumps that something being a multiple of an independent Brownian motion.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is sort of a slight risk.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Feynman tavour have our simulation methods.",
                    "label": 0
                },
                {
                    "sent": "Now, some parametric families.",
                    "label": 0
                },
                {
                    "sent": "We've already seen Brownian motion as a very particular example, Brownian motion manasu, as we've now seen as the only levy process that has continuous sample paths.",
                    "label": 0
                },
                {
                    "sent": "All the other levy processes were constructed by adding some.",
                    "label": 1
                },
                {
                    "sent": "Sort of compound for some process of jumps and then passing to limits so they'll always be jumps in any other levy process.",
                    "label": 0
                },
                {
                    "sent": "Some explicit distributions that are infinitely divisible include the gamma distribution, so we can consider a gamma process with gamma increments.",
                    "label": 1
                },
                {
                    "sent": "It's going to be an increasing process, or we can take differences of two gamma processes.",
                    "label": 1
                },
                {
                    "sent": "It's easily seen that that all is also a levy process, which is called the generalized variance gamma process.",
                    "label": 1
                },
                {
                    "sent": "We can.",
                    "label": 0
                },
                {
                    "sent": "Have some more sophisticated ways of constructing levy processes.",
                    "label": 0
                },
                {
                    "sent": "The normal inverse Gaussian process is such an example where we take a 2 dimensional Brownian motion that we run until it exceeds a threshold in one of its and coordinates, and then we look at where the process is in its other coordinate and that random variable.",
                    "label": 0
                },
                {
                    "sent": "The Second Brownian motion evaluated when the first Brownian motion exceeds a threshold.",
                    "label": 0
                },
                {
                    "sent": "As that threshold varies, that gives us a process that turns out to be a levy process, and it's called the inverse Gaussian normal inverse Gaussian levy process, because we're sort of taking an inverse here of the Gaussian process and that Brownian motion here and then, we take and sort of make that the variance of the normally distributed other Brownian motion.",
                    "label": 1
                },
                {
                    "sent": "That's where that name comes from.",
                    "label": 0
                },
                {
                    "sent": "So these are processes that we can construct, and distributions that we can describe without worrying about infinite divisibility.",
                    "label": 0
                },
                {
                    "sent": "Really, while we do, but we don't need to go into specifying mu Sigma squared and knew here because we've got other means of seeing that we've got infinite divisibility, which is that that gamma distribution if you add up to gamma variables with the same beta, you get another gamma variable.",
                    "label": 0
                },
                {
                    "sent": "And if you if you look at this construction with some care, you see that you've got a strong Markov property which tells you that again, this IT process is a process with stationary independent increments, and that property translates to that same property of ZT.",
                    "label": 1
                },
                {
                    "sent": "So advantages of this is that we get reasonably explicit densities and that is very useful for parameter estimation.",
                    "label": 0
                },
                {
                    "sent": "Here we've got these three parameters or the four parameters that.",
                    "label": 0
                },
                {
                    "sent": "Of course, if we want to do modeling, will need to be fitted.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Disadvantages are that, well, we haven't exactly got a lot of modeling freedom, and it's actually not so clear how with such approaches you generate more general levy processes, so this construction that we've gone through now is really coming and bear fruit when we say, well, why don't we use mu Sigma squared and knew for the modeling?",
                    "label": 0
                },
                {
                    "sent": "What are natural classes of.",
                    "label": 0
                },
                {
                    "sent": "Mu Sigma Squared knew particularly new want that would give natural levy.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Processes so well, I forgot that I had some simulations of these just for you to look at.",
                    "label": 0
                },
                {
                    "sent": "So here let's look at the gamma process we can.",
                    "label": 0
                },
                {
                    "sent": "Vary the parameters I've chosen Alpha equals beta because anything else would just have changed the scale said of the scaling of our of our pictures.",
                    "label": 0
                },
                {
                    "sent": "So this is the behavior what gamma processes can express something that's pretty much dominated by the very big jumps, and you'll see smaller jumps there.",
                    "label": 0
                },
                {
                    "sent": "Infinitely many jumps.",
                    "label": 0
                },
                {
                    "sent": "In fact they are no longer visible at this scale.",
                    "label": 0
                },
                {
                    "sent": "And then as you increase the parameter you see that.",
                    "label": 0
                },
                {
                    "sent": "The individual jumps are becoming more and more important of similar sizes, and as you increase further and further, you get a convergence to a linear drift.",
                    "label": 0
                },
                {
                    "sent": "Eventually that's a sort of strong law of large numbers behavior that you see here in these classes of gamma processes looking at variants, processes, we take differences of two such independent processes.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then again, I've chosen a certain relationship between the parameters in order to keep the variance of the variance gamma process the same all the time, and so again what you see here is the range of possibility that the.",
                    "label": 1
                },
                {
                    "sent": "Well, the symmetric variance gamma process can can achieve.",
                    "label": 1
                },
                {
                    "sent": "So again you see very much dominance by by the of the picture by the biggest jumps for small parameters and for bigger parameters you see another convergence.",
                    "label": 0
                },
                {
                    "sent": "This is a convergence to Brownian motion instead of central Limit theorem.",
                    "label": 1
                },
                {
                    "sent": "Within the class of variance gamma processes.",
                    "label": 1
                },
                {
                    "sent": "And you might say, well, what we're looking at here is really we zoom into into a variance gamma process here to see such a picture and resume out to see such a picture.",
                    "label": 0
                },
                {
                    "sent": "So that's aggregate normality.",
                    "label": 0
                },
                {
                    "sent": "That's quite useful for financial time series, because in the very long term the normal distribution is not all that bad.",
                    "label": 0
                },
                {
                    "sent": "But when you have a reasonably short horizon, it's just not not very useful.",
                    "label": 0
                },
                {
                    "sent": "There's other problems if you take 2 short in horizon and look into intraday behavior than any of these models is inadequate anyway, but I'll get to the.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If I have time at the end, so I was saying really our modeling freedom comes from specifying the characteristics rather than the increment distribution.",
                    "label": 0
                },
                {
                    "sent": "So famous earlier examples have been stable processes that have been studied for their scaling relation, where the distribution at a time 80 can be derived from the distribution at time T just by multiplying a random variable by by a constant.",
                    "label": 1
                },
                {
                    "sent": "So such processes can be obtained by specifying in maybe the simplest possible way, the density of the measure knew, so you just take powers of of X as densities, so that makes sense for Alpha between zero and two.",
                    "label": 0
                },
                {
                    "sent": "I've separated out the two cases here in order to be explicit about what kind of compensation we use.",
                    "label": 0
                },
                {
                    "sent": "Here, we don't need to compensate any jumps.",
                    "label": 1
                },
                {
                    "sent": "And here we can compensate all jumps.",
                    "label": 0
                },
                {
                    "sent": "Other than that, the two are the same.",
                    "label": 0
                },
                {
                    "sent": "There's also Alpha equals one, which looks a little different and Alpha equals 2, which is very different, which is Brownian motion.",
                    "label": 0
                },
                {
                    "sent": "Then maybe more interesting Lee is a class of processes which is sort of the next most natural where you've got both a a polynomial term and an exponential term, where of course, this polynomial term describes the behavior near 0 and the exponential term describes the behavior near Infinity in the one case and near minus Infinity in the other case.",
                    "label": 0
                },
                {
                    "sent": "So you've then got a a certain number of parameters.",
                    "label": 0
                },
                {
                    "sent": "There's five parameters.",
                    "label": 0
                },
                {
                    "sent": "In this, in this density of our measure knew, and that gives us quite a bit of modeling freedom just out of out of such simple definitions.",
                    "label": 0
                },
                {
                    "sent": "Here you could go on and take linear combinations of these, or take any take your favorite function on the real line as soon as it satisfies this.",
                    "label": 0
                },
                {
                    "sent": "This integrability condition of 1 minimum X squared and you can take it as well.",
                    "label": 0
                },
                {
                    "sent": "If it's not negative as well.",
                    "label": 0
                },
                {
                    "sent": "You can take it as the density of the measuring you, so that's a lot of freedom.",
                    "label": 0
                },
                {
                    "sent": "And disadvantage then, of course, is that if you then ask to fit your model to data, then well, the probability density function is not available in closed form.",
                    "label": 1
                },
                {
                    "sent": "You can have some integral representations or some you can invert some characteristic functions or moment generating functions and and you've got a way of doing the the model fitting.",
                    "label": 0
                },
                {
                    "sent": "But it's sort of a little less elementary then then by modeling the increment distribution.",
                    "label": 0
                },
                {
                    "sent": "I've got some.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Simulations of stable processes, so you see again very similar behavior in the symmetric case for small value of Alpha we get very much pictures dominated by small jumps for large values of Alpha 1.8.",
                    "label": 0
                },
                {
                    "sent": "Is this one.",
                    "label": 0
                },
                {
                    "sent": "Here you get something that is moving closer together, and if you let Alpha 1:50 it.",
                    "label": 0
                },
                {
                    "sent": "Actually, some sort of continuity that makes this converge to a Brownian motion again.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in the There's another interesting class of stable processes where you've only got positive jumps or only got negative jumps, as the case may be.",
                    "label": 0
                },
                {
                    "sent": "Here is positive jumps, then we've got due to our compensation rule for Alpha between zero and one.",
                    "label": 0
                },
                {
                    "sent": "We were not compensating and you jump, so we're really just adding up jumps in this process and it's dominated by by big jumps as Alpha moves across one.",
                    "label": 0
                },
                {
                    "sent": "We can compensate and do compensate all jumps.",
                    "label": 0
                },
                {
                    "sent": "And then we get a behavior that that has drift downwards, but in that infinite sense that I've been been looking at in an example and upward jumps again, big jumps being being quite dominant here.",
                    "label": 0
                },
                {
                    "sent": "And well, this is.",
                    "label": 0
                },
                {
                    "sent": "This is what this table processes then look like.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so that's modeling levy processes themselves.",
                    "label": 0
                },
                {
                    "sent": "We can go further once we've got levy processes because they are semimartingales.",
                    "label": 1
                },
                {
                    "sent": "Essentially, we've got stochastic integration at our disposal.",
                    "label": 1
                },
                {
                    "sent": "We can look at stochastic integrals, either of deterministic functions, which means that we take these increments or the jump sizes and according to Winner Jump happens.",
                    "label": 0
                },
                {
                    "sent": "It's scaled by that function F, or we have a stochastic process that sort of interacts with the randomness of our levy process.",
                    "label": 0
                },
                {
                    "sent": "Or has some additional randomness in it and?",
                    "label": 0
                },
                {
                    "sent": "That gives us.",
                    "label": 1
                },
                {
                    "sent": "Gives us another form of models that that we can form from levy processes where the levy processes sort of the bid with stationary independent increments.",
                    "label": 0
                },
                {
                    "sent": "So over any little time interval it's feeding in in dependently some randomness of the same type, so it's giving some sort of stationary flavor to the process, but the cube can then of course make some dependence between.",
                    "label": 0
                },
                {
                    "sent": "Between neighboring increments of the of this stochastic integral.",
                    "label": 0
                },
                {
                    "sent": "So an example of such such a model, while actually off the first model here, is the class of Ornstein Uhlenbeck processes, non Gaussian on central bank processes.",
                    "label": 0
                },
                {
                    "sent": "More precisely we can define Whitey to be such an integral from North to TE to the minus, Lambda T -- S the excess.",
                    "label": 0
                },
                {
                    "sent": "What is this process doing while this process?",
                    "label": 0
                },
                {
                    "sent": "Instead of, well, if we look at a compound for some process in particular, then our processes starting from wynaut and it's decreasing exponentially.",
                    "label": 1
                },
                {
                    "sent": "And when the 1st jump happens that jump well if it happens at time T then then the T -- T is equal to 0.",
                    "label": 0
                },
                {
                    "sent": "So we're really multiplying by one that Trump of our levy process X is taken just as is and added to our to our process and then.",
                    "label": 0
                },
                {
                    "sent": "There's the again this exponential decay, which steps in and it's sort of an interaction between that exponential decay and the upward jump.",
                    "label": 0
                },
                {
                    "sent": "So if there are lots of jumps, then it can go very high up, but also slopes down very steeply and we get an interesting class of processes that sort of returning to determine value all the time.",
                    "label": 0
                },
                {
                    "sent": "So it's a mean reverting process that's quite useful.",
                    "label": 0
                },
                {
                    "sent": "You can get a stationary regime and.",
                    "label": 1
                },
                {
                    "sent": "And use this to models processes that ought to be stationary.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So there are other classes of levy driven stochastic processes we can look at stochastic differential equations or we can look at time changes where we somehow change either the scale of our process or the speed at which the process travels and that gives gives larger classes of of stochastic processes based on.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On levy processes.",
                    "label": 0
                },
                {
                    "sent": "So if we now move more, particularly towards modeling financial price processes, and of course this is starting from the Black Scholes model, which is taking geometric Brownian motion as a model for a stock price.",
                    "label": 1
                },
                {
                    "sent": "And this is a model that's being used in practice a lot, because it's just so tractable.",
                    "label": 0
                },
                {
                    "sent": "You can do very quick and efficient computations and value lots of options overnight.",
                    "label": 0
                },
                {
                    "sent": "And that is.",
                    "label": 0
                },
                {
                    "sent": "That is still making this model.",
                    "label": 1
                },
                {
                    "sent": "The only model that's that's of any practical use essentially, but on the side you really need other models 'cause there's abundant empirical evidence that financial price processes are not normally distributed.",
                    "label": 0
                },
                {
                    "sent": "These while returns or log returns.",
                    "label": 1
                },
                {
                    "sent": "They they are the quantities that where this model claims they are normally distributed and, well, we need to really address that.",
                    "label": 0
                },
                {
                    "sent": "And say, well, if they're not, then maybe what we should be looking at is a so-called levy market model, where we take instead of Brownian motion levy process in the exponent of this of this process.",
                    "label": 0
                },
                {
                    "sent": "So these are levy markets, that's.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "One step in one can go further.",
                    "label": 0
                },
                {
                    "sent": "There's more problems with the Black Scholes model and what the markets do is just focus on the return distribution.",
                    "label": 0
                },
                {
                    "sent": "You can then argue well, there's also evidence against independence of increments that leads to the looking at stochastic volatility models.",
                    "label": 1
                },
                {
                    "sent": "Some leverage effects and you can set up models to address.",
                    "label": 0
                },
                {
                    "sent": "To address this, let me just look at one example here, which brings in our own standalone back process, again bound of Nielsen and Shepard introduced such a model.",
                    "label": 0
                },
                {
                    "sent": "It's only one in many, but it's one that that sort of fits.",
                    "label": 1
                },
                {
                    "sent": "Our framework of levy modeling, so you can take your Brownian motion and rather than having a constant volatility, have a stochastic volatility process where that stochastic volatility process is.",
                    "label": 0
                },
                {
                    "sent": "The Ornstein Uhlenbeck process that I introduced earlier.",
                    "label": 0
                },
                {
                    "sent": "It had better be non negative so we achieve that by taking zed and increasing levy process.",
                    "label": 0
                },
                {
                    "sent": "So this is this is a model which has that behavior that I've described for that oh you process on the level of volatility.",
                    "label": 0
                },
                {
                    "sent": "So what does that mean?",
                    "label": 0
                },
                {
                    "sent": "Well that means we've sort of got upward jumps.",
                    "label": 0
                },
                {
                    "sent": "You can think that's when information is coming in saying.",
                    "label": 0
                },
                {
                    "sent": "Well the company releases, it's it's.",
                    "label": 0
                },
                {
                    "sent": "It's quarterly report or there's somebody saying, well, that company really doesn't do very well and lots of people go to the market and that's just increasing the activity at which the otherwise Brownian model then evolves.",
                    "label": 0
                },
                {
                    "sent": "So you get an increase in activity and that slows down as time goes by until the next piece of information is is released and.",
                    "label": 0
                },
                {
                    "sent": "Yes, independence.",
                    "label": 0
                },
                {
                    "sent": "Negatives of squared or absolute increments?",
                    "label": 0
                },
                {
                    "sent": "Or are you talking about she imagines of English?",
                    "label": 0
                },
                {
                    "sent": "I'm talking about actual independence of increments, as in the definition of our levy process.",
                    "label": 0
                },
                {
                    "sent": "OK, OK. That's what we're already.",
                    "label": 0
                },
                {
                    "sent": "Processes have by definition.",
                    "label": 0
                },
                {
                    "sent": "And now we're saying, well, if we look at market data then we consider study correlation of adjacent increments or sum of higher form of independent of dependence.",
                    "label": 0
                },
                {
                    "sent": "Square.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "Right, I mean what you probably mean is correlation of increments.",
                    "label": 0
                },
                {
                    "sent": "That zero correlation is quite quite OK, but the squares have have have correlation.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so.",
                    "label": 0
                },
                {
                    "sent": "Anyway, so this is this is our interpretation of this model and.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, that model.",
                    "label": 0
                },
                {
                    "sent": "Setup is something that we've then also studied in our work.",
                    "label": 0
                },
                {
                    "sent": "So how much time?",
                    "label": 0
                },
                {
                    "sent": "They use 5 minutes?",
                    "label": 0
                },
                {
                    "sent": "Yeah, that's that's certainly certainly enough to now now.",
                    "label": 0
                },
                {
                    "sent": "Just just briefly indicate that that little contribution that I've made together with all the band of Nielsen and Neil Shepherd.",
                    "label": 0
                },
                {
                    "sent": "So the framework is the following.",
                    "label": 0
                },
                {
                    "sent": "The volatility process cannot be observed, So what you see is the price process and the price process.",
                    "label": 0
                },
                {
                    "sent": "Well, contains information about the volatility process, but does not a priore allow you to?",
                    "label": 0
                },
                {
                    "sent": "Via simple transformation, get back that volatility process.",
                    "label": 0
                },
                {
                    "sent": "So what we then want to do is find information about the volatility process Sigma S from the price process Y.",
                    "label": 1
                },
                {
                    "sent": "And what one can do is common can look at increments of the Y process and raise them to certain powers.",
                    "label": 0
                },
                {
                    "sent": "If that power is 2, then this stands some chance of converging to some sort of quantity involving squares over there.",
                    "label": 0
                },
                {
                    "sent": "What I've done instead is I've taken adjacent increments M of them, and I've raised each one of them through a power 2 / M. Now that's a quantity that's quite complicated, but it's.",
                    "label": 0
                },
                {
                    "sent": "Purely described in terms of the prices that you can see at a lag of Delta.",
                    "label": 1
                },
                {
                    "sent": "So there's two to the minus 10 should be a Delta early here.",
                    "label": 0
                },
                {
                    "sent": "So that in fact converges to an integral of the volatility process.",
                    "label": 0
                },
                {
                    "sent": "This quantity here in the case of a continuous stochastic process is called the quadratic variation of that process and has been studied in probability theory as well as in the financial applications.",
                    "label": 1
                },
                {
                    "sent": "So what we see here is a way of finding information about the volatility process.",
                    "label": 0
                },
                {
                    "sent": "Well, we don't know how good such an approximation is.",
                    "label": 0
                },
                {
                    "sent": "We can't let Delta 10 to 0 really.",
                    "label": 0
                },
                {
                    "sent": "'cause of market microstructure locali these paths are constant and the approximation actually only works because very assuming that paths have fat Brownian behavior at all scales.",
                    "label": 0
                },
                {
                    "sent": "So we need to somewhere stop at a finite Delta and it's sort of important to know well how far off are we going to be so.",
                    "label": 0
                },
                {
                    "sent": "To get a feeling for that, she sort of take the difference.",
                    "label": 1
                },
                {
                    "sent": "Redscale appropriately, and indeed there is a central limit theorem under slightly more restrictive assumptions were still pretty general.",
                    "label": 0
                },
                {
                    "sent": "That give us precise information about the amount of error that we commit by using this as the integrated volatility prices, so this is in a model with continuous paths an hour.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Contribution has been really to study how far we can push such results when we have.",
                    "label": 0
                },
                {
                    "sent": "A part of our price process which is no longer why but which is S now where we've added an independent levy process or on standalone back process or something with reasonably levy like like jumps and the result that we've obtained is that there is a sort of Alpha that matters in the modeling of our levy process.",
                    "label": 1
                },
                {
                    "sent": "We've studied that integrability with conditions gamma equals one or gamma equals 2.",
                    "label": 0
                },
                {
                    "sent": "But of course anything between.",
                    "label": 0
                },
                {
                    "sent": "Is something where sort of the upper limit might might sit by which we get a finite value for that integral, and that Alpha quantity which is by the way the Y in the CGM Y process that turns out to be important in order to say that we can still.",
                    "label": 0
                },
                {
                    "sent": "Make inference on our our volatility process.",
                    "label": 0
                },
                {
                    "sent": "We've got convergence in probability essentially under no conditions, Alpha less than two just exclude some weird processes.",
                    "label": 0
                },
                {
                    "sent": "That's not a restriction, but if you want a central limit theorem, we need two things.",
                    "label": 0
                },
                {
                    "sent": "We need Alpha less than one, which is restricting quite seriously.",
                    "label": 0
                },
                {
                    "sent": "Our modeling freedom, and we need a further restriction on M essentially, But we can sort of then tweak tweak M so that it lies between these bounds.",
                    "label": 1
                },
                {
                    "sent": "And we then have a central limit theorem and can make inference on the stochastic volatility in a model that's sort of perturbed by by a levy process.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's it, I've got some references here.",
                    "label": 0
                },
                {
                    "sent": "If anybody would like to to look at either theorie or this particular application that I've been talking about.",
                    "label": 0
                },
                {
                    "sent": "OK, it's OK, thank you.",
                    "label": 0
                },
                {
                    "sent": "Questions any other questions with time for one or two questions?",
                    "label": 0
                },
                {
                    "sent": "About stochastic withdrawal.",
                    "label": 0
                },
                {
                    "sent": "Because liquation program.",
                    "label": 0
                },
                {
                    "sent": "By these poses, I know them got some frozen promotion form were useful plus of feeding times from the prophecies, unfaltering if there are processes with, for example, Porsche on a driving components which have some coffee, dimensional transistor density statistiques, finite dimensional of finite dimensional world.",
                    "label": 0
                },
                {
                    "sent": "Sufficient statistics?",
                    "label": 0
                },
                {
                    "sent": "Ford Transit, some density is all.",
                    "label": 0
                },
                {
                    "sent": "In the same sense as the Goshen processes are very useful class and they correspond to problem motion linear differential equations.",
                    "label": 0
                },
                {
                    "sent": "Question process instead of the motion.",
                    "label": 0
                },
                {
                    "sent": "Do I have some class of differential equations where I calculate so you're talking about the the partial differential equations associated with with Brownian motion, while there's an analog which would not be a, we would not be at differential equation, but which would be an integral equation, because these terms that.",
                    "label": 0
                },
                {
                    "sent": "Model that jumps if you look at the generator of a levy process, then it's no longer a a differential operator, but it is an integral operator, so you get a support one, cause nonlocal term and there's a study of integral operators that can be pushed to a certain level, but not anywhere as far as as what the.",
                    "label": 0
                },
                {
                    "sent": "The situation for Brownian motion allows you to do.",
                    "label": 0
                },
                {
                    "sent": "Is that?",
                    "label": 0
                },
                {
                    "sent": "Is that the right direction or?",
                    "label": 0
                },
                {
                    "sent": "Power transistor density point was ordering stochastic displays.",
                    "label": 0
                },
                {
                    "sent": "Just wondering if there exist classes so liberal causes driven differential equations which would have closed form transition densities.",
                    "label": 0
                },
                {
                    "sent": "For example.",
                    "label": 0
                },
                {
                    "sent": "Well, the clothes from transition densities are the increment distributions for levy processes, so we've got some examples where they are explicit they are the parametric families.",
                    "label": 0
                },
                {
                    "sent": "The first group of parametric families such as the variance gamma processes the normal inverse Gaussian processes.",
                    "label": 0
                },
                {
                    "sent": "Where you've got some reasonably explicit densities, it may involve some Bessel functions or so, but but it's explicit.",
                    "label": 0
                },
                {
                    "sent": "So they are very useful in impractical in first.",
                    "label": 0
                },
                {
                    "sent": "So yes, OK. What yes?",
                    "label": 0
                },
                {
                    "sent": "Yeah, there's.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Integral of X power gamma is like more what is gamma?",
                    "label": 0
                },
                {
                    "sent": "Gamma is.",
                    "label": 0
                },
                {
                    "sent": "You're sort of looking for the smallest gamma for which for the highest.",
                    "label": 0
                },
                {
                    "sent": "The smallest camera for which you've got this integrability.",
                    "label": 0
                },
                {
                    "sent": "It can be less than one.",
                    "label": 0
                },
                {
                    "sent": "Yes, it's.",
                    "label": 0
                },
                {
                    "sent": "I mean what we always have.",
                    "label": 0
                },
                {
                    "sent": "Is integrability of X squared nude X?",
                    "label": 0
                },
                {
                    "sent": "That's our condition that we need in order to construct the levy process.",
                    "label": 0
                },
                {
                    "sent": "What we said is that if we have integrability of X near X, then we can forget about compensation and we can go go lower than this and that gives us gives us strong integrability.",
                    "label": 0
                },
                {
                    "sent": "For instance, for the gamma process you'd get gamma equal to 0 here.",
                    "label": 0
                },
                {
                    "sent": "What are the countries speak at?",
                    "label": 0
                },
                {
                    "sent": "This pace is not replacing?",
                    "label": 0
                },
                {
                    "sent": "OK, well, we're not really worried about about the norms associated.",
                    "label": 0
                },
                {
                    "sent": "It yes, but.",
                    "label": 0
                },
                {
                    "sent": "But that's not why we're looking at this.",
                    "label": 0
                },
                {
                    "sent": "It's more about summability of jumps and being able to some certain powers of jumps.",
                    "label": 0
                },
                {
                    "sent": "As far as I recall, this game, mixture of Gaussian and Wilson process yes.",
                    "label": 0
                },
                {
                    "sent": "Of course, the most important things about this particular.",
                    "label": 0
                },
                {
                    "sent": "Processes as a continuous spectrum and also has discrete yes, so any reflections.",
                    "label": 0
                },
                {
                    "sent": "Well, I constructed that most general levy process from a Brownian motion and a limit of compound person processes.",
                    "label": 0
                },
                {
                    "sent": "I haven't really looked at spectral properties, that's not the area that's close to what I've been working on, but.",
                    "label": 0
                },
                {
                    "sent": "Yes, this is certainly a lot is known about this.",
                    "label": 0
                }
            ]
        }
    }
}