{
    "id": "zg5mzrpupuf5to2rpgqox2t6bku7j2km",
    "title": "Dynamics of News Events and Social Media Reaction",
    "info": {
        "author": [
            "Mikalai Tsytsarau, Department of Information Engineering and Computer Science (DISI), University of Trento"
        ],
        "published": "Oct. 7, 2014",
        "recorded": "August 2014",
        "category": [
            "Top->Computer Science->Data Mining",
            "Top->Computer Science->Knowledge Extraction"
        ]
    },
    "url": "http://videolectures.net/kdd2014_tsytsarau_media_reaction/",
    "segmentation": [
        [
            "So my today's talk would be on news on their dynamics and on their impact on sentiment in Twitter.",
            "So there's also here for a bit tired.",
            "I would like to."
        ],
        [
            "Wake you up with breaking news.",
            "Yesterday it was a earthquake in California which woke people up in the middle of the night and there is a service which tracks how many people are awake of those who were there.",
            "Sleeping bands.",
            "So usually this sleeping activity pattern looks like that people are sleeping at 3:00 AM and there gradually going to sleep, gradually waking up and this is.",
            "Was observed for the distant regions from the epicenter of earthquake.",
            "For cities such Sacramento or San Jose, which were closer, you see a little bump in the middle, which indicates that some people were waken up by the earthquake.",
            "For cities such as San Francisco or Oakland, which are closer to the epicenter, you see that this bump is increasing.",
            "And finally for the epicenter, which was in neighbor, many people woke up during the earthquake and it took some time for them to go to sleep, and some of them even didn't wake up as I see.",
            "It's, which is very strange because Earthquake was a largest one in 25 years.",
            "So this shape of people waking up and gradually going to sleep it reminds.",
            "Of the shapes observed during earthquakes of the magnitude of earthquakes, and it's actually interesting question whether such social activity or personal activity can be actually described as a physical process.",
            "In this example, the dynamics is.",
            "Similar to poison process."
        ],
        [
            "This is another example of search interest on Google for the topic iPad and you see the two pics.",
            "Which are very largest, appearing somewhere with the interval of one year.",
            "The first pic is obviously the announcement of the first iPad.",
            "And the second pic is announcement of the second iPad, which looks just like receiving the same interest of people because the height of observed volume of publications of search interest is the same, which is a blue color, but apparently it received twice as small interest because of the height was cost, not just by interest by the trend occurring during the previous time.",
            "And.",
            "What we are interested in is analyzing how impacting where the events by observing the publication counts and what our system produces.",
            "Is this red triangles which have a sense of importance of events.",
            "So we want to construct robust and simple model of publication dynamics which would allow us to extract and analyze this event important and we want to do this by only observing the volume of publications only.",
            "The time series of numbers.",
            "And then we want to correlate only important events to time series of sentiment and see if they cost measurable shift in the sentiment we want to create only the important events.",
            "Becausw some unimportant would introduce.",
            "Obviously annoys and will not be correlated to sentiment.",
            "But there are some problems on this way.",
            "First of all, event importance is marked by a trend and overlapping events as you see in iPad 2 case, where US sales and iPad 2 introduction where coinciding and your sales were in the shade of interest connected to introduction.",
            "Also, the beginnings of events and their true longitudes are.",
            "Obscured by the trend and by the dynamics from previous events, and not hardly visible.",
            "For instance, in new year sales are hard to come by even when we see them.",
            "It's hard to determine when the event starts because the dynamics is.",
            "Said that, the interest of users is increasing constantly.",
            "It's monotonic.",
            "And finally, the different events have different dynamics because people react differently to impact and non impact in events and also it depends on which social media we're talking about.",
            "Of Twitter of Google or Facebook or others.",
            "OK, existing models.",
            "Proposed on this topic.",
            "We're primarily considering fitting the.",
            "Observing the observing volume of publications by some equations out of this, only a bunch of models are very few of them actually proposed something meaningful which can be described in which can describe peoples behavior.",
            "For instance, mean model proposed by Lescar cattle explains the response of people, the dynamics of news publications by.",
            "Imitation and recency.",
            "Components where people tend to publish more on recent events and they tend to publish more on those receiving greater attention from their community.",
            "Another model describes this dynamics by.",
            "Stochastic what I will which is good for fitted to the data because we have as many variables and parameters as a time points, but it's very bad for predicting the output cause of stochastic nature of this model.",
            "And finally the most robust model was proposed by Crane and Sornette.",
            "It is based on Hawkes Process person process which Interestingly takes roots from the analysis of earthquake."
        ],
        [
            "Our model is.",
            "We are modeling events dynamics.",
            "With the help of social media representing it as a dynamic system which takes events importance as input and outputs news publications, for instance tweets or news articles or blog posts and.",
            "Output volume, its shape and its dynamics depends a lot on the inherent parameter of social media of its response function.",
            "Which can be different for different media and different events."
        ],
        [
            "More details on that.",
            "First of all, events important.",
            "Has some.",
            "Parameters these are the height, the importance of the event, it's longitude and buildup or decay rates.",
            "In this paper we represent events important as a triangular shape, but this can be basically different rectangular for events receiving the constant attention throughout time like 4 Olympics or even spike shapes for events having no longitude.",
            "And combining events, importance and media response function, we produce the output signal.",
            "The volume of publications.",
            "So we can reconstruct the hidden importance of events by reversing this process by performing the deconvolution of the observed news volume with the help of media response function."
        ],
        [
            "So media response functions can be different.",
            "For instance, they can be linear where the rate of people losing interest to the topic is constant and doesn't depend on anything.",
            "You can treat the people in this case as a bunch of individuals they do not communicate, and all of them have the same parameters.",
            "Another type of dynamics commonly observed is exponential, where the rate of decline of interest is proportional to the.",
            "Quoting volume of publications or current volume of interested people here were talking about some kind of community where the more people are in community, the more interest each of the Members has to the topic and the most exciting kind of dynamics is hyperbolic, whereas the rate of decline of interest or buildup of interest is proportional to the square root number of participants.",
            "And here we are talking about.",
            "Number of connections in a group.",
            "We're talking about social networks and it is really exciting becausw.",
            "Only in the social networks in well connected systems we can see such kind of dynamics."
        ],
        [
            "And all of this response dynamics are different, and they're producing different kind of output to news publications.",
            "Here is the example.",
            "You can see that out of the same event importance which are triangles, linear, hyperbolic, and exponential models produce slightly different results in publication volumes, which are blue shapes the most.",
            "Impacting hyperbolic type of response have very sharp price and then very sharp decay with a very very long tail which lasts basically forever.",
            "Linear shapes are not so fast rising but also decaying to zero in a finite time, while exponential is the case somewhere in between."
        ],
        [
            "And.",
            "Co can we extract the original event importance from the time series of publication?",
            "Volume is by applying the deconvolution process.",
            "Hopefully it can be applied using Fourier transformation in a frequency domain so we don't need to solve a differential equation and we can apply the convolution for arbitrary response functions even of those not mentioned in this work.",
            "By learning the response function parameters or by simply.",
            "Processing the response function using a free transformation.",
            "Our method works in the following way.",
            "We first extract the peaks corresponding to news events and four.",
            "Such pics were analyzed.",
            "Once shape extract parameters of the decay and then we.",
            "Other research parameters across all the pics to come with respons function for that social media for that topic which we then deconvolve and produce.",
            "Such kind of output representing events important which is not a linear.",
            "Result it's not linearly dependent on the original volume, so for most impacting events, importance can be several orders of magnitude higher than for less impacting events, even if the volumes are different by just few percent."
        ],
        [
            "We experimented with datasets.",
            "One was mean data set consisting social media.",
            "During the United States elections of 2008, 2009, and we used the volume time series of top 100 topics or memes from the data set processed, the time series using granularity of four hours and smooth the data to have a cleaner output and our second data set contained 30 topics from extracted from Twitter for a period of half a year from July 2009 two.",
            "December 2009 and we process the data using granularity of six hours and smoothing.",
            "Then we measured the accuracy of our model by reversing.",
            "My first computing our events importance, approximating it as piecewise linear, triangular shapes and then reversing the process to see which output our model produces and compare it to the original volume.",
            "So we first extract.",
            "Parameters of response function.",
            "We deconvolve the original volume then approximate event importance strangler shapes.",
            "Then we can go with back and compare the output to the.",
            "And we measure root mean squared error of the two time series to see how different our prediction to the original."
        ],
        [
            "Just to compare our model to the NIM model on some data set our model used fixed parameters for all time series and for all picks in those time series and it.",
            "Credit twice smaller error compared to the meme model, which featured.",
            "Features parameters for every pick of every individual time series.",
            "You can see that difference is significant.",
            "Our model produces twice as small error compared to the model.",
            "And this is on their data set."
        ],
        [
            "Then we wanted to look how well different kinds of response dynamics perform on the name data set because its data set extracted from social media.",
            "So we see first of all that the linear type of dynamics produces the least error, which says that.",
            "Events or meetings in this media are short lived and probably people do not disseminate quite well such news.",
            "But hyperbolic type of dynamics who's also a very small error which can be just compared to the linear.",
            "So it's probably a mixture of topics, some of them receive collective attention, some of them receive attention on the individual level, and exponential model is obviously of the track.",
            "It produces the largest."
        ],
        [
            "Twitter data set is more interesting.",
            "We expected the Twitter to be.",
            "Favor in a linear models 'cause it's.",
            "Also, being a kind of social network is still inclined towards recent events, and events are short lived and people react as individuals.",
            "So linear model is obviously the better.",
            "The best fitting model here, but also hyperbolic and exponential model can be applied to certain cases and this greatly depends on the nature of event some events.",
            "Receive hyperbolic response.",
            "Some of them receive exponential response."
        ],
        [
            "Following this, we wanted to see how impacting events correlate with the sentiment sentiment Time series is.",
            "Indicating opinion of people.",
            "It can range from positive to negative overtime, but such time series is not correlated to news events.",
            "Becausw it is.",
            "Ranging from positive to negative, it is not bursty so to see the impact of nuisance sentiment extracted several measures, first one being positive volume than negative volume and measuring the cutting indicating the variance of sentiment switches contradiction.",
            "Such measures are bursty so they can be correlated to.",
            "New speaks and reapply jakartan cosine similarity to find the ratio of the correlation, and we maximize the time lag.",
            "We determined that I'm like by maximizing the correlations to see by which time the response of social media followed or preceded the event."
        ],
        [
            "And these are our results.",
            "We observed that for some events like movie premieres, we had positive expectation which represented by negative time lag for positive volume and the negative outcome.",
            "So people were expecting something interesting they were treating.",
            "Exciting going to movie premieres, but we're not so excited afterwards and for some events for some topic we see reverse case.",
            "We see a negative expectation and a positive outcome, which is for few of movies and such expected events or Sequela Summit Beer Summit or follow Friday."
        ],
        [
            "This is it.",
            "Thank you for your attention."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So my today's talk would be on news on their dynamics and on their impact on sentiment in Twitter.",
                    "label": 0
                },
                {
                    "sent": "So there's also here for a bit tired.",
                    "label": 0
                },
                {
                    "sent": "I would like to.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Wake you up with breaking news.",
                    "label": 1
                },
                {
                    "sent": "Yesterday it was a earthquake in California which woke people up in the middle of the night and there is a service which tracks how many people are awake of those who were there.",
                    "label": 1
                },
                {
                    "sent": "Sleeping bands.",
                    "label": 0
                },
                {
                    "sent": "So usually this sleeping activity pattern looks like that people are sleeping at 3:00 AM and there gradually going to sleep, gradually waking up and this is.",
                    "label": 0
                },
                {
                    "sent": "Was observed for the distant regions from the epicenter of earthquake.",
                    "label": 0
                },
                {
                    "sent": "For cities such Sacramento or San Jose, which were closer, you see a little bump in the middle, which indicates that some people were waken up by the earthquake.",
                    "label": 0
                },
                {
                    "sent": "For cities such as San Francisco or Oakland, which are closer to the epicenter, you see that this bump is increasing.",
                    "label": 0
                },
                {
                    "sent": "And finally for the epicenter, which was in neighbor, many people woke up during the earthquake and it took some time for them to go to sleep, and some of them even didn't wake up as I see.",
                    "label": 0
                },
                {
                    "sent": "It's, which is very strange because Earthquake was a largest one in 25 years.",
                    "label": 0
                },
                {
                    "sent": "So this shape of people waking up and gradually going to sleep it reminds.",
                    "label": 1
                },
                {
                    "sent": "Of the shapes observed during earthquakes of the magnitude of earthquakes, and it's actually interesting question whether such social activity or personal activity can be actually described as a physical process.",
                    "label": 0
                },
                {
                    "sent": "In this example, the dynamics is.",
                    "label": 0
                },
                {
                    "sent": "Similar to poison process.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is another example of search interest on Google for the topic iPad and you see the two pics.",
                    "label": 0
                },
                {
                    "sent": "Which are very largest, appearing somewhere with the interval of one year.",
                    "label": 0
                },
                {
                    "sent": "The first pic is obviously the announcement of the first iPad.",
                    "label": 0
                },
                {
                    "sent": "And the second pic is announcement of the second iPad, which looks just like receiving the same interest of people because the height of observed volume of publications of search interest is the same, which is a blue color, but apparently it received twice as small interest because of the height was cost, not just by interest by the trend occurring during the previous time.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "What we are interested in is analyzing how impacting where the events by observing the publication counts and what our system produces.",
                    "label": 0
                },
                {
                    "sent": "Is this red triangles which have a sense of importance of events.",
                    "label": 0
                },
                {
                    "sent": "So we want to construct robust and simple model of publication dynamics which would allow us to extract and analyze this event important and we want to do this by only observing the volume of publications only.",
                    "label": 1
                },
                {
                    "sent": "The time series of numbers.",
                    "label": 0
                },
                {
                    "sent": "And then we want to correlate only important events to time series of sentiment and see if they cost measurable shift in the sentiment we want to create only the important events.",
                    "label": 0
                },
                {
                    "sent": "Becausw some unimportant would introduce.",
                    "label": 0
                },
                {
                    "sent": "Obviously annoys and will not be correlated to sentiment.",
                    "label": 0
                },
                {
                    "sent": "But there are some problems on this way.",
                    "label": 1
                },
                {
                    "sent": "First of all, event importance is marked by a trend and overlapping events as you see in iPad 2 case, where US sales and iPad 2 introduction where coinciding and your sales were in the shade of interest connected to introduction.",
                    "label": 0
                },
                {
                    "sent": "Also, the beginnings of events and their true longitudes are.",
                    "label": 1
                },
                {
                    "sent": "Obscured by the trend and by the dynamics from previous events, and not hardly visible.",
                    "label": 0
                },
                {
                    "sent": "For instance, in new year sales are hard to come by even when we see them.",
                    "label": 0
                },
                {
                    "sent": "It's hard to determine when the event starts because the dynamics is.",
                    "label": 0
                },
                {
                    "sent": "Said that, the interest of users is increasing constantly.",
                    "label": 0
                },
                {
                    "sent": "It's monotonic.",
                    "label": 0
                },
                {
                    "sent": "And finally, the different events have different dynamics because people react differently to impact and non impact in events and also it depends on which social media we're talking about.",
                    "label": 0
                },
                {
                    "sent": "Of Twitter of Google or Facebook or others.",
                    "label": 0
                },
                {
                    "sent": "OK, existing models.",
                    "label": 0
                },
                {
                    "sent": "Proposed on this topic.",
                    "label": 0
                },
                {
                    "sent": "We're primarily considering fitting the.",
                    "label": 0
                },
                {
                    "sent": "Observing the observing volume of publications by some equations out of this, only a bunch of models are very few of them actually proposed something meaningful which can be described in which can describe peoples behavior.",
                    "label": 0
                },
                {
                    "sent": "For instance, mean model proposed by Lescar cattle explains the response of people, the dynamics of news publications by.",
                    "label": 0
                },
                {
                    "sent": "Imitation and recency.",
                    "label": 0
                },
                {
                    "sent": "Components where people tend to publish more on recent events and they tend to publish more on those receiving greater attention from their community.",
                    "label": 0
                },
                {
                    "sent": "Another model describes this dynamics by.",
                    "label": 0
                },
                {
                    "sent": "Stochastic what I will which is good for fitted to the data because we have as many variables and parameters as a time points, but it's very bad for predicting the output cause of stochastic nature of this model.",
                    "label": 0
                },
                {
                    "sent": "And finally the most robust model was proposed by Crane and Sornette.",
                    "label": 0
                },
                {
                    "sent": "It is based on Hawkes Process person process which Interestingly takes roots from the analysis of earthquake.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our model is.",
                    "label": 0
                },
                {
                    "sent": "We are modeling events dynamics.",
                    "label": 0
                },
                {
                    "sent": "With the help of social media representing it as a dynamic system which takes events importance as input and outputs news publications, for instance tweets or news articles or blog posts and.",
                    "label": 1
                },
                {
                    "sent": "Output volume, its shape and its dynamics depends a lot on the inherent parameter of social media of its response function.",
                    "label": 0
                },
                {
                    "sent": "Which can be different for different media and different events.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "More details on that.",
                    "label": 0
                },
                {
                    "sent": "First of all, events important.",
                    "label": 0
                },
                {
                    "sent": "Has some.",
                    "label": 0
                },
                {
                    "sent": "Parameters these are the height, the importance of the event, it's longitude and buildup or decay rates.",
                    "label": 1
                },
                {
                    "sent": "In this paper we represent events important as a triangular shape, but this can be basically different rectangular for events receiving the constant attention throughout time like 4 Olympics or even spike shapes for events having no longitude.",
                    "label": 0
                },
                {
                    "sent": "And combining events, importance and media response function, we produce the output signal.",
                    "label": 1
                },
                {
                    "sent": "The volume of publications.",
                    "label": 0
                },
                {
                    "sent": "So we can reconstruct the hidden importance of events by reversing this process by performing the deconvolution of the observed news volume with the help of media response function.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So media response functions can be different.",
                    "label": 1
                },
                {
                    "sent": "For instance, they can be linear where the rate of people losing interest to the topic is constant and doesn't depend on anything.",
                    "label": 1
                },
                {
                    "sent": "You can treat the people in this case as a bunch of individuals they do not communicate, and all of them have the same parameters.",
                    "label": 1
                },
                {
                    "sent": "Another type of dynamics commonly observed is exponential, where the rate of decline of interest is proportional to the.",
                    "label": 0
                },
                {
                    "sent": "Quoting volume of publications or current volume of interested people here were talking about some kind of community where the more people are in community, the more interest each of the Members has to the topic and the most exciting kind of dynamics is hyperbolic, whereas the rate of decline of interest or buildup of interest is proportional to the square root number of participants.",
                    "label": 1
                },
                {
                    "sent": "And here we are talking about.",
                    "label": 0
                },
                {
                    "sent": "Number of connections in a group.",
                    "label": 0
                },
                {
                    "sent": "We're talking about social networks and it is really exciting becausw.",
                    "label": 0
                },
                {
                    "sent": "Only in the social networks in well connected systems we can see such kind of dynamics.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And all of this response dynamics are different, and they're producing different kind of output to news publications.",
                    "label": 0
                },
                {
                    "sent": "Here is the example.",
                    "label": 0
                },
                {
                    "sent": "You can see that out of the same event importance which are triangles, linear, hyperbolic, and exponential models produce slightly different results in publication volumes, which are blue shapes the most.",
                    "label": 0
                },
                {
                    "sent": "Impacting hyperbolic type of response have very sharp price and then very sharp decay with a very very long tail which lasts basically forever.",
                    "label": 0
                },
                {
                    "sent": "Linear shapes are not so fast rising but also decaying to zero in a finite time, while exponential is the case somewhere in between.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Co can we extract the original event importance from the time series of publication?",
                    "label": 0
                },
                {
                    "sent": "Volume is by applying the deconvolution process.",
                    "label": 0
                },
                {
                    "sent": "Hopefully it can be applied using Fourier transformation in a frequency domain so we don't need to solve a differential equation and we can apply the convolution for arbitrary response functions even of those not mentioned in this work.",
                    "label": 0
                },
                {
                    "sent": "By learning the response function parameters or by simply.",
                    "label": 0
                },
                {
                    "sent": "Processing the response function using a free transformation.",
                    "label": 0
                },
                {
                    "sent": "Our method works in the following way.",
                    "label": 1
                },
                {
                    "sent": "We first extract the peaks corresponding to news events and four.",
                    "label": 1
                },
                {
                    "sent": "Such pics were analyzed.",
                    "label": 0
                },
                {
                    "sent": "Once shape extract parameters of the decay and then we.",
                    "label": 0
                },
                {
                    "sent": "Other research parameters across all the pics to come with respons function for that social media for that topic which we then deconvolve and produce.",
                    "label": 0
                },
                {
                    "sent": "Such kind of output representing events important which is not a linear.",
                    "label": 0
                },
                {
                    "sent": "Result it's not linearly dependent on the original volume, so for most impacting events, importance can be several orders of magnitude higher than for less impacting events, even if the volumes are different by just few percent.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We experimented with datasets.",
                    "label": 0
                },
                {
                    "sent": "One was mean data set consisting social media.",
                    "label": 0
                },
                {
                    "sent": "During the United States elections of 2008, 2009, and we used the volume time series of top 100 topics or memes from the data set processed, the time series using granularity of four hours and smooth the data to have a cleaner output and our second data set contained 30 topics from extracted from Twitter for a period of half a year from July 2009 two.",
                    "label": 1
                },
                {
                    "sent": "December 2009 and we process the data using granularity of six hours and smoothing.",
                    "label": 1
                },
                {
                    "sent": "Then we measured the accuracy of our model by reversing.",
                    "label": 0
                },
                {
                    "sent": "My first computing our events importance, approximating it as piecewise linear, triangular shapes and then reversing the process to see which output our model produces and compare it to the original volume.",
                    "label": 1
                },
                {
                    "sent": "So we first extract.",
                    "label": 0
                },
                {
                    "sent": "Parameters of response function.",
                    "label": 0
                },
                {
                    "sent": "We deconvolve the original volume then approximate event importance strangler shapes.",
                    "label": 0
                },
                {
                    "sent": "Then we can go with back and compare the output to the.",
                    "label": 0
                },
                {
                    "sent": "And we measure root mean squared error of the two time series to see how different our prediction to the original.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just to compare our model to the NIM model on some data set our model used fixed parameters for all time series and for all picks in those time series and it.",
                    "label": 1
                },
                {
                    "sent": "Credit twice smaller error compared to the meme model, which featured.",
                    "label": 0
                },
                {
                    "sent": "Features parameters for every pick of every individual time series.",
                    "label": 0
                },
                {
                    "sent": "You can see that difference is significant.",
                    "label": 0
                },
                {
                    "sent": "Our model produces twice as small error compared to the model.",
                    "label": 0
                },
                {
                    "sent": "And this is on their data set.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then we wanted to look how well different kinds of response dynamics perform on the name data set because its data set extracted from social media.",
                    "label": 0
                },
                {
                    "sent": "So we see first of all that the linear type of dynamics produces the least error, which says that.",
                    "label": 0
                },
                {
                    "sent": "Events or meetings in this media are short lived and probably people do not disseminate quite well such news.",
                    "label": 0
                },
                {
                    "sent": "But hyperbolic type of dynamics who's also a very small error which can be just compared to the linear.",
                    "label": 0
                },
                {
                    "sent": "So it's probably a mixture of topics, some of them receive collective attention, some of them receive attention on the individual level, and exponential model is obviously of the track.",
                    "label": 0
                },
                {
                    "sent": "It produces the largest.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Twitter data set is more interesting.",
                    "label": 0
                },
                {
                    "sent": "We expected the Twitter to be.",
                    "label": 0
                },
                {
                    "sent": "Favor in a linear models 'cause it's.",
                    "label": 0
                },
                {
                    "sent": "Also, being a kind of social network is still inclined towards recent events, and events are short lived and people react as individuals.",
                    "label": 0
                },
                {
                    "sent": "So linear model is obviously the better.",
                    "label": 0
                },
                {
                    "sent": "The best fitting model here, but also hyperbolic and exponential model can be applied to certain cases and this greatly depends on the nature of event some events.",
                    "label": 0
                },
                {
                    "sent": "Receive hyperbolic response.",
                    "label": 0
                },
                {
                    "sent": "Some of them receive exponential response.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Following this, we wanted to see how impacting events correlate with the sentiment sentiment Time series is.",
                    "label": 0
                },
                {
                    "sent": "Indicating opinion of people.",
                    "label": 0
                },
                {
                    "sent": "It can range from positive to negative overtime, but such time series is not correlated to news events.",
                    "label": 0
                },
                {
                    "sent": "Becausw it is.",
                    "label": 0
                },
                {
                    "sent": "Ranging from positive to negative, it is not bursty so to see the impact of nuisance sentiment extracted several measures, first one being positive volume than negative volume and measuring the cutting indicating the variance of sentiment switches contradiction.",
                    "label": 0
                },
                {
                    "sent": "Such measures are bursty so they can be correlated to.",
                    "label": 0
                },
                {
                    "sent": "New speaks and reapply jakartan cosine similarity to find the ratio of the correlation, and we maximize the time lag.",
                    "label": 0
                },
                {
                    "sent": "We determined that I'm like by maximizing the correlations to see by which time the response of social media followed or preceded the event.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And these are our results.",
                    "label": 0
                },
                {
                    "sent": "We observed that for some events like movie premieres, we had positive expectation which represented by negative time lag for positive volume and the negative outcome.",
                    "label": 0
                },
                {
                    "sent": "So people were expecting something interesting they were treating.",
                    "label": 0
                },
                {
                    "sent": "Exciting going to movie premieres, but we're not so excited afterwards and for some events for some topic we see reverse case.",
                    "label": 0
                },
                {
                    "sent": "We see a negative expectation and a positive outcome, which is for few of movies and such expected events or Sequela Summit Beer Summit or follow Friday.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is it.",
                    "label": 0
                },
                {
                    "sent": "Thank you for your attention.",
                    "label": 0
                }
            ]
        }
    }
}