{
    "id": "zntti46h7mk3hzhb4fueb7k7ybwl6ypi",
    "title": "High-Order Multi-Task Feature Learning to Identify Longitudinal Phenotypic Markers for Alzheimer Disease Progression Prediction",
    "info": {
        "author": [
            "Hua Wang, Department of Electrical Engineering & Computer Science, Colorado School of Mines"
        ],
        "published": "Jan. 16, 2013",
        "recorded": "December 2012",
        "category": [
            "Top->Biology->Neuroscience",
            "Top->Computer Science->Machine Learning->Supervised Learning"
        ]
    },
    "url": "http://videolectures.net/nips2012_wang_alzheimer_disease/",
    "segmentation": [
        [
            "Good afternoon everyone.",
            "It is my great pleasure to present our paper high Order Multi Task feature learning to identify a longitudinal phenotypic markers for ultimate disease progression prediction.",
            "Kind of long title.",
            "My name is how long I come from Colorado school mines.",
            "This work was done when I was at University of Texas at Arlington and it's also a part of the joint project collaborated with Indiana University School of Medicine.",
            "So I'm going."
        ],
        [
            "So first introduce some background and motivations of this work.",
            "Then I'm going to introduce our new method followed by the report of our empirical studies.",
            "So now let's start from."
        ],
        [
            "The backgrounds and motivations."
        ],
        [
            "So many major diseases are important concerns in modern modern society such as neurodegenerative disorders and cancers."
        ],
        [
            "Recent research has shown that neurodegenerative disorders are closely connected to regional and functional changes on the patient."
        ],
        [
            "In so if we could elucidate the interrelationship between the variation of human brains as well and the progression of the disease, then it could help us to better diagnose, diagnose the disease, and treat the patient.",
            "So this is meant target of this paper.",
            "For put disease progression prediction different from traditional learning problems where we make prediction over a single data point in longitudinal disease progression prediction, our prediction target is a trajectory as shown in the figure over here.",
            "So basically for the patient during the ultimate disease progression history, we can collect a set of a set of data.",
            "Using different imaging modality measures and also perform cognitive assessment for the same same set of subjects so that we can know the memory score are changed over the progression.",
            "So our target is to predict the prediction by using the longitudinal imaging marker measurements."
        ],
        [
            "In traditional Association study, typically a single summarized value such as average change rate change, our slope is used to make prediction.",
            "So for the example showing in the left part over here, we have two groups of participants.",
            "They have a different status for the ultimate dizzy, so their trajectory can be clearly differentiated if use on only one summarized value, such as slope.",
            "Average value, but in general the trajectory are typically tangled together, so it is inadequate to use only one single value to make prediction.",
            "So as shown in the right example over here, we can see that.",
            "Cognitive assessment results for the memory score are same as the two different point as a very beginning at the very end time .0 and three.",
            "So in this case it is not very easy to use one single memorize a single summarized value to make the prediction."
        ],
        [
            "So our work is try to discover.",
            "I imagine markers associated with cognitive trajectory's so that we can fully differentiate the entire, uh, longitudinal profiles, to help the other to help identify relevant imaging markers.",
            "Because of the longitudinal features, in order to design effective learning model, we are facing some challenges and also have some opportunities to improve the prediction performance.",
            "The most important challenges."
        ],
        [
            "Both are input neuroimaging measurements and output.",
            "Cognitive scores are 3D tensors, so this is different from our traditional learning model where we use data matrices and indication.",
            "Matrices as output.",
            "And all."
        ],
        [
            "So the task in the ultimate disease progression cause as correlated in different way.",
            "That means are different different tasks are correlated together and also for the same cost at consecutive time point are also correlated.",
            "So how to use them is another problem.",
            "For example, for the KVLT cognitive assessment, here are listed the Six Test performed for this assessment.",
            "So each different test will yield memory score, and we can see that the number of words that remembered in the first trials by the participant heavily impact the number of words that can be recorded in the six trail and the result of the both tests.",
            "Directly connected to the final recognition rates after 30 minutes delay.",
            "So obviously all the tasks are correlated.",
            "Also, according to the previous studies, we know that for the same task at different at consecutive time point, they are also connected to each other.",
            "So in this work, our goal is to deal with as the ultimate disease progression prediction using the longitudinal imaging data and also we hope we can incorporate the correlations in different way to improve our prediction model.",
            "So now let's move on to the method."
        ],
        [
            "We have proposed high order multitask feature learning, so before we move on, let's first see the problem we want to solve basically Association of."
        ],
        [
            "Do they know image in marker and asthma disease progression?",
            "So for hours about disease progression prediction using the longitudinal phenotypic markers, the input image in features are a set of metrics denoted over here.",
            "So this corresponding to the image in Image Ng feature measurements at consecutive data points and each matrix is a measurement for a certain type of image markers at time point.",
            "So obviously the input data X is a tensor with D different images.",
            "Image in features and participants and T consecutive points so simple."
        ],
        [
            "Only the output for the prediction is a cognitive assessment for the same set of subjects, which denoted by a set of matrix matrices for a certain type of cognitive measurement at the same TI consecutive point.",
            "Again, the output Y is a tensor with samples, see scores corresponding to see learning tasks at the T consecutive data points."
        ],
        [
            "So our goal is to learn from the input tensor X an output tensor YA model that can reveal the longitudinal Association between the image Ng and cognitive trajectories, by which we hope we can better understand how the variation of different regions are human brain to effect the ultimate disease progression so that we can improve the diagnosis and treatment for the disease.",
            "So as a result, what we want to learn is a stack of parimeter matrix as illustrated in the picture.",
            "So this again is a tensor.",
            "So the fundamental challenge in this type of prediction task is that we have to learn a parimeter tensor, so it is not trivial to generalize the existing method to solve this type of problems."
        ],
        [
            "In conventional Association studies, multivariate regression, which is basically linear regression, has widely used to associate image markers and projective and cognitive measurements, so this method can be summarized to minimize the objective showing this slide.",
            "Because of the flat nature of the Frobenius norm over the matrix and the squared L2 norm, regularization over the parameter vector.",
            "This objective actually can be."
        ],
        [
            "They coupled for each different tasks at different time points.",
            "So as a result this model has no capability to make use the longitudinal correlations that exist in available data.",
            "So in order to address this prob."
        ],
        [
            "Column in our work.",
            "We hope to simultaneously performing the T groups of learning tasks and consider them as an integral learning target, and Meanwhile we hope to select the image and features that are relevant to the temporal pattern change over the whole elsamma disease progression."
        ],
        [
            "So instead of to use as a traditional squared L2 norm regularization in regression, we replace it by the L2 one norm defined over the matrix unfolded from the perimeter from the parimeter tensor along the feature mode.",
            "So as a result, we can see that for each individual feature in this unfolded matrix, they will across they will go across all the time points.",
            "So because of the mathematical nature of ultra one of regularization, the select imaging features will be relevant to the whole Altima disease progression.",
            "Then the next step we want to do is to capture the longitudinal correlations.",
            "Here we want to take care of two types of correlations mentioned before, so the first one is correlation among different tasks and second one is the correlation for the same task but at different consecutive time points.",
            "So besides the first 2 terms in the first slides, we achieve this goal by Additionally incorporates the low rank regularization.",
            "Through the Matrix is to the matrices unfolded from the perimeter tensor along different mode, which are illustrated in the figures over here.",
            "So in the middle figure it corresponding the first trace norm regularization term.",
            "So we can see that the parameter matrix at T consecutive consecutive time point are concatenated together.",
            "So in this folded matrix we consider all the learning task at different time points.",
            "Parallel, so if this matrix is low rank, then the correlation among different tasks can be incorporated.",
            "So similarly in the last regularization term for each individual task, the parameters at different time points are put together.",
            "So if this matrix is low rank, then the correlations for the same task at different time points will be incorporated.",
            "Because in our learning model we Additionally consider one more dimension overtime.",
            "So we call our learning model as a."
        ],
        [
            "High Dimensional multi task learning model and the ultimate goal of this work is trying to identify a subset of image markers that are relevant to the whole progression of Alzheimer's disease development.",
            "So we call our model as high order multitask feature learning model.",
            "So this is a model is summarized by learning objective in this slide.",
            "Well, although this method has clear intuition, but unfortunately it is not easy to solve because it involves three nouns, most terms, so we propose."
        ],
        [
            "Efficient algorithm to solve this one by using the iterative rivet method.",
            "The key point here is that we use three latent variables to solve to deal with non smoothness of the three fertilization terms and based on this latent variable we can decouple the problem into smaller size which is for each different time time point in Step 3.",
            "So in the end the problem can be solved.",
            "Most importantly we have proved rigorously prove the efficiency convergence of that.",
            "Of this algorithm, that is, this algorithm monotonically decrease the objective in each iteration until it converges to the globally optimal solution."
        ],
        [
            "Now let's see the empirical results by using this method.",
            "Here we apply our method on the asthma dizzy."
        ],
        [
            "Neuro in General Neuroimaging initiative data.",
            "This project is sponsored by Edge and a few big companies.",
            "It involves three different groups of participants, including normal people, mild cognitive impairment, people, an asthma disease, people over a certain time period so that this is a longitudinal data.",
            "In our experiment, we consider we consider four time points, including the baseline time point as very beginning.",
            "And as a result, at the next six months, 12 months and 24 months, the first experiment is to compare to make cognitive score."
        ],
        [
            "Regression prediction and we compare our new method against two baseline method including linear regression and Ridge regression.",
            "And also we compare a very recent method published in KDD conference and last year which is which is able to deal with longitudinal data pattern but can only deal with one cognitive one memory score at a time.",
            "So it has no capability to incorporate task correlations.",
            "So from this numerical result we can see that our method is obviously better for cognitive score progression prediction and the the final experiment result.",
            "I want to present is."
        ],
        [
            "Identification of longitudinal imaging markers in the top panel.",
            "The horizontal axis corresponding to the different regions regions in the human brain and the vertical axis corresponding to different time points.",
            "We can see that all the selected image markers are longitudinally stable and most importantly, there very suggestive as we can see.",
            "For example, these two images markers that corresponding to the left and right hippocampus in human brain.",
            "It is well known to be a good indicator for ultimate easy, so this result demonstrates the effectiveness and correctness of our new method from both practical perspective and clinical perspective.",
            "So this is our new method where we want to solve the asthma disease progression prediction using longitudinal data."
        ],
        [
            "Any questions are very welcome."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good afternoon everyone.",
                    "label": 0
                },
                {
                    "sent": "It is my great pleasure to present our paper high Order Multi Task feature learning to identify a longitudinal phenotypic markers for ultimate disease progression prediction.",
                    "label": 1
                },
                {
                    "sent": "Kind of long title.",
                    "label": 0
                },
                {
                    "sent": "My name is how long I come from Colorado school mines.",
                    "label": 1
                },
                {
                    "sent": "This work was done when I was at University of Texas at Arlington and it's also a part of the joint project collaborated with Indiana University School of Medicine.",
                    "label": 0
                },
                {
                    "sent": "So I'm going.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So first introduce some background and motivations of this work.",
                    "label": 0
                },
                {
                    "sent": "Then I'm going to introduce our new method followed by the report of our empirical studies.",
                    "label": 0
                },
                {
                    "sent": "So now let's start from.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The backgrounds and motivations.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So many major diseases are important concerns in modern modern society such as neurodegenerative disorders and cancers.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Recent research has shown that neurodegenerative disorders are closely connected to regional and functional changes on the patient.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In so if we could elucidate the interrelationship between the variation of human brains as well and the progression of the disease, then it could help us to better diagnose, diagnose the disease, and treat the patient.",
                    "label": 0
                },
                {
                    "sent": "So this is meant target of this paper.",
                    "label": 0
                },
                {
                    "sent": "For put disease progression prediction different from traditional learning problems where we make prediction over a single data point in longitudinal disease progression prediction, our prediction target is a trajectory as shown in the figure over here.",
                    "label": 0
                },
                {
                    "sent": "So basically for the patient during the ultimate disease progression history, we can collect a set of a set of data.",
                    "label": 0
                },
                {
                    "sent": "Using different imaging modality measures and also perform cognitive assessment for the same same set of subjects so that we can know the memory score are changed over the progression.",
                    "label": 0
                },
                {
                    "sent": "So our target is to predict the prediction by using the longitudinal imaging marker measurements.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In traditional Association study, typically a single summarized value such as average change rate change, our slope is used to make prediction.",
                    "label": 1
                },
                {
                    "sent": "So for the example showing in the left part over here, we have two groups of participants.",
                    "label": 0
                },
                {
                    "sent": "They have a different status for the ultimate dizzy, so their trajectory can be clearly differentiated if use on only one summarized value, such as slope.",
                    "label": 1
                },
                {
                    "sent": "Average value, but in general the trajectory are typically tangled together, so it is inadequate to use only one single value to make prediction.",
                    "label": 0
                },
                {
                    "sent": "So as shown in the right example over here, we can see that.",
                    "label": 0
                },
                {
                    "sent": "Cognitive assessment results for the memory score are same as the two different point as a very beginning at the very end time .0 and three.",
                    "label": 0
                },
                {
                    "sent": "So in this case it is not very easy to use one single memorize a single summarized value to make the prediction.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So our work is try to discover.",
                    "label": 1
                },
                {
                    "sent": "I imagine markers associated with cognitive trajectory's so that we can fully differentiate the entire, uh, longitudinal profiles, to help the other to help identify relevant imaging markers.",
                    "label": 1
                },
                {
                    "sent": "Because of the longitudinal features, in order to design effective learning model, we are facing some challenges and also have some opportunities to improve the prediction performance.",
                    "label": 0
                },
                {
                    "sent": "The most important challenges.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Both are input neuroimaging measurements and output.",
                    "label": 0
                },
                {
                    "sent": "Cognitive scores are 3D tensors, so this is different from our traditional learning model where we use data matrices and indication.",
                    "label": 0
                },
                {
                    "sent": "Matrices as output.",
                    "label": 0
                },
                {
                    "sent": "And all.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the task in the ultimate disease progression cause as correlated in different way.",
                    "label": 1
                },
                {
                    "sent": "That means are different different tasks are correlated together and also for the same cost at consecutive time point are also correlated.",
                    "label": 1
                },
                {
                    "sent": "So how to use them is another problem.",
                    "label": 0
                },
                {
                    "sent": "For example, for the KVLT cognitive assessment, here are listed the Six Test performed for this assessment.",
                    "label": 1
                },
                {
                    "sent": "So each different test will yield memory score, and we can see that the number of words that remembered in the first trials by the participant heavily impact the number of words that can be recorded in the six trail and the result of the both tests.",
                    "label": 0
                },
                {
                    "sent": "Directly connected to the final recognition rates after 30 minutes delay.",
                    "label": 0
                },
                {
                    "sent": "So obviously all the tasks are correlated.",
                    "label": 0
                },
                {
                    "sent": "Also, according to the previous studies, we know that for the same task at different at consecutive time point, they are also connected to each other.",
                    "label": 0
                },
                {
                    "sent": "So in this work, our goal is to deal with as the ultimate disease progression prediction using the longitudinal imaging data and also we hope we can incorporate the correlations in different way to improve our prediction model.",
                    "label": 0
                },
                {
                    "sent": "So now let's move on to the method.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have proposed high order multitask feature learning, so before we move on, let's first see the problem we want to solve basically Association of.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Do they know image in marker and asthma disease progression?",
                    "label": 0
                },
                {
                    "sent": "So for hours about disease progression prediction using the longitudinal phenotypic markers, the input image in features are a set of metrics denoted over here.",
                    "label": 1
                },
                {
                    "sent": "So this corresponding to the image in Image Ng feature measurements at consecutive data points and each matrix is a measurement for a certain type of image markers at time point.",
                    "label": 0
                },
                {
                    "sent": "So obviously the input data X is a tensor with D different images.",
                    "label": 0
                },
                {
                    "sent": "Image in features and participants and T consecutive points so simple.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Only the output for the prediction is a cognitive assessment for the same set of subjects, which denoted by a set of matrix matrices for a certain type of cognitive measurement at the same TI consecutive point.",
                    "label": 0
                },
                {
                    "sent": "Again, the output Y is a tensor with samples, see scores corresponding to see learning tasks at the T consecutive data points.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So our goal is to learn from the input tensor X an output tensor YA model that can reveal the longitudinal Association between the image Ng and cognitive trajectories, by which we hope we can better understand how the variation of different regions are human brain to effect the ultimate disease progression so that we can improve the diagnosis and treatment for the disease.",
                    "label": 1
                },
                {
                    "sent": "So as a result, what we want to learn is a stack of parimeter matrix as illustrated in the picture.",
                    "label": 0
                },
                {
                    "sent": "So this again is a tensor.",
                    "label": 0
                },
                {
                    "sent": "So the fundamental challenge in this type of prediction task is that we have to learn a parimeter tensor, so it is not trivial to generalize the existing method to solve this type of problems.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In conventional Association studies, multivariate regression, which is basically linear regression, has widely used to associate image markers and projective and cognitive measurements, so this method can be summarized to minimize the objective showing this slide.",
                    "label": 1
                },
                {
                    "sent": "Because of the flat nature of the Frobenius norm over the matrix and the squared L2 norm, regularization over the parameter vector.",
                    "label": 0
                },
                {
                    "sent": "This objective actually can be.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "They coupled for each different tasks at different time points.",
                    "label": 1
                },
                {
                    "sent": "So as a result this model has no capability to make use the longitudinal correlations that exist in available data.",
                    "label": 1
                },
                {
                    "sent": "So in order to address this prob.",
                    "label": 1
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Column in our work.",
                    "label": 0
                },
                {
                    "sent": "We hope to simultaneously performing the T groups of learning tasks and consider them as an integral learning target, and Meanwhile we hope to select the image and features that are relevant to the temporal pattern change over the whole elsamma disease progression.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So instead of to use as a traditional squared L2 norm regularization in regression, we replace it by the L2 one norm defined over the matrix unfolded from the perimeter from the parimeter tensor along the feature mode.",
                    "label": 0
                },
                {
                    "sent": "So as a result, we can see that for each individual feature in this unfolded matrix, they will across they will go across all the time points.",
                    "label": 0
                },
                {
                    "sent": "So because of the mathematical nature of ultra one of regularization, the select imaging features will be relevant to the whole Altima disease progression.",
                    "label": 1
                },
                {
                    "sent": "Then the next step we want to do is to capture the longitudinal correlations.",
                    "label": 1
                },
                {
                    "sent": "Here we want to take care of two types of correlations mentioned before, so the first one is correlation among different tasks and second one is the correlation for the same task but at different consecutive time points.",
                    "label": 0
                },
                {
                    "sent": "So besides the first 2 terms in the first slides, we achieve this goal by Additionally incorporates the low rank regularization.",
                    "label": 0
                },
                {
                    "sent": "Through the Matrix is to the matrices unfolded from the perimeter tensor along different mode, which are illustrated in the figures over here.",
                    "label": 1
                },
                {
                    "sent": "So in the middle figure it corresponding the first trace norm regularization term.",
                    "label": 0
                },
                {
                    "sent": "So we can see that the parameter matrix at T consecutive consecutive time point are concatenated together.",
                    "label": 1
                },
                {
                    "sent": "So in this folded matrix we consider all the learning task at different time points.",
                    "label": 0
                },
                {
                    "sent": "Parallel, so if this matrix is low rank, then the correlation among different tasks can be incorporated.",
                    "label": 1
                },
                {
                    "sent": "So similarly in the last regularization term for each individual task, the parameters at different time points are put together.",
                    "label": 0
                },
                {
                    "sent": "So if this matrix is low rank, then the correlations for the same task at different time points will be incorporated.",
                    "label": 1
                },
                {
                    "sent": "Because in our learning model we Additionally consider one more dimension overtime.",
                    "label": 0
                },
                {
                    "sent": "So we call our learning model as a.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "High Dimensional multi task learning model and the ultimate goal of this work is trying to identify a subset of image markers that are relevant to the whole progression of Alzheimer's disease development.",
                    "label": 1
                },
                {
                    "sent": "So we call our model as high order multitask feature learning model.",
                    "label": 0
                },
                {
                    "sent": "So this is a model is summarized by learning objective in this slide.",
                    "label": 0
                },
                {
                    "sent": "Well, although this method has clear intuition, but unfortunately it is not easy to solve because it involves three nouns, most terms, so we propose.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Efficient algorithm to solve this one by using the iterative rivet method.",
                    "label": 1
                },
                {
                    "sent": "The key point here is that we use three latent variables to solve to deal with non smoothness of the three fertilization terms and based on this latent variable we can decouple the problem into smaller size which is for each different time time point in Step 3.",
                    "label": 0
                },
                {
                    "sent": "So in the end the problem can be solved.",
                    "label": 0
                },
                {
                    "sent": "Most importantly we have proved rigorously prove the efficiency convergence of that.",
                    "label": 0
                },
                {
                    "sent": "Of this algorithm, that is, this algorithm monotonically decrease the objective in each iteration until it converges to the globally optimal solution.",
                    "label": 1
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now let's see the empirical results by using this method.",
                    "label": 0
                },
                {
                    "sent": "Here we apply our method on the asthma dizzy.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Neuro in General Neuroimaging initiative data.",
                    "label": 1
                },
                {
                    "sent": "This project is sponsored by Edge and a few big companies.",
                    "label": 0
                },
                {
                    "sent": "It involves three different groups of participants, including normal people, mild cognitive impairment, people, an asthma disease, people over a certain time period so that this is a longitudinal data.",
                    "label": 0
                },
                {
                    "sent": "In our experiment, we consider we consider four time points, including the baseline time point as very beginning.",
                    "label": 0
                },
                {
                    "sent": "And as a result, at the next six months, 12 months and 24 months, the first experiment is to compare to make cognitive score.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Regression prediction and we compare our new method against two baseline method including linear regression and Ridge regression.",
                    "label": 0
                },
                {
                    "sent": "And also we compare a very recent method published in KDD conference and last year which is which is able to deal with longitudinal data pattern but can only deal with one cognitive one memory score at a time.",
                    "label": 0
                },
                {
                    "sent": "So it has no capability to incorporate task correlations.",
                    "label": 0
                },
                {
                    "sent": "So from this numerical result we can see that our method is obviously better for cognitive score progression prediction and the the final experiment result.",
                    "label": 1
                },
                {
                    "sent": "I want to present is.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Identification of longitudinal imaging markers in the top panel.",
                    "label": 1
                },
                {
                    "sent": "The horizontal axis corresponding to the different regions regions in the human brain and the vertical axis corresponding to different time points.",
                    "label": 0
                },
                {
                    "sent": "We can see that all the selected image markers are longitudinally stable and most importantly, there very suggestive as we can see.",
                    "label": 0
                },
                {
                    "sent": "For example, these two images markers that corresponding to the left and right hippocampus in human brain.",
                    "label": 0
                },
                {
                    "sent": "It is well known to be a good indicator for ultimate easy, so this result demonstrates the effectiveness and correctness of our new method from both practical perspective and clinical perspective.",
                    "label": 1
                },
                {
                    "sent": "So this is our new method where we want to solve the asthma disease progression prediction using longitudinal data.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Any questions are very welcome.",
                    "label": 0
                }
            ]
        }
    }
}