{
    "id": "zsn5o4i6ohq5ncmhyb742wisqbpawfwg",
    "title": "Does an efficient calibrated forecasting strategy exist?",
    "info": {
        "author": [
            "Jacob Abernethy, Department of Electrical Engineering and Computer Sciences, UC Berkeley"
        ],
        "published": "Aug. 2, 2011",
        "recorded": "July 2011",
        "category": [
            "Top->Computer Science->Machine Learning->Computational Learning Theory"
        ]
    },
    "url": "http://videolectures.net/colt2011_abernethy_strategy/",
    "segmentation": [
        [
            "So this is an open problem with Simon or she wrote about a month ago because you couldn't solve it."
        ],
        [
            "So the idea is we have a.",
            "We have a sequential prediction problem.",
            "So in every round."
        ],
        [
            "To make a binary of probability prediction, and there's a binary outcome.",
            "So we choose a probability like .25 and then we see let's say zero, which means let's say it didn't rain, so we're predicting rain or not, right?",
            "So the classic example that you use in this calibration setting is is weather, so whether it rains or not."
        ],
        [
            "So.",
            "The we're going to discuss how to measure whether a forecaster is good, weather forecasters making good predictions, so a good prediction.",
            "So on every round, probability prediction and I see the outcome after I make it now.",
            "Presumably when a weather forecaster says 20% chance of rain, you would hope that it rains one of every five times roughly right.",
            "You would hope that was true.",
            "And you know when, when, when the forecast is 100 chance of rain.",
            "Presumably it should never not rain, right, or almost never not rain, right turns out.",
            "So when people have actually checked whether this is the case, whether this actually."
        ],
        [
            "And there actually is data out there.",
            "So I don't actually know the exact where this data came from, but it's you can look in the Freakonomics Freakonomics and Weather data, and forecasts are actually quite bad weather forecasts actually quite bad, so when you know for this particular data set, when the forecaster said 50% chance of rain, it actually rained 27% of the time, so.",
            "So we're hoping to fix that.",
            "So, OK, So what is Cal?"
        ],
        [
            "Rated forecasting, so here's the idea.",
            "So what we're going to do is we're going to discuss the quality of a forecaster.",
            "I'm going to take the probability space, and I'm going to turn into little grid, so I'm going to have these different bins down here."
        ],
        [
            "Alright, so one grid will be like and I epsilon come I epsilon plus one little little interval in this probability grid and we're going to see it."
        ],
        [
            "To observe these points, so point is going to be the empirical.",
            "So for every been going to value, which is going to be the empirical frequency of the actual outcomes on just the days that I predicted within that bin.",
            "So if I was predicting roughly P for some value P, that number is the frequency of the outcome on just the days when I predicted roughly P, right?",
            "So we can."
        ],
        [
            "Plot this for all of them, right?",
            "And we would hope that actually the plot would be close to the to the line y = X, right?",
            "That means that in the areas when.",
            "That means that when the forecast is predicting roughly P for every P, the outcomes are also the frequencies of the outcomes are also pee on those days, right?",
            "So if you."
        ],
        [
            "Would be this would be a a well calibrated forecaster, right?",
            "So everyone is a little intervals we want the frequencies to match.",
            "The actual predictions.",
            "Roughly speaking, that would be pretty well calibrated forecast."
        ],
        [
            "And of course, this would be a poorly calibrated forecaster.",
            "Right, so this would be a badly calibrated forecaster, so I'm going to discuss the details of how you measure calibration, so there's just two eggs."
        ],
        [
            "Apples the standard.",
            "So I want to mention one thing first so it turns out that if the data is IID, if every day you know rain or shine is just chosen from a fixed distribution, what's the optimal strategy?",
            "I mean just sample a few of them and then just predict the empirical probability in every round, right?",
            "I mean, maybe if you want to get better you can sample.",
            "You can sample further if you want to just take enough examples and then just keep predicting that probability, right?",
            "It's very easy action, so this actually is an interesting if you have a stationary distribution.",
            "If nothing is changing, it's easy.",
            "It turns out that you can actually do this.",
            "You can actually get calibration even when the data is chosen by an adversary.",
            "That's actually pretty weird thing about it.",
            "So every day.",
            "So the the the.",
            "Nature sees what the what the weather forecast is going to do, what the weather forecast is going to, and then chooses its outcome based on chooses the out come rain or shine based on that on that choice.",
            "And it turns out you can still get collaboration.",
            "Now.",
            "It turns out that's not totally true, because you that he's the forecaster would then need to be randomized, which means that the yes.",
            "Without praying.",
            "So.",
            "Yeah, so you know the game is the weather forecaster chooses distribution over these.",
            "This is weird, right?",
            "The weather forecast chooses distribution over the probability values and then and then the adversary nature can choose the outcome and then you know the player samples from the distribution and that's the actual prediction right so?",
            "And then everything is revealed and then the player sees what the outcome was.",
            "You can you right so it turns out you can actually get calibration even in this setting, which is nice, right?",
            "That's very nice so.",
            "One of the reasons why this actually is is nice example of this and this thing that she taught me when I was in Israel and I hadn't heard this before.",
            "But this is a great application with calibration.",
            "If you're playing against.",
            "If you're playing a game and you want to have an optimal strategy, something let's you know close to the value of the game.",
            "In the limit, it turns out that if you just calibrate, just get a calibrated forecast of your opponent strategy and you best respond to your calibrated forecast.",
            "That actually is an optimal.",
            "That is essentially an optimal strategy.",
            "In the limit, I mean that will approach the value, the game your payoff will get at least the value of the game.",
            "So I can tell you more about that offline if you want."
        ],
        [
            "So this is how this is the actual technical definition of a calibrated forecaster.",
            "So there's two notions, there's strong and weak.",
            "The strong notion is following.",
            "So for every P and every epsilon I should put for all epsilon.",
            "Here.",
            "If you sum up all of the values of PT, which are your predictions, and all the values of ziti which are the outcomes so PZ or the OR the binary or the pizza, the real valued predictions, or the zero, the probability predictions and the seeds of the outcomes, then you want.",
            "The frequencies of the PTS to match the frequencies of disease.",
            "So are the values of the PTS to match the value, the frequencies of disease, but only when PT is in this interval.",
            "So I'm only going to filter the the rounds I look at to just those where the prediction is actually in an interval, right?",
            "So this is a strong calibration.",
            "You want this value to go to zero for every P and for every epsilon."
        ],
        [
            "Now it turns out there's a weak notion of calibration, which is so so what's strong about this?",
            "What's wrong with this is that you're testing these these indicator functions.",
            "These are very sharp functions, right?",
            "There's like 000 one and then 0000.",
            "It's one in this interval, so it actually shoots up.",
            "This is actually hard.",
            "You have kind of a weird.",
            "It's difficult to get someone to calibrate that little spot where it jumps up.",
            "There could be some difficulties there, so if you actually smooth off.",
            "But if you actually smooth off these functions and only look at smooth functions like these, let's say these could be.",
            "Gaussians right nice Gaussians, right?",
            "This is actually an easier problem, so this is a weaker notion calibration.",
            "Just replace all those indicators with these smoother GS and it could turn that energy will work.",
            "Any questions about this?",
            "This is kind of technical, but you can look in the paper.",
            "This is all.",
            "There's lots of other right up to this.",
            "OK, so."
        ],
        [
            "Are the problems well?",
            "Typical calibration algorithms.",
            "The following this is the way that people solve this problem.",
            "I'm not going to give the full details, but I'll give you kind of sketchy."
        ],
        [
            "People, but there's three or four algorithms out there.",
            "The standard trick is to have a have a value for every one of these grid points, right?",
            "You sort of measure how you're doing it.",
            "Every grid point in my account, my calibrated positives and negatives.",
            "How am I doing at this particular spot, right?",
            "So you have to maintain a value for every one of these spots, and then you have to actually go over the entire grid and then do something.",
            "For me.",
            "You have to pick one of those good points randomly, right?",
            "And of course the problem with this is that.",
            "Epsilon you have to look at every single gridpoint."
        ],
        [
            "So that one epsilon is expensive both in time and space.",
            "And this computation is required for every single prediction.",
            "It's not just once I have to do this every time I want to look over my entire grid.",
            "So.",
            "This gets really bad when the number of outcomes, so this whole time I've been talking with binary outcomes, rain or shine.",
            "But what happens if there's multiple states that you're predicting right and multiple multiple outcome scenario?",
            "Then this thing will turn into one Rhapsody, so it's not just one, it's exponential on the dimension, so binary is nice.",
            "Maybe but exponentially bad, right?"
        ],
        [
            "And it turns out we don't actually, so we don't.",
            "Actually, I'll explain what the difficulties are.",
            "So there are some good news here.",
            "The good news is we actually recent, so recently there's a week calibration in 2007 shy and some colleagues got a weak calibration algorithm with the constant time space but constant space and time.",
            "And for strong collaboration, this paper with them with Aladdin and Peter this year we have a log one over epsilon.",
            "Rate in time requires unfortunately lot of space unfortunately, but you know it's still an improvement from what existed previously.",
            "So this is nice.",
            "The bad news of."
        ],
        [
            "So that we don't have this for D greater than two, this only works in the binary case.",
            "So it looks like this is the problem isn't that hard, but we shouldn't need to actually look at the entire grid.",
            "You should be able to make simpler.",
            "This is we figured out some similar tricks in some cases, but it only works in the binary case and we don't know what to do in the general case."
        ],
        [
            "So the questions are, can we find something Poly?",
            "What's that?",
            "No, no, it's the computation time per round of an algorithm.",
            "The convergence rate.",
            "The whole other issue?",
            "That's another difficulty, which is, yeah, that's simply not long.",
            "Yeah, yeah, actually, we're happy to have a slow rate.",
            "It doesn't matter how slowly, just little computation algorithm.",
            "So no problem, this is your problem here.",
            "Can you get polylog or Pauline D. Polylog and one over epsilon rate for these different cases?",
            "Strong, weak in time and space?",
            "Right, it turns out that, um, we."
        ],
        [
            "Are offering cash prizes for this, so we're going to give $50 a box so for every box that you solve, you get $50.00 an you know if you solve only two boxes, there's obviously 2 boxes.",
            "The remaining and it positive or negative solution is fine.",
            "So if you have a lower bound, that's fine.",
            "You get, you get you $50.",
            "Um?",
            "Any questions about that?"
        ],
        [
            "So.",
            "My mom will cover the cost.",
            "Any questions?",
            "So.",
            "Sorry, that was all in D dimensions.",
            "Yeah, for K for D greater than two.",
            "How much can you make this to 2 dimensional problem?"
        ],
        [
            "Yeah, so for two dimensions we already know the answer.",
            "Or we have so we have something you know, even improving that one of the overall space would be nice, but right now we have sort of an answer for.",
            "Um, so that's.",
            "It thank you everybody.",
            "Where's that big claws come on?",
            "Come on, come on or."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is an open problem with Simon or she wrote about a month ago because you couldn't solve it.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the idea is we have a.",
                    "label": 0
                },
                {
                    "sent": "We have a sequential prediction problem.",
                    "label": 1
                },
                {
                    "sent": "So in every round.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To make a binary of probability prediction, and there's a binary outcome.",
                    "label": 0
                },
                {
                    "sent": "So we choose a probability like .25 and then we see let's say zero, which means let's say it didn't rain, so we're predicting rain or not, right?",
                    "label": 0
                },
                {
                    "sent": "So the classic example that you use in this calibration setting is is weather, so whether it rains or not.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The we're going to discuss how to measure whether a forecaster is good, weather forecasters making good predictions, so a good prediction.",
                    "label": 0
                },
                {
                    "sent": "So on every round, probability prediction and I see the outcome after I make it now.",
                    "label": 0
                },
                {
                    "sent": "Presumably when a weather forecaster says 20% chance of rain, you would hope that it rains one of every five times roughly right.",
                    "label": 0
                },
                {
                    "sent": "You would hope that was true.",
                    "label": 0
                },
                {
                    "sent": "And you know when, when, when the forecast is 100 chance of rain.",
                    "label": 0
                },
                {
                    "sent": "Presumably it should never not rain, right, or almost never not rain, right turns out.",
                    "label": 0
                },
                {
                    "sent": "So when people have actually checked whether this is the case, whether this actually.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And there actually is data out there.",
                    "label": 0
                },
                {
                    "sent": "So I don't actually know the exact where this data came from, but it's you can look in the Freakonomics Freakonomics and Weather data, and forecasts are actually quite bad weather forecasts actually quite bad, so when you know for this particular data set, when the forecaster said 50% chance of rain, it actually rained 27% of the time, so.",
                    "label": 0
                },
                {
                    "sent": "So we're hoping to fix that.",
                    "label": 0
                },
                {
                    "sent": "So, OK, So what is Cal?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Rated forecasting, so here's the idea.",
                    "label": 0
                },
                {
                    "sent": "So what we're going to do is we're going to discuss the quality of a forecaster.",
                    "label": 0
                },
                {
                    "sent": "I'm going to take the probability space, and I'm going to turn into little grid, so I'm going to have these different bins down here.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Alright, so one grid will be like and I epsilon come I epsilon plus one little little interval in this probability grid and we're going to see it.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To observe these points, so point is going to be the empirical.",
                    "label": 0
                },
                {
                    "sent": "So for every been going to value, which is going to be the empirical frequency of the actual outcomes on just the days that I predicted within that bin.",
                    "label": 1
                },
                {
                    "sent": "So if I was predicting roughly P for some value P, that number is the frequency of the outcome on just the days when I predicted roughly P, right?",
                    "label": 0
                },
                {
                    "sent": "So we can.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Plot this for all of them, right?",
                    "label": 0
                },
                {
                    "sent": "And we would hope that actually the plot would be close to the to the line y = X, right?",
                    "label": 0
                },
                {
                    "sent": "That means that in the areas when.",
                    "label": 1
                },
                {
                    "sent": "That means that when the forecast is predicting roughly P for every P, the outcomes are also the frequencies of the outcomes are also pee on those days, right?",
                    "label": 0
                },
                {
                    "sent": "So if you.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Would be this would be a a well calibrated forecaster, right?",
                    "label": 0
                },
                {
                    "sent": "So everyone is a little intervals we want the frequencies to match.",
                    "label": 0
                },
                {
                    "sent": "The actual predictions.",
                    "label": 0
                },
                {
                    "sent": "Roughly speaking, that would be pretty well calibrated forecast.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And of course, this would be a poorly calibrated forecaster.",
                    "label": 0
                },
                {
                    "sent": "Right, so this would be a badly calibrated forecaster, so I'm going to discuss the details of how you measure calibration, so there's just two eggs.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Apples the standard.",
                    "label": 0
                },
                {
                    "sent": "So I want to mention one thing first so it turns out that if the data is IID, if every day you know rain or shine is just chosen from a fixed distribution, what's the optimal strategy?",
                    "label": 0
                },
                {
                    "sent": "I mean just sample a few of them and then just predict the empirical probability in every round, right?",
                    "label": 1
                },
                {
                    "sent": "I mean, maybe if you want to get better you can sample.",
                    "label": 0
                },
                {
                    "sent": "You can sample further if you want to just take enough examples and then just keep predicting that probability, right?",
                    "label": 0
                },
                {
                    "sent": "It's very easy action, so this actually is an interesting if you have a stationary distribution.",
                    "label": 0
                },
                {
                    "sent": "If nothing is changing, it's easy.",
                    "label": 0
                },
                {
                    "sent": "It turns out that you can actually do this.",
                    "label": 1
                },
                {
                    "sent": "You can actually get calibration even when the data is chosen by an adversary.",
                    "label": 0
                },
                {
                    "sent": "That's actually pretty weird thing about it.",
                    "label": 0
                },
                {
                    "sent": "So every day.",
                    "label": 0
                },
                {
                    "sent": "So the the the.",
                    "label": 0
                },
                {
                    "sent": "Nature sees what the what the weather forecast is going to do, what the weather forecast is going to, and then chooses its outcome based on chooses the out come rain or shine based on that on that choice.",
                    "label": 1
                },
                {
                    "sent": "And it turns out you can still get collaboration.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "It turns out that's not totally true, because you that he's the forecaster would then need to be randomized, which means that the yes.",
                    "label": 0
                },
                {
                    "sent": "Without praying.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so you know the game is the weather forecaster chooses distribution over these.",
                    "label": 0
                },
                {
                    "sent": "This is weird, right?",
                    "label": 0
                },
                {
                    "sent": "The weather forecast chooses distribution over the probability values and then and then the adversary nature can choose the outcome and then you know the player samples from the distribution and that's the actual prediction right so?",
                    "label": 0
                },
                {
                    "sent": "And then everything is revealed and then the player sees what the outcome was.",
                    "label": 0
                },
                {
                    "sent": "You can you right so it turns out you can actually get calibration even in this setting, which is nice, right?",
                    "label": 1
                },
                {
                    "sent": "That's very nice so.",
                    "label": 0
                },
                {
                    "sent": "One of the reasons why this actually is is nice example of this and this thing that she taught me when I was in Israel and I hadn't heard this before.",
                    "label": 0
                },
                {
                    "sent": "But this is a great application with calibration.",
                    "label": 0
                },
                {
                    "sent": "If you're playing against.",
                    "label": 0
                },
                {
                    "sent": "If you're playing a game and you want to have an optimal strategy, something let's you know close to the value of the game.",
                    "label": 0
                },
                {
                    "sent": "In the limit, it turns out that if you just calibrate, just get a calibrated forecast of your opponent strategy and you best respond to your calibrated forecast.",
                    "label": 0
                },
                {
                    "sent": "That actually is an optimal.",
                    "label": 0
                },
                {
                    "sent": "That is essentially an optimal strategy.",
                    "label": 0
                },
                {
                    "sent": "In the limit, I mean that will approach the value, the game your payoff will get at least the value of the game.",
                    "label": 0
                },
                {
                    "sent": "So I can tell you more about that offline if you want.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is how this is the actual technical definition of a calibrated forecaster.",
                    "label": 0
                },
                {
                    "sent": "So there's two notions, there's strong and weak.",
                    "label": 0
                },
                {
                    "sent": "The strong notion is following.",
                    "label": 0
                },
                {
                    "sent": "So for every P and every epsilon I should put for all epsilon.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "If you sum up all of the values of PT, which are your predictions, and all the values of ziti which are the outcomes so PZ or the OR the binary or the pizza, the real valued predictions, or the zero, the probability predictions and the seeds of the outcomes, then you want.",
                    "label": 0
                },
                {
                    "sent": "The frequencies of the PTS to match the frequencies of disease.",
                    "label": 0
                },
                {
                    "sent": "So are the values of the PTS to match the value, the frequencies of disease, but only when PT is in this interval.",
                    "label": 0
                },
                {
                    "sent": "So I'm only going to filter the the rounds I look at to just those where the prediction is actually in an interval, right?",
                    "label": 0
                },
                {
                    "sent": "So this is a strong calibration.",
                    "label": 1
                },
                {
                    "sent": "You want this value to go to zero for every P and for every epsilon.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now it turns out there's a weak notion of calibration, which is so so what's strong about this?",
                    "label": 0
                },
                {
                    "sent": "What's wrong with this is that you're testing these these indicator functions.",
                    "label": 0
                },
                {
                    "sent": "These are very sharp functions, right?",
                    "label": 0
                },
                {
                    "sent": "There's like 000 one and then 0000.",
                    "label": 0
                },
                {
                    "sent": "It's one in this interval, so it actually shoots up.",
                    "label": 0
                },
                {
                    "sent": "This is actually hard.",
                    "label": 0
                },
                {
                    "sent": "You have kind of a weird.",
                    "label": 0
                },
                {
                    "sent": "It's difficult to get someone to calibrate that little spot where it jumps up.",
                    "label": 0
                },
                {
                    "sent": "There could be some difficulties there, so if you actually smooth off.",
                    "label": 0
                },
                {
                    "sent": "But if you actually smooth off these functions and only look at smooth functions like these, let's say these could be.",
                    "label": 0
                },
                {
                    "sent": "Gaussians right nice Gaussians, right?",
                    "label": 0
                },
                {
                    "sent": "This is actually an easier problem, so this is a weaker notion calibration.",
                    "label": 0
                },
                {
                    "sent": "Just replace all those indicators with these smoother GS and it could turn that energy will work.",
                    "label": 0
                },
                {
                    "sent": "Any questions about this?",
                    "label": 0
                },
                {
                    "sent": "This is kind of technical, but you can look in the paper.",
                    "label": 0
                },
                {
                    "sent": "This is all.",
                    "label": 0
                },
                {
                    "sent": "There's lots of other right up to this.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Are the problems well?",
                    "label": 0
                },
                {
                    "sent": "Typical calibration algorithms.",
                    "label": 0
                },
                {
                    "sent": "The following this is the way that people solve this problem.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to give the full details, but I'll give you kind of sketchy.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "People, but there's three or four algorithms out there.",
                    "label": 0
                },
                {
                    "sent": "The standard trick is to have a have a value for every one of these grid points, right?",
                    "label": 0
                },
                {
                    "sent": "You sort of measure how you're doing it.",
                    "label": 0
                },
                {
                    "sent": "Every grid point in my account, my calibrated positives and negatives.",
                    "label": 0
                },
                {
                    "sent": "How am I doing at this particular spot, right?",
                    "label": 0
                },
                {
                    "sent": "So you have to maintain a value for every one of these spots, and then you have to actually go over the entire grid and then do something.",
                    "label": 0
                },
                {
                    "sent": "For me.",
                    "label": 0
                },
                {
                    "sent": "You have to pick one of those good points randomly, right?",
                    "label": 0
                },
                {
                    "sent": "And of course the problem with this is that.",
                    "label": 0
                },
                {
                    "sent": "Epsilon you have to look at every single gridpoint.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So that one epsilon is expensive both in time and space.",
                    "label": 1
                },
                {
                    "sent": "And this computation is required for every single prediction.",
                    "label": 1
                },
                {
                    "sent": "It's not just once I have to do this every time I want to look over my entire grid.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "This gets really bad when the number of outcomes, so this whole time I've been talking with binary outcomes, rain or shine.",
                    "label": 0
                },
                {
                    "sent": "But what happens if there's multiple states that you're predicting right and multiple multiple outcome scenario?",
                    "label": 0
                },
                {
                    "sent": "Then this thing will turn into one Rhapsody, so it's not just one, it's exponential on the dimension, so binary is nice.",
                    "label": 0
                },
                {
                    "sent": "Maybe but exponentially bad, right?",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And it turns out we don't actually, so we don't.",
                    "label": 0
                },
                {
                    "sent": "Actually, I'll explain what the difficulties are.",
                    "label": 0
                },
                {
                    "sent": "So there are some good news here.",
                    "label": 1
                },
                {
                    "sent": "The good news is we actually recent, so recently there's a week calibration in 2007 shy and some colleagues got a weak calibration algorithm with the constant time space but constant space and time.",
                    "label": 0
                },
                {
                    "sent": "And for strong collaboration, this paper with them with Aladdin and Peter this year we have a log one over epsilon.",
                    "label": 0
                },
                {
                    "sent": "Rate in time requires unfortunately lot of space unfortunately, but you know it's still an improvement from what existed previously.",
                    "label": 0
                },
                {
                    "sent": "So this is nice.",
                    "label": 0
                },
                {
                    "sent": "The bad news of.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So that we don't have this for D greater than two, this only works in the binary case.",
                    "label": 1
                },
                {
                    "sent": "So it looks like this is the problem isn't that hard, but we shouldn't need to actually look at the entire grid.",
                    "label": 0
                },
                {
                    "sent": "You should be able to make simpler.",
                    "label": 0
                },
                {
                    "sent": "This is we figured out some similar tricks in some cases, but it only works in the binary case and we don't know what to do in the general case.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the questions are, can we find something Poly?",
                    "label": 0
                },
                {
                    "sent": "What's that?",
                    "label": 0
                },
                {
                    "sent": "No, no, it's the computation time per round of an algorithm.",
                    "label": 0
                },
                {
                    "sent": "The convergence rate.",
                    "label": 0
                },
                {
                    "sent": "The whole other issue?",
                    "label": 0
                },
                {
                    "sent": "That's another difficulty, which is, yeah, that's simply not long.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah, actually, we're happy to have a slow rate.",
                    "label": 0
                },
                {
                    "sent": "It doesn't matter how slowly, just little computation algorithm.",
                    "label": 0
                },
                {
                    "sent": "So no problem, this is your problem here.",
                    "label": 0
                },
                {
                    "sent": "Can you get polylog or Pauline D. Polylog and one over epsilon rate for these different cases?",
                    "label": 0
                },
                {
                    "sent": "Strong, weak in time and space?",
                    "label": 0
                },
                {
                    "sent": "Right, it turns out that, um, we.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Are offering cash prizes for this, so we're going to give $50 a box so for every box that you solve, you get $50.00 an you know if you solve only two boxes, there's obviously 2 boxes.",
                    "label": 0
                },
                {
                    "sent": "The remaining and it positive or negative solution is fine.",
                    "label": 1
                },
                {
                    "sent": "So if you have a lower bound, that's fine.",
                    "label": 0
                },
                {
                    "sent": "You get, you get you $50.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Any questions about that?",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "My mom will cover the cost.",
                    "label": 0
                },
                {
                    "sent": "Any questions?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Sorry, that was all in D dimensions.",
                    "label": 0
                },
                {
                    "sent": "Yeah, for K for D greater than two.",
                    "label": 0
                },
                {
                    "sent": "How much can you make this to 2 dimensional problem?",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, so for two dimensions we already know the answer.",
                    "label": 0
                },
                {
                    "sent": "Or we have so we have something you know, even improving that one of the overall space would be nice, but right now we have sort of an answer for.",
                    "label": 0
                },
                {
                    "sent": "Um, so that's.",
                    "label": 0
                },
                {
                    "sent": "It thank you everybody.",
                    "label": 0
                },
                {
                    "sent": "Where's that big claws come on?",
                    "label": 0
                },
                {
                    "sent": "Come on, come on or.",
                    "label": 0
                }
            ]
        }
    }
}