{
    "id": "ztqwhjwyg5piaotpj7vcdafotnjqp7wp",
    "title": "The community-search problem and how to plan a successful cocktail party",
    "info": {
        "author": [
            "Mauro Sozio, Max Planck Institute for Computer Science, Max Planck Institute"
        ],
        "published": "Oct. 1, 2010",
        "recorded": "July 2010",
        "category": [
            "Top->Computer Science->Data Mining"
        ]
    },
    "url": "http://videolectures.net/kdd2010_sozio_csp/",
    "segmentation": [
        [
            "Second, talk in our session is a statistical model for popular event tracking.",
            "And sorry wrong, one community search problem and how to plan a successful cocktail party by Mario Socio.",
            "So hi there, everybody.",
            "As you can see from the title, we will be talking about Community search.",
            "The community search problem in social network or maybe more interesting about out organizing successful cocktail party.",
            "So this is a joint work with the IRS yonis from Yahoo.",
            "Lab Barcelona."
        ],
        [
            "So let me start with a non serious introduction.",
            "So let's suppose this famous scientists wish to organize a party.",
            "So how do how should they proceed?",
            "Which persons are they should invite?",
            "So to address this question we can consider the underlying social networks.",
            "So in this case this is Co authorship graph.",
            "So there is an edge within two persons.",
            "If they code or the paper together and."
        ],
        [
            "We can use this valuable information to plan to organize this party.",
            "So what is a good recipe for a successful party?",
            "Well, we would like the participants are to be close to the organizer, so they shouldn't be too far apart from the organizer in the social network graph.",
            "And we would like also to ensure that there is some degree of connection between the participants.",
            "Would like everybody to know some other people in the party so not to be isolated and also the number of the size of the party is also the number of people that are invited is also very important.",
            "We might not have enough room.",
            "For example, to invite 1 million people right?",
            "And on the other hand, we would like to invite at least 20 or 30 people or something like that.",
            "So who has an experience with organizing party and more in general scientific events knows that this is not really an easy task, right?",
            "So maybe we'll try to solve this problem now."
        ],
        [
            "OK, more seriously, what we are trying to do here is to find the community of a given set of users.",
            "That belong to that community.",
            "So our approach here is a combinatorial, and so I will formalize the problem later and we also show you a greedy algorithm that achieves quite good performances.",
            "But roughly speaking, given a graph and a set of nodes, we would like to find a densely connected sub graph that contains the set of users given input, and I will formalize later.",
            "What do I mean by a densely connected sub graph?"
        ],
        [
            "And also there is an additional difficulties here that we have to face.",
            "Is that different organizers might so different people might belong to.",
            "Many people can belong to many."
        ],
        [
            "Lapping communities, and so there's an additional feature in difficulty that we have to organize that we have to face."
        ],
        [
            "Other interesting applications are in the tag suggestion and biological later, and so I will briefly mention these applications.",
            "But our main problem is to solve the Community detection."
        ],
        [
            "The community search problem.",
            "So suppose we have a picture here on the right hand side we have a nice picture of the Dolomites.",
            "It's really nice location and we have a set of tags, dolomites and Lake that describes this picture.",
            "So we would like to suggest to the user some other tags that are strongly related to the taxi that has already been given and how should we proceed?",
            "Well, again, let's consider the dog network graph, where there is an edge between the two pictures.",
            "Share A tag so we can again use this information to suggest to the user some tags that are strongly related to the tags that has already that are already given and are also related strongly related among themselves.",
            "So for example, in this case we can suggest mountains, nature or landscape and so on so forth."
        ],
        [
            "So another interesting applications is in the in the field of bioinformatic, so you can see here a small number of proteins and their interaction between among themselves and so."
        ],
        [
            "Good question.",
            "Could be given a set of proteins, can we find out other proteins that are that interact with the proteins given an input and that are also they also interact."
        ],
        [
            "Themselves.",
            "OK, so this is the outline of the talk I just gave a brief overview and So what we do next, I will formalize the problem presented two free algorithms for this problem.",
            "Then I will present some results that we conducted on a free free real world datasets and then I will also generalize our results and show you that we can actually optimize a broad class of so-called monotone functions.",
            "And then I will conclude the talk with some."
        ],
        [
            "Moments OK, so this actually is not really a new problem.",
            "There is a huge amount of work that has been done so far and for finding a community in a social network and you and you can see here that there are many communities that are actually interested in this problem.",
            "What we do here we consider a query dependent variant of the problem where we are interested to find the community of a given set of input while the previous work has focused on a static version where the Community has to be found only with reference to the original graph in.",
            "Another related work that are quite related actually and didn't consider explicitly the social problem.",
            "Finding a community in a social network, but probably their techniques can also be applied here.",
            "An remarkably the paper of Coronet, Alan Tongue Involutes seems to be quite related, and there is also a lot of work in combinatorial in a dog arhythmic communities, and there are many papers that appeared in folks I kalpin.",
            "Out books which are theoretical conferences and where the goal was to find the densest subgraph."
        ],
        [
            "OK, so let's try to formalize the problem."
        ],
        [
            "Let me just recall you that the good properties that we.",
            "That we would like to to achieve is to obtain a somehow graph where there is a small diameter which is very dense for some definition of density that I will clarify now and such that the graph is connected.",
            "So As for density, there are two different definitions.",
            "One is the number of edges divided by the total number of the maximum number of edges you can have in a graph.",
            "So this is the number of edges you can have in a click, and another definition is the average degree of the graph.",
            "So some well known fact if we would like to optimize the first definition, then this problem is NP hard.",
            "So there is an easy reduction from maximum clique, which is one of the toughest problems also to approximate.",
            "And the second factor is that actually the if you would like to optimize the second definition, then there is an algorithm that solves this problem optimally.",
            "But the problem is that these are going is pretty slow if I remember well, the running time is cubic in the size of the graph, so it's not really easy, so it's not really efficient.",
            "So what we do we actually consider and."
        ],
        [
            "Through the definition of density of a graph, which actually is the minimum, no degree, the minimum degree of the graph of this up graph, and then the rest of the talk, we will consider this density definition."
        ],
        [
            "As for distance, I mentioned distance, but what is the distance?",
            "So if we have only one one query node then this is simply the length of the shortest path.",
            "But if we have many query nodes then we have to somehow adjust this to this new scenario and So what we consider is we could consider the sum of the length of the shortest path.",
            "But we consider actually the squared distance squared.",
            "The sum of the squared distances, because this somehow favor more balance scenario OK will maybe will not."
        ],
        [
            "Normalize this OK, so now we have all the ingredients to define formally our problem.",
            "So in input we have an undirected graph, a set of query nodes and integer D which is actually distance constraint and we would like to find an induced subgraph of G such that the graph contains the query nodes.",
            "The graph is connected and all the nodes are at distance at most D from the query nodes and also the minimum degree.",
            "Of the graph is maximized, so we would like to have these people to be able to interact with other people in the in the party talking about the the party problem, and surprisingly enough, this problem at first glance it seems quite to be quite complete."
        ],
        [
            "They did, but actually there is an optimum greedy algorithm that can solve this problem, and I think this is a nice result."
        ],
        [
            "And the algorithm is actually pretty easy."
        ],
        [
            "I will mention the algorithm briefly, so starting from the initial graph, we iteratively delete some nodes as follow.",
            "If there is a node that violates the distance constraint, then we delete this node from the graph an from further consideration.",
            "If not, then we delete from the graph the node with minimum degree and we iterate this simple steps until all the all the nodes have been deleted.",
            "Then among all graphs that has been constructed so far, we selected the graph with the maximum minimum degree that satisfy all the constraints that is connected and that satisfies.",
            "The distance constraint.",
            "So the algorithm is quite easy and also is quite efficient."
        ],
        [
            "But surprisingly, this algorithm computes an optimal solution for this problem."
        ],
        [
            "OK, so nice results, but unfortunately this is not the end of the story as I told you in the introduction.",
            "I think somehow limiting the size of the graph is quite important because for example in the case of the party we don't have, we might not have enough room for one million of people, but in the case of the Community search problem we would like maybe to analyze the data.",
            "Humans should be able to interpret this data and get some valuable insights on this.",
            "So if the community that we retrieved consists of 1 billion of people, then maybe this this is not really interesting.",
            "But now the come the bad news, because if we had an upper bound on the size of the graph, then the problem becomes NP hard.",
            "But still we can do something.",
            "I mean theory can still help and there is a simple observation here.",
            "Some good properties of the algorithm, namely if we executed algorithms with two distance constraints.",
            "Then the resulting graph would be smaller if the distance constraint is tighter.",
            "Roughly speaking, if we execute the algorithm with this constraint.",
            "Equal to 7, then the size of the graph would be smaller than executing the this greedy algorithm with this as constraint 10 for example.",
            "So this simple observation that we can actually prove an inspired our greedy eristic that can somehow limit the size of the output graph, even though now we don't have any approximation guarantee anymore."
        ],
        [
            "And so the grid is pretty simple.",
            "We execute the our greedy algorithm with some distance constraint given an input.",
            "And then if this the size of the graph exceeds the upper bound, then we make the constraint tighter until the upper bound is met.",
            "So it's pretty simple.",
            "And also I think quite nature."
        ],
        [
            "Another eristic we developed.",
            "And in this case we have the intuition that knows that are very far apart from the graph, may not belong to the same community, is of the query nodes right?",
            "So maybe we can have a preprocessing phase where we delete these nodes and this of course will make everything more efficient.",
            "And this eristic I will show you later some experiments proved to be a good compromise between accuracy and running."
        ],
        [
            "Time.",
            "OK so I will show you now some some experiments."
        ],
        [
            "OK, so we conducted an evaluation on using free real world datasets that DBL quarter ship graph, the Flickr graph and also biological data and we measured the minimum degree of the resulting graph.",
            "The average degree, the size of the output graph and of course also the running time.",
            "So we show you briefly summarize."
        ],
        [
            "Adults OK so and we compare this against the simple baseline.",
            "And so in this algorithm what we do, we first connect the query nodes using a standard tree algorithm and then at each step we add the node with minimum with maximum with maximum degree and this is in contrast with the previous approaches where at each step we actually delete nodes.",
            "But we think that this could be.",
            "Also this should be an approach that should be.",
            "Considered.",
            "And then as we were doing before, among all graph constructed, we return the one with maximum degree, maximum, minimum."
        ],
        [
            "OK so here is some results on the X axis we have an upper bound on the size and on the Y axis we have the minimum degree and we can see that for example if the upper bound is 50, then the minimum degree is 4 and so this means that all nodes in the graph of degree are connected with at least four other nodes, and so this shows that the graph is somehow quite connected, but there is a lot of interaction.",
            "Between tags in this case."
        ],
        [
            "OK, this is the average degree and we can also see that the performances or greedy fast ingredients are not really are somehow."
        ],
        [
            "Parable.",
            "And finally, I would like to show you the running time, so the fastest eristic.",
            "Once in 2030 seconds and this is quite fast and as I show you before, the performance are somehow compared compatible with the with the most accurate terroristic.",
            "So we think this could be a good compromise if if we're interested in retrieving a graph with a large density and but quickly.",
            "Then this could be I woulda good.",
            "It could be nice."
        ],
        [
            "We use this algorithm.",
            "OK, this is some empirical evidence to show you the the main theorem that inspired the second eristic.",
            "And here we have the distance constraint on the columns and on the roads we have three different datasets and we can see that as we increase the distance constraint the resulting graph becomes larger and larger and so for example for distance equal to six.",
            "So the DLP consists of only four nodes and then if we increase the distance constraint we have nine and so on so forth.",
            "And this has been we consider here early free query nodes."
        ],
        [
            "OK, So what we did next?",
            "We generalize our results further and trying to deal with an even larger set of constraints so that to somehow have to have more power and more have more powerful tools on retrieving at the Community we are."
        ],
        [
            "Looking for.",
            "And So what we did, for example, we defined this new problem that we called the generalized Community search problem in this case.",
            "In input we have for each node a set of skills and we are requesting to find the graph whose union over of the of the set of skills contains a given set of skills provided any input so.",
            "Roughly speaking, if you compute the union of all these sets, we want this to be a super set super set of the of the set of skills given any input.",
            "And again we would like to have distance constraint.",
            "We would like the minimum degree to be maximised.",
            "The graph to be connected and so on, so forth.",
            "And still we are able to.",
            "Solve this problem to compute an optimal solution for this problem by means of a greedy algorithm."
        ],
        [
            "So what is the idea here?",
            "So actually generalizing even further, these are what the so-called monotone functions, which roughly speaking."
        ],
        [
            "So we say that the monotone function the function is monotone if when we evaluate this function on a sub graph of the original graph, its value decreases, either always decreases or either always increases, and so in the case we have a set of constraints and these are all monotone function, we are able to compute an optimum solution for the problem and the running time depends actually on the on the.",
            "Number of functions we have."
        ],
        [
            "OK, so the talk is almost finished.",
            "I will just conclude my talk with some conclusions and and interesting."
        ],
        [
            "Future work.",
            "So we define a query dependent variant of the Community detection problem and we propose an Oval combinatorially approach to tackle this problem, and we also define the a class of function that can be optimized efficiently.",
            "And it's also interesting that whenever we have to the output so it was interesting that adding some distance constraint, we were able to actually limit the size of the output graph.",
            "So maybe this approach can always can be also used in other for other problems and future work.",
            "Are there other useful monotone functions?",
            "Can we find all communities of a given set of users?",
            "And last but not least.",
            "And can we parallelize this algorithm?",
            "Can we use, for example, a paradigm like MapReduce for example to deal with a huge amount of data?",
            "So OK, thanks."
        ],
        [
            "Not for the OK sorry.",
            "Forgot what about the party I mentioned in the beginning?",
            "So this is the people that actually should be invited by in the party.",
            "I don't know if you can see there, but there are many edges that show a lot of connections and actually it is not by chance because the on the left side.",
            "This corresponds to the database community while on the right hand side we have an algorithm communities some, so there's some anecdotal evidence that is seems to be quite quite effective."
        ],
        [
            "So thanks a lot for your attention and looking forward for questions.",
            "Please in the microphone.",
            "Very similar to the problem of like given a set of nodes, find their local nothings cluster around the set of notes and then there is this paper from like Andersen, Chung and Tanga, called Page rank nibble.",
            "So it's very efficient and basically they run the personalized or rooted Pagerank.",
            "But there's a restart vertex is not a single one, but these set of not so.",
            "Share the flying among these set of notes and so, and you also cited the Hong Kong and Crystals Politics.",
            "Sure.",
            "So did you actually compare it with this?",
            "And how do you actually say that the Community sure sure, yes.",
            "So yeah, this is a good question.",
            "So the objective function in this case is different.",
            "So in the random Gen random walk with their start approach, you would like someone to connect the query nodes and minimizes sum.",
            "Proximity measures, but this measure are actually different, so it's not really miss different than minimizing the minimum degree.",
            "So for example, an automatic evaluation wouldn't be fair in this case is because we have simply two different objective function.",
            "What would make sense?",
            "And we're actually working on this student of ours is working on this is to do a user evaluation.",
            "So given the results of the two algorithms, which Community is a good community for?",
            "Which algorithm we obtain better results?",
            "We are working on this, but.",
            "So far we don't have any experiments in this direction, but thanks for the question.",
            "We'll take one more.",
            "Very interesting paper.",
            "One question about the party examples.",
            "I can imagine social gathering strength of tire is important, so can you argue with an extended?",
            "What do you mean by strength?",
            "Strength of tie, strength of links or you?",
            "OK so you would like to have, for example, an edge weight associated which edge?",
            "Yeah, so this could be we didn't consider this, but probably I'm optimistic that approach could be also extended in this direction.",
            "This shouldn't be any problem, but OK. Of course I have to think about that, yeah?",
            "Speaker speaker again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Second, talk in our session is a statistical model for popular event tracking.",
                    "label": 0
                },
                {
                    "sent": "And sorry wrong, one community search problem and how to plan a successful cocktail party by Mario Socio.",
                    "label": 1
                },
                {
                    "sent": "So hi there, everybody.",
                    "label": 0
                },
                {
                    "sent": "As you can see from the title, we will be talking about Community search.",
                    "label": 0
                },
                {
                    "sent": "The community search problem in social network or maybe more interesting about out organizing successful cocktail party.",
                    "label": 0
                },
                {
                    "sent": "So this is a joint work with the IRS yonis from Yahoo.",
                    "label": 0
                },
                {
                    "sent": "Lab Barcelona.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let me start with a non serious introduction.",
                    "label": 0
                },
                {
                    "sent": "So let's suppose this famous scientists wish to organize a party.",
                    "label": 0
                },
                {
                    "sent": "So how do how should they proceed?",
                    "label": 0
                },
                {
                    "sent": "Which persons are they should invite?",
                    "label": 0
                },
                {
                    "sent": "So to address this question we can consider the underlying social networks.",
                    "label": 0
                },
                {
                    "sent": "So in this case this is Co authorship graph.",
                    "label": 0
                },
                {
                    "sent": "So there is an edge within two persons.",
                    "label": 0
                },
                {
                    "sent": "If they code or the paper together and.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We can use this valuable information to plan to organize this party.",
                    "label": 0
                },
                {
                    "sent": "So what is a good recipe for a successful party?",
                    "label": 0
                },
                {
                    "sent": "Well, we would like the participants are to be close to the organizer, so they shouldn't be too far apart from the organizer in the social network graph.",
                    "label": 0
                },
                {
                    "sent": "And we would like also to ensure that there is some degree of connection between the participants.",
                    "label": 0
                },
                {
                    "sent": "Would like everybody to know some other people in the party so not to be isolated and also the number of the size of the party is also the number of people that are invited is also very important.",
                    "label": 0
                },
                {
                    "sent": "We might not have enough room.",
                    "label": 0
                },
                {
                    "sent": "For example, to invite 1 million people right?",
                    "label": 0
                },
                {
                    "sent": "And on the other hand, we would like to invite at least 20 or 30 people or something like that.",
                    "label": 0
                },
                {
                    "sent": "So who has an experience with organizing party and more in general scientific events knows that this is not really an easy task, right?",
                    "label": 0
                },
                {
                    "sent": "So maybe we'll try to solve this problem now.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, more seriously, what we are trying to do here is to find the community of a given set of users.",
                    "label": 0
                },
                {
                    "sent": "That belong to that community.",
                    "label": 0
                },
                {
                    "sent": "So our approach here is a combinatorial, and so I will formalize the problem later and we also show you a greedy algorithm that achieves quite good performances.",
                    "label": 0
                },
                {
                    "sent": "But roughly speaking, given a graph and a set of nodes, we would like to find a densely connected sub graph that contains the set of users given input, and I will formalize later.",
                    "label": 0
                },
                {
                    "sent": "What do I mean by a densely connected sub graph?",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And also there is an additional difficulties here that we have to face.",
                    "label": 0
                },
                {
                    "sent": "Is that different organizers might so different people might belong to.",
                    "label": 0
                },
                {
                    "sent": "Many people can belong to many.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Lapping communities, and so there's an additional feature in difficulty that we have to organize that we have to face.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Other interesting applications are in the tag suggestion and biological later, and so I will briefly mention these applications.",
                    "label": 0
                },
                {
                    "sent": "But our main problem is to solve the Community detection.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The community search problem.",
                    "label": 0
                },
                {
                    "sent": "So suppose we have a picture here on the right hand side we have a nice picture of the Dolomites.",
                    "label": 0
                },
                {
                    "sent": "It's really nice location and we have a set of tags, dolomites and Lake that describes this picture.",
                    "label": 1
                },
                {
                    "sent": "So we would like to suggest to the user some other tags that are strongly related to the taxi that has already been given and how should we proceed?",
                    "label": 0
                },
                {
                    "sent": "Well, again, let's consider the dog network graph, where there is an edge between the two pictures.",
                    "label": 0
                },
                {
                    "sent": "Share A tag so we can again use this information to suggest to the user some tags that are strongly related to the tags that has already that are already given and are also related strongly related among themselves.",
                    "label": 0
                },
                {
                    "sent": "So for example, in this case we can suggest mountains, nature or landscape and so on so forth.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So another interesting applications is in the in the field of bioinformatic, so you can see here a small number of proteins and their interaction between among themselves and so.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Good question.",
                    "label": 0
                },
                {
                    "sent": "Could be given a set of proteins, can we find out other proteins that are that interact with the proteins given an input and that are also they also interact.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Themselves.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is the outline of the talk I just gave a brief overview and So what we do next, I will formalize the problem presented two free algorithms for this problem.",
                    "label": 0
                },
                {
                    "sent": "Then I will present some results that we conducted on a free free real world datasets and then I will also generalize our results and show you that we can actually optimize a broad class of so-called monotone functions.",
                    "label": 0
                },
                {
                    "sent": "And then I will conclude the talk with some.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Moments OK, so this actually is not really a new problem.",
                    "label": 0
                },
                {
                    "sent": "There is a huge amount of work that has been done so far and for finding a community in a social network and you and you can see here that there are many communities that are actually interested in this problem.",
                    "label": 0
                },
                {
                    "sent": "What we do here we consider a query dependent variant of the problem where we are interested to find the community of a given set of input while the previous work has focused on a static version where the Community has to be found only with reference to the original graph in.",
                    "label": 0
                },
                {
                    "sent": "Another related work that are quite related actually and didn't consider explicitly the social problem.",
                    "label": 0
                },
                {
                    "sent": "Finding a community in a social network, but probably their techniques can also be applied here.",
                    "label": 0
                },
                {
                    "sent": "An remarkably the paper of Coronet, Alan Tongue Involutes seems to be quite related, and there is also a lot of work in combinatorial in a dog arhythmic communities, and there are many papers that appeared in folks I kalpin.",
                    "label": 0
                },
                {
                    "sent": "Out books which are theoretical conferences and where the goal was to find the densest subgraph.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so let's try to formalize the problem.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let me just recall you that the good properties that we.",
                    "label": 0
                },
                {
                    "sent": "That we would like to to achieve is to obtain a somehow graph where there is a small diameter which is very dense for some definition of density that I will clarify now and such that the graph is connected.",
                    "label": 0
                },
                {
                    "sent": "So As for density, there are two different definitions.",
                    "label": 0
                },
                {
                    "sent": "One is the number of edges divided by the total number of the maximum number of edges you can have in a graph.",
                    "label": 0
                },
                {
                    "sent": "So this is the number of edges you can have in a click, and another definition is the average degree of the graph.",
                    "label": 0
                },
                {
                    "sent": "So some well known fact if we would like to optimize the first definition, then this problem is NP hard.",
                    "label": 0
                },
                {
                    "sent": "So there is an easy reduction from maximum clique, which is one of the toughest problems also to approximate.",
                    "label": 0
                },
                {
                    "sent": "And the second factor is that actually the if you would like to optimize the second definition, then there is an algorithm that solves this problem optimally.",
                    "label": 0
                },
                {
                    "sent": "But the problem is that these are going is pretty slow if I remember well, the running time is cubic in the size of the graph, so it's not really easy, so it's not really efficient.",
                    "label": 0
                },
                {
                    "sent": "So what we do we actually consider and.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Through the definition of density of a graph, which actually is the minimum, no degree, the minimum degree of the graph of this up graph, and then the rest of the talk, we will consider this density definition.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As for distance, I mentioned distance, but what is the distance?",
                    "label": 0
                },
                {
                    "sent": "So if we have only one one query node then this is simply the length of the shortest path.",
                    "label": 0
                },
                {
                    "sent": "But if we have many query nodes then we have to somehow adjust this to this new scenario and So what we consider is we could consider the sum of the length of the shortest path.",
                    "label": 0
                },
                {
                    "sent": "But we consider actually the squared distance squared.",
                    "label": 0
                },
                {
                    "sent": "The sum of the squared distances, because this somehow favor more balance scenario OK will maybe will not.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Normalize this OK, so now we have all the ingredients to define formally our problem.",
                    "label": 0
                },
                {
                    "sent": "So in input we have an undirected graph, a set of query nodes and integer D which is actually distance constraint and we would like to find an induced subgraph of G such that the graph contains the query nodes.",
                    "label": 0
                },
                {
                    "sent": "The graph is connected and all the nodes are at distance at most D from the query nodes and also the minimum degree.",
                    "label": 0
                },
                {
                    "sent": "Of the graph is maximized, so we would like to have these people to be able to interact with other people in the in the party talking about the the party problem, and surprisingly enough, this problem at first glance it seems quite to be quite complete.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "They did, but actually there is an optimum greedy algorithm that can solve this problem, and I think this is a nice result.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the algorithm is actually pretty easy.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I will mention the algorithm briefly, so starting from the initial graph, we iteratively delete some nodes as follow.",
                    "label": 0
                },
                {
                    "sent": "If there is a node that violates the distance constraint, then we delete this node from the graph an from further consideration.",
                    "label": 0
                },
                {
                    "sent": "If not, then we delete from the graph the node with minimum degree and we iterate this simple steps until all the all the nodes have been deleted.",
                    "label": 0
                },
                {
                    "sent": "Then among all graphs that has been constructed so far, we selected the graph with the maximum minimum degree that satisfy all the constraints that is connected and that satisfies.",
                    "label": 0
                },
                {
                    "sent": "The distance constraint.",
                    "label": 0
                },
                {
                    "sent": "So the algorithm is quite easy and also is quite efficient.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But surprisingly, this algorithm computes an optimal solution for this problem.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so nice results, but unfortunately this is not the end of the story as I told you in the introduction.",
                    "label": 0
                },
                {
                    "sent": "I think somehow limiting the size of the graph is quite important because for example in the case of the party we don't have, we might not have enough room for one million of people, but in the case of the Community search problem we would like maybe to analyze the data.",
                    "label": 0
                },
                {
                    "sent": "Humans should be able to interpret this data and get some valuable insights on this.",
                    "label": 0
                },
                {
                    "sent": "So if the community that we retrieved consists of 1 billion of people, then maybe this this is not really interesting.",
                    "label": 0
                },
                {
                    "sent": "But now the come the bad news, because if we had an upper bound on the size of the graph, then the problem becomes NP hard.",
                    "label": 0
                },
                {
                    "sent": "But still we can do something.",
                    "label": 0
                },
                {
                    "sent": "I mean theory can still help and there is a simple observation here.",
                    "label": 1
                },
                {
                    "sent": "Some good properties of the algorithm, namely if we executed algorithms with two distance constraints.",
                    "label": 1
                },
                {
                    "sent": "Then the resulting graph would be smaller if the distance constraint is tighter.",
                    "label": 0
                },
                {
                    "sent": "Roughly speaking, if we execute the algorithm with this constraint.",
                    "label": 0
                },
                {
                    "sent": "Equal to 7, then the size of the graph would be smaller than executing the this greedy algorithm with this as constraint 10 for example.",
                    "label": 1
                },
                {
                    "sent": "So this simple observation that we can actually prove an inspired our greedy eristic that can somehow limit the size of the output graph, even though now we don't have any approximation guarantee anymore.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so the grid is pretty simple.",
                    "label": 0
                },
                {
                    "sent": "We execute the our greedy algorithm with some distance constraint given an input.",
                    "label": 1
                },
                {
                    "sent": "And then if this the size of the graph exceeds the upper bound, then we make the constraint tighter until the upper bound is met.",
                    "label": 0
                },
                {
                    "sent": "So it's pretty simple.",
                    "label": 0
                },
                {
                    "sent": "And also I think quite nature.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Another eristic we developed.",
                    "label": 0
                },
                {
                    "sent": "And in this case we have the intuition that knows that are very far apart from the graph, may not belong to the same community, is of the query nodes right?",
                    "label": 1
                },
                {
                    "sent": "So maybe we can have a preprocessing phase where we delete these nodes and this of course will make everything more efficient.",
                    "label": 1
                },
                {
                    "sent": "And this eristic I will show you later some experiments proved to be a good compromise between accuracy and running.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Time.",
                    "label": 0
                },
                {
                    "sent": "OK so I will show you now some some experiments.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so we conducted an evaluation on using free real world datasets that DBL quarter ship graph, the Flickr graph and also biological data and we measured the minimum degree of the resulting graph.",
                    "label": 0
                },
                {
                    "sent": "The average degree, the size of the output graph and of course also the running time.",
                    "label": 0
                },
                {
                    "sent": "So we show you briefly summarize.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Adults OK so and we compare this against the simple baseline.",
                    "label": 0
                },
                {
                    "sent": "And so in this algorithm what we do, we first connect the query nodes using a standard tree algorithm and then at each step we add the node with minimum with maximum with maximum degree and this is in contrast with the previous approaches where at each step we actually delete nodes.",
                    "label": 0
                },
                {
                    "sent": "But we think that this could be.",
                    "label": 0
                },
                {
                    "sent": "Also this should be an approach that should be.",
                    "label": 0
                },
                {
                    "sent": "Considered.",
                    "label": 0
                },
                {
                    "sent": "And then as we were doing before, among all graph constructed, we return the one with maximum degree, maximum, minimum.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK so here is some results on the X axis we have an upper bound on the size and on the Y axis we have the minimum degree and we can see that for example if the upper bound is 50, then the minimum degree is 4 and so this means that all nodes in the graph of degree are connected with at least four other nodes, and so this shows that the graph is somehow quite connected, but there is a lot of interaction.",
                    "label": 0
                },
                {
                    "sent": "Between tags in this case.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, this is the average degree and we can also see that the performances or greedy fast ingredients are not really are somehow.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Parable.",
                    "label": 0
                },
                {
                    "sent": "And finally, I would like to show you the running time, so the fastest eristic.",
                    "label": 0
                },
                {
                    "sent": "Once in 2030 seconds and this is quite fast and as I show you before, the performance are somehow compared compatible with the with the most accurate terroristic.",
                    "label": 0
                },
                {
                    "sent": "So we think this could be a good compromise if if we're interested in retrieving a graph with a large density and but quickly.",
                    "label": 0
                },
                {
                    "sent": "Then this could be I woulda good.",
                    "label": 0
                },
                {
                    "sent": "It could be nice.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We use this algorithm.",
                    "label": 0
                },
                {
                    "sent": "OK, this is some empirical evidence to show you the the main theorem that inspired the second eristic.",
                    "label": 0
                },
                {
                    "sent": "And here we have the distance constraint on the columns and on the roads we have three different datasets and we can see that as we increase the distance constraint the resulting graph becomes larger and larger and so for example for distance equal to six.",
                    "label": 0
                },
                {
                    "sent": "So the DLP consists of only four nodes and then if we increase the distance constraint we have nine and so on so forth.",
                    "label": 0
                },
                {
                    "sent": "And this has been we consider here early free query nodes.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, So what we did next?",
                    "label": 0
                },
                {
                    "sent": "We generalize our results further and trying to deal with an even larger set of constraints so that to somehow have to have more power and more have more powerful tools on retrieving at the Community we are.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Looking for.",
                    "label": 0
                },
                {
                    "sent": "And So what we did, for example, we defined this new problem that we called the generalized Community search problem in this case.",
                    "label": 0
                },
                {
                    "sent": "In input we have for each node a set of skills and we are requesting to find the graph whose union over of the of the set of skills contains a given set of skills provided any input so.",
                    "label": 0
                },
                {
                    "sent": "Roughly speaking, if you compute the union of all these sets, we want this to be a super set super set of the of the set of skills given any input.",
                    "label": 0
                },
                {
                    "sent": "And again we would like to have distance constraint.",
                    "label": 0
                },
                {
                    "sent": "We would like the minimum degree to be maximised.",
                    "label": 0
                },
                {
                    "sent": "The graph to be connected and so on, so forth.",
                    "label": 0
                },
                {
                    "sent": "And still we are able to.",
                    "label": 0
                },
                {
                    "sent": "Solve this problem to compute an optimal solution for this problem by means of a greedy algorithm.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what is the idea here?",
                    "label": 0
                },
                {
                    "sent": "So actually generalizing even further, these are what the so-called monotone functions, which roughly speaking.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we say that the monotone function the function is monotone if when we evaluate this function on a sub graph of the original graph, its value decreases, either always decreases or either always increases, and so in the case we have a set of constraints and these are all monotone function, we are able to compute an optimum solution for the problem and the running time depends actually on the on the.",
                    "label": 0
                },
                {
                    "sent": "Number of functions we have.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so the talk is almost finished.",
                    "label": 0
                },
                {
                    "sent": "I will just conclude my talk with some conclusions and and interesting.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Future work.",
                    "label": 0
                },
                {
                    "sent": "So we define a query dependent variant of the Community detection problem and we propose an Oval combinatorially approach to tackle this problem, and we also define the a class of function that can be optimized efficiently.",
                    "label": 0
                },
                {
                    "sent": "And it's also interesting that whenever we have to the output so it was interesting that adding some distance constraint, we were able to actually limit the size of the output graph.",
                    "label": 0
                },
                {
                    "sent": "So maybe this approach can always can be also used in other for other problems and future work.",
                    "label": 1
                },
                {
                    "sent": "Are there other useful monotone functions?",
                    "label": 0
                },
                {
                    "sent": "Can we find all communities of a given set of users?",
                    "label": 0
                },
                {
                    "sent": "And last but not least.",
                    "label": 0
                },
                {
                    "sent": "And can we parallelize this algorithm?",
                    "label": 0
                },
                {
                    "sent": "Can we use, for example, a paradigm like MapReduce for example to deal with a huge amount of data?",
                    "label": 0
                },
                {
                    "sent": "So OK, thanks.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Not for the OK sorry.",
                    "label": 0
                },
                {
                    "sent": "Forgot what about the party I mentioned in the beginning?",
                    "label": 0
                },
                {
                    "sent": "So this is the people that actually should be invited by in the party.",
                    "label": 0
                },
                {
                    "sent": "I don't know if you can see there, but there are many edges that show a lot of connections and actually it is not by chance because the on the left side.",
                    "label": 0
                },
                {
                    "sent": "This corresponds to the database community while on the right hand side we have an algorithm communities some, so there's some anecdotal evidence that is seems to be quite quite effective.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So thanks a lot for your attention and looking forward for questions.",
                    "label": 0
                },
                {
                    "sent": "Please in the microphone.",
                    "label": 0
                },
                {
                    "sent": "Very similar to the problem of like given a set of nodes, find their local nothings cluster around the set of notes and then there is this paper from like Andersen, Chung and Tanga, called Page rank nibble.",
                    "label": 0
                },
                {
                    "sent": "So it's very efficient and basically they run the personalized or rooted Pagerank.",
                    "label": 0
                },
                {
                    "sent": "But there's a restart vertex is not a single one, but these set of not so.",
                    "label": 0
                },
                {
                    "sent": "Share the flying among these set of notes and so, and you also cited the Hong Kong and Crystals Politics.",
                    "label": 0
                },
                {
                    "sent": "Sure.",
                    "label": 0
                },
                {
                    "sent": "So did you actually compare it with this?",
                    "label": 0
                },
                {
                    "sent": "And how do you actually say that the Community sure sure, yes.",
                    "label": 0
                },
                {
                    "sent": "So yeah, this is a good question.",
                    "label": 0
                },
                {
                    "sent": "So the objective function in this case is different.",
                    "label": 0
                },
                {
                    "sent": "So in the random Gen random walk with their start approach, you would like someone to connect the query nodes and minimizes sum.",
                    "label": 0
                },
                {
                    "sent": "Proximity measures, but this measure are actually different, so it's not really miss different than minimizing the minimum degree.",
                    "label": 0
                },
                {
                    "sent": "So for example, an automatic evaluation wouldn't be fair in this case is because we have simply two different objective function.",
                    "label": 0
                },
                {
                    "sent": "What would make sense?",
                    "label": 0
                },
                {
                    "sent": "And we're actually working on this student of ours is working on this is to do a user evaluation.",
                    "label": 0
                },
                {
                    "sent": "So given the results of the two algorithms, which Community is a good community for?",
                    "label": 0
                },
                {
                    "sent": "Which algorithm we obtain better results?",
                    "label": 0
                },
                {
                    "sent": "We are working on this, but.",
                    "label": 0
                },
                {
                    "sent": "So far we don't have any experiments in this direction, but thanks for the question.",
                    "label": 0
                },
                {
                    "sent": "We'll take one more.",
                    "label": 0
                },
                {
                    "sent": "Very interesting paper.",
                    "label": 0
                },
                {
                    "sent": "One question about the party examples.",
                    "label": 1
                },
                {
                    "sent": "I can imagine social gathering strength of tire is important, so can you argue with an extended?",
                    "label": 0
                },
                {
                    "sent": "What do you mean by strength?",
                    "label": 0
                },
                {
                    "sent": "Strength of tie, strength of links or you?",
                    "label": 0
                },
                {
                    "sent": "OK so you would like to have, for example, an edge weight associated which edge?",
                    "label": 0
                },
                {
                    "sent": "Yeah, so this could be we didn't consider this, but probably I'm optimistic that approach could be also extended in this direction.",
                    "label": 0
                },
                {
                    "sent": "This shouldn't be any problem, but OK. Of course I have to think about that, yeah?",
                    "label": 0
                },
                {
                    "sent": "Speaker speaker again.",
                    "label": 0
                }
            ]
        }
    }
}