{
    "id": "zyxemv4vewrldzpsu3qc4zm5646n2a2p",
    "title": "DEX Methodology: Thirty three years of qualitative multi-attribute modeling",
    "info": {
        "author": [
            "Marko Bohanec, Department of Intelligent Systems, Jožef Stefan Institute"
        ],
        "published": "Nov. 16, 2012",
        "recorded": "October 2012",
        "category": [
            "Top->Computer Science->Data Modeling",
            "Top->Computer Science->Decision Support"
        ]
    },
    "url": "http://videolectures.net/is2012_bohanec_dex_methodology/",
    "segmentation": [
        [
            "Good afternoon, I'm also very glad that I could present this topic to you.",
            "It's about decks, methodology and it's quite.",
            "I was quite surprised to realize that that's really 30, three years since our beginning.",
            "Here are some people who are responsible for developing decks methodology in part or in some way.",
            "Ladislao Riker each other dimension today even broadcast my long, many times.",
            "Supervisor for Diploma Work, Master thesis and PhD and then two collaborators do students at that time, Blair Zupan and Martinez leaders each later later on, but before.",
            "So what?",
            "I would like to.",
            "Show you today first.",
            "I think that most of you know what is decks, But anyway, let me tell that this is a methodology which is used in decision support.",
            "It is used to support people who make decisions.",
            "It falls very well into the multi attribute modeling paradigm."
        ],
        [
            "Which looks like that.",
            "So if you have some situation in real life typically which is more or less cloudy, you don't know or you want to shed some light on that.",
            "And there are some objects appearing here, which usually in general called alternatives.",
            "This can be object like when you buy something like cars, you will see one example later on, or you can do this.",
            "These are some alternative actions or there are some.",
            "Like different.",
            "Topics and so on.",
            "So there are many possible ways, but the idea is that.",
            "The task which we do here is that first we design the so called performance variables are indicators that measure some characteristics of these alternatives, like typically select price, performance quality and then can be many other performance variables.",
            "Then we develop multi attribute model which usually has some kind of hierarchical structure and this hierarchical structure is used to evaluate these alternatives.",
            "So we get some marks.",
            "We can rank these alternatives on the basis of this evaluation, but even more importantly, we typically use this model to analyze the situation to compare alternatives to see there."
        ],
        [
            "And bad points, and hopefully we understand the situation alittle bit better."
        ],
        [
            "I would like to point out that in development of such models there is basically that's not artificial intelligence, it's a human intelligence becausw.",
            "Usually these models are built by people, so the development takes path that was somehow as we heard today, touring said it was not going to work, and probably on the large scale it doesn't.",
            "But here it would ask why.",
            "Well so such models are developed by people, but where is then?",
            "AI here.",
            "It turns out that we can use a lot of interesting concepts from AI to support this process of developing and using the models.",
            "So the idea of Dex originates in the 1980s."
        ],
        [
            "Will tell us something more about that and it tries to bring in together several topics that were very active and prolific at that time.",
            "On one hand side, there was a multicriteria decision analysis.",
            "Which is the approach which I just presented developing models hierarchical models using criteria and so forth.",
            "And of course there was artificial intelligence coming.",
            "We mainly used concepts from expert systems which probably know these are manually mostly manually built systems that try to solve difficult problems, for which we say that people usually use intelligence an from those expert systems there were some.",
            "Ideas taken and.",
            "Planted into this area like using qualitative variables.",
            "If, then rules considering a decision model is a kind of a knowledge base and so on.",
            "We also use some algorithms for machine learning and of course, especially at the beginning.",
            "The idea was founded on fuzzy sets.",
            "So what is just to try to illustrate this stuff so the."
        ],
        [
            "Excuse some methods for multi attribute modeling so it shares the characteristics of traditional multi attribute modeling like structuring the problem into variables using hierarchical structure.",
            "Evaluating decision alternatives where you can take some car and then you use some kind of aggregation to get to the final evaluation.",
            "So this is what decks shares with common or common multi attribute modeling."
        ],
        [
            "Methods, but on the other hand it took the idea of using symbolic.",
            "Variables instead of numeric one which are more common in traditional multicriteria model."
        ],
        [
            "Think another idea was that instead of some kinds of numeric aggregation formulas, like using weights, which is quite often often used in multi."
        ],
        [
            "Criteria modeling we use some decision tables, some relatively simple decision rules to aggregate these values into the final value."
        ],
        [
            "Even though the method is quite simple.",
            "It is still surprising for me is that how many research challenges actually poses?",
            "How many research questions are have to be solved when trying to deal with such methodology in the middle part?",
            "I put some recent decision support model which is a model for the assessment of DNA analysis methods which we developed in some European project recently, but it is not meant to be read.",
            "It just illustrates illustrates.",
            "A typical complexity of such a model, and of course the model is not just the structure.",
            "There are some rules behind and so on.",
            "So this is the stuff that we typically have to develop and the research challenges that come in is creation of this model.",
            "How to create this model?",
            "And these are, there are some very interesting questions here how to obtain the model from people's heads, how to verify the model, how to deal with with uncertainty.",
            "The model should be transparent, understood, understandable, and there are many other things.",
            "One of the things which is also very challenging.",
            "Is how to manage change if somebody wants to change the model, how should the model be adapted so that it retains as much information as before?",
            "And then we have also interesting research questions at the end on the other side, using the model of course, how to obtain data about alternatives?",
            "How to deal with incomplete uncertain data?",
            "Very important topic is we should be able to explain the results.",
            "We should validate the results we should do which support a lot of analysis and so on.",
            "So all these questions were, at least for me, very interesting and we were trying to solve it to address them during the.",
            "This long history of."
        ],
        [
            "With the decks.",
            "I will sketch the history so.",
            "The idea was actually born at least as far as I'm concerned.",
            "I joined a little bit later.",
            "It was in 1979 when Vlado Rykovich was already mentioned.",
            "Today visited Darm University inning."
        ],
        [
            "Learned.",
            "And he worked with the genitive Stasio, and this is actually the 1st paper from 1979 establishing the idea of the method.",
            "The approach was very fuzzy oriented at that time, using fuzzy."
        ],
        [
            "Logic verbal fight."
        ],
        [
            "The variables, but also there were already tables which are quite typical for index today this was."
        ],
        [
            "The founding document I soon joined.",
            "At that time I was doing my diploma and professor radicals my supervisor.",
            "So I started programming stuff and the 1st result program called Deck Max write notes this as a kind of a deck Makira and initial period of development.",
            "So there was no word X at that time.",
            "It was kinda little bit later, so I would correct arise this.",
            "This initial development of the methodology.",
            "The software at the beginning was only one computer program called Deck Deck Mac.",
            "Then there was a whole tool bag of different programs developed this for different eyes times.",
            "Computers were not that powerful so it was difficult to develop complex software at that time and the method turned out to be quite successful.",
            "We had some first applications, I think that Vlado was very active in finding customers for that, so we did a lot of practical decision making in terms of hardware software selection.",
            "Personnel management.",
            "There was quite a significant application for nursery schools, so I'd like to illustrate."
        ],
        [
            "Each.",
            "By a few snapshots very quickly.",
            "So this is from one report which illustrates that deck Mark Software was command line driven.",
            "You know there was no fancy user interface, there were just commands, commands and.",
            "This just illustrates how some tables decision tables were defined with deck Mac later on this whole set 1987 there was not only that, but there was a bunch of software developed, one of that by to interesting one.",
            "DMC's was programmed by Blood Zuppan.",
            "The other sort of programmed by me."
        ],
        [
            "There were some interesting papers at that time, one resulting directly from my diploma work together with even Brad."
        ],
        [
            "Like which established somehow the method."
        ],
        [
            "Some kind of formal model?",
            "Anne."
        ],
        [
            "And maybe just one mention 11 in 1988, which was quite a major.",
            "I would say publication in which we described how which techniques can be used to identify the tables, the rules and how to."
        ],
        [
            "Deal with that just to illustrate that."
        ],
        [
            "And we apply this.",
            "All these techniques in personnel management personnel, personnel selection, or evaluation system, and this is the list of criteria which we used at that time."
        ],
        [
            "So after let's say 1988, we had quite a significant list of practical applications of the methodology.",
            "This is also from one publication, so we estimated that there were about 30 practical applications of the method of that time.",
            "They are listed here and bakes.",
            "Basically unfortunately we more or less stopped counting them.",
            "So today I'm not able to tell how many applications are today, but we can just say there are several hundreds, or maybe several thousands.",
            "So that was the situation."
        ],
        [
            "1988 so, but it was clearly quite early, so it it was found out that deck was not sufficient, so we had to move on.",
            "Then the word decks decision expert was point.",
            "And then there was a second.",
            "Which was again, I think that we improve the methodology, a kind of integrated into a single product called X.",
            "There was something else.",
            "A little bit later called Donna, and the period was characterized by what I would say, national applications important, difficult decision making projects concerning in our country.",
            "In Slovenia we worked a lot with the housing fund to Slovenia.",
            "We develop models for the Ministry of Science and Technology that was called.",
            "So at that time we developed a talent system and there were several industrial applications as well as applications in medicine and also related development was done by Blair's open for his PhD called Hint Method, which is basically a machine learning method.",
            "But the method that attempts to derive the structure of concepts which was mentioned today that it is difficult.",
            "How much OK I will do that.",
            "It is a difficult task.",
            "And but of course, hint use some heuristics for that, but from the internal point of view, from the deck's viewpoint, is a methodology that is capable of developing parts of dxy decks, models from data.",
            "So again to illustrate this was the user interface of the."
        ],
        [
            "Makes it work under DOS and now we need emulation or virtualization."
        ],
        [
            "For that, this was a slightly later system developed by Andre.",
            "She ate one of the students, every Donna, which added some evaluation Kappa."
        ],
        [
            "Bilitis to decks.",
            "This is the founding paper.",
            "It was published in systemically in 1990s describing this software."
        ],
        [
            "Methodology and there was a bunch of public."
        ],
        [
            "Nations in that area about mainly, I would say applications in dust."
        ],
        [
            "Applications medical"
        ],
        [
            "Applications here are just a few snapshots.",
            "For example, for the Ministry of Science and Technology, we evaluated projects.",
            "And each dot in that matrix chart is a project that was evaluated by 1 model."
        ],
        [
            "We developed.",
            "There were applications in healthcare like risk assessment for breast breast cancer."
        ],
        [
            "We developed a special system called Talent for advising young people in choosing sports.",
            "So this was in collaboration with the Faculty of Sport.",
            "There was a special system not implemented index."
        ],
        [
            "But spare specially, and of course the thing which I already mentioned.",
            "The work by Blair's Open and many others young is demshar even bradco.",
            "The hint."
        ],
        [
            "Ideology and the last.",
            "The last one we moved on with Dexie, which was a more modern software based on decks.",
            "Also, further improvement of the methodology software and I think that this the last decade went international, so Dxi was really used in a lot of international projects.",
            "That is the name of 1 project in which we had several application applications.",
            "It was heavily used in agronomy, connected with genetically modified crops for project evaluation.",
            "Right now is being used for financial decision making."
        ],
        [
            "So here is for example how it looks like.",
            "Most of you know, there are several books."
        ],
        [
            "So available."
        ],
        [
            "It.",
            "Um?",
            "And I should mention the work of Martin Schnieders each who also did some work in.",
            "Not learning decks, models, but revising decks model so you first do this development manually and then you refine you, enhance your model through a database revision."
        ],
        [
            "And he also developed some prototype product software dealing with."
        ],
        [
            "This methodology so we are using this methodology for different stuff like evaluating cropping system in agronomy.",
            "This is 1 Justin."
        ],
        [
            "Example of a model we were developing some web based.",
            "Decision tools or evaluate."
        ],
        [
            "Tools non web."
        ],
        [
            "Indecision tool"
        ],
        [
            "This is an example which I like very much.",
            "Becaused X is implemented in what we.",
            "See almost every day on our highways becausw the models developed index are used to recognize some some dangerous situations like bad weather, heavy traffic, wrong way driving the tunnel and so on.",
            "And we are using this methodology for data mining."
        ],
        [
            "To evaluate.",
            "Data mining workflows.",
            "This was done in one European project."
        ],
        [
            "And the last thing before conclusion, I would like to point out that now after so many years, I think that the ex became recognized by international community.",
            "So this is just one example of a group of people in France who is using this methodology for their evaluating cropping system cropping systems.",
            "So the X is now really used over the world or are in Europe for different task."
        ],
        [
            "Like this one.",
            "So to conclude, the X is a multi attribute decision modeling methodology here for quite some time it's a pioneering approach.",
            "It's quite surprising that there are not very many alternative approaches I know about, just two.",
            "One was an attempt called doctors in Hungary, which is not alive anymore and another very closest related to rough sets and some special ways of rough sets by Greco Matarazzo.",
            "Slovenske, so it's quite well known in Multicriteria decision making, so we had some quite a lot of scientific, technical, practical contributions.",
            "As you saw, there were three generations of software.",
            "And really, I can't tell the number, but it's hundreds of real life applications of this methodology, so it's some quite happy that after 30 three years both the method end to myself and my colleagues are still alive.",
            "So it's still actively used in new projects.",
            "I didn't mention it is taught in schools on faculties, which is also something that Vlad is quite responsible for.",
            "That and it still developing.",
            "So about the future.",
            "If you look at this history historic chart.",
            "OK, it's 2.",
            "Far away, if you notice that the length of lines, here, Dex, Dex is so it's somehow running out, and I think it's really time for new new architectures and new versions of this methodology into we already have.",
            "I started working on that insert on several ways by applying for some project grants and also by setting up some work in our group.",
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Good afternoon, I'm also very glad that I could present this topic to you.",
                    "label": 0
                },
                {
                    "sent": "It's about decks, methodology and it's quite.",
                    "label": 0
                },
                {
                    "sent": "I was quite surprised to realize that that's really 30, three years since our beginning.",
                    "label": 0
                },
                {
                    "sent": "Here are some people who are responsible for developing decks methodology in part or in some way.",
                    "label": 0
                },
                {
                    "sent": "Ladislao Riker each other dimension today even broadcast my long, many times.",
                    "label": 0
                },
                {
                    "sent": "Supervisor for Diploma Work, Master thesis and PhD and then two collaborators do students at that time, Blair Zupan and Martinez leaders each later later on, but before.",
                    "label": 0
                },
                {
                    "sent": "So what?",
                    "label": 0
                },
                {
                    "sent": "I would like to.",
                    "label": 0
                },
                {
                    "sent": "Show you today first.",
                    "label": 0
                },
                {
                    "sent": "I think that most of you know what is decks, But anyway, let me tell that this is a methodology which is used in decision support.",
                    "label": 0
                },
                {
                    "sent": "It is used to support people who make decisions.",
                    "label": 0
                },
                {
                    "sent": "It falls very well into the multi attribute modeling paradigm.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Which looks like that.",
                    "label": 0
                },
                {
                    "sent": "So if you have some situation in real life typically which is more or less cloudy, you don't know or you want to shed some light on that.",
                    "label": 0
                },
                {
                    "sent": "And there are some objects appearing here, which usually in general called alternatives.",
                    "label": 0
                },
                {
                    "sent": "This can be object like when you buy something like cars, you will see one example later on, or you can do this.",
                    "label": 0
                },
                {
                    "sent": "These are some alternative actions or there are some.",
                    "label": 0
                },
                {
                    "sent": "Like different.",
                    "label": 0
                },
                {
                    "sent": "Topics and so on.",
                    "label": 0
                },
                {
                    "sent": "So there are many possible ways, but the idea is that.",
                    "label": 0
                },
                {
                    "sent": "The task which we do here is that first we design the so called performance variables are indicators that measure some characteristics of these alternatives, like typically select price, performance quality and then can be many other performance variables.",
                    "label": 1
                },
                {
                    "sent": "Then we develop multi attribute model which usually has some kind of hierarchical structure and this hierarchical structure is used to evaluate these alternatives.",
                    "label": 0
                },
                {
                    "sent": "So we get some marks.",
                    "label": 0
                },
                {
                    "sent": "We can rank these alternatives on the basis of this evaluation, but even more importantly, we typically use this model to analyze the situation to compare alternatives to see there.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And bad points, and hopefully we understand the situation alittle bit better.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I would like to point out that in development of such models there is basically that's not artificial intelligence, it's a human intelligence becausw.",
                    "label": 0
                },
                {
                    "sent": "Usually these models are built by people, so the development takes path that was somehow as we heard today, touring said it was not going to work, and probably on the large scale it doesn't.",
                    "label": 0
                },
                {
                    "sent": "But here it would ask why.",
                    "label": 0
                },
                {
                    "sent": "Well so such models are developed by people, but where is then?",
                    "label": 0
                },
                {
                    "sent": "AI here.",
                    "label": 0
                },
                {
                    "sent": "It turns out that we can use a lot of interesting concepts from AI to support this process of developing and using the models.",
                    "label": 0
                },
                {
                    "sent": "So the idea of Dex originates in the 1980s.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Will tell us something more about that and it tries to bring in together several topics that were very active and prolific at that time.",
                    "label": 0
                },
                {
                    "sent": "On one hand side, there was a multicriteria decision analysis.",
                    "label": 1
                },
                {
                    "sent": "Which is the approach which I just presented developing models hierarchical models using criteria and so forth.",
                    "label": 0
                },
                {
                    "sent": "And of course there was artificial intelligence coming.",
                    "label": 0
                },
                {
                    "sent": "We mainly used concepts from expert systems which probably know these are manually mostly manually built systems that try to solve difficult problems, for which we say that people usually use intelligence an from those expert systems there were some.",
                    "label": 1
                },
                {
                    "sent": "Ideas taken and.",
                    "label": 1
                },
                {
                    "sent": "Planted into this area like using qualitative variables.",
                    "label": 1
                },
                {
                    "sent": "If, then rules considering a decision model is a kind of a knowledge base and so on.",
                    "label": 0
                },
                {
                    "sent": "We also use some algorithms for machine learning and of course, especially at the beginning.",
                    "label": 0
                },
                {
                    "sent": "The idea was founded on fuzzy sets.",
                    "label": 0
                },
                {
                    "sent": "So what is just to try to illustrate this stuff so the.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Excuse some methods for multi attribute modeling so it shares the characteristics of traditional multi attribute modeling like structuring the problem into variables using hierarchical structure.",
                    "label": 0
                },
                {
                    "sent": "Evaluating decision alternatives where you can take some car and then you use some kind of aggregation to get to the final evaluation.",
                    "label": 0
                },
                {
                    "sent": "So this is what decks shares with common or common multi attribute modeling.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Methods, but on the other hand it took the idea of using symbolic.",
                    "label": 0
                },
                {
                    "sent": "Variables instead of numeric one which are more common in traditional multicriteria model.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Think another idea was that instead of some kinds of numeric aggregation formulas, like using weights, which is quite often often used in multi.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Criteria modeling we use some decision tables, some relatively simple decision rules to aggregate these values into the final value.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Even though the method is quite simple.",
                    "label": 0
                },
                {
                    "sent": "It is still surprising for me is that how many research challenges actually poses?",
                    "label": 1
                },
                {
                    "sent": "How many research questions are have to be solved when trying to deal with such methodology in the middle part?",
                    "label": 0
                },
                {
                    "sent": "I put some recent decision support model which is a model for the assessment of DNA analysis methods which we developed in some European project recently, but it is not meant to be read.",
                    "label": 1
                },
                {
                    "sent": "It just illustrates illustrates.",
                    "label": 0
                },
                {
                    "sent": "A typical complexity of such a model, and of course the model is not just the structure.",
                    "label": 0
                },
                {
                    "sent": "There are some rules behind and so on.",
                    "label": 0
                },
                {
                    "sent": "So this is the stuff that we typically have to develop and the research challenges that come in is creation of this model.",
                    "label": 0
                },
                {
                    "sent": "How to create this model?",
                    "label": 1
                },
                {
                    "sent": "And these are, there are some very interesting questions here how to obtain the model from people's heads, how to verify the model, how to deal with with uncertainty.",
                    "label": 0
                },
                {
                    "sent": "The model should be transparent, understood, understandable, and there are many other things.",
                    "label": 0
                },
                {
                    "sent": "One of the things which is also very challenging.",
                    "label": 1
                },
                {
                    "sent": "Is how to manage change if somebody wants to change the model, how should the model be adapted so that it retains as much information as before?",
                    "label": 0
                },
                {
                    "sent": "And then we have also interesting research questions at the end on the other side, using the model of course, how to obtain data about alternatives?",
                    "label": 1
                },
                {
                    "sent": "How to deal with incomplete uncertain data?",
                    "label": 0
                },
                {
                    "sent": "Very important topic is we should be able to explain the results.",
                    "label": 0
                },
                {
                    "sent": "We should validate the results we should do which support a lot of analysis and so on.",
                    "label": 0
                },
                {
                    "sent": "So all these questions were, at least for me, very interesting and we were trying to solve it to address them during the.",
                    "label": 0
                },
                {
                    "sent": "This long history of.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With the decks.",
                    "label": 0
                },
                {
                    "sent": "I will sketch the history so.",
                    "label": 0
                },
                {
                    "sent": "The idea was actually born at least as far as I'm concerned.",
                    "label": 0
                },
                {
                    "sent": "I joined a little bit later.",
                    "label": 0
                },
                {
                    "sent": "It was in 1979 when Vlado Rykovich was already mentioned.",
                    "label": 0
                },
                {
                    "sent": "Today visited Darm University inning.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Learned.",
                    "label": 0
                },
                {
                    "sent": "And he worked with the genitive Stasio, and this is actually the 1st paper from 1979 establishing the idea of the method.",
                    "label": 0
                },
                {
                    "sent": "The approach was very fuzzy oriented at that time, using fuzzy.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Logic verbal fight.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The variables, but also there were already tables which are quite typical for index today this was.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The founding document I soon joined.",
                    "label": 0
                },
                {
                    "sent": "At that time I was doing my diploma and professor radicals my supervisor.",
                    "label": 0
                },
                {
                    "sent": "So I started programming stuff and the 1st result program called Deck Max write notes this as a kind of a deck Makira and initial period of development.",
                    "label": 0
                },
                {
                    "sent": "So there was no word X at that time.",
                    "label": 0
                },
                {
                    "sent": "It was kinda little bit later, so I would correct arise this.",
                    "label": 0
                },
                {
                    "sent": "This initial development of the methodology.",
                    "label": 1
                },
                {
                    "sent": "The software at the beginning was only one computer program called Deck Deck Mac.",
                    "label": 0
                },
                {
                    "sent": "Then there was a whole tool bag of different programs developed this for different eyes times.",
                    "label": 0
                },
                {
                    "sent": "Computers were not that powerful so it was difficult to develop complex software at that time and the method turned out to be quite successful.",
                    "label": 0
                },
                {
                    "sent": "We had some first applications, I think that Vlado was very active in finding customers for that, so we did a lot of practical decision making in terms of hardware software selection.",
                    "label": 0
                },
                {
                    "sent": "Personnel management.",
                    "label": 1
                },
                {
                    "sent": "There was quite a significant application for nursery schools, so I'd like to illustrate.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Each.",
                    "label": 0
                },
                {
                    "sent": "By a few snapshots very quickly.",
                    "label": 0
                },
                {
                    "sent": "So this is from one report which illustrates that deck Mark Software was command line driven.",
                    "label": 0
                },
                {
                    "sent": "You know there was no fancy user interface, there were just commands, commands and.",
                    "label": 0
                },
                {
                    "sent": "This just illustrates how some tables decision tables were defined with deck Mac later on this whole set 1987 there was not only that, but there was a bunch of software developed, one of that by to interesting one.",
                    "label": 0
                },
                {
                    "sent": "DMC's was programmed by Blood Zuppan.",
                    "label": 0
                },
                {
                    "sent": "The other sort of programmed by me.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There were some interesting papers at that time, one resulting directly from my diploma work together with even Brad.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Like which established somehow the method.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some kind of formal model?",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And maybe just one mention 11 in 1988, which was quite a major.",
                    "label": 0
                },
                {
                    "sent": "I would say publication in which we described how which techniques can be used to identify the tables, the rules and how to.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Deal with that just to illustrate that.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we apply this.",
                    "label": 0
                },
                {
                    "sent": "All these techniques in personnel management personnel, personnel selection, or evaluation system, and this is the list of criteria which we used at that time.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So after let's say 1988, we had quite a significant list of practical applications of the methodology.",
                    "label": 0
                },
                {
                    "sent": "This is also from one publication, so we estimated that there were about 30 practical applications of the method of that time.",
                    "label": 0
                },
                {
                    "sent": "They are listed here and bakes.",
                    "label": 0
                },
                {
                    "sent": "Basically unfortunately we more or less stopped counting them.",
                    "label": 0
                },
                {
                    "sent": "So today I'm not able to tell how many applications are today, but we can just say there are several hundreds, or maybe several thousands.",
                    "label": 0
                },
                {
                    "sent": "So that was the situation.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "1988 so, but it was clearly quite early, so it it was found out that deck was not sufficient, so we had to move on.",
                    "label": 0
                },
                {
                    "sent": "Then the word decks decision expert was point.",
                    "label": 0
                },
                {
                    "sent": "And then there was a second.",
                    "label": 0
                },
                {
                    "sent": "Which was again, I think that we improve the methodology, a kind of integrated into a single product called X.",
                    "label": 0
                },
                {
                    "sent": "There was something else.",
                    "label": 0
                },
                {
                    "sent": "A little bit later called Donna, and the period was characterized by what I would say, national applications important, difficult decision making projects concerning in our country.",
                    "label": 0
                },
                {
                    "sent": "In Slovenia we worked a lot with the housing fund to Slovenia.",
                    "label": 0
                },
                {
                    "sent": "We develop models for the Ministry of Science and Technology that was called.",
                    "label": 0
                },
                {
                    "sent": "So at that time we developed a talent system and there were several industrial applications as well as applications in medicine and also related development was done by Blair's open for his PhD called Hint Method, which is basically a machine learning method.",
                    "label": 0
                },
                {
                    "sent": "But the method that attempts to derive the structure of concepts which was mentioned today that it is difficult.",
                    "label": 0
                },
                {
                    "sent": "How much OK I will do that.",
                    "label": 0
                },
                {
                    "sent": "It is a difficult task.",
                    "label": 0
                },
                {
                    "sent": "And but of course, hint use some heuristics for that, but from the internal point of view, from the deck's viewpoint, is a methodology that is capable of developing parts of dxy decks, models from data.",
                    "label": 0
                },
                {
                    "sent": "So again to illustrate this was the user interface of the.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Makes it work under DOS and now we need emulation or virtualization.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For that, this was a slightly later system developed by Andre.",
                    "label": 0
                },
                {
                    "sent": "She ate one of the students, every Donna, which added some evaluation Kappa.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Bilitis to decks.",
                    "label": 0
                },
                {
                    "sent": "This is the founding paper.",
                    "label": 0
                },
                {
                    "sent": "It was published in systemically in 1990s describing this software.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Methodology and there was a bunch of public.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nations in that area about mainly, I would say applications in dust.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Applications medical",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Applications here are just a few snapshots.",
                    "label": 0
                },
                {
                    "sent": "For example, for the Ministry of Science and Technology, we evaluated projects.",
                    "label": 0
                },
                {
                    "sent": "And each dot in that matrix chart is a project that was evaluated by 1 model.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We developed.",
                    "label": 0
                },
                {
                    "sent": "There were applications in healthcare like risk assessment for breast breast cancer.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We developed a special system called Talent for advising young people in choosing sports.",
                    "label": 0
                },
                {
                    "sent": "So this was in collaboration with the Faculty of Sport.",
                    "label": 0
                },
                {
                    "sent": "There was a special system not implemented index.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But spare specially, and of course the thing which I already mentioned.",
                    "label": 0
                },
                {
                    "sent": "The work by Blair's Open and many others young is demshar even bradco.",
                    "label": 0
                },
                {
                    "sent": "The hint.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ideology and the last.",
                    "label": 0
                },
                {
                    "sent": "The last one we moved on with Dexie, which was a more modern software based on decks.",
                    "label": 0
                },
                {
                    "sent": "Also, further improvement of the methodology software and I think that this the last decade went international, so Dxi was really used in a lot of international projects.",
                    "label": 0
                },
                {
                    "sent": "That is the name of 1 project in which we had several application applications.",
                    "label": 0
                },
                {
                    "sent": "It was heavily used in agronomy, connected with genetically modified crops for project evaluation.",
                    "label": 0
                },
                {
                    "sent": "Right now is being used for financial decision making.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here is for example how it looks like.",
                    "label": 0
                },
                {
                    "sent": "Most of you know, there are several books.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So available.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And I should mention the work of Martin Schnieders each who also did some work in.",
                    "label": 0
                },
                {
                    "sent": "Not learning decks, models, but revising decks model so you first do this development manually and then you refine you, enhance your model through a database revision.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And he also developed some prototype product software dealing with.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This methodology so we are using this methodology for different stuff like evaluating cropping system in agronomy.",
                    "label": 0
                },
                {
                    "sent": "This is 1 Justin.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Example of a model we were developing some web based.",
                    "label": 0
                },
                {
                    "sent": "Decision tools or evaluate.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tools non web.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Indecision tool",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is an example which I like very much.",
                    "label": 0
                },
                {
                    "sent": "Becaused X is implemented in what we.",
                    "label": 0
                },
                {
                    "sent": "See almost every day on our highways becausw the models developed index are used to recognize some some dangerous situations like bad weather, heavy traffic, wrong way driving the tunnel and so on.",
                    "label": 0
                },
                {
                    "sent": "And we are using this methodology for data mining.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To evaluate.",
                    "label": 0
                },
                {
                    "sent": "Data mining workflows.",
                    "label": 0
                },
                {
                    "sent": "This was done in one European project.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the last thing before conclusion, I would like to point out that now after so many years, I think that the ex became recognized by international community.",
                    "label": 0
                },
                {
                    "sent": "So this is just one example of a group of people in France who is using this methodology for their evaluating cropping system cropping systems.",
                    "label": 0
                },
                {
                    "sent": "So the X is now really used over the world or are in Europe for different task.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Like this one.",
                    "label": 0
                },
                {
                    "sent": "So to conclude, the X is a multi attribute decision modeling methodology here for quite some time it's a pioneering approach.",
                    "label": 1
                },
                {
                    "sent": "It's quite surprising that there are not very many alternative approaches I know about, just two.",
                    "label": 0
                },
                {
                    "sent": "One was an attempt called doctors in Hungary, which is not alive anymore and another very closest related to rough sets and some special ways of rough sets by Greco Matarazzo.",
                    "label": 0
                },
                {
                    "sent": "Slovenske, so it's quite well known in Multicriteria decision making, so we had some quite a lot of scientific, technical, practical contributions.",
                    "label": 1
                },
                {
                    "sent": "As you saw, there were three generations of software.",
                    "label": 1
                },
                {
                    "sent": "And really, I can't tell the number, but it's hundreds of real life applications of this methodology, so it's some quite happy that after 30 three years both the method end to myself and my colleagues are still alive.",
                    "label": 1
                },
                {
                    "sent": "So it's still actively used in new projects.",
                    "label": 1
                },
                {
                    "sent": "I didn't mention it is taught in schools on faculties, which is also something that Vlad is quite responsible for.",
                    "label": 0
                },
                {
                    "sent": "That and it still developing.",
                    "label": 0
                },
                {
                    "sent": "So about the future.",
                    "label": 0
                },
                {
                    "sent": "If you look at this history historic chart.",
                    "label": 0
                },
                {
                    "sent": "OK, it's 2.",
                    "label": 0
                },
                {
                    "sent": "Far away, if you notice that the length of lines, here, Dex, Dex is so it's somehow running out, and I think it's really time for new new architectures and new versions of this methodology into we already have.",
                    "label": 0
                },
                {
                    "sent": "I started working on that insert on several ways by applying for some project grants and also by setting up some work in our group.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}